; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_action_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_action_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimEdit_Context", file: !57, line: 636, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62, !63}
!59 = !DIEnumerator(name: "SACTCONT_ACTION", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "SACTCONT_SHAPEKEY", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "SACTCONT_GPENCIL", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "SACTCONT_DOPESHEET", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "SACTCONT_MASK", value: 4, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !65, line: 67, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75}
!67 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!73 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!74 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!75 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!76 = !{!77, !147, !160, !161, !162, !365, !48, !1411, !1433, !1434, !1435, !517, !1436, !1498, !1499, !1500, !1510, !1512, !83}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !79, line: 130, baseType: !80)
!79 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !79, line: 117, size: 960, elements: !81)
!81 = !{!82, !84, !85, !87, !106, !110, !112, !113, !114, !115}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !80, file: !79, line: 118, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !80, file: !79, line: 118, baseType: !83, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !80, file: !79, line: 119, baseType: !86, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !80, file: !79, line: 120, baseType: !88, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !79, line: 136, size: 17600, elements: !90)
!90 = !{!91, !92, !93, !96, !101, !102, !103}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !89, file: !79, line: 137, baseType: !78, size: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !89, file: !79, line: 138, baseType: !77, size: 64, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !89, file: !79, line: 139, baseType: !94, size: 64, offset: 1024)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !79, line: 43, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !79, line: 140, baseType: !97, size: 8192, offset: 1088)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8192, elements: !99)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !{!100}
!100 = !DISubrange(count: 1024)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !89, file: !79, line: 141, baseType: !97, size: 8192, offset: 9280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !89, file: !79, line: 148, baseType: !88, size: 64, offset: 17472)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !89, file: !79, line: 150, baseType: !104, size: 64, offset: 17536)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !79, line: 45, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !79, line: 121, baseType: !107, size: 528, offset: 256)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 528, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 66)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !80, file: !79, line: 126, baseType: !111, size: 16, offset: 784)
!111 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !80, file: !79, line: 127, baseType: !48, size: 32, offset: 800)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !80, file: !79, line: 128, baseType: !48, size: 32, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !80, file: !79, line: 128, baseType: !48, size: 32, offset: 864)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !80, file: !79, line: 129, baseType: !116, size: 64, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !79, line: 75, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !79, line: 62, size: 1024, elements: !119)
!119 = !{!120, !122, !123, !124, !125, !126, !130, !131, !145, !146}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !79, line: 63, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !118, file: !79, line: 63, baseType: !121, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !79, line: 64, baseType: !98, size: 8, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !118, file: !79, line: 64, baseType: !98, size: 8, offset: 136)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !118, file: !79, line: 65, baseType: !111, size: 16, offset: 144)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !79, line: 66, baseType: !127, size: 512, offset: 160)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 512, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !118, file: !79, line: 67, baseType: !48, size: 32, offset: 672)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !118, file: !79, line: 69, baseType: !132, size: 256, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !79, line: 60, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !79, line: 48, size: 256, elements: !134)
!134 = !{!135, !136, !143, !144}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !133, file: !79, line: 49, baseType: !83, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !133, file: !79, line: 58, baseType: !137, size: 128, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !138, line: 71, baseType: !139)
!138 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !138, line: 69, size: 128, elements: !140)
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !139, file: !138, line: 70, baseType: !83, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !139, file: !138, line: 70, baseType: !83, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !133, file: !79, line: 59, baseType: !48, size: 32, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !133, file: !79, line: 59, baseType: !48, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !118, file: !79, line: 70, baseType: !48, size: 32, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !118, file: !79, line: 74, baseType: !48, size: 32, offset: 992)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !57, line: 499, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !57, line: 486, size: 1600, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158, !159}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !149, file: !57, line: 487, baseType: !78, size: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !149, file: !57, line: 489, baseType: !137, size: 128, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !149, file: !57, line: 490, baseType: !137, size: 128, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !149, file: !57, line: 491, baseType: !137, size: 128, offset: 1216)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !149, file: !57, line: 492, baseType: !137, size: 128, offset: 1344)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !149, file: !57, line: 494, baseType: !48, size: 32, offset: 1472)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !149, file: !57, line: 495, baseType: !48, size: 32, offset: 1504)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !149, file: !57, line: 497, baseType: !48, size: 32, offset: 1536)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !149, file: !57, line: 498, baseType: !48, size: 32, offset: 1568)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceAction", file: !57, line: 605, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceAction", file: !57, line: 589, size: 2752, elements: !165)
!165 = !{!166, !170, !171, !172, !173, !175, !179, !345, !346, !361, !362, !363, !364}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !57, line: 590, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !169, line: 49, flags: DIFlagFwdDecl)
!169 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !57, line: 590, baseType: !167, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !164, file: !57, line: 591, baseType: !137, size: 128, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !164, file: !57, line: 592, baseType: !48, size: 32, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !164, file: !57, line: 593, baseType: !174, size: 32, offset: 288)
!174 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !164, file: !57, line: 595, baseType: !176, size: 128, offset: 320)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !164, file: !57, line: 597, baseType: !180, size: 1280, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !181, line: 71, baseType: !182)
!181 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !181, line: 40, size: 1280, elements: !183)
!183 = !{!184, !193, !194, !202, !203, !204, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !225, !226, !227, !230}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !182, file: !181, line: 41, baseType: !185, size: 128)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !186, line: 95, baseType: !187)
!186 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !186, line: 92, size: 128, elements: !188)
!188 = !{!189, !190, !191, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !187, file: !186, line: 93, baseType: !174, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !187, file: !186, line: 93, baseType: !174, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !187, file: !186, line: 94, baseType: !174, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !187, file: !186, line: 94, baseType: !174, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !182, file: !181, line: 41, baseType: !185, size: 128, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !182, file: !181, line: 42, baseType: !195, size: 128, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !186, line: 89, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !186, line: 86, size: 128, elements: !197)
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !196, file: !186, line: 87, baseType: !48, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !196, file: !186, line: 87, baseType: !48, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !196, file: !186, line: 88, baseType: !48, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !196, file: !186, line: 88, baseType: !48, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !182, file: !181, line: 42, baseType: !195, size: 128, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !182, file: !181, line: 43, baseType: !195, size: 128, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !182, file: !181, line: 45, baseType: !205, size: 64, offset: 640)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 2)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !182, file: !181, line: 45, baseType: !205, size: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !182, file: !181, line: 46, baseType: !174, size: 32, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !182, file: !181, line: 46, baseType: !174, size: 32, offset: 800)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !182, file: !181, line: 48, baseType: !111, size: 16, offset: 832)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !182, file: !181, line: 49, baseType: !111, size: 16, offset: 848)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !182, file: !181, line: 51, baseType: !111, size: 16, offset: 864)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !182, file: !181, line: 52, baseType: !111, size: 16, offset: 880)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !182, file: !181, line: 53, baseType: !111, size: 16, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !181, line: 55, baseType: !111, size: 16, offset: 912)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !182, file: !181, line: 56, baseType: !111, size: 16, offset: 928)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !182, file: !181, line: 58, baseType: !111, size: 16, offset: 944)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !182, file: !181, line: 58, baseType: !111, size: 16, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !182, file: !181, line: 59, baseType: !111, size: 16, offset: 976)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !182, file: !181, line: 59, baseType: !111, size: 16, offset: 992)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !182, file: !181, line: 61, baseType: !111, size: 16, offset: 1008)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !182, file: !181, line: 63, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !182, file: !181, line: 64, baseType: !48, size: 32, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !182, file: !181, line: 65, baseType: !48, size: 32, offset: 1120)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !182, file: !181, line: 68, baseType: !228, size: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !181, line: 68, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !182, file: !181, line: 69, baseType: !231, size: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !233, line: 490, size: 768, elements: !234)
!233 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = !{!235, !236, !237, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !233, line: 491, baseType: !231, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !232, file: !233, line: 491, baseType: !231, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !232, file: !233, line: 493, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !65, line: 169, size: 2048, elements: !240)
!240 = !{!241, !242, !243, !244, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !311, !314, !328, !329, !330, !331, !332, !333, !334, !335}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !65, line: 170, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !239, file: !65, line: 170, baseType: !238, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !239, file: !65, line: 172, baseType: !83, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !239, file: !65, line: 174, baseType: !245, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !169, line: 41, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !239, file: !65, line: 175, baseType: !245, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !239, file: !65, line: 176, baseType: !127, size: 512, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !239, file: !65, line: 178, baseType: !111, size: 16, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !239, file: !65, line: 178, baseType: !111, size: 16, offset: 848)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !239, file: !65, line: 178, baseType: !111, size: 16, offset: 864)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !239, file: !65, line: 178, baseType: !111, size: 16, offset: 880)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !239, file: !65, line: 179, baseType: !111, size: 16, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !239, file: !65, line: 180, baseType: !111, size: 16, offset: 912)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !239, file: !65, line: 181, baseType: !111, size: 16, offset: 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !239, file: !65, line: 182, baseType: !111, size: 16, offset: 944)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !239, file: !65, line: 183, baseType: !111, size: 16, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !239, file: !65, line: 184, baseType: !111, size: 16, offset: 976)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !239, file: !65, line: 185, baseType: !111, size: 16, offset: 992)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !239, file: !65, line: 186, baseType: !111, size: 16, offset: 1008)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !239, file: !65, line: 188, baseType: !48, size: 32, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !239, file: !65, line: 190, baseType: !111, size: 16, offset: 1056)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !239, file: !65, line: 191, baseType: !111, size: 16, offset: 1072)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !239, file: !65, line: 194, baseType: !265, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !233, line: 421, size: 960, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !276, !280, !281, !282, !283, !284, !285, !286, !288, !289, !290, !291, !292, !293, !294, !295, !296, !299, !307, !308, !309, !310}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !233, line: 422, baseType: !265, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !266, file: !233, line: 422, baseType: !265, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !233, line: 424, baseType: !111, size: 16, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !266, file: !233, line: 425, baseType: !111, size: 16, offset: 144)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !266, file: !233, line: 426, baseType: !48, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !266, file: !233, line: 426, baseType: !48, size: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !266, file: !233, line: 427, baseType: !275, size: 64, offset: 224)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !206)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !266, file: !233, line: 428, baseType: !277, size: 48, offset: 288)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 48, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 6)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !266, file: !233, line: 431, baseType: !98, size: 8, offset: 336)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !266, file: !233, line: 432, baseType: !98, size: 8, offset: 344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !266, file: !233, line: 435, baseType: !111, size: 16, offset: 352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !266, file: !233, line: 436, baseType: !111, size: 16, offset: 368)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !266, file: !233, line: 437, baseType: !48, size: 32, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !266, file: !233, line: 437, baseType: !48, size: 32, offset: 416)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !266, file: !233, line: 438, baseType: !287, size: 64, offset: 448)
!287 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !266, file: !233, line: 439, baseType: !48, size: 32, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !266, file: !233, line: 439, baseType: !48, size: 32, offset: 544)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !266, file: !233, line: 442, baseType: !111, size: 16, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !266, file: !233, line: 442, baseType: !111, size: 16, offset: 592)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !266, file: !233, line: 442, baseType: !111, size: 16, offset: 608)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !266, file: !233, line: 442, baseType: !111, size: 16, offset: 624)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !266, file: !233, line: 443, baseType: !111, size: 16, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !266, file: !233, line: 446, baseType: !111, size: 16, offset: 656)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !266, file: !233, line: 449, baseType: !297, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !266, file: !233, line: 452, baseType: !300, size: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !233, line: 463, size: 128, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !301, file: !233, line: 464, baseType: !48, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !301, file: !233, line: 465, baseType: !174, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !301, file: !233, line: 466, baseType: !174, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !301, file: !233, line: 467, baseType: !174, size: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !266, file: !233, line: 455, baseType: !111, size: 16, offset: 832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !266, file: !233, line: 456, baseType: !111, size: 16, offset: 848)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !266, file: !233, line: 457, baseType: !48, size: 32, offset: 864)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !266, file: !233, line: 458, baseType: !83, size: 64, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !239, file: !65, line: 196, baseType: !312, size: 64, offset: 1152)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !65, line: 55, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !239, file: !65, line: 198, baseType: !315, size: 64, offset: 1216)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !233, line: 398, size: 448, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !233, line: 399, baseType: !315, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !316, file: !233, line: 399, baseType: !315, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !316, file: !233, line: 400, baseType: !48, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !316, file: !233, line: 401, baseType: !48, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !233, line: 402, baseType: !48, size: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !316, file: !233, line: 403, baseType: !48, size: 32, offset: 224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !316, file: !233, line: 404, baseType: !48, size: 32, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !316, file: !233, line: 405, baseType: !48, size: 32, offset: 288)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !316, file: !233, line: 407, baseType: !83, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !316, file: !233, line: 414, baseType: !83, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !239, file: !65, line: 200, baseType: !48, size: 32, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !239, file: !65, line: 200, baseType: !48, size: 32, offset: 1312)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !239, file: !65, line: 201, baseType: !83, size: 64, offset: 1344)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !239, file: !65, line: 203, baseType: !137, size: 128, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !239, file: !65, line: 204, baseType: !137, size: 128, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !239, file: !65, line: 205, baseType: !137, size: 128, offset: 1664)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !239, file: !65, line: 207, baseType: !137, size: 128, offset: 1792)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !239, file: !65, line: 208, baseType: !137, size: 128, offset: 1920)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !232, file: !233, line: 495, baseType: !287, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !232, file: !233, line: 496, baseType: !48, size: 32, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !232, file: !233, line: 497, baseType: !83, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !232, file: !233, line: 499, baseType: !287, size: 64, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !232, file: !233, line: 500, baseType: !287, size: 64, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !232, file: !233, line: 502, baseType: !287, size: 64, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !232, file: !233, line: 503, baseType: !287, size: 64, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !232, file: !233, line: 504, baseType: !287, size: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !232, file: !233, line: 505, baseType: !48, size: 32, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !164, file: !57, line: 599, baseType: !147, size: 64, offset: 1728)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !164, file: !57, line: 600, baseType: !347, size: 896, offset: 1792)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "bDopeSheet", file: !57, line: 531, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bDopeSheet", file: !57, line: 519, size: 896, elements: !349)
!349 = !{!350, !351, !352, !356, !357, !358, !359, !360}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !348, file: !57, line: 520, baseType: !77, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !348, file: !57, line: 521, baseType: !137, size: 128, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "filter_grp", scope: !348, file: !57, line: 523, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !355, line: 43, flags: DIFlagFwdDecl)
!355 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "searchstr", scope: !348, file: !57, line: 524, baseType: !127, size: 512, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "filterflag", scope: !348, file: !57, line: 526, baseType: !48, size: 32, offset: 768)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !348, file: !57, line: 527, baseType: !48, size: 32, offset: 800)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "renameIndex", scope: !348, file: !57, line: 529, baseType: !48, size: 32, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !348, file: !57, line: 530, baseType: !48, size: 32, offset: 864)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !164, file: !57, line: 602, baseType: !98, size: 8, offset: 2688)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "autosnap", scope: !164, file: !57, line: 602, baseType: !98, size: 8, offset: 2696)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !57, line: 603, baseType: !111, size: 16, offset: 2704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "timeslide", scope: !164, file: !57, line: 604, baseType: !174, size: 32, offset: 2720)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !368, line: 157, size: 1344, elements: !369)
!368 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!369 = !{!370, !372, !373, !374, !375, !376, !377, !378, !379, !380, !382, !384, !571, !572, !576, !577, !1395, !1396, !1401, !1406, !1407, !1409, !1410}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !368, line: 158, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !367, file: !368, line: 158, baseType: !371, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !367, file: !368, line: 161, baseType: !48, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !367, file: !368, line: 164, baseType: !297, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !368, line: 166, baseType: !48, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !368, line: 169, baseType: !297, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !367, file: !368, line: 171, baseType: !297, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !367, file: !368, line: 173, baseType: !48, size: 32, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !367, file: !368, line: 175, baseType: !297, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !368, line: 178, baseType: !381, size: 32, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !367, file: !368, line: 180, baseType: !383, size: 32, offset: 608)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !367, file: !368, line: 182, baseType: !385, size: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !368, line: 73, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!48, !389, !517}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !391)
!391 = !{!392, !396, !570}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !390, file: !6, line: 58, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !6, line: 56, size: 64, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !393, file: !6, line: 57, baseType: !83, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !6, line: 60, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !368, line: 339, size: 1600, elements: !399)
!399 = !{!400, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !427, !432, !552, !557, !563, !569}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !398, file: !368, line: 341, baseType: !401, size: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !368, line: 135, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !368, line: 130, size: 320, elements: !403)
!403 = !{!404, !405, !406, !409}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !402, file: !368, line: 131, baseType: !83, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !402, file: !368, line: 131, baseType: !83, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !402, file: !368, line: 133, baseType: !407, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !368, line: 46, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !402, file: !368, line: 134, baseType: !137, size: 128, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !398, file: !368, line: 344, baseType: !297, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !398, file: !368, line: 348, baseType: !83, size: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !398, file: !368, line: 349, baseType: !83, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !368, line: 352, baseType: !48, size: 32, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !368, line: 355, baseType: !297, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !398, file: !368, line: 357, baseType: !297, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !398, file: !368, line: 359, baseType: !297, size: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !398, file: !368, line: 361, baseType: !48, size: 32, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !398, file: !368, line: 364, baseType: !365, size: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !398, file: !368, line: 367, baseType: !365, size: 64, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !398, file: !368, line: 370, baseType: !397, size: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !398, file: !368, line: 376, baseType: !397, size: 64, offset: 1024)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !398, file: !368, line: 379, baseType: !423, size: 64, offset: 1088)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !368, line: 70, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!397, !389}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !398, file: !368, line: 382, baseType: !428, size: 64, offset: 1152)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !368, line: 71, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!160, !389}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !398, file: !368, line: 385, baseType: !433, size: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!397, !437, !504, !83, !297, !513, !518, !548}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !439, line: 53, size: 15232, elements: !440)
!439 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !454, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !498, !501}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !439, line: 54, baseType: !437, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !438, file: !439, line: 54, baseType: !437, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !438, file: !439, line: 55, baseType: !97, size: 8192, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !438, file: !439, line: 56, baseType: !111, size: 16, offset: 8320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !438, file: !439, line: 56, baseType: !111, size: 16, offset: 8336)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !438, file: !439, line: 57, baseType: !111, size: 16, offset: 8352)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !438, file: !439, line: 57, baseType: !111, size: 16, offset: 8368)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !438, file: !439, line: 58, baseType: !449, size: 64, offset: 8384)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !450, line: 27, baseType: !451)
!450 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !452, line: 45, baseType: !453)
!452 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!453 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !438, file: !439, line: 59, baseType: !455, size: 128, offset: 8448)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 16)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !438, file: !439, line: 60, baseType: !111, size: 16, offset: 8576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !438, file: !439, line: 62, baseType: !88, size: 64, offset: 8640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !438, file: !439, line: 63, baseType: !137, size: 128, offset: 8704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !438, file: !439, line: 64, baseType: !137, size: 128, offset: 8832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !438, file: !439, line: 65, baseType: !137, size: 128, offset: 8960)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !438, file: !439, line: 66, baseType: !137, size: 128, offset: 9088)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !438, file: !439, line: 67, baseType: !137, size: 128, offset: 9216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !438, file: !439, line: 68, baseType: !137, size: 128, offset: 9344)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !438, file: !439, line: 69, baseType: !137, size: 128, offset: 9472)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !438, file: !439, line: 70, baseType: !137, size: 128, offset: 9600)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !438, file: !439, line: 71, baseType: !137, size: 128, offset: 9728)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !438, file: !439, line: 72, baseType: !137, size: 128, offset: 9856)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !438, file: !439, line: 73, baseType: !137, size: 128, offset: 9984)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !438, file: !439, line: 74, baseType: !137, size: 128, offset: 10112)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !438, file: !439, line: 75, baseType: !137, size: 128, offset: 10240)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !438, file: !439, line: 76, baseType: !137, size: 128, offset: 10368)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !438, file: !439, line: 77, baseType: !137, size: 128, offset: 10496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !438, file: !439, line: 78, baseType: !137, size: 128, offset: 10624)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !438, file: !439, line: 79, baseType: !137, size: 128, offset: 10752)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !438, file: !439, line: 80, baseType: !137, size: 128, offset: 10880)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !438, file: !439, line: 81, baseType: !137, size: 128, offset: 11008)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !438, file: !439, line: 82, baseType: !137, size: 128, offset: 11136)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !438, file: !439, line: 83, baseType: !137, size: 128, offset: 11264)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !438, file: !439, line: 84, baseType: !137, size: 128, offset: 11392)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !438, file: !439, line: 85, baseType: !137, size: 128, offset: 11520)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !438, file: !439, line: 86, baseType: !137, size: 128, offset: 11648)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !438, file: !439, line: 87, baseType: !137, size: 128, offset: 11776)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !438, file: !439, line: 88, baseType: !137, size: 128, offset: 11904)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !438, file: !439, line: 89, baseType: !137, size: 128, offset: 12032)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !438, file: !439, line: 90, baseType: !137, size: 128, offset: 12160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !438, file: !439, line: 91, baseType: !137, size: 128, offset: 12288)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !438, file: !439, line: 92, baseType: !137, size: 128, offset: 12416)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !438, file: !439, line: 93, baseType: !137, size: 128, offset: 12544)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !438, file: !439, line: 94, baseType: !137, size: 128, offset: 12672)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !438, file: !439, line: 95, baseType: !137, size: 128, offset: 12800)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !438, file: !439, line: 96, baseType: !137, size: 128, offset: 12928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !438, file: !439, line: 98, baseType: !495, size: 2048, offset: 13056)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 2048, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !438, file: !439, line: 101, baseType: !499, size: 64, offset: 15104)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !439, line: 49, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !438, file: !439, line: 103, baseType: !502, size: 64, offset: 15168)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !439, line: 51, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !65, line: 106, size: 320, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !505, file: !65, line: 107, baseType: !137, size: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !505, file: !65, line: 108, baseType: !48, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !505, file: !65, line: 109, baseType: !48, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !505, file: !65, line: 110, baseType: !48, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !505, file: !65, line: 110, baseType: !48, size: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !505, file: !65, line: 111, baseType: !231, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!48, !389, !83, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!48, !522, !389, !524, !538}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !368, line: 137, size: 640, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !547}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !525, file: !368, line: 139, baseType: !401, size: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !525, file: !368, line: 142, baseType: !297, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !525, file: !368, line: 144, baseType: !48, size: 32, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !525, file: !368, line: 147, baseType: !297, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !525, file: !368, line: 150, baseType: !532, size: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !522, !504, !536, !538}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !390)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !541)
!541 = !{!542, !543, !544, !545, !546}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !540, file: !6, line: 339, baseType: !83, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !540, file: !6, line: 342, baseType: !524, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !540, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !540, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !540, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !525, file: !368, line: 154, baseType: !365, size: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !83}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !398, file: !368, line: 386, baseType: !553, size: 64, offset: 1280)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !437, !397}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !398, file: !368, line: 387, baseType: !558, size: 64, offset: 1344)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!562, !536}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !398, file: !368, line: 390, baseType: !564, size: 64, offset: 1408)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !368, line: 69, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!121, !389, !568}
!568 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !398, file: !368, line: 393, baseType: !137, size: 128, offset: 1472)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !6, line: 61, baseType: !83, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !367, file: !368, line: 184, baseType: !7, size: 32, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !367, file: !368, line: 186, baseType: !573, size: 96, offset: 736)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 3)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !367, file: !368, line: 187, baseType: !7, size: 32, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !367, file: !368, line: 190, baseType: !578, size: 64, offset: 896)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !368, line: 64, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !437, !582, !389}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !584, line: 1216, size: 39680, elements: !585)
!584 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!585 = !{!586, !587, !643, !646, !649, !650, !651, !663, !664, !666, !667, !668, !669, !670, !671, !672, !673, !674, !678, !681, !684, !982, !985, !1266, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1288, !1289, !1290, !1291, !1292, !1300, !1367, !1374, !1377, !1384, !1387, !1388, !1389, !1390, !1391, !1392}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !583, file: !584, line: 1217, baseType: !78, size: 960)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !583, file: !584, line: 1218, baseType: !588, size: 64, offset: 960)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !590, line: 838, size: 768, elements: !591)
!590 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!591 = !{!592, !593, !594, !604, !605, !636, !637, !638, !639, !640, !641, !642}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !589, file: !590, line: 840, baseType: !147, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !589, file: !590, line: 844, baseType: !147, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !589, file: !590, line: 848, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !590, line: 549, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !590, line: 544, size: 320, elements: !598)
!598 = !{!599, !601, !602, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !597, file: !590, line: 545, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !597, file: !590, line: 545, baseType: !600, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !597, file: !590, line: 547, baseType: !147, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !597, file: !590, line: 548, baseType: !137, size: 128, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !589, file: !590, line: 851, baseType: !137, size: 128, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !589, file: !590, line: 853, baseType: !606, size: 64, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !590, line: 594, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !590, line: 561, size: 1664, elements: !609)
!609 = !{!610, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !608, file: !590, line: 562, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !608, file: !590, line: 562, baseType: !611, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !608, file: !590, line: 564, baseType: !137, size: 128, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !608, file: !590, line: 565, baseType: !147, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !608, file: !590, line: 566, baseType: !595, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !608, file: !590, line: 568, baseType: !137, size: 128, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !608, file: !590, line: 569, baseType: !137, size: 128, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !608, file: !590, line: 571, baseType: !127, size: 512, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !608, file: !590, line: 573, baseType: !174, size: 32, offset: 1152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !608, file: !590, line: 574, baseType: !174, size: 32, offset: 1184)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !608, file: !590, line: 576, baseType: !174, size: 32, offset: 1216)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !608, file: !590, line: 576, baseType: !174, size: 32, offset: 1248)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !608, file: !590, line: 577, baseType: !174, size: 32, offset: 1280)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !608, file: !590, line: 577, baseType: !174, size: 32, offset: 1312)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !608, file: !590, line: 579, baseType: !174, size: 32, offset: 1344)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !608, file: !590, line: 580, baseType: !174, size: 32, offset: 1376)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !608, file: !590, line: 582, baseType: !174, size: 32, offset: 1408)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !608, file: !590, line: 582, baseType: !174, size: 32, offset: 1440)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !608, file: !590, line: 583, baseType: !111, size: 16, offset: 1472)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !608, file: !590, line: 585, baseType: !111, size: 16, offset: 1488)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !608, file: !590, line: 586, baseType: !111, size: 16, offset: 1504)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !590, line: 588, baseType: !111, size: 16, offset: 1520)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !608, file: !590, line: 590, baseType: !83, size: 64, offset: 1536)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !608, file: !590, line: 592, baseType: !48, size: 32, offset: 1600)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !608, file: !590, line: 593, baseType: !48, size: 32, offset: 1632)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !589, file: !590, line: 858, baseType: !137, size: 128, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !589, file: !590, line: 859, baseType: !137, size: 128, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !589, file: !590, line: 862, baseType: !48, size: 32, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !589, file: !590, line: 863, baseType: !48, size: 32, offset: 672)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !589, file: !590, line: 866, baseType: !111, size: 16, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !589, file: !590, line: 867, baseType: !111, size: 16, offset: 720)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !589, file: !590, line: 868, baseType: !174, size: 32, offset: 736)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !583, file: !584, line: 1220, baseType: !644, size: 64, offset: 1024)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !584, line: 50, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !583, file: !584, line: 1221, baseType: !647, size: 64, offset: 1088)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !584, line: 52, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !583, file: !584, line: 1223, baseType: !582, size: 64, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !583, file: !584, line: 1225, baseType: !137, size: 128, offset: 1216)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !583, file: !584, line: 1226, baseType: !652, size: 64, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !584, line: 69, size: 320, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !584, line: 70, baseType: !652, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !653, file: !584, line: 70, baseType: !652, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !653, file: !584, line: 71, baseType: !7, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !653, file: !584, line: 71, baseType: !7, size: 32, offset: 160)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !653, file: !584, line: 72, baseType: !48, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !653, file: !584, line: 73, baseType: !111, size: 16, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !653, file: !584, line: 73, baseType: !111, size: 16, offset: 240)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !653, file: !584, line: 74, baseType: !644, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !583, file: !584, line: 1227, baseType: !644, size: 64, offset: 1408)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !583, file: !584, line: 1229, baseType: !665, size: 96, offset: 1472)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 96, elements: !574)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !583, file: !584, line: 1230, baseType: !665, size: 96, offset: 1568)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !583, file: !584, line: 1231, baseType: !665, size: 96, offset: 1664)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !583, file: !584, line: 1231, baseType: !665, size: 96, offset: 1760)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !583, file: !584, line: 1233, baseType: !7, size: 32, offset: 1856)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !583, file: !584, line: 1234, baseType: !48, size: 32, offset: 1888)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !583, file: !584, line: 1235, baseType: !7, size: 32, offset: 1920)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !583, file: !584, line: 1237, baseType: !111, size: 16, offset: 1952)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !583, file: !584, line: 1239, baseType: !98, size: 8, offset: 1968)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !583, file: !584, line: 1240, baseType: !675, size: 8, offset: 1976)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 1)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !583, file: !584, line: 1242, baseType: !679, size: 64, offset: 1984)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !584, line: 57, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !583, file: !584, line: 1244, baseType: !682, size: 64, offset: 2048)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !584, line: 59, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !583, file: !584, line: 1246, baseType: !685, size: 64, offset: 2112)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !584, line: 1067, size: 5184, elements: !687)
!687 = !{!688, !720, !721, !736, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !758, !854, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !903, !904, !905, !906, !907, !908, !909, !910, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !965}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !686, file: !584, line: 1068, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !584, line: 934, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !584, line: 925, size: 576, elements: !692)
!692 = !{!693, !711, !712, !713, !714, !716, !719}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !691, file: !584, line: 926, baseType: !694, size: 320)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !584, line: 830, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !584, line: 813, size: 320, elements: !696)
!696 = !{!697, !700, !703, !704, !708, !709, !710}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !695, file: !584, line: 814, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !584, line: 51, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !695, file: !584, line: 815, baseType: !701, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !584, line: 815, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !695, file: !584, line: 818, baseType: !83, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !695, file: !584, line: 819, baseType: !705, size: 32, offset: 192)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 32, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 4)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !695, file: !584, line: 822, baseType: !48, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !695, file: !584, line: 826, baseType: !48, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !695, file: !584, line: 829, baseType: !48, size: 32, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !584, line: 928, baseType: !111, size: 16, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !691, file: !584, line: 928, baseType: !111, size: 16, offset: 336)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !691, file: !584, line: 929, baseType: !48, size: 32, offset: 352)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !691, file: !584, line: 930, baseType: !715, size: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !691, file: !584, line: 931, baseType: !717, size: 64, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !584, line: 931, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !691, file: !584, line: 933, baseType: !83, size: 64, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !686, file: !584, line: 1069, baseType: !689, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !686, file: !584, line: 1070, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !584, line: 916, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !584, line: 891, size: 704, elements: !725)
!725 = !{!726, !727, !728, !730, !731, !732, !733, !734, !735}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !724, file: !584, line: 892, baseType: !694, size: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !724, file: !584, line: 896, baseType: !48, size: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !724, file: !584, line: 900, baseType: !729, size: 96, offset: 352)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !574)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !724, file: !584, line: 903, baseType: !174, size: 32, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !724, file: !584, line: 906, baseType: !48, size: 32, offset: 480)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !724, file: !584, line: 909, baseType: !174, size: 32, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !724, file: !584, line: 912, baseType: !174, size: 32, offset: 544)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !724, file: !584, line: 914, baseType: !644, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !724, file: !584, line: 915, baseType: !83, size: 64, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !686, file: !584, line: 1071, baseType: !737, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !584, line: 920, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !584, line: 918, size: 320, elements: !740)
!740 = !{!741}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !739, file: !584, line: 919, baseType: !694, size: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !686, file: !584, line: 1075, baseType: !174, size: 32, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !686, file: !584, line: 1077, baseType: !174, size: 32, offset: 288)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !686, file: !584, line: 1078, baseType: !174, size: 32, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !686, file: !584, line: 1079, baseType: !111, size: 16, offset: 352)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !686, file: !584, line: 1082, baseType: !111, size: 16, offset: 368)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !686, file: !584, line: 1085, baseType: !98, size: 8, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !686, file: !584, line: 1086, baseType: !98, size: 8, offset: 392)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !686, file: !584, line: 1087, baseType: !98, size: 8, offset: 400)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !686, file: !584, line: 1088, baseType: !98, size: 8, offset: 408)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !686, file: !584, line: 1090, baseType: !174, size: 32, offset: 416)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !686, file: !584, line: 1093, baseType: !111, size: 16, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !686, file: !584, line: 1096, baseType: !98, size: 8, offset: 464)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !686, file: !584, line: 1098, baseType: !755, size: 40, offset: 472)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 40, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 5)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !686, file: !584, line: 1101, baseType: !759, size: 832, offset: 512)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !584, line: 836, size: 832, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !768, !769, !770, !850, !851, !852, !853}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !759, file: !584, line: 837, baseType: !694, size: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !759, file: !584, line: 839, baseType: !111, size: 16, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !759, file: !584, line: 839, baseType: !111, size: 16, offset: 336)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !759, file: !584, line: 842, baseType: !111, size: 16, offset: 352)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !759, file: !584, line: 842, baseType: !111, size: 16, offset: 368)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !759, file: !584, line: 843, baseType: !767, size: 32, offset: 384)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 32, elements: !206)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !759, file: !584, line: 845, baseType: !48, size: 32, offset: 416)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !759, file: !584, line: 847, baseType: !83, size: 64, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !759, file: !584, line: 848, baseType: !771, size: 64, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !773, line: 77, size: 15424, elements: !774)
!773 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!774 = !{!775, !776, !777, !780, !783, !786, !789, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !831, !832, !833, !839, !840, !844}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !772, file: !773, line: 78, baseType: !78, size: 960)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !772, file: !773, line: 80, baseType: !97, size: 8192, offset: 960)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !772, file: !773, line: 82, baseType: !778, size: 64, offset: 9152)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !773, line: 43, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !772, file: !773, line: 83, baseType: !781, size: 64, offset: 9216)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !79, line: 46, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !772, file: !773, line: 86, baseType: !784, size: 64, offset: 9280)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !773, line: 41, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !772, file: !773, line: 87, baseType: !787, size: 64, offset: 9344)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !773, line: 44, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !772, file: !773, line: 89, baseType: !790, size: 512, offset: 9408)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 512, elements: !177)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !772, file: !773, line: 90, baseType: !111, size: 16, offset: 9920)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !772, file: !773, line: 90, baseType: !111, size: 16, offset: 9936)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !772, file: !773, line: 92, baseType: !111, size: 16, offset: 9952)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !772, file: !773, line: 92, baseType: !111, size: 16, offset: 9968)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !772, file: !773, line: 93, baseType: !111, size: 16, offset: 9984)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !772, file: !773, line: 93, baseType: !111, size: 16, offset: 10000)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !772, file: !773, line: 94, baseType: !48, size: 32, offset: 10016)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !772, file: !773, line: 97, baseType: !111, size: 16, offset: 10048)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !772, file: !773, line: 97, baseType: !111, size: 16, offset: 10064)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !772, file: !773, line: 98, baseType: !111, size: 16, offset: 10080)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !772, file: !773, line: 98, baseType: !111, size: 16, offset: 10096)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !772, file: !773, line: 99, baseType: !111, size: 16, offset: 10112)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !772, file: !773, line: 99, baseType: !111, size: 16, offset: 10128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !772, file: !773, line: 100, baseType: !7, size: 32, offset: 10144)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !772, file: !773, line: 101, baseType: !715, size: 64, offset: 10176)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !772, file: !773, line: 103, baseType: !104, size: 64, offset: 10240)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !772, file: !773, line: 104, baseType: !808, size: 64, offset: 10304)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !79, line: 159, size: 448, elements: !810)
!810 = !{!811, !813, !814, !815, !816, !818}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !809, file: !79, line: 161, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !206)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !809, file: !79, line: 162, baseType: !812, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !809, file: !79, line: 163, baseType: !767, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !809, file: !79, line: 164, baseType: !767, size: 32, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !809, file: !79, line: 165, baseType: !817, size: 128, offset: 192)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 128, elements: !206)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !809, file: !79, line: 166, baseType: !819, size: 128, offset: 320)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 128, elements: !206)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !772, file: !773, line: 107, baseType: !174, size: 32, offset: 10368)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !772, file: !773, line: 108, baseType: !48, size: 32, offset: 10400)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !772, file: !773, line: 109, baseType: !111, size: 16, offset: 10432)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !772, file: !773, line: 110, baseType: !111, size: 16, offset: 10448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !772, file: !773, line: 113, baseType: !48, size: 32, offset: 10464)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !772, file: !773, line: 113, baseType: !48, size: 32, offset: 10496)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !772, file: !773, line: 114, baseType: !98, size: 8, offset: 10528)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !772, file: !773, line: 114, baseType: !98, size: 8, offset: 10536)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !772, file: !773, line: 115, baseType: !111, size: 16, offset: 10544)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !772, file: !773, line: 116, baseType: !830, size: 128, offset: 10560)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 128, elements: !706)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !772, file: !773, line: 119, baseType: !174, size: 32, offset: 10688)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !772, file: !773, line: 119, baseType: !174, size: 32, offset: 10720)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !772, file: !773, line: 122, baseType: !834, size: 512, offset: 10752)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !835, line: 182, baseType: !836)
!835 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !835, line: 180, size: 512, elements: !837)
!837 = !{!838}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !836, file: !835, line: 181, baseType: !127, size: 512)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !772, file: !773, line: 123, baseType: !98, size: 8, offset: 11264)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !772, file: !773, line: 125, baseType: !841, size: 56, offset: 11272)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 56, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 7)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !772, file: !773, line: 126, baseType: !845, size: 4096, offset: 11328)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 4096, elements: !177)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !773, line: 69, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !773, line: 67, size: 512, elements: !848)
!848 = !{!849}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !847, file: !773, line: 68, baseType: !127, size: 512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !759, file: !584, line: 849, baseType: !771, size: 64, offset: 576)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !759, file: !584, line: 850, baseType: !771, size: 64, offset: 640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !759, file: !584, line: 851, baseType: !665, size: 96, offset: 704)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !759, file: !584, line: 852, baseType: !174, size: 32, offset: 800)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !686, file: !584, line: 1104, baseType: !855, size: 1344, offset: 1344)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !584, line: 867, size: 1344, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !855, file: !584, line: 868, baseType: !111, size: 16)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !855, file: !584, line: 869, baseType: !111, size: 16, offset: 16)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !855, file: !584, line: 870, baseType: !111, size: 16, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !855, file: !584, line: 871, baseType: !111, size: 16, offset: 48)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !855, file: !584, line: 873, baseType: !862, size: 896, offset: 64)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 896, elements: !842)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !584, line: 864, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !584, line: 859, size: 128, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !871}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !864, file: !584, line: 860, baseType: !111, size: 16)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !864, file: !584, line: 861, baseType: !111, size: 16, offset: 16)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !864, file: !584, line: 861, baseType: !111, size: 16, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !864, file: !584, line: 861, baseType: !111, size: 16, offset: 48)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !864, file: !584, line: 862, baseType: !48, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !864, file: !584, line: 863, baseType: !174, size: 32, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !855, file: !584, line: 874, baseType: !83, size: 64, offset: 960)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !855, file: !584, line: 876, baseType: !174, size: 32, offset: 1024)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !855, file: !584, line: 876, baseType: !174, size: 32, offset: 1056)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !855, file: !584, line: 878, baseType: !48, size: 32, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !855, file: !584, line: 879, baseType: !48, size: 32, offset: 1120)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !855, file: !584, line: 881, baseType: !48, size: 32, offset: 1152)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !855, file: !584, line: 881, baseType: !48, size: 32, offset: 1184)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !855, file: !584, line: 883, baseType: !582, size: 64, offset: 1216)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !855, file: !584, line: 884, baseType: !644, size: 64, offset: 1280)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !686, file: !584, line: 1107, baseType: !174, size: 32, offset: 2688)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !686, file: !584, line: 1110, baseType: !174, size: 32, offset: 2720)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !686, file: !584, line: 1113, baseType: !111, size: 16, offset: 2752)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !686, file: !584, line: 1113, baseType: !111, size: 16, offset: 2768)
