; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_mods.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_mods.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }

!76 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 63, baseType: !5, size: 32, elements: !88)
!87 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!88 = !{!89, !90, !91, !92, !93}
!89 = !DIEnumerator(name: "_FLAG_JF", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "_FLAG_MF", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "_FLAG_MV", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "_FLAG_OVERLAP", value: 4, isUnsigned: true)
!93 = !DIEnumerator(name: "_FLAG_WALK", value: 8, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !95, line: 33, baseType: !5, size: 32, elements: !96)
!95 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !101, line: 57, baseType: !5, size: 32, elements: !102)
!101 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!103 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!104 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!105 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!106 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!107 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!108 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!109 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!110 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!111 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!112 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!113 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!114 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!115 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!116 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 74, baseType: !5, size: 32, elements: !119)
!118 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_mods.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!119 = !{!120, !121, !122, !123}
!120 = !DIEnumerator(name: "BM_EDGEROT_CHECK_EXISTS", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "BM_EDGEROT_CHECK_SPLICE", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "BM_EDGEROT_CHECK_DEGENERATE", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "BM_EDGEROT_CHECK_BEAUTY", value: 8, isUnsigned: true)
!124 = !{!125, !126, !129, !130, !132, !133, !198, !200, !201, !205, !209, !182}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!128 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!132 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !135, line: 123, baseType: !136)
!135 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !135, line: 110, size: 640, elements: !137)
!137 = !{!138, !148, !154, !167, !168, !191, !197}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !136, file: !135, line: 111, baseType: !139, size: 128)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !135, line: 82, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !135, line: 64, size: 128, elements: !141)
!141 = !{!142, !143, !145, !146, !147}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !135, line: 65, baseType: !125, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !140, file: !135, line: 66, baseType: !144, size: 32, offset: 64)
!144 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !140, file: !135, line: 73, baseType: !131, size: 8, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !140, file: !135, line: 74, baseType: !131, size: 8, offset: 104)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !140, file: !135, line: 80, baseType: !131, size: 8, offset: 112)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !136, file: !135, line: 112, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !135, line: 180, size: 16, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !150, file: !135, line: 181, baseType: !153, size: 16)
!153 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !136, file: !135, line: 114, baseType: !155, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !135, line: 90, size: 448, elements: !157)
!157 = !{!158, !159, !160, !164, !165}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !156, file: !135, line: 91, baseType: !139, size: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !156, file: !135, line: 92, baseType: !149, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !156, file: !135, line: 94, baseType: !161, size: 96, offset: 192)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 96, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 3)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !156, file: !135, line: 95, baseType: !161, size: 96, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !156, file: !135, line: 102, baseType: !166, size: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !136, file: !135, line: 114, baseType: !155, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !136, file: !135, line: 118, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !135, line: 125, size: 576, elements: !171)
!171 = !{!172, !173, !174, !175, !187, !188, !189, !190}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !170, file: !135, line: 126, baseType: !139, size: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !170, file: !135, line: 129, baseType: !155, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !170, file: !135, line: 130, baseType: !166, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !170, file: !135, line: 131, baseType: !176, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !135, line: 164, size: 448, elements: !178)
!178 = !{!179, !180, !181, !184, !185, !186}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !177, file: !135, line: 165, baseType: !139, size: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !177, file: !135, line: 166, baseType: !149, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !177, file: !135, line: 172, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !135, line: 140, baseType: !170)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !177, file: !135, line: 174, baseType: !144, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !177, file: !135, line: 175, baseType: !161, size: 96, offset: 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !177, file: !135, line: 176, baseType: !153, size: 16, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !170, file: !135, line: 135, baseType: !169, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !170, file: !135, line: 135, baseType: !169, size: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !135, line: 139, baseType: !169, size: 64, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !135, line: 139, baseType: !169, size: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !136, file: !135, line: 122, baseType: !192, size: 128, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !135, line: 108, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !135, line: 106, size: 128, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !135, line: 107, baseType: !166, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !193, file: !135, line: 107, baseType: !166, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !136, file: !135, line: 122, baseType: !192, size: 128, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !135, line: 103, baseType: !156)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !101, line: 79, baseType: !100)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !101, line: 158, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !125}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !101, line: 159, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!125, !125}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !135, line: 178, baseType: !177)
!211 = !{i32 7, !"Dwarf Version", i32 4}
!212 = !{i32 2, !"Debug Info Version", i32 3}
!213 = !{i32 1, !"wchar_size", i32 4}
!214 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!215 = distinct !DISubprogram(name: "BM_vert_dissolve", scope: !1, file: !1, line: 73, type: !216, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !359)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !219, !198}
!218 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !135, line: 246, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !135, line: 186, size: 8064, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !236, !237, !238, !239, !241, !243, !245, !246, !247, !248, !249, !250, !251, !252, !303, !342, !343, !344, !345, !346, !347, !348, !349, !356, !357, !358}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !221, file: !135, line: 187, baseType: !144, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !221, file: !135, line: 187, baseType: !144, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !221, file: !135, line: 187, baseType: !144, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !221, file: !135, line: 187, baseType: !144, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !221, file: !135, line: 188, baseType: !144, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !221, file: !135, line: 188, baseType: !144, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !221, file: !135, line: 188, baseType: !144, size: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !221, file: !135, line: 193, baseType: !131, size: 8, offset: 224)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !221, file: !135, line: 197, baseType: !131, size: 8, offset: 232)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !221, file: !135, line: 201, baseType: !233, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !235, line: 39, flags: DIFlagFwdDecl)
!235 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !221, file: !135, line: 201, baseType: !233, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !221, file: !135, line: 201, baseType: !233, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !221, file: !135, line: 201, baseType: !233, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !221, file: !135, line: 208, baseType: !240, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !221, file: !135, line: 209, baseType: !242, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !221, file: !135, line: 210, baseType: !244, size: 64, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !221, file: !135, line: 213, baseType: !144, size: 32, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !221, file: !135, line: 214, baseType: !144, size: 32, offset: 736)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !221, file: !135, line: 215, baseType: !144, size: 32, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !221, file: !135, line: 218, baseType: !233, size: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !221, file: !135, line: 218, baseType: !233, size: 64, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !221, file: !135, line: 218, baseType: !233, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !221, file: !135, line: 220, baseType: !144, size: 32, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !221, file: !135, line: 221, baseType: !253, size: 64, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !255)
!255 = !{!256, !291, !292, !296, !299, !300, !302}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !254, file: !4, line: 191, baseType: !257, size: 5120)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 5120, elements: !289)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !259)
!259 = !{!260, !263, !265, !275, !276}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !258, file: !4, line: 148, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !258, file: !4, line: 149, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !258, file: !4, line: 150, baseType: !266, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !268)
!268 = !{!269, !271, !273}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !267, file: !4, line: 139, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !267, file: !4, line: 140, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !267, file: !4, line: 141, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !4, line: 152, baseType: !144, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !4, line: 162, baseType: !277, size: 128, offset: 192)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !258, file: !4, line: 155, size: 128, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !277, file: !4, line: 156, baseType: !144, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !277, file: !4, line: 157, baseType: !132, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !277, file: !4, line: 158, baseType: !125, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !277, file: !4, line: 159, baseType: !161, size: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !277, file: !4, line: 160, baseType: !129, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !277, file: !4, line: 161, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !287, line: 48, baseType: !288)
!287 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !287, line: 48, flags: DIFlagFwdDecl)
!289 = !{!290}
!290 = !DISubrange(count: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !254, file: !4, line: 192, baseType: !257, size: 5120, offset: 5120)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !254, file: !4, line: 193, baseType: !293, size: 64, offset: 10240)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !219, !253}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !254, file: !4, line: 194, baseType: !297, size: 64, offset: 10304)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !235, line: 38, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !4, line: 195, baseType: !144, size: 32, offset: 10368)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !254, file: !4, line: 196, baseType: !301, size: 32, offset: 10400)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !254, file: !4, line: 197, baseType: !144, size: 32, offset: 10432)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !221, file: !135, line: 223, baseType: !304, size: 1600, offset: 1152)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !43, line: 73, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !43, line: 64, size: 1600, elements: !306)
!306 = !{!307, !325, !329, !330, !331, !332, !333}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !305, file: !43, line: 65, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !43, line: 53, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !43, line: 42, size: 832, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !324}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !43, line: 43, baseType: !144, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !310, file: !43, line: 44, baseType: !144, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !310, file: !43, line: 45, baseType: !144, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !310, file: !43, line: 46, baseType: !144, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !310, file: !43, line: 47, baseType: !144, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !310, file: !43, line: 48, baseType: !144, size: 32, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !310, file: !43, line: 49, baseType: !144, size: 32, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !310, file: !43, line: 50, baseType: !144, size: 32, offset: 224)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !43, line: 51, baseType: !321, size: 512, offset: 256)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 512, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !43, line: 52, baseType: !125, size: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !305, file: !43, line: 66, baseType: !326, size: 1312, offset: 64)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 1312, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 41)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !305, file: !43, line: 69, baseType: !144, size: 32, offset: 1376)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !305, file: !43, line: 69, baseType: !144, size: 32, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !305, file: !43, line: 70, baseType: !144, size: 32, offset: 1440)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !305, file: !43, line: 71, baseType: !233, size: 64, offset: 1472)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !305, file: !43, line: 72, baseType: !334, size: 64, offset: 1536)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !43, line: 59, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !43, line: 57, size: 8192, elements: !337)
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !336, file: !43, line: 58, baseType: !339, size: 8192)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 8192, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 1024)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !221, file: !135, line: 223, baseType: !304, size: 1600, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !221, file: !135, line: 223, baseType: !304, size: 1600, offset: 4352)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !221, file: !135, line: 223, baseType: !304, size: 1600, offset: 5952)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !221, file: !135, line: 233, baseType: !153, size: 16, offset: 7552)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !221, file: !135, line: 236, baseType: !144, size: 32, offset: 7584)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !221, file: !135, line: 238, baseType: !144, size: 32, offset: 7616)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !221, file: !135, line: 238, baseType: !144, size: 32, offset: 7648)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !221, file: !135, line: 239, baseType: !350, size: 128, offset: 7680)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !351, line: 71, baseType: !352)
!351 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !351, line: 69, size: 128, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !352, file: !351, line: 70, baseType: !125, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !352, file: !351, line: 70, baseType: !125, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !221, file: !135, line: 241, baseType: !209, size: 64, offset: 7808)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !221, file: !135, line: 243, baseType: !350, size: 128, offset: 7872)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !221, file: !135, line: 245, baseType: !125, size: 64, offset: 8000)
!359 = !{}
!360 = !DILocalVariable(name: "bm", arg: 1, scope: !215, file: !1, line: 73, type: !219)
!361 = !DILocation(line: 73, column: 30, scope: !215)
!362 = !DILocalVariable(name: "v", arg: 2, scope: !215, file: !1, line: 73, type: !198)
!363 = !DILocation(line: 73, column: 42, scope: !215)
!364 = !DILocalVariable(name: "len", scope: !215, file: !1, line: 75, type: !365)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!366 = !DILocation(line: 75, column: 12, scope: !215)
!367 = !DILocation(line: 75, column: 37, scope: !215)
!368 = !DILocation(line: 75, column: 18, scope: !215)
!369 = !DILocation(line: 77, column: 6, scope: !370)
!370 = distinct !DILexicalBlock(scope: !215, file: !1, line: 77, column: 6)
!371 = !DILocation(line: 77, column: 10, scope: !370)
!372 = !DILocation(line: 77, column: 6, scope: !215)
!373 = !DILocation(line: 78, column: 16, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !1, line: 77, column: 16)
!375 = !DILocation(line: 78, column: 20, scope: !374)
!376 = !DILocation(line: 78, column: 3, scope: !374)
!377 = !DILocation(line: 79, column: 3, scope: !374)
!378 = !DILocation(line: 81, column: 32, scope: !379)
!379 = distinct !DILexicalBlock(scope: !370, file: !1, line: 81, column: 11)
!380 = !DILocation(line: 81, column: 12, scope: !379)
!381 = !DILocation(line: 81, column: 11, scope: !370)
!382 = !DILocation(line: 82, column: 8, scope: !383)
!383 = distinct !DILexicalBlock(scope: !384, file: !1, line: 82, column: 7)
!384 = distinct !DILexicalBlock(scope: !379, file: !1, line: 81, column: 36)
!385 = !DILocation(line: 82, column: 11, scope: !383)
!386 = !DILocation(line: 82, column: 7, scope: !384)
!387 = !DILocation(line: 83, column: 17, scope: !388)
!388 = distinct !DILexicalBlock(scope: !383, file: !1, line: 82, column: 14)
!389 = !DILocation(line: 83, column: 21, scope: !388)
!390 = !DILocation(line: 83, column: 4, scope: !388)
!391 = !DILocation(line: 84, column: 4, scope: !388)
!392 = !DILocation(line: 86, column: 13, scope: !393)
!393 = distinct !DILexicalBlock(scope: !383, file: !1, line: 86, column: 12)
!394 = !DILocation(line: 86, column: 16, scope: !393)
!395 = !DILocation(line: 86, column: 19, scope: !393)
!396 = !DILocation(line: 86, column: 12, scope: !383)
!397 = !DILocation(line: 87, column: 8, scope: !398)
!398 = distinct !DILexicalBlock(scope: !399, file: !1, line: 87, column: 8)
!399 = distinct !DILexicalBlock(scope: !393, file: !1, line: 86, column: 22)
!400 = !DILocation(line: 87, column: 12, scope: !398)
!401 = !DILocation(line: 87, column: 8, scope: !399)
!402 = !DILocation(line: 88, column: 35, scope: !403)
!403 = distinct !DILexicalBlock(scope: !398, file: !1, line: 87, column: 18)
!404 = !DILocation(line: 88, column: 39, scope: !403)
!405 = !DILocation(line: 88, column: 42, scope: !403)
!406 = !DILocation(line: 88, column: 45, scope: !403)
!407 = !DILocation(line: 88, column: 13, scope: !403)
!408 = !DILocation(line: 88, column: 60, scope: !403)
!409 = !DILocation(line: 88, column: 12, scope: !403)
!410 = !DILocation(line: 88, column: 5, scope: !403)
!411 = !DILocation(line: 93, column: 5, scope: !412)
!412 = distinct !DILexicalBlock(scope: !398, file: !1, line: 90, column: 9)
!413 = !DILocation(line: 97, column: 4, scope: !414)
!414 = distinct !DILexicalBlock(scope: !393, file: !1, line: 96, column: 8)
!415 = !DILocation(line: 100, column: 11, scope: !416)
!416 = distinct !DILexicalBlock(scope: !379, file: !1, line: 100, column: 11)
!417 = !DILocation(line: 100, column: 15, scope: !416)
!418 = !DILocation(line: 100, column: 20, scope: !416)
!419 = !DILocation(line: 100, column: 42, scope: !416)
!420 = !DILocation(line: 100, column: 23, scope: !416)
!421 = !DILocation(line: 100, column: 45, scope: !416)
!422 = !DILocation(line: 100, column: 11, scope: !379)
!423 = !DILocation(line: 102, column: 33, scope: !424)
!424 = distinct !DILexicalBlock(scope: !416, file: !1, line: 100, column: 51)
!425 = !DILocation(line: 102, column: 37, scope: !424)
!426 = !DILocation(line: 102, column: 40, scope: !424)
!427 = !DILocation(line: 102, column: 43, scope: !424)
!428 = !DILocation(line: 102, column: 11, scope: !424)
!429 = !DILocation(line: 102, column: 58, scope: !424)
!430 = !DILocation(line: 102, column: 10, scope: !424)
!431 = !DILocation(line: 102, column: 3, scope: !424)
!432 = !DILocation(line: 105, column: 27, scope: !433)
!433 = distinct !DILexicalBlock(scope: !416, file: !1, line: 104, column: 7)
!434 = !DILocation(line: 105, column: 31, scope: !433)
!435 = !DILocation(line: 105, column: 10, scope: !433)
!436 = !DILocation(line: 105, column: 3, scope: !433)
!437 = !DILocation(line: 107, column: 1, scope: !215)
!438 = distinct !DISubprogram(name: "BM_vert_collapse_edge", scope: !1, file: !1, line: 1104, type: !439, scopeLine: 1106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !359)
!439 = !DISubroutineType(types: !440)
!440 = !{!133, !219, !133, !198, !441, !441}
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!442 = !DILocalVariable(name: "bm", arg: 1, scope: !438, file: !1, line: 1104, type: !219)
!443 = !DILocation(line: 1104, column: 38, scope: !438)
!444 = !DILocalVariable(name: "e_kill", arg: 2, scope: !438, file: !1, line: 1104, type: !133)
!445 = !DILocation(line: 1104, column: 50, scope: !438)
!446 = !DILocalVariable(name: "v_kill", arg: 3, scope: !438, file: !1, line: 1104, type: !198)
!447 = !DILocation(line: 1104, column: 66, scope: !438)
!448 = !DILocalVariable(name: "do_del", arg: 4, scope: !438, file: !1, line: 1105, type: !441)
!449 = !DILocation(line: 1105, column: 42, scope: !438)
!450 = !DILocalVariable(name: "kill_degenerate_faces", arg: 5, scope: !438, file: !1, line: 1105, type: !441)
!451 = !DILocation(line: 1105, column: 61, scope: !438)
!452 = !DILocation(line: 1132, column: 32, scope: !438)
!453 = !DILocation(line: 1132, column: 36, scope: !438)
!454 = !DILocation(line: 1132, column: 44, scope: !438)
!455 = !DILocation(line: 1132, column: 58, scope: !438)
!456 = !DILocation(line: 1132, column: 73, scope: !438)
!457 = !DILocation(line: 1132, column: 9, scope: !438)
!458 = !DILocation(line: 1132, column: 2, scope: !438)
!459 = distinct !DISubprogram(name: "BM_disk_dissolve", scope: !1, file: !1, line: 112, type: !216, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !359)
!460 = !DILocalVariable(name: "bm", arg: 1, scope: !459, file: !1, line: 112, type: !219)
!461 = !DILocation(line: 112, column: 30, scope: !459)
!462 = !DILocalVariable(name: "v", arg: 2, scope: !459, file: !1, line: 112, type: !198)
!463 = !DILocation(line: 112, column: 42, scope: !459)
!464 = !DILocalVariable(name: "f", scope: !459, file: !1, line: 114, type: !209)
!465 = !DILocation(line: 114, column: 10, scope: !459)
!466 = !DILocalVariable(name: "f2", scope: !459, file: !1, line: 114, type: !209)
!467 = !DILocation(line: 114, column: 14, scope: !459)
!468 = !DILocalVariable(name: "e", scope: !459, file: !1, line: 115, type: !133)
!469 = !DILocation(line: 115, column: 10, scope: !459)
!470 = !DILocalVariable(name: "keepedge", scope: !459, file: !1, line: 115, type: !133)
!471 = !DILocation(line: 115, column: 14, scope: !459)
!472 = !DILocalVariable(name: "baseedge", scope: !459, file: !1, line: 115, type: !133)
!473 = !DILocation(line: 115, column: 32, scope: !459)
!474 = !DILocalVariable(name: "len", scope: !459, file: !1, line: 116, type: !144)
!475 = !DILocation(line: 116, column: 6, scope: !459)
!476 = !DILocation(line: 118, column: 27, scope: !477)
!477 = distinct !DILexicalBlock(scope: !459, file: !1, line: 118, column: 6)
!478 = !DILocation(line: 118, column: 7, scope: !477)
!479 = !DILocation(line: 118, column: 6, scope: !459)
!480 = !DILocation(line: 119, column: 3, scope: !481)
!481 = distinct !DILexicalBlock(scope: !477, file: !1, line: 118, column: 31)
!482 = !DILocation(line: 122, column: 6, scope: !483)
!483 = distinct !DILexicalBlock(scope: !459, file: !1, line: 122, column: 6)
!484 = !DILocation(line: 122, column: 9, scope: !483)
!485 = !DILocation(line: 122, column: 6, scope: !459)
!486 = !DILocation(line: 124, column: 7, scope: !487)
!487 = distinct !DILexicalBlock(scope: !483, file: !1, line: 122, column: 12)
!488 = !DILocation(line: 124, column: 10, scope: !487)
!489 = !DILocation(line: 124, column: 5, scope: !487)
!490 = !DILocation(line: 125, column: 3, scope: !487)
!491 = !DILocation(line: 126, column: 29, scope: !492)
!492 = distinct !DILexicalBlock(scope: !487, file: !1, line: 125, column: 6)
!493 = !DILocation(line: 126, column: 32, scope: !492)
!494 = !DILocation(line: 126, column: 8, scope: !492)
!495 = !DILocation(line: 126, column: 6, scope: !492)
!496 = !DILocation(line: 127, column: 35, scope: !497)
!497 = distinct !DILexicalBlock(scope: !492, file: !1, line: 127, column: 8)
!498 = !DILocation(line: 127, column: 38, scope: !497)
!499 = !DILocation(line: 127, column: 41, scope: !497)
!500 = !DILocation(line: 127, column: 10, scope: !497)
!501 = !DILocation(line: 127, column: 8, scope: !492)
!502 = !DILocation(line: 128, column: 16, scope: !503)
!503 = distinct !DILexicalBlock(scope: !497, file: !1, line: 127, column: 46)
!504 = !DILocation(line: 128, column: 14, scope: !503)
!505 = !DILocation(line: 129, column: 16, scope: !503)
!506 = !DILocation(line: 129, column: 19, scope: !503)
!507 = !DILocation(line: 129, column: 14, scope: !503)
!508 = !DILocation(line: 130, column: 5, scope: !503)
!509 = !DILocation(line: 132, column: 7, scope: !492)
!510 = !DILocation(line: 133, column: 3, scope: !492)
!511 = !DILocation(line: 133, column: 12, scope: !487)
!512 = !DILocation(line: 133, column: 17, scope: !487)
!513 = !DILocation(line: 133, column: 20, scope: !487)
!514 = !DILocation(line: 133, column: 14, scope: !487)
!515 = distinct !{!515, !490, !516}
!516 = !DILocation(line: 133, column: 21, scope: !487)
!517 = !DILocation(line: 134, column: 2, scope: !487)
!518 = !DILocation(line: 138, column: 6, scope: !519)
!519 = distinct !DILexicalBlock(scope: !459, file: !1, line: 138, column: 6)
!520 = !DILocation(line: 138, column: 15, scope: !519)
!521 = !DILocation(line: 138, column: 23, scope: !519)
!522 = !DILocation(line: 138, column: 26, scope: !519)
!523 = !DILocation(line: 138, column: 30, scope: !519)
!524 = !DILocation(line: 138, column: 6, scope: !459)
!525 = !DILocation(line: 151, column: 7, scope: !526)
!526 = distinct !DILexicalBlock(scope: !527, file: !1, line: 151, column: 7)
!527 = distinct !DILexicalBlock(scope: !519, file: !1, line: 138, column: 36)
!528 = !DILocation(line: 151, column: 7, scope: !527)
!529 = !DILocation(line: 152, column: 4, scope: !530)
!530 = distinct !DILexicalBlock(scope: !526, file: !1, line: 151, column: 82)
!531 = !DILocation(line: 154, column: 12, scope: !532)
!532 = distinct !DILexicalBlock(scope: !526, file: !1, line: 154, column: 12)
!533 = !DILocation(line: 154, column: 12, scope: !526)
!534 = !DILocation(line: 155, column: 4, scope: !535)
!535 = distinct !DILexicalBlock(scope: !532, file: !1, line: 154, column: 84)
!536 = !DILocation(line: 158, column: 3, scope: !527)
!537 = !DILocation(line: 160, column: 11, scope: !538)
!538 = distinct !DILexicalBlock(scope: !519, file: !1, line: 160, column: 11)
!539 = !DILocation(line: 160, column: 20, scope: !538)
!540 = !DILocation(line: 160, column: 28, scope: !538)
!541 = !DILocation(line: 160, column: 31, scope: !538)
!542 = !DILocation(line: 160, column: 35, scope: !538)
!543 = !DILocation(line: 160, column: 11, scope: !519)
!544 = !DILocation(line: 162, column: 30, scope: !545)
!545 = distinct !DILexicalBlock(scope: !538, file: !1, line: 160, column: 41)
!546 = !DILocation(line: 162, column: 34, scope: !545)
!547 = !DILocation(line: 162, column: 37, scope: !545)
!548 = !DILocation(line: 162, column: 40, scope: !545)
!549 = !DILocation(line: 162, column: 7, scope: !545)
!550 = !DILocation(line: 162, column: 5, scope: !545)
!551 = !DILocation(line: 164, column: 8, scope: !552)
!552 = distinct !DILexicalBlock(scope: !545, file: !1, line: 164, column: 7)
!553 = !DILocation(line: 164, column: 7, scope: !545)
!554 = !DILocation(line: 165, column: 4, scope: !555)
!555 = distinct !DILexicalBlock(scope: !552, file: !1, line: 164, column: 11)
!556 = !DILocation(line: 169, column: 7, scope: !545)
!557 = !DILocation(line: 169, column: 10, scope: !545)
!558 = !DILocation(line: 169, column: 13, scope: !545)
!559 = !DILocation(line: 169, column: 5, scope: !545)
!560 = !DILocation(line: 170, column: 8, scope: !545)
!561 = !DILocation(line: 170, column: 11, scope: !545)
!562 = !DILocation(line: 170, column: 14, scope: !545)
!563 = !DILocation(line: 170, column: 27, scope: !545)
!564 = !DILocation(line: 170, column: 6, scope: !545)
!565 = !DILocation(line: 172, column: 7, scope: !566)
!566 = distinct !DILexicalBlock(scope: !545, file: !1, line: 172, column: 7)
!567 = !DILocation(line: 172, column: 12, scope: !566)
!568 = !DILocation(line: 172, column: 9, scope: !566)
!569 = !DILocation(line: 172, column: 15, scope: !566)
!570 = !DILocation(line: 172, column: 38, scope: !566)
!571 = !DILocation(line: 172, column: 42, scope: !566)
!572 = !DILocation(line: 172, column: 45, scope: !566)
!573 = !DILocation(line: 172, column: 49, scope: !566)
!574 = !DILocation(line: 172, column: 19, scope: !566)
!575 = !DILocation(line: 172, column: 7, scope: !545)
!576 = !DILocation(line: 173, column: 4, scope: !577)
!577 = distinct !DILexicalBlock(scope: !566, file: !1, line: 172, column: 59)
!578 = !DILocation(line: 176, column: 3, scope: !545)
!579 = !DILocation(line: 179, column: 6, scope: !580)
!580 = distinct !DILexicalBlock(scope: !459, file: !1, line: 179, column: 6)
!581 = !DILocation(line: 179, column: 6, scope: !459)
!582 = !DILocalVariable(name: "done", scope: !583, file: !1, line: 180, type: !218)
!583 = distinct !DILexicalBlock(scope: !580, file: !1, line: 179, column: 16)
!584 = !DILocation(line: 180, column: 8, scope: !583)
!585 = !DILocation(line: 182, column: 3, scope: !583)
!586 = !DILocation(line: 182, column: 11, scope: !583)
!587 = !DILocation(line: 182, column: 10, scope: !583)
!588 = !DILocation(line: 183, column: 9, scope: !589)
!589 = distinct !DILexicalBlock(scope: !583, file: !1, line: 182, column: 17)
!590 = !DILocation(line: 184, column: 8, scope: !589)
!591 = !DILocation(line: 184, column: 11, scope: !589)
!592 = !DILocation(line: 184, column: 6, scope: !589)
!593 = !DILocation(line: 185, column: 4, scope: !589)
!594 = !DILocation(line: 186, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !589, file: !1, line: 185, column: 7)
!596 = !DILocation(line: 187, column: 29, scope: !597)
!597 = distinct !DILexicalBlock(scope: !595, file: !1, line: 187, column: 9)
!598 = !DILocation(line: 187, column: 9, scope: !597)
!599 = !DILocation(line: 187, column: 32, scope: !597)
!600 = !DILocation(line: 187, column: 36, scope: !597)
!601 = !DILocation(line: 187, column: 41, scope: !597)
!602 = !DILocation(line: 187, column: 38, scope: !597)
!603 = !DILocation(line: 187, column: 51, scope: !597)
!604 = !DILocation(line: 187, column: 55, scope: !597)
!605 = !DILocation(line: 187, column: 60, scope: !597)
!606 = !DILocation(line: 187, column: 57, scope: !597)
!607 = !DILocation(line: 187, column: 9, scope: !595)
!608 = !DILocation(line: 188, column: 29, scope: !609)
!609 = distinct !DILexicalBlock(scope: !597, file: !1, line: 187, column: 71)
!610 = !DILocation(line: 188, column: 33, scope: !609)
!611 = !DILocation(line: 188, column: 36, scope: !609)
!612 = !DILocation(line: 188, column: 39, scope: !609)
!613 = !DILocation(line: 188, column: 42, scope: !609)
!614 = !DILocation(line: 188, column: 45, scope: !609)
!615 = !DILocation(line: 188, column: 48, scope: !609)
!616 = !DILocation(line: 188, column: 61, scope: !609)
!617 = !DILocation(line: 188, column: 64, scope: !609)
!618 = !DILocation(line: 188, column: 10, scope: !609)
!619 = !DILocation(line: 188, column: 8, scope: !609)
!620 = !DILocation(line: 192, column: 11, scope: !621)
!621 = distinct !DILexicalBlock(scope: !609, file: !1, line: 192, column: 10)
!622 = !DILocation(line: 192, column: 10, scope: !609)
!623 = !DILocation(line: 193, column: 7, scope: !624)
!624 = distinct !DILexicalBlock(scope: !621, file: !1, line: 192, column: 14)
!625 = !DILocation(line: 195, column: 5, scope: !609)
!626 = !DILocation(line: 197, column: 9, scope: !627)
!627 = distinct !DILexicalBlock(scope: !595, file: !1, line: 197, column: 9)
!628 = !DILocation(line: 197, column: 9, scope: !595)
!629 = !DILocation(line: 198, column: 11, scope: !630)
!630 = distinct !DILexicalBlock(scope: !627, file: !1, line: 197, column: 12)
!631 = !DILocation(line: 199, column: 6, scope: !630)
!632 = !DILocation(line: 201, column: 4, scope: !595)
!633 = !DILocation(line: 201, column: 39, scope: !589)
!634 = !DILocation(line: 201, column: 42, scope: !589)
!635 = !DILocation(line: 201, column: 18, scope: !589)
!636 = !DILocation(line: 201, column: 16, scope: !589)
!637 = !DILocation(line: 201, column: 49, scope: !589)
!638 = !DILocation(line: 201, column: 52, scope: !589)
!639 = !DILocation(line: 201, column: 46, scope: !589)
!640 = distinct !{!640, !593, !641}
!641 = !DILocation(line: 201, column: 53, scope: !589)
!642 = distinct !{!642, !585, !643}
!643 = !DILocation(line: 202, column: 3, scope: !583)
!644 = !DILocation(line: 206, column: 30, scope: !583)
!645 = !DILocation(line: 206, column: 34, scope: !583)
!646 = !DILocation(line: 206, column: 44, scope: !583)
!647 = !DILocation(line: 206, column: 79, scope: !583)
!648 = !DILocation(line: 206, column: 59, scope: !583)
!649 = !DILocation(line: 206, column: 58, scope: !583)
!650 = !DILocation(line: 206, column: 7, scope: !583)
!651 = !DILocation(line: 206, column: 5, scope: !583)
!652 = !DILocation(line: 208, column: 8, scope: !653)
!653 = distinct !DILexicalBlock(scope: !583, file: !1, line: 208, column: 7)
!654 = !DILocation(line: 208, column: 7, scope: !583)
!655 = !DILocation(line: 209, column: 4, scope: !656)
!656 = distinct !DILexicalBlock(scope: !653, file: !1, line: 208, column: 11)
!657 = !DILocation(line: 212, column: 7, scope: !658)
!658 = distinct !DILexicalBlock(scope: !583, file: !1, line: 212, column: 7)
!659 = !DILocation(line: 212, column: 10, scope: !658)
!660 = !DILocation(line: 212, column: 7, scope: !583)
!661 = !DILocation(line: 214, column: 8, scope: !662)
!662 = distinct !DILexicalBlock(scope: !658, file: !1, line: 212, column: 13)
!663 = !DILocation(line: 214, column: 11, scope: !662)
!664 = !DILocation(line: 214, column: 14, scope: !662)
!665 = !DILocation(line: 214, column: 6, scope: !662)
!666 = !DILocation(line: 215, column: 9, scope: !662)
!667 = !DILocation(line: 215, column: 12, scope: !662)
!668 = !DILocation(line: 215, column: 15, scope: !662)
!669 = !DILocation(line: 215, column: 28, scope: !662)
!670 = !DILocation(line: 215, column: 7, scope: !662)
!671 = !DILocation(line: 217, column: 8, scope: !672)
!672 = distinct !DILexicalBlock(scope: !662, file: !1, line: 217, column: 8)
!673 = !DILocation(line: 217, column: 13, scope: !672)
!674 = !DILocation(line: 217, column: 10, scope: !672)
!675 = !DILocation(line: 217, column: 8, scope: !662)
!676 = !DILocation(line: 219, column: 29, scope: !677)
!677 = distinct !DILexicalBlock(scope: !678, file: !1, line: 219, column: 9)
!678 = distinct !DILexicalBlock(scope: !672, file: !1, line: 217, column: 17)
!679 = !DILocation(line: 219, column: 33, scope: !677)
!680 = !DILocation(line: 219, column: 36, scope: !677)
!681 = !DILocation(line: 219, column: 40, scope: !677)
!682 = !DILocation(line: 219, column: 10, scope: !677)
!683 = !DILocation(line: 219, column: 9, scope: !678)
!684 = !DILocation(line: 220, column: 6, scope: !685)
!685 = distinct !DILexicalBlock(scope: !677, file: !1, line: 219, column: 50)
!686 = !DILocation(line: 222, column: 4, scope: !678)
!687 = !DILocation(line: 223, column: 3, scope: !662)
!688 = !DILocation(line: 224, column: 2, scope: !583)
!689 = !DILocation(line: 226, column: 2, scope: !459)
!690 = !DILocation(line: 227, column: 1, scope: !459)
!691 = distinct !DISubprogram(name: "bmesh_disk_edge_next", scope: !692, file: !692, line: 61, type: !693, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !359)
!692 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_structure_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !DISubroutineType(types: !694)
!694 = !{!133, !695, !697}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!699 = !DILocalVariable(name: "e", arg: 1, scope: !691, file: !692, line: 61, type: !695)
!700 = !DILocation(line: 61, column: 55, scope: !691)
!701 = !DILocalVariable(name: "v", arg: 2, scope: !691, file: !692, line: 61, type: !697)
!702 = !DILocation(line: 61, column: 72, scope: !691)
!703 = !DILocation(line: 63, column: 9, scope: !691)
!704 = !DILocation(line: 63, column: 2, scope: !691)
!705 = distinct !DISubprogram(name: "BM_faces_join_pair", scope: !1, file: !1, line: 244, type: !706, scopeLine: 245, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !359)
!706 = !DISubroutineType(types: !707)
!707 = !{!209, !219, !209, !209, !133, !441}
!708 = !DILocalVariable(name: "bm", arg: 1, scope: !705, file: !1, line: 244, type: !219)
!709 = !DILocation(line: 244, column: 35, scope: !705)
!710 = !DILocalVariable(name: "f_a", arg: 2, scope: !705, file: !1, line: 244, type: !209)
!711 = !DILocation(line: 244, column: 47, scope: !705)
!712 = !DILocalVariable(name: "f_b", arg: 3, scope: !705, file: !1, line: 244, type: !209)
!713 = !DILocation(line: 244, column: 60, scope: !705)
!714 = !DILocalVariable(name: "e", arg: 4, scope: !705, file: !1, line: 244, type: !133)
!715 = !DILocation(line: 244, column: 73, scope: !705)
!716 = !DILocalVariable(name: "do_del", arg: 5, scope: !705, file: !1, line: 244, type: !441)
!717 = !DILocation(line: 244, column: 87, scope: !705)
!718 = !DILocalVariable(name: "faces", scope: !705, file: !1, line: 246, type: !719)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 128, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 2)
!722 = !DILocation(line: 246, column: 10, scope: !705)
!723 = !DILocation(line: 246, column: 21, scope: !705)
!724 = !DILocation(line: 246, column: 22, scope: !705)
!725 = !DILocation(line: 246, column: 27, scope: !705)
!726 = !DILocalVariable(name: "l_a", scope: !705, file: !1, line: 248, type: !182)
!727 = !DILocation(line: 248, column: 10, scope: !705)
!728 = !DILocation(line: 248, column: 40, scope: !705)
!729 = !DILocation(line: 248, column: 45, scope: !705)
!730 = !DILocation(line: 248, column: 16, scope: !705)
!731 = !DILocalVariable(name: "l_b", scope: !705, file: !1, line: 249, type: !182)
!732 = !DILocation(line: 249, column: 10, scope: !705)
!733 = !DILocation(line: 249, column: 40, scope: !705)
!734 = !DILocation(line: 249, column: 45, scope: !705)
!735 = !DILocation(line: 249, column: 16, scope: !705)
!736 = !DILocation(line: 253, column: 6, scope: !737)
!737 = distinct !DILexicalBlock(scope: !705, file: !1, line: 253, column: 6)
!738 = !DILocation(line: 253, column: 11, scope: !737)
!739 = !DILocation(line: 253, column: 16, scope: !737)
!740 = !DILocation(line: 253, column: 21, scope: !737)
!741 = !DILocation(line: 253, column: 13, scope: !737)
!742 = !DILocation(line: 253, column: 6, scope: !705)
!743 = !DILocation(line: 254, column: 22, scope: !744)
!744 = distinct !DILexicalBlock(scope: !737, file: !1, line: 253, column: 24)
!745 = !DILocation(line: 254, column: 26, scope: !744)
!746 = !DILocation(line: 254, column: 3, scope: !744)
!747 = !DILocation(line: 255, column: 2, scope: !744)
!748 = !DILocation(line: 257, column: 23, scope: !705)
!749 = !DILocation(line: 257, column: 27, scope: !705)
!750 = !DILocation(line: 257, column: 37, scope: !705)
!751 = !DILocation(line: 257, column: 9, scope: !705)
!752 = !DILocation(line: 257, column: 2, scope: !705)
!753 = distinct !DISubprogram(name: "BM_vert_collapse_faces", scope: !1, file: !1, line: 991, type: !754, scopeLine: 993, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !359)
!754 = !DISubroutineType(types: !755)
!755 = !{!133, !219, !133, !198, !132, !441, !441, !441}
!756 = !DILocalVariable(name: "bm", arg: 1, scope: !753, file: !1, line: 991, type: !219)
!757 = !DILocation(line: 991, column: 39, scope: !753)
!758 = !DILocalVariable(name: "e_kill", arg: 2, scope: !753, file: !1, line: 991, type: !133)
!759 = !DILocation(line: 991, column: 51, scope: !753)
!760 = !DILocalVariable(name: "v_kill", arg: 3, scope: !753, file: !1, line: 991, type: !198)
!761 = !DILocation(line: 991, column: 67, scope: !753)
!762 = !DILocalVariable(name: "fac", arg: 4, scope: !753, file: !1, line: 991, type: !132)
!763 = !DILocation(line: 991, column: 81, scope: !753)
!764 = !DILocalVariable(name: "do_del", arg: 5, scope: !753, file: !1, line: 992, type: !441)
!765 = !DILocation(line: 992, column: 43, scope: !753)
!766 = !DILocalVariable(name: "join_faces", arg: 6, scope: !753, file: !1, line: 992, type: !441)
!767 = !DILocation(line: 992, column: 62, scope: !753)
!768 = !DILocalVariable(name: "kill_degenerate_faces", arg: 7, scope: !753, file: !1, line: 992, type: !441)
!769 = !DILocation(line: 992, column: 85, scope: !753)
!770 = !DILocalVariable(name: "e_new", scope: !753, file: !1, line: 994, type: !133)
!771 = !DILocation(line: 994, column: 10, scope: !753)
!772 = !DILocalVariable(name: "tv", scope: !753, file: !1, line: 995, type: !198)
!773 = !DILocation(line: 995, column: 10, scope: !753)
!774 = !DILocation(line: 995, column: 34, scope: !753)
!775 = !DILocation(line: 995, column: 42, scope: !753)
!776 = !DILocation(line: 995, column: 15, scope: !753)
!777 = !DILocalVariable(name: "e2", scope: !753, file: !1, line: 997, type: !133)
!778 = !DILocation(line: 997, column: 10, scope: !753)
!779 = !DILocalVariable(name: "tv2", scope: !753, file: !1, line: 998, type: !198)
!780 = !DILocation(line: 998, column: 10, scope: !753)
!781 = !DILocation(line: 1006, column: 6, scope: !782)
!782 = distinct !DILexicalBlock(scope: !753, file: !1, line: 1006, column: 6)
!783 = !DILocation(line: 1006, column: 14, scope: !782)
!784 = !DILocation(line: 1006, column: 6, scope: !753)
!785 = !DILocalVariable(name: "l_iter", scope: !786, file: !1, line: 1007, type: !182)
!786 = distinct !DILexicalBlock(scope: !782, file: !1, line: 1006, column: 17)
!787 = !DILocation(line: 1007, column: 11, scope: !786)
!788 = !DILocalVariable(name: "w", scope: !786, file: !1, line: 1008, type: !789)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 64, elements: !720)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!791 = !DILocation(line: 1008, column: 15, scope: !786)
!792 = !DILocation(line: 1008, column: 22, scope: !786)
!793 = !DILocation(line: 1008, column: 30, scope: !786)
!794 = !DILocation(line: 1008, column: 28, scope: !786)
!795 = !DILocation(line: 1008, column: 35, scope: !786)
!796 = !DILocation(line: 1010, column: 12, scope: !786)
!797 = !DILocation(line: 1010, column: 20, scope: !786)
!798 = !DILocation(line: 1010, column: 10, scope: !786)
!799 = !DILocation(line: 1011, column: 3, scope: !786)
!800 = !DILocation(line: 1012, column: 8, scope: !801)
!801 = distinct !DILexicalBlock(scope: !802, file: !1, line: 1012, column: 8)
!802 = distinct !DILexicalBlock(scope: !786, file: !1, line: 1011, column: 6)
!803 = !DILocation(line: 1012, column: 16, scope: !801)
!804 = !DILocation(line: 1012, column: 21, scope: !801)
!805 = !DILocation(line: 1012, column: 18, scope: !801)
!806 = !DILocation(line: 1012, column: 24, scope: !801)
!807 = !DILocation(line: 1012, column: 27, scope: !801)
!808 = !DILocation(line: 1012, column: 35, scope: !801)
!809 = !DILocation(line: 1012, column: 41, scope: !801)
!810 = !DILocation(line: 1012, column: 46, scope: !801)
!811 = !DILocation(line: 1012, column: 43, scope: !801)
!812 = !DILocation(line: 1012, column: 8, scope: !802)
!813 = !DILocalVariable(name: "src", scope: !814, file: !1, line: 1013, type: !815)
!814 = distinct !DILexicalBlock(scope: !801, file: !1, line: 1012, column: 54)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, elements: !720)
!816 = !DILocation(line: 1013, column: 11, scope: !814)
!817 = !DILocalVariable(name: "tvloop", scope: !814, file: !1, line: 1014, type: !182)
!818 = !DILocation(line: 1014, column: 13, scope: !814)
!819 = !DILocation(line: 1014, column: 22, scope: !814)
!820 = !DILocalVariable(name: "kvloop", scope: !814, file: !1, line: 1015, type: !182)
!821 = !DILocation(line: 1015, column: 13, scope: !814)
!822 = !DILocation(line: 1015, column: 22, scope: !814)
!823 = !DILocation(line: 1015, column: 30, scope: !814)
!824 = !DILocation(line: 1017, column: 14, scope: !814)
!825 = !DILocation(line: 1017, column: 22, scope: !814)
!826 = !DILocation(line: 1017, column: 27, scope: !814)
!827 = !DILocation(line: 1017, column: 5, scope: !814)
!828 = !DILocation(line: 1017, column: 12, scope: !814)
!829 = !DILocation(line: 1018, column: 14, scope: !814)
!830 = !DILocation(line: 1018, column: 22, scope: !814)
!831 = !DILocation(line: 1018, column: 27, scope: !814)
!832 = !DILocation(line: 1018, column: 5, scope: !814)
!833 = !DILocation(line: 1018, column: 12, scope: !814)
!834 = !DILocation(line: 1019, column: 30, scope: !814)
!835 = !DILocation(line: 1019, column: 34, scope: !814)
!836 = !DILocation(line: 1019, column: 41, scope: !814)
!837 = !DILocation(line: 1019, column: 46, scope: !814)
!838 = !DILocation(line: 1019, column: 58, scope: !814)
!839 = !DILocation(line: 1019, column: 66, scope: !814)
!840 = !DILocation(line: 1019, column: 71, scope: !814)
!841 = !DILocation(line: 1019, column: 5, scope: !814)
!842 = !DILocation(line: 1020, column: 4, scope: !814)
!843 = !DILocation(line: 1021, column: 3, scope: !802)
!844 = !DILocation(line: 1021, column: 22, scope: !786)
!845 = !DILocation(line: 1021, column: 30, scope: !786)
!846 = !DILocation(line: 1021, column: 20, scope: !786)
!847 = !DILocation(line: 1021, column: 46, scope: !786)
!848 = !DILocation(line: 1021, column: 54, scope: !786)
!849 = !DILocation(line: 1021, column: 43, scope: !786)
!850 = distinct !{!850, !799, !851}
!851 = !DILocation(line: 1021, column: 55, scope: !786)
!852 = !DILocation(line: 1022, column: 2, scope: !786)
!853 = !DILocation(line: 1025, column: 28, scope: !753)
!854 = !DILocation(line: 1025, column: 32, scope: !753)
!855 = !DILocation(line: 1025, column: 40, scope: !753)
!856 = !DILocation(line: 1025, column: 44, scope: !753)
!857 = !DILocation(line: 1025, column: 52, scope: !753)
!858 = !DILocation(line: 1025, column: 2, scope: !753)
!859 = !DILocation(line: 1027, column: 28, scope: !753)
!860 = !DILocation(line: 1027, column: 36, scope: !753)
!861 = !DILocation(line: 1027, column: 7, scope: !753)
!862 = !DILocation(line: 1027, column: 5, scope: !753)
!863 = !DILocation(line: 1028, column: 27, scope: !753)
!864 = !DILocation(line: 1028, column: 31, scope: !753)
!865 = !DILocation(line: 1028, column: 8, scope: !753)
!866 = !DILocation(line: 1028, column: 6, scope: !753)
!867 = !DILocation(line: 1030, column: 6, scope: !868)
!868 = distinct !DILexicalBlock(scope: !753, file: !1, line: 1030, column: 6)
!869 = !DILocation(line: 1030, column: 6, scope: !753)
!870 = !DILocalVariable(name: "fiter", scope: !871, file: !1, line: 1031, type: !872)
!871 = distinct !DILexicalBlock(scope: !868, file: !1, line: 1030, column: 18)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !101, line: 186, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !101, line: 164, size: 512, elements: !874)
!874 = !{!875, !955, !956, !957, !958}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !873, file: !101, line: 179, baseType: !876, size: 320)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !873, file: !101, line: 166, size: 320, elements: !877)
!877 = !{!878, !893, !899, !907, !915, !921, !927, !933, !937, !943, !949}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !876, file: !101, line: 167, baseType: !879, size: 192)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !101, line: 113, size: 192, elements: !880)
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !879, file: !101, line: 114, baseType: !882, size: 192)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !883, line: 80, baseType: !884)
!883 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !883, line: 76, size: 192, elements: !885)
!885 = !{!886, !889, !892}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !884, file: !883, line: 77, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !883, line: 47, baseType: !234)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !884, file: !883, line: 78, baseType: !890, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !883, line: 45, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !884, file: !883, line: 79, baseType: !5, size: 32, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !876, file: !101, line: 169, baseType: !894, size: 192)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !101, line: 116, size: 192, elements: !895)
!895 = !{!896, !897, !898}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !894, file: !101, line: 117, baseType: !198, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !894, file: !101, line: 118, baseType: !133, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !894, file: !101, line: 118, baseType: !133, size: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !876, file: !101, line: 170, baseType: !900, size: 320)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !101, line: 120, size: 320, elements: !901)
!901 = !{!902, !903, !904, !905, !906}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !900, file: !101, line: 121, baseType: !198, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !900, file: !101, line: 122, baseType: !182, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !900, file: !101, line: 122, baseType: !182, size: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !900, file: !101, line: 123, baseType: !133, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !900, file: !101, line: 123, baseType: !133, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !876, file: !101, line: 171, baseType: !908, size: 320)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !101, line: 125, size: 320, elements: !909)
!909 = !{!910, !911, !912, !913, !914}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !908, file: !101, line: 126, baseType: !198, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !908, file: !101, line: 127, baseType: !182, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !908, file: !101, line: 127, baseType: !182, size: 64, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !908, file: !101, line: 128, baseType: !133, size: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !908, file: !101, line: 128, baseType: !133, size: 64, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !876, file: !101, line: 172, baseType: !916, size: 192)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !101, line: 130, size: 192, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !916, file: !101, line: 131, baseType: !133, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !916, file: !101, line: 132, baseType: !182, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !916, file: !101, line: 132, baseType: !182, size: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !876, file: !101, line: 173, baseType: !922, size: 192)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !101, line: 134, size: 192, elements: !923)
!923 = !{!924, !925, !926}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !922, file: !101, line: 135, baseType: !182, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !922, file: !101, line: 136, baseType: !182, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !922, file: !101, line: 136, baseType: !182, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !876, file: !101, line: 174, baseType: !928, size: 192)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !101, line: 138, size: 192, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !928, file: !101, line: 139, baseType: !133, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !928, file: !101, line: 140, baseType: !182, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !928, file: !101, line: 140, baseType: !182, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !876, file: !101, line: 175, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !101, line: 142, size: 64, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !934, file: !101, line: 143, baseType: !133, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !876, file: !101, line: 176, baseType: !938, size: 192)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !101, line: 145, size: 192, elements: !939)
!939 = !{!940, !941, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !938, file: !101, line: 146, baseType: !209, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !938, file: !101, line: 147, baseType: !182, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !938, file: !101, line: 147, baseType: !182, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !876, file: !101, line: 177, baseType: !944, size: 192)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !101, line: 149, size: 192, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !944, file: !101, line: 150, baseType: !209, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !944, file: !101, line: 151, baseType: !182, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !944, file: !101, line: 151, baseType: !182, size: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !876, file: !101, line: 178, baseType: !950, size: 192)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !101, line: 153, size: 192, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !950, file: !101, line: 154, baseType: !209, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !950, file: !101, line: 155, baseType: !182, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !950, file: !101, line: 155, baseType: !182, size: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !873, file: !101, line: 181, baseType: !201, size: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !873, file: !101, line: 182, baseType: !205, size: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !873, file: !101, line: 184, baseType: !144, size: 32, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !873, file: !101, line: 185, baseType: !131, size: 8, offset: 480)
!959 = !DILocation(line: 1031, column: 10, scope: !871)
!960 = !DILocalVariable(name: "faces", scope: !871, file: !1, line: 1032, type: !244)
!961 = !DILocation(line: 1032, column: 12, scope: !871)
!962 = !DILocalVariable(name: "f", scope: !871, file: !1, line: 1033, type: !209)
!963 = !DILocation(line: 1033, column: 11, scope: !871)
!964 = !DILocalVariable(name: "_faces_count", scope: !871, file: !1, line: 1034, type: !144)
!965 = !DILocation(line: 1034, column: 3, scope: !871)
!966 = !DILocalVariable(name: "_faces_static", scope: !871, file: !1, line: 1034, type: !967)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 1024, elements: !289)
!968 = !DILocation(line: 1036, column: 3, scope: !969)
!969 = distinct !DILexicalBlock(scope: !871, file: !1, line: 1036, column: 3)
!970 = !DILocation(line: 1036, column: 3, scope: !971)
!971 = distinct !DILexicalBlock(scope: !969, file: !1, line: 1036, column: 3)
!972 = !DILocation(line: 1037, column: 4, scope: !973)
!973 = distinct !DILexicalBlock(scope: !971, file: !1, line: 1036, column: 54)
!974 = !DILocation(line: 1038, column: 3, scope: !973)
!975 = distinct !{!975, !968, !976}
!976 = !DILocation(line: 1038, column: 3, scope: !969)
!977 = !DILocation(line: 1040, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !871, file: !1, line: 1040, column: 7)
!979 = !DILocation(line: 1040, column: 30, scope: !978)
!980 = !DILocation(line: 1040, column: 7, scope: !871)
!981 = !DILocalVariable(name: "f2", scope: !982, file: !1, line: 1041, type: !209)
!982 = distinct !DILexicalBlock(scope: !978, file: !1, line: 1040, column: 36)
!983 = !DILocation(line: 1041, column: 12, scope: !982)
!984 = !DILocation(line: 1041, column: 31, scope: !982)
!985 = !DILocation(line: 1041, column: 35, scope: !982)
!986 = !DILocation(line: 1041, column: 42, scope: !982)
!987 = !DILocation(line: 1041, column: 17, scope: !982)
!988 = !DILocation(line: 1042, column: 8, scope: !989)
!989 = distinct !DILexicalBlock(scope: !982, file: !1, line: 1042, column: 8)
!990 = !DILocation(line: 1042, column: 8, scope: !982)
!991 = !DILocalVariable(name: "l_a", scope: !992, file: !1, line: 1043, type: !182)
!992 = distinct !DILexicalBlock(scope: !989, file: !1, line: 1042, column: 12)
!993 = !DILocation(line: 1043, column: 13, scope: !992)
!994 = !DILocalVariable(name: "l_b", scope: !992, file: !1, line: 1043, type: !182)
!995 = !DILocation(line: 1043, column: 19, scope: !992)
!996 = !DILocation(line: 1045, column: 40, scope: !997)
!997 = distinct !DILexicalBlock(scope: !992, file: !1, line: 1045, column: 9)
!998 = !DILocation(line: 1045, column: 44, scope: !997)
!999 = !DILocation(line: 1045, column: 16, scope: !997)
!1000 = !DILocation(line: 1045, column: 14, scope: !997)
!1001 = !DILocation(line: 1045, column: 49, scope: !997)
!1002 = !DILocation(line: 1046, column: 40, scope: !997)
!1003 = !DILocation(line: 1046, column: 44, scope: !997)
!1004 = !DILocation(line: 1046, column: 16, scope: !997)
!1005 = !DILocation(line: 1046, column: 14, scope: !997)
!1006 = !DILocation(line: 1045, column: 9, scope: !992)
!1007 = !DILocalVariable(name: "l_new", scope: !1008, file: !1, line: 1048, type: !182)
!1008 = distinct !DILexicalBlock(scope: !997, file: !1, line: 1047, column: 5)
!1009 = !DILocation(line: 1048, column: 14, scope: !1008)
!1010 = !DILocation(line: 1050, column: 24, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1008, file: !1, line: 1050, column: 10)
!1012 = !DILocation(line: 1050, column: 28, scope: !1011)
!1013 = !DILocation(line: 1050, column: 32, scope: !1011)
!1014 = !DILocation(line: 1050, column: 37, scope: !1011)
!1015 = !DILocation(line: 1050, column: 10, scope: !1011)
!1016 = !DILocation(line: 1050, column: 10, scope: !1008)
!1017 = !DILocation(line: 1051, column: 15, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1011, file: !1, line: 1050, column: 64)
!1019 = !DILocation(line: 1051, column: 22, scope: !1018)
!1020 = !DILocation(line: 1051, column: 13, scope: !1018)
!1021 = !DILocation(line: 1052, column: 6, scope: !1018)
!1022 = !DILocation(line: 1053, column: 5, scope: !1008)
!1023 = !DILocation(line: 1054, column: 4, scope: !992)
!1024 = !DILocation(line: 1055, column: 3, scope: !982)
!1025 = !DILocation(line: 1059, column: 3, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !871, file: !1, line: 1059, column: 3)
!1027 = !DILocation(line: 1059, column: 3, scope: !871)
!1028 = !DILocation(line: 1059, column: 3, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1026, file: !1, line: 1059, column: 3)
!1030 = !DILocation(line: 1060, column: 2, scope: !871)
!1031 = !DILocation(line: 1065, column: 22, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !868, file: !1, line: 1061, column: 7)
!1033 = !DILocation(line: 1065, column: 26, scope: !1032)
!1034 = !DILocation(line: 1065, column: 34, scope: !1032)
!1035 = !DILocation(line: 1065, column: 42, scope: !1032)
!1036 = !DILocation(line: 1065, column: 11, scope: !1032)
!1037 = !DILocation(line: 1065, column: 9, scope: !1032)
!1038 = !DILocation(line: 1068, column: 7, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 1068, column: 7)
!1040 = !DILocation(line: 1068, column: 13, scope: !1039)
!1041 = !DILocation(line: 1068, column: 16, scope: !1039)
!1042 = !DILocation(line: 1068, column: 7, scope: !1032)
!1043 = !DILocalVariable(name: "bad_faces", scope: !1044, file: !1, line: 1069, type: !244)
!1044 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 1068, column: 39)
!1045 = !DILocation(line: 1069, column: 13, scope: !1044)
!1046 = !DILocalVariable(name: "_bad_faces_count", scope: !1044, file: !1, line: 1070, type: !144)
!1047 = !DILocation(line: 1070, column: 4, scope: !1044)
!1048 = !DILocalVariable(name: "_bad_faces_static", scope: !1044, file: !1, line: 1070, type: !967)
!1049 = !DILocalVariable(name: "fiter", scope: !1044, file: !1, line: 1072, type: !872)
!1050 = !DILocation(line: 1072, column: 11, scope: !1044)
!1051 = !DILocalVariable(name: "f", scope: !1044, file: !1, line: 1073, type: !209)
!1052 = !DILocation(line: 1073, column: 12, scope: !1044)
!1053 = !DILocalVariable(name: "verts", scope: !1044, file: !1, line: 1074, type: !1054)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 128, elements: !720)
!1055 = !DILocation(line: 1074, column: 12, scope: !1044)
!1056 = !DILocation(line: 1074, column: 23, scope: !1044)
!1057 = !DILocation(line: 1074, column: 24, scope: !1044)
!1058 = !DILocation(line: 1074, column: 31, scope: !1044)
!1059 = !DILocation(line: 1074, column: 35, scope: !1044)
!1060 = !DILocation(line: 1074, column: 42, scope: !1044)
!1061 = !DILocalVariable(name: "i", scope: !1044, file: !1, line: 1075, type: !144)
!1062 = !DILocation(line: 1075, column: 8, scope: !1044)
!1063 = !DILocation(line: 1077, column: 11, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 1077, column: 4)
!1065 = !DILocation(line: 1077, column: 9, scope: !1064)
!1066 = !DILocation(line: 1077, column: 16, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1064, file: !1, line: 1077, column: 4)
!1068 = !DILocation(line: 1077, column: 18, scope: !1067)
!1069 = !DILocation(line: 1077, column: 4, scope: !1064)
!1070 = !DILocation(line: 1079, column: 5, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !1, line: 1079, column: 5)
!1072 = distinct !DILexicalBlock(scope: !1067, file: !1, line: 1077, column: 28)
!1073 = !DILocation(line: 1080, column: 5, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1072, file: !1, line: 1080, column: 5)
!1075 = !DILocation(line: 1080, column: 5, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 1080, column: 5)
!1077 = !DILocation(line: 1081, column: 10, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !1, line: 1081, column: 10)
!1079 = distinct !DILexicalBlock(scope: !1076, file: !1, line: 1080, column: 58)
!1080 = !DILocation(line: 1081, column: 10, scope: !1079)
!1081 = !DILocation(line: 1082, column: 7, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !1, line: 1081, column: 32)
!1083 = !DILocation(line: 1083, column: 6, scope: !1082)
!1084 = !DILocation(line: 1084, column: 5, scope: !1079)
!1085 = distinct !{!1085, !1073, !1086}
!1086 = !DILocation(line: 1084, column: 5, scope: !1074)
!1087 = !DILocation(line: 1085, column: 5, scope: !1072)
!1088 = !DILocation(line: 1085, column: 17, scope: !1072)
!1089 = !DILocation(line: 1085, column: 15, scope: !1072)
!1090 = !DILocation(line: 1086, column: 19, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1072, file: !1, line: 1085, column: 44)
!1092 = !DILocation(line: 1086, column: 23, scope: !1091)
!1093 = !DILocation(line: 1086, column: 6, scope: !1091)
!1094 = distinct !{!1094, !1087, !1095}
!1095 = !DILocation(line: 1087, column: 5, scope: !1072)
!1096 = !DILocation(line: 1088, column: 4, scope: !1072)
!1097 = !DILocation(line: 1077, column: 24, scope: !1067)
!1098 = !DILocation(line: 1077, column: 4, scope: !1067)
!1099 = distinct !{!1099, !1069, !1100}
!1100 = !DILocation(line: 1088, column: 4, scope: !1064)
!1101 = !DILocation(line: 1089, column: 4, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 1089, column: 4)
!1103 = !DILocation(line: 1089, column: 4, scope: !1044)
!1104 = !DILocation(line: 1089, column: 4, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1102, file: !1, line: 1089, column: 4)
!1106 = !DILocation(line: 1090, column: 3, scope: !1044)
!1107 = !DILocation(line: 1093, column: 9, scope: !753)
!1108 = !DILocation(line: 1093, column: 2, scope: !753)
!1109 = distinct !DISubprogram(name: "BM_edge_is_manifold", scope: !1110, file: !1110, line: 86, type: !1111, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !359)
!1110 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_queries_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!218, !695}
!1113 = !DILocalVariable(name: "e", arg: 1, scope: !1109, file: !1110, line: 86, type: !695)
!1114 = !DILocation(line: 86, column: 51, scope: !1109)
!1115 = !DILocalVariable(name: "l", scope: !1109, file: !1110, line: 88, type: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!1118 = !DILocation(line: 88, column: 16, scope: !1109)
!1119 = !DILocation(line: 88, column: 20, scope: !1109)
!1120 = !DILocation(line: 88, column: 23, scope: !1109)
!1121 = !DILocation(line: 89, column: 10, scope: !1109)
!1122 = !DILocation(line: 89, column: 12, scope: !1109)
!1123 = !DILocation(line: 89, column: 16, scope: !1109)
!1124 = !DILocation(line: 89, column: 19, scope: !1109)
!1125 = !DILocation(line: 89, column: 34, scope: !1109)
!1126 = !DILocation(line: 89, column: 31, scope: !1109)
!1127 = !DILocation(line: 89, column: 37, scope: !1109)
!1128 = !DILocation(line: 90, column: 16, scope: !1109)
!1129 = !DILocation(line: 90, column: 19, scope: !1109)
!1130 = !DILocation(line: 90, column: 32, scope: !1109)
!1131 = !DILocation(line: 90, column: 47, scope: !1109)
!1132 = !DILocation(line: 90, column: 44, scope: !1109)
!1133 = !DILocation(line: 0, scope: !1109)
!1134 = !DILocation(line: 89, column: 9, scope: !1109)
!1135 = !DILocation(line: 89, column: 2, scope: !1109)
!1136 = distinct !DISubprogram(name: "BM_edge_is_boundary", scope: !1110, file: !1110, line: 118, type: !1111, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !359)
!1137 = !DILocalVariable(name: "e", arg: 1, scope: !1136, file: !1110, line: 118, type: !695)
!1138 = !DILocation(line: 118, column: 51, scope: !1136)
!1139 = !DILocalVariable(name: "l", scope: !1136, file: !1110, line: 120, type: !1116)
!1140 = !DILocation(line: 120, column: 16, scope: !1136)
!1141 = !DILocation(line: 120, column: 20, scope: !1136)
!1142 = !DILocation(line: 120, column: 23, scope: !1136)
!1143 = !DILocation(line: 121, column: 10, scope: !1136)
!1144 = !DILocation(line: 121, column: 12, scope: !1136)
!1145 = !DILocation(line: 121, column: 16, scope: !1136)
!1146 = !DILocation(line: 121, column: 19, scope: !1136)
!1147 = !DILocation(line: 121, column: 34, scope: !1136)
!1148 = !DILocation(line: 121, column: 31, scope: !1136)
!1149 = !DILocation(line: 0, scope: !1136)
!1150 = !DILocation(line: 121, column: 9, scope: !1136)
!1151 = !DILocation(line: 121, column: 2, scope: !1136)
!1152 = distinct !DISubprogram(name: "BM_face_split", scope: !1, file: !1, line: 278, type: !1153, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !359)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!209, !219, !209, !182, !182, !1155, !133, !441}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!1156 = !DILocalVariable(name: "bm", arg: 1, scope: !1152, file: !1, line: 278, type: !219)
!1157 = !DILocation(line: 278, column: 30, scope: !1152)
!1158 = !DILocalVariable(name: "f", arg: 2, scope: !1152, file: !1, line: 278, type: !209)
!1159 = !DILocation(line: 278, column: 42, scope: !1152)
!1160 = !DILocalVariable(name: "l_a", arg: 3, scope: !1152, file: !1, line: 279, type: !182)
!1161 = !DILocation(line: 279, column: 31, scope: !1152)
!1162 = !DILocalVariable(name: "l_b", arg: 4, scope: !1152, file: !1, line: 279, type: !182)
!1163 = !DILocation(line: 279, column: 44, scope: !1152)
!1164 = !DILocalVariable(name: "r_l", arg: 5, scope: !1152, file: !1, line: 280, type: !1155)
!1165 = !DILocation(line: 280, column: 32, scope: !1152)
!1166 = !DILocalVariable(name: "example", arg: 6, scope: !1152, file: !1, line: 280, type: !133)
!1167 = !DILocation(line: 280, column: 45, scope: !1152)
!1168 = !DILocalVariable(name: "no_double", arg: 7, scope: !1152, file: !1, line: 281, type: !441)
!1169 = !DILocation(line: 281, column: 34, scope: !1152)
!1170 = !DILocalVariable(name: "has_mdisp", scope: !1152, file: !1, line: 283, type: !441)
!1171 = !DILocation(line: 283, column: 13, scope: !1152)
!1172 = !DILocation(line: 283, column: 47, scope: !1152)
!1173 = !DILocation(line: 283, column: 51, scope: !1152)
!1174 = !DILocation(line: 283, column: 25, scope: !1152)
!1175 = !DILocalVariable(name: "f_new", scope: !1152, file: !1, line: 284, type: !209)
!1176 = !DILocation(line: 284, column: 10, scope: !1152)
!1177 = !DILocalVariable(name: "f_tmp", scope: !1152, file: !1, line: 284, type: !209)
!1178 = !DILocation(line: 284, column: 18, scope: !1152)
!1179 = !DILocation(line: 291, column: 6, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1152, file: !1, line: 291, column: 6)
!1181 = !DILocation(line: 291, column: 46, scope: !1180)
!1182 = !DILocation(line: 292, column: 6, scope: !1180)
!1183 = !DILocation(line: 291, column: 6, scope: !1152)
!1184 = !DILocation(line: 294, column: 7, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !1, line: 294, column: 7)
!1186 = distinct !DILexicalBlock(scope: !1180, file: !1, line: 293, column: 2)
!1187 = !DILocation(line: 294, column: 7, scope: !1186)
!1188 = !DILocation(line: 295, column: 5, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1185, file: !1, line: 294, column: 12)
!1190 = !DILocation(line: 295, column: 9, scope: !1189)
!1191 = !DILocation(line: 296, column: 3, scope: !1189)
!1192 = !DILocation(line: 297, column: 3, scope: !1186)
!1193 = !DILocation(line: 301, column: 6, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1152, file: !1, line: 301, column: 6)
!1195 = !DILocation(line: 301, column: 6, scope: !1152)
!1196 = !DILocation(line: 302, column: 24, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1194, file: !1, line: 301, column: 17)
!1198 = !DILocation(line: 302, column: 28, scope: !1197)
!1199 = !DILocation(line: 302, column: 32, scope: !1197)
!1200 = !DILocation(line: 302, column: 11, scope: !1197)
!1201 = !DILocation(line: 302, column: 9, scope: !1197)
!1202 = !DILocation(line: 303, column: 2, scope: !1197)
!1203 = !DILocation(line: 308, column: 21, scope: !1152)
!1204 = !DILocation(line: 308, column: 25, scope: !1152)
!1205 = !DILocation(line: 308, column: 28, scope: !1152)
!1206 = !DILocation(line: 308, column: 33, scope: !1152)
!1207 = !DILocation(line: 308, column: 38, scope: !1152)
!1208 = !DILocation(line: 308, column: 43, scope: !1152)
!1209 = !DILocation(line: 308, column: 52, scope: !1152)
!1210 = !DILocation(line: 308, column: 10, scope: !1152)
!1211 = !DILocation(line: 308, column: 8, scope: !1152)
!1212 = !DILocation(line: 311, column: 6, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1152, file: !1, line: 311, column: 6)
!1214 = !DILocation(line: 311, column: 6, scope: !1152)
!1215 = !DILocation(line: 313, column: 7, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1217, file: !1, line: 313, column: 7)
!1217 = distinct !DILexicalBlock(scope: !1213, file: !1, line: 311, column: 13)
!1218 = !DILocation(line: 313, column: 7, scope: !1217)
!1219 = !DILocalVariable(name: "l_iter", scope: !1220, file: !1, line: 314, type: !182)
!1220 = distinct !DILexicalBlock(scope: !1216, file: !1, line: 313, column: 18)
!1221 = !DILocation(line: 314, column: 12, scope: !1220)
!1222 = !DILocalVariable(name: "l_first", scope: !1220, file: !1, line: 315, type: !182)
!1223 = !DILocation(line: 315, column: 12, scope: !1220)
!1224 = !DILocation(line: 317, column: 23, scope: !1220)
!1225 = !DILocation(line: 317, column: 21, scope: !1220)
!1226 = !DILocation(line: 317, column: 11, scope: !1220)
!1227 = !DILocation(line: 318, column: 4, scope: !1220)
!1228 = !DILocation(line: 319, column: 29, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1220, file: !1, line: 318, column: 7)
!1230 = !DILocation(line: 319, column: 33, scope: !1229)
!1231 = !DILocation(line: 319, column: 41, scope: !1229)
!1232 = !DILocation(line: 319, column: 5, scope: !1229)
!1233 = !DILocation(line: 320, column: 4, scope: !1229)
!1234 = !DILocation(line: 320, column: 23, scope: !1220)
!1235 = !DILocation(line: 320, column: 31, scope: !1220)
!1236 = !DILocation(line: 320, column: 21, scope: !1220)
!1237 = !DILocation(line: 320, column: 40, scope: !1220)
!1238 = !DILocation(line: 320, column: 37, scope: !1220)
!1239 = distinct !{!1239, !1227, !1240}
!1240 = !DILocation(line: 320, column: 47, scope: !1220)
!1241 = !DILocation(line: 322, column: 23, scope: !1220)
!1242 = !DILocation(line: 322, column: 21, scope: !1220)
!1243 = !DILocation(line: 322, column: 11, scope: !1220)
!1244 = !DILocation(line: 323, column: 4, scope: !1220)
!1245 = !DILocation(line: 324, column: 29, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1220, file: !1, line: 323, column: 7)
!1247 = !DILocation(line: 324, column: 33, scope: !1246)
!1248 = !DILocation(line: 324, column: 41, scope: !1246)
!1249 = !DILocation(line: 324, column: 5, scope: !1246)
!1250 = !DILocation(line: 325, column: 4, scope: !1246)
!1251 = !DILocation(line: 325, column: 23, scope: !1220)
!1252 = !DILocation(line: 325, column: 31, scope: !1220)
!1253 = !DILocation(line: 325, column: 21, scope: !1220)
!1254 = !DILocation(line: 325, column: 40, scope: !1220)
!1255 = !DILocation(line: 325, column: 37, scope: !1220)
!1256 = distinct !{!1256, !1244, !1257}
!1257 = !DILocation(line: 325, column: 47, scope: !1220)
!1258 = !DILocation(line: 332, column: 3, scope: !1220)
!1259 = !DILocation(line: 333, column: 2, scope: !1217)
!1260 = !DILocation(line: 335, column: 6, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1152, file: !1, line: 335, column: 6)
!1262 = !DILocation(line: 335, column: 6, scope: !1152)
!1263 = !DILocation(line: 336, column: 16, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1261, file: !1, line: 335, column: 17)
!1265 = !DILocation(line: 336, column: 20, scope: !1264)
!1266 = !DILocation(line: 336, column: 3, scope: !1264)
!1267 = !DILocation(line: 337, column: 2, scope: !1264)
!1268 = !DILocation(line: 339, column: 9, scope: !1152)
!1269 = !DILocation(line: 339, column: 2, scope: !1152)
!1270 = !DILocation(line: 340, column: 1, scope: !1152)
!1271 = distinct !DISubprogram(name: "BM_loop_is_adjacent", scope: !1110, file: !1110, line: 133, type: !1272, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !359)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!218, !1116, !1116}
!1274 = !DILocalVariable(name: "l_a", arg: 1, scope: !1271, file: !1110, line: 133, type: !1116)
!1275 = !DILocation(line: 133, column: 51, scope: !1271)
!1276 = !DILocalVariable(name: "l_b", arg: 2, scope: !1271, file: !1110, line: 133, type: !1116)
!1277 = !DILocation(line: 133, column: 70, scope: !1271)
!1278 = !DILocation(line: 137, column: 10, scope: !1271)
!1279 = !DILocation(line: 137, column: 9, scope: !1271)
!1280 = !DILocation(line: 137, column: 2, scope: !1271)
!1281 = distinct !DISubprogram(name: "BM_face_split_n", scope: !1, file: !1, line: 359, type: !1282, scopeLine: 363, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !359)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!209, !219, !209, !182, !182, !1284, !144, !1155, !133}
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!1285 = !DILocalVariable(name: "bm", arg: 1, scope: !1281, file: !1, line: 359, type: !219)
!1286 = !DILocation(line: 359, column: 32, scope: !1281)
!1287 = !DILocalVariable(name: "f", arg: 2, scope: !1281, file: !1, line: 359, type: !209)
!1288 = !DILocation(line: 359, column: 44, scope: !1281)
!1289 = !DILocalVariable(name: "l_a", arg: 3, scope: !1281, file: !1, line: 360, type: !182)
!1290 = !DILocation(line: 360, column: 33, scope: !1281)
!1291 = !DILocalVariable(name: "l_b", arg: 4, scope: !1281, file: !1, line: 360, type: !182)
!1292 = !DILocation(line: 360, column: 46, scope: !1281)
!1293 = !DILocalVariable(name: "cos", arg: 5, scope: !1281, file: !1, line: 361, type: !1284)
!1294 = !DILocation(line: 361, column: 31, scope: !1281)
!1295 = !DILocalVariable(name: "n", arg: 6, scope: !1281, file: !1, line: 361, type: !144)
!1296 = !DILocation(line: 361, column: 45, scope: !1281)
!1297 = !DILocalVariable(name: "r_l", arg: 7, scope: !1281, file: !1, line: 362, type: !1155)
!1298 = !DILocation(line: 362, column: 34, scope: !1281)
!1299 = !DILocalVariable(name: "example", arg: 8, scope: !1281, file: !1, line: 362, type: !133)
!1300 = !DILocation(line: 362, column: 47, scope: !1281)
!1301 = !DILocalVariable(name: "f_new", scope: !1281, file: !1, line: 364, type: !209)
!1302 = !DILocation(line: 364, column: 10, scope: !1281)
!1303 = !DILocalVariable(name: "f_tmp", scope: !1281, file: !1, line: 364, type: !209)
!1304 = !DILocation(line: 364, column: 18, scope: !1281)
!1305 = !DILocalVariable(name: "l_dummy", scope: !1281, file: !1, line: 365, type: !182)
!1306 = !DILocation(line: 365, column: 10, scope: !1281)
!1307 = !DILocalVariable(name: "e", scope: !1281, file: !1, line: 366, type: !133)
!1308 = !DILocation(line: 366, column: 10, scope: !1281)
!1309 = !DILocalVariable(name: "e_new", scope: !1281, file: !1, line: 366, type: !133)
!1310 = !DILocation(line: 366, column: 14, scope: !1281)
!1311 = !DILocalVariable(name: "v_new", scope: !1281, file: !1, line: 367, type: !198)
!1312 = !DILocation(line: 367, column: 10, scope: !1281)
!1313 = !DILocalVariable(name: "v_b", scope: !1281, file: !1, line: 369, type: !198)
!1314 = !DILocation(line: 369, column: 10, scope: !1281)
!1315 = !DILocation(line: 369, column: 16, scope: !1281)
!1316 = !DILocation(line: 369, column: 21, scope: !1281)
!1317 = !DILocalVariable(name: "i", scope: !1281, file: !1, line: 370, type: !144)
!1318 = !DILocation(line: 370, column: 6, scope: !1281)
!1319 = !DILocalVariable(name: "j", scope: !1281, file: !1, line: 370, type: !144)
!1320 = !DILocation(line: 370, column: 9, scope: !1281)
!1321 = !DILocation(line: 377, column: 6, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1281, file: !1, line: 377, column: 6)
!1323 = !DILocation(line: 377, column: 58, scope: !1322)
!1324 = !DILocation(line: 378, column: 6, scope: !1322)
!1325 = !DILocation(line: 377, column: 6, scope: !1281)
!1326 = !DILocation(line: 380, column: 7, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1328, file: !1, line: 380, column: 7)
!1328 = distinct !DILexicalBlock(scope: !1322, file: !1, line: 379, column: 2)
!1329 = !DILocation(line: 380, column: 7, scope: !1328)
!1330 = !DILocation(line: 381, column: 5, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1327, file: !1, line: 380, column: 12)
!1332 = !DILocation(line: 381, column: 9, scope: !1331)
!1333 = !DILocation(line: 382, column: 3, scope: !1331)
!1334 = !DILocation(line: 383, column: 3, scope: !1328)
!1335 = !DILocation(line: 386, column: 23, scope: !1281)
!1336 = !DILocation(line: 386, column: 27, scope: !1281)
!1337 = !DILocation(line: 386, column: 31, scope: !1281)
!1338 = !DILocation(line: 386, column: 10, scope: !1281)
!1339 = !DILocation(line: 386, column: 8, scope: !1281)
!1340 = !DILocation(line: 388, column: 7, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1281, file: !1, line: 388, column: 6)
!1342 = !DILocation(line: 388, column: 6, scope: !1281)
!1343 = !DILocation(line: 389, column: 7, scope: !1341)
!1344 = !DILocation(line: 389, column: 3, scope: !1341)
!1345 = !DILocation(line: 394, column: 21, scope: !1281)
!1346 = !DILocation(line: 394, column: 25, scope: !1281)
!1347 = !DILocation(line: 394, column: 28, scope: !1281)
!1348 = !DILocation(line: 394, column: 33, scope: !1281)
!1349 = !DILocation(line: 394, column: 38, scope: !1281)
!1350 = !DILocation(line: 394, column: 43, scope: !1281)
!1351 = !DILocation(line: 394, column: 10, scope: !1281)
!1352 = !DILocation(line: 394, column: 8, scope: !1281)
!1353 = !DILocation(line: 399, column: 6, scope: !1354)
!1354 = distinct !DILexicalBlock(scope: !1281, file: !1, line: 399, column: 6)
!1355 = !DILocation(line: 399, column: 6, scope: !1281)
!1356 = !DILocation(line: 400, column: 9, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1354, file: !1, line: 399, column: 13)
!1358 = !DILocation(line: 400, column: 8, scope: !1357)
!1359 = !DILocation(line: 400, column: 15, scope: !1357)
!1360 = !DILocation(line: 400, column: 5, scope: !1357)
!1361 = !DILocation(line: 401, column: 10, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1357, file: !1, line: 401, column: 3)
!1363 = !DILocation(line: 401, column: 8, scope: !1362)
!1364 = !DILocation(line: 401, column: 15, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !1362, file: !1, line: 401, column: 3)
!1366 = !DILocation(line: 401, column: 19, scope: !1365)
!1367 = !DILocation(line: 401, column: 17, scope: !1365)
!1368 = !DILocation(line: 401, column: 3, scope: !1362)
!1369 = !DILocation(line: 402, column: 23, scope: !1370)
!1370 = distinct !DILexicalBlock(scope: !1365, file: !1, line: 401, column: 27)
!1371 = !DILocation(line: 402, column: 27, scope: !1370)
!1372 = !DILocation(line: 402, column: 32, scope: !1370)
!1373 = !DILocation(line: 402, column: 12, scope: !1370)
!1374 = !DILocation(line: 402, column: 10, scope: !1370)
!1375 = !DILocation(line: 405, column: 15, scope: !1370)
!1376 = !DILocation(line: 405, column: 22, scope: !1370)
!1377 = !DILocation(line: 405, column: 26, scope: !1370)
!1378 = !DILocation(line: 405, column: 30, scope: !1370)
!1379 = !DILocation(line: 405, column: 4, scope: !1370)
!1380 = !DILocation(line: 408, column: 11, scope: !1381)
!1381 = distinct !DILexicalBlock(scope: !1370, file: !1, line: 408, column: 4)
!1382 = !DILocation(line: 408, column: 9, scope: !1381)
!1383 = !DILocation(line: 408, column: 16, scope: !1384)
!1384 = distinct !DILexicalBlock(scope: !1381, file: !1, line: 408, column: 4)
!1385 = !DILocation(line: 408, column: 18, scope: !1384)
!1386 = !DILocation(line: 408, column: 4, scope: !1381)
