; ModuleID = 'blender/source/blender/render/intern/source/voxeldata.c'
source_filename = "blender/source/blender/render/intern/source/voxeldata.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/source/voxeldata.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !8, !18, !20}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 46, baseType: !7)
!6 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!7 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "VoxelDataHeader", file: !10, line: 41, baseType: !11)
!10 = !DIFile(filename: "blender/source/blender/render/intern/include/voxeldata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelDataHeader", file: !10, line: 38, size: 128, elements: !12)
!12 = !{!13, !15, !16, !17}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "resolX", scope: !11, file: !10, line: 39, baseType: !14, size: 32)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "resolY", scope: !11, file: !10, line: 39, baseType: !14, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "resolZ", scope: !11, file: !10, line: 39, baseType: !14, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !11, file: !10, line: 40, baseType: !14, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!21 = !{i32 7, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{i32 1, !"wchar_size", i32 4}
!24 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!25 = distinct !DISubprogram(name: "cache_voxeldata", scope: !1, file: !1, line: 368, type: !26, scopeLine: 369, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28, !14}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tex", file: !30, line: 261, baseType: !31)
!30 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !30, line: 202, size: 3328, elements: !32)
!32 = !{!33, !102, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !1608, !1609, !1610, !1611, !1632, !1717, !1718, !1747, !1767, !1775, !1776}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !31, file: !30, line: 203, baseType: !34, size: 960)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !35, line: 130, baseType: !36)
!35 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !35, line: 117, size: 960, elements: !37)
!37 = !{!38, !39, !40, !42, !61, !65, !67, !68, !69, !70}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !35, line: 118, baseType: !4, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !36, file: !35, line: 118, baseType: !4, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !36, file: !35, line: 119, baseType: !41, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !36, file: !35, line: 120, baseType: !43, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !35, line: 136, size: 17600, elements: !45)
!45 = !{!46, !47, !49, !52, !56, !57, !58}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !44, file: !35, line: 137, baseType: !34, size: 960)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !44, file: !35, line: 138, baseType: !48, size: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !44, file: !35, line: 139, baseType: !50, size: 64, offset: 1024)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !35, line: 43, flags: DIFlagFwdDecl)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !35, line: 140, baseType: !53, size: 8192, offset: 1088)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8192, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 1024)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !44, file: !35, line: 141, baseType: !53, size: 8192, offset: 9280)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !44, file: !35, line: 148, baseType: !43, size: 64, offset: 17472)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !44, file: !35, line: 150, baseType: !59, size: 64, offset: 17536)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !35, line: 45, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !35, line: 121, baseType: !62, size: 528, offset: 256)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 528, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 66)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !36, file: !35, line: 126, baseType: !66, size: 16, offset: 784)
!66 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !36, file: !35, line: 127, baseType: !14, size: 32, offset: 800)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !36, file: !35, line: 128, baseType: !14, size: 32, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !36, file: !35, line: 128, baseType: !14, size: 32, offset: 864)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !36, file: !35, line: 129, baseType: !71, size: 64, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !35, line: 75, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !35, line: 62, size: 1024, elements: !74)
!74 = !{!75, !77, !78, !79, !80, !81, !85, !86, !100, !101}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !73, file: !35, line: 63, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !73, file: !35, line: 63, baseType: !76, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !35, line: 64, baseType: !19, size: 8, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !73, file: !35, line: 64, baseType: !19, size: 8, offset: 136)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !73, file: !35, line: 65, baseType: !66, size: 16, offset: 144)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !35, line: 66, baseType: !82, size: 512, offset: 160)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 512, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !73, file: !35, line: 67, baseType: !14, size: 32, offset: 672)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !35, line: 69, baseType: !87, size: 256, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !35, line: 60, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !35, line: 48, size: 256, elements: !89)
!89 = !{!90, !91, !98, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !88, file: !35, line: 49, baseType: !4, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !88, file: !35, line: 58, baseType: !92, size: 128, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !93, line: 71, baseType: !94)
!93 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !93, line: 69, size: 128, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !94, file: !93, line: 70, baseType: !4, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !94, file: !93, line: 70, baseType: !4, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !88, file: !35, line: 59, baseType: !14, size: 32, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !88, file: !35, line: 59, baseType: !14, size: 32, offset: 224)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, file: !35, line: 70, baseType: !14, size: 32, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !73, file: !35, line: 74, baseType: !14, size: 32, offset: 992)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !31, file: !30, line: 204, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !30, line: 45, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !31, file: !30, line: 206, baseType: !20, size: 32, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !31, file: !30, line: 206, baseType: !20, size: 32, offset: 1056)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !31, file: !30, line: 207, baseType: !20, size: 32, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !31, file: !30, line: 207, baseType: !20, size: 32, offset: 1120)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !31, file: !30, line: 207, baseType: !20, size: 32, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !31, file: !30, line: 207, baseType: !20, size: 32, offset: 1184)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !31, file: !30, line: 207, baseType: !20, size: 32, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !31, file: !30, line: 207, baseType: !20, size: 32, offset: 1248)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !31, file: !30, line: 208, baseType: !20, size: 32, offset: 1280)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !31, file: !30, line: 208, baseType: !20, size: 32, offset: 1312)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !31, file: !30, line: 211, baseType: !20, size: 32, offset: 1344)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !31, file: !30, line: 211, baseType: !20, size: 32, offset: 1376)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !31, file: !30, line: 211, baseType: !20, size: 32, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !31, file: !30, line: 211, baseType: !20, size: 32, offset: 1440)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !31, file: !30, line: 211, baseType: !20, size: 32, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !31, file: !30, line: 214, baseType: !20, size: 32, offset: 1504)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !31, file: !30, line: 214, baseType: !20, size: 32, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !31, file: !30, line: 217, baseType: !20, size: 32, offset: 1568)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !31, file: !30, line: 218, baseType: !20, size: 32, offset: 1600)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !31, file: !30, line: 219, baseType: !20, size: 32, offset: 1632)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !31, file: !30, line: 220, baseType: !20, size: 32, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !31, file: !30, line: 221, baseType: !20, size: 32, offset: 1696)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !31, file: !30, line: 222, baseType: !66, size: 16, offset: 1728)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !31, file: !30, line: 222, baseType: !66, size: 16, offset: 1744)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !31, file: !30, line: 224, baseType: !66, size: 16, offset: 1760)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !31, file: !30, line: 224, baseType: !66, size: 16, offset: 1776)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !31, file: !30, line: 227, baseType: !66, size: 16, offset: 1792)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !31, file: !30, line: 227, baseType: !66, size: 16, offset: 1808)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !31, file: !30, line: 229, baseType: !66, size: 16, offset: 1824)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !31, file: !30, line: 229, baseType: !66, size: 16, offset: 1840)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !31, file: !30, line: 230, baseType: !66, size: 16, offset: 1856)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !31, file: !30, line: 230, baseType: !66, size: 16, offset: 1872)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !31, file: !30, line: 232, baseType: !20, size: 32, offset: 1888)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !31, file: !30, line: 232, baseType: !20, size: 32, offset: 1920)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !31, file: !30, line: 232, baseType: !20, size: 32, offset: 1952)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !31, file: !30, line: 232, baseType: !20, size: 32, offset: 1984)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !31, file: !30, line: 233, baseType: !14, size: 32, offset: 2016)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !31, file: !30, line: 234, baseType: !14, size: 32, offset: 2048)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !31, file: !30, line: 235, baseType: !66, size: 16, offset: 2080)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !31, file: !30, line: 235, baseType: !66, size: 16, offset: 2096)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !31, file: !30, line: 236, baseType: !66, size: 16, offset: 2112)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !31, file: !30, line: 239, baseType: !66, size: 16, offset: 2128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !31, file: !30, line: 240, baseType: !14, size: 32, offset: 2144)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !31, file: !30, line: 241, baseType: !14, size: 32, offset: 2176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !31, file: !30, line: 241, baseType: !14, size: 32, offset: 2208)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !31, file: !30, line: 241, baseType: !14, size: 32, offset: 2240)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !31, file: !30, line: 243, baseType: !20, size: 32, offset: 2272)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !31, file: !30, line: 243, baseType: !20, size: 32, offset: 2304)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !31, file: !30, line: 244, baseType: !20, size: 32, offset: 2336)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !31, file: !30, line: 246, baseType: !155, size: 320, offset: 2368)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !156, line: 50, size: 320, elements: !157)
!156 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!157 = !{!158, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !155, file: !156, line: 51, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !161, line: 1216, size: 39680, elements: !162)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !{!163, !164, !165, !629, !803, !804, !805, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !831, !832, !835, !1173, !1176, !1468, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1491, !1492, !1493, !1494, !1495, !1503, !1569, !1576, !1577, !1584, !1587, !1588, !1589, !1590, !1591, !1592}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !160, file: !161, line: 1217, baseType: !34, size: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !160, file: !161, line: 1218, baseType: !103, size: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !160, file: !161, line: 1220, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !168, line: 115, size: 11392, elements: !169)
!168 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!169 = !{!170, !171, !172, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !189, !200, !214, !215, !259, !260, !263, !264, !280, !281, !282, !283, !284, !285, !286, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !305, !306, !307, !308, !309, !310, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !402, !403, !404, !405, !406, !407, !408, !409, !410, !458, !576, !577, !578, !579, !580, !581, !585, !588, !591, !592, !597, !598, !599, !600, !601, !602, !604, !607, !610, !614, !617, !618}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !167, file: !168, line: 116, baseType: !34, size: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !167, file: !168, line: 117, baseType: !103, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !167, file: !168, line: 119, baseType: !173, size: 64, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !168, line: 57, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !167, file: !168, line: 121, baseType: !66, size: 16, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !167, file: !168, line: 121, baseType: !66, size: 16, offset: 1104)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !167, file: !168, line: 122, baseType: !14, size: 32, offset: 1120)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !167, file: !168, line: 122, baseType: !14, size: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !167, file: !168, line: 122, baseType: !14, size: 32, offset: 1184)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !167, file: !168, line: 123, baseType: !82, size: 512, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !167, file: !168, line: 124, baseType: !166, size: 64, offset: 1728)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !167, file: !168, line: 124, baseType: !166, size: 64, offset: 1792)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !167, file: !168, line: 127, baseType: !166, size: 64, offset: 1856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !167, file: !168, line: 127, baseType: !166, size: 64, offset: 1920)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !167, file: !168, line: 127, baseType: !166, size: 64, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !167, file: !168, line: 128, baseType: !187, size: 64, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !30, line: 46, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !167, file: !168, line: 130, baseType: !190, size: 64, offset: 2112)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !168, line: 97, size: 832, elements: !192)
!192 = !{!193, !198, !199}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !191, file: !168, line: 98, baseType: !194, size: 768)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 768, elements: !195)
!195 = !{!196, !197}
!196 = !DISubrange(count: 8)
!197 = !DISubrange(count: 3)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !168, line: 99, baseType: !14, size: 32, offset: 768)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !191, file: !168, line: 99, baseType: !14, size: 32, offset: 800)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !167, file: !168, line: 131, baseType: !201, size: 64, offset: 2176)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !203, line: 486, size: 1600, elements: !204)
!203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !202, file: !203, line: 487, baseType: !34, size: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !202, file: !203, line: 489, baseType: !92, size: 128, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !202, file: !203, line: 490, baseType: !92, size: 128, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !202, file: !203, line: 491, baseType: !92, size: 128, offset: 1216)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !202, file: !203, line: 492, baseType: !92, size: 128, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !202, file: !203, line: 494, baseType: !14, size: 32, offset: 1472)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !202, file: !203, line: 495, baseType: !14, size: 32, offset: 1504)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !202, file: !203, line: 497, baseType: !14, size: 32, offset: 1536)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !202, file: !203, line: 498, baseType: !14, size: 32, offset: 1568)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !167, file: !168, line: 132, baseType: !201, size: 64, offset: 2240)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !167, file: !168, line: 133, baseType: !216, size: 64, offset: 2304)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !203, line: 334, size: 1728, elements: !218)
!218 = !{!219, !220, !223, !224, !225, !227, !228, !229, !232, !233, !234, !235, !236, !237, !238, !258}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !217, file: !203, line: 335, baseType: !92, size: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !217, file: !203, line: 336, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !203, line: 47, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !217, file: !203, line: 338, baseType: !66, size: 16, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !217, file: !203, line: 338, baseType: !66, size: 16, offset: 208)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !217, file: !203, line: 339, baseType: !226, size: 32, offset: 224)
!226 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !217, file: !203, line: 340, baseType: !14, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !217, file: !203, line: 342, baseType: !20, size: 32, offset: 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !217, file: !203, line: 343, baseType: !230, size: 96, offset: 320)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !231)
!231 = !{!197}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !217, file: !203, line: 344, baseType: !230, size: 96, offset: 416)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !217, file: !203, line: 347, baseType: !92, size: 128, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !217, file: !203, line: 349, baseType: !14, size: 32, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !217, file: !203, line: 350, baseType: !14, size: 32, offset: 672)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !217, file: !203, line: 351, baseType: !4, size: 64, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !217, file: !203, line: 352, baseType: !4, size: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !217, file: !203, line: 354, baseType: !239, size: 384, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !203, line: 116, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !203, line: 94, size: 384, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !240, file: !203, line: 96, baseType: !14, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !240, file: !203, line: 96, baseType: !14, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !240, file: !203, line: 97, baseType: !14, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !240, file: !203, line: 97, baseType: !14, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !240, file: !203, line: 99, baseType: !66, size: 16, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !240, file: !203, line: 100, baseType: !66, size: 16, offset: 144)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !240, file: !203, line: 102, baseType: !66, size: 16, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !240, file: !203, line: 105, baseType: !66, size: 16, offset: 176)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !240, file: !203, line: 108, baseType: !66, size: 16, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !240, file: !203, line: 109, baseType: !66, size: 16, offset: 208)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !240, file: !203, line: 111, baseType: !66, size: 16, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !240, file: !203, line: 112, baseType: !66, size: 16, offset: 240)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !240, file: !203, line: 114, baseType: !14, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !240, file: !203, line: 114, baseType: !14, size: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !240, file: !203, line: 115, baseType: !14, size: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !240, file: !203, line: 115, baseType: !14, size: 32, offset: 352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !217, file: !203, line: 355, baseType: !82, size: 512, offset: 1216)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !167, file: !168, line: 134, baseType: !4, size: 64, offset: 2368)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !167, file: !168, line: 136, baseType: !261, size: 64, offset: 2432)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !168, line: 58, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !167, file: !168, line: 138, baseType: !239, size: 384, offset: 2496)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !167, file: !168, line: 139, baseType: !265, size: 64, offset: 2880)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !203, line: 80, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !203, line: 72, size: 192, elements: !268)
!268 = !{!269, !276, !277, !278, !279}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !267, file: !203, line: 73, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !203, line: 59, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !203, line: 56, size: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !272, file: !203, line: 57, baseType: !230, size: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !203, line: 58, baseType: !14, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !267, file: !203, line: 74, baseType: !14, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !267, file: !203, line: 76, baseType: !14, size: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !267, file: !203, line: 77, baseType: !14, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !203, line: 79, baseType: !14, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !167, file: !168, line: 141, baseType: !92, size: 128, offset: 2944)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !167, file: !168, line: 142, baseType: !92, size: 128, offset: 3072)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !167, file: !168, line: 143, baseType: !92, size: 128, offset: 3200)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !167, file: !168, line: 144, baseType: !92, size: 128, offset: 3328)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !167, file: !168, line: 146, baseType: !14, size: 32, offset: 3456)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !167, file: !168, line: 147, baseType: !14, size: 32, offset: 3488)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !167, file: !168, line: 150, baseType: !287, size: 64, offset: 3520)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !168, line: 50, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !167, file: !168, line: 151, baseType: !18, size: 64, offset: 3584)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !167, file: !168, line: 152, baseType: !14, size: 32, offset: 3648)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !167, file: !168, line: 153, baseType: !14, size: 32, offset: 3680)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !167, file: !168, line: 156, baseType: !230, size: 96, offset: 3712)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !167, file: !168, line: 156, baseType: !230, size: 96, offset: 3808)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !167, file: !168, line: 156, baseType: !230, size: 96, offset: 3904)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !167, file: !168, line: 157, baseType: !230, size: 96, offset: 4000)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !167, file: !168, line: 158, baseType: !230, size: 96, offset: 4096)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !167, file: !168, line: 159, baseType: !230, size: 96, offset: 4192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !167, file: !168, line: 160, baseType: !230, size: 96, offset: 4288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !167, file: !168, line: 160, baseType: !230, size: 96, offset: 4384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !167, file: !168, line: 161, baseType: !302, size: 128, offset: 4480)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 4)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !167, file: !168, line: 161, baseType: !302, size: 128, offset: 4608)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !167, file: !168, line: 162, baseType: !230, size: 96, offset: 4736)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !167, file: !168, line: 162, baseType: !230, size: 96, offset: 4832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !167, file: !168, line: 163, baseType: !20, size: 32, offset: 4928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !167, file: !168, line: 163, baseType: !20, size: 32, offset: 4960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !167, file: !168, line: 164, baseType: !311, size: 512, offset: 4992)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, elements: !312)
!312 = !{!304, !304}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !167, file: !168, line: 165, baseType: !311, size: 512, offset: 5504)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !167, file: !168, line: 166, baseType: !311, size: 512, offset: 6016)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !167, file: !168, line: 167, baseType: !311, size: 512, offset: 6528)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !167, file: !168, line: 176, baseType: !311, size: 512, offset: 7040)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !167, file: !168, line: 178, baseType: !226, size: 32, offset: 7552)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !167, file: !168, line: 180, baseType: !66, size: 16, offset: 7584)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !167, file: !168, line: 181, baseType: !66, size: 16, offset: 7600)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !167, file: !168, line: 183, baseType: !66, size: 16, offset: 7616)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !167, file: !168, line: 183, baseType: !66, size: 16, offset: 7632)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !167, file: !168, line: 184, baseType: !66, size: 16, offset: 7648)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !167, file: !168, line: 184, baseType: !66, size: 16, offset: 7664)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !167, file: !168, line: 185, baseType: !66, size: 16, offset: 7680)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !167, file: !168, line: 186, baseType: !66, size: 16, offset: 7696)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !167, file: !168, line: 187, baseType: !66, size: 16, offset: 7712)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !167, file: !168, line: 188, baseType: !19, size: 8, offset: 7728)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !167, file: !168, line: 189, baseType: !19, size: 8, offset: 7736)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !167, file: !168, line: 192, baseType: !14, size: 32, offset: 7744)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !167, file: !168, line: 192, baseType: !14, size: 32, offset: 7776)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !167, file: !168, line: 192, baseType: !14, size: 32, offset: 7808)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !167, file: !168, line: 192, baseType: !14, size: 32, offset: 7840)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !167, file: !168, line: 194, baseType: !14, size: 32, offset: 7872)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !167, file: !168, line: 202, baseType: !20, size: 32, offset: 7904)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !167, file: !168, line: 202, baseType: !20, size: 32, offset: 7936)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !167, file: !168, line: 202, baseType: !20, size: 32, offset: 7968)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !167, file: !168, line: 211, baseType: !20, size: 32, offset: 8000)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !167, file: !168, line: 212, baseType: !20, size: 32, offset: 8032)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !167, file: !168, line: 213, baseType: !20, size: 32, offset: 8064)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !167, file: !168, line: 214, baseType: !20, size: 32, offset: 8096)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !167, file: !168, line: 215, baseType: !20, size: 32, offset: 8128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !167, file: !168, line: 216, baseType: !20, size: 32, offset: 8160)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !167, file: !168, line: 219, baseType: !20, size: 32, offset: 8192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !167, file: !168, line: 220, baseType: !20, size: 32, offset: 8224)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !167, file: !168, line: 221, baseType: !20, size: 32, offset: 8256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !167, file: !168, line: 224, baseType: !347, size: 16, offset: 8288)
!347 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !167, file: !168, line: 224, baseType: !347, size: 16, offset: 8304)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !167, file: !168, line: 226, baseType: !66, size: 16, offset: 8320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !167, file: !168, line: 228, baseType: !19, size: 8, offset: 8336)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !167, file: !168, line: 229, baseType: !19, size: 8, offset: 8344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !167, file: !168, line: 231, baseType: !66, size: 16, offset: 8352)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !167, file: !168, line: 232, baseType: !19, size: 8, offset: 8368)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !167, file: !168, line: 233, baseType: !19, size: 8, offset: 8376)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !167, file: !168, line: 234, baseType: !20, size: 32, offset: 8384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !167, file: !168, line: 235, baseType: !20, size: 32, offset: 8416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !167, file: !168, line: 237, baseType: !92, size: 128, offset: 8448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !167, file: !168, line: 238, baseType: !92, size: 128, offset: 8576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !167, file: !168, line: 239, baseType: !92, size: 128, offset: 8704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !167, file: !168, line: 240, baseType: !92, size: 128, offset: 8832)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !167, file: !168, line: 242, baseType: !20, size: 32, offset: 8960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !167, file: !168, line: 244, baseType: !66, size: 16, offset: 8992)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !167, file: !168, line: 245, baseType: !347, size: 16, offset: 9008)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !167, file: !168, line: 246, baseType: !302, size: 128, offset: 9024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !167, file: !168, line: 248, baseType: !14, size: 32, offset: 9152)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !167, file: !168, line: 249, baseType: !14, size: 32, offset: 9184)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !167, file: !168, line: 251, baseType: !368, size: 64, offset: 9216)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !370, line: 215, size: 960, elements: !371)
!370 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !370, line: 216, baseType: !14, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !369, file: !370, line: 217, baseType: !20, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !369, file: !370, line: 218, baseType: !20, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !369, file: !370, line: 219, baseType: !20, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !369, file: !370, line: 221, baseType: !14, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !369, file: !370, line: 222, baseType: !14, size: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !369, file: !370, line: 223, baseType: !14, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !369, file: !370, line: 224, baseType: !14, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !369, file: !370, line: 226, baseType: !20, size: 32, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !369, file: !370, line: 227, baseType: !20, size: 32, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !369, file: !370, line: 228, baseType: !20, size: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !369, file: !370, line: 229, baseType: !20, size: 32, offset: 352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !369, file: !370, line: 231, baseType: !20, size: 32, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !369, file: !370, line: 232, baseType: !20, size: 32, offset: 416)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !369, file: !370, line: 233, baseType: !20, size: 32, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !369, file: !370, line: 234, baseType: !20, size: 32, offset: 480)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !369, file: !370, line: 236, baseType: !20, size: 32, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !369, file: !370, line: 237, baseType: !20, size: 32, offset: 544)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !369, file: !370, line: 238, baseType: !20, size: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !369, file: !370, line: 239, baseType: !20, size: 32, offset: 608)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !369, file: !370, line: 241, baseType: !20, size: 32, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !369, file: !370, line: 242, baseType: !20, size: 32, offset: 672)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !369, file: !370, line: 243, baseType: !20, size: 32, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !369, file: !370, line: 244, baseType: !20, size: 32, offset: 736)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !369, file: !370, line: 246, baseType: !20, size: 32, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !369, file: !370, line: 247, baseType: !20, size: 32, offset: 800)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !369, file: !370, line: 248, baseType: !14, size: 32, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !369, file: !370, line: 249, baseType: !14, size: 32, offset: 864)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !369, file: !370, line: 250, baseType: !20, size: 32, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !369, file: !370, line: 251, baseType: !20, size: 32, offset: 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !167, file: !168, line: 253, baseType: !19, size: 8, offset: 9280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !167, file: !168, line: 254, baseType: !19, size: 8, offset: 9288)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !167, file: !168, line: 255, baseType: !66, size: 16, offset: 9296)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !167, file: !168, line: 256, baseType: !230, size: 96, offset: 9312)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !167, file: !168, line: 258, baseType: !92, size: 128, offset: 9408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !167, file: !168, line: 259, baseType: !92, size: 128, offset: 9536)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !167, file: !168, line: 260, baseType: !92, size: 128, offset: 9664)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !167, file: !168, line: 261, baseType: !92, size: 128, offset: 9792)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !167, file: !168, line: 263, baseType: !411, size: 64, offset: 9920)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !370, line: 61, size: 1280, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !452, !455, !456, !457}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !412, file: !370, line: 62, baseType: !14, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !412, file: !370, line: 63, baseType: !66, size: 16, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !412, file: !370, line: 64, baseType: !66, size: 16, offset: 48)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !412, file: !370, line: 65, baseType: !66, size: 16, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !412, file: !370, line: 66, baseType: !66, size: 16, offset: 80)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !412, file: !370, line: 67, baseType: !66, size: 16, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !412, file: !370, line: 68, baseType: !66, size: 16, offset: 112)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !412, file: !370, line: 68, baseType: !66, size: 16, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !412, file: !370, line: 69, baseType: !66, size: 16, offset: 144)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !412, file: !370, line: 72, baseType: !20, size: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !412, file: !370, line: 73, baseType: !20, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !412, file: !370, line: 74, baseType: !20, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !412, file: !370, line: 77, baseType: !20, size: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !412, file: !370, line: 80, baseType: !20, size: 32, offset: 288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !412, file: !370, line: 81, baseType: !20, size: 32, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !412, file: !370, line: 82, baseType: !20, size: 32, offset: 352)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !412, file: !370, line: 83, baseType: !20, size: 32, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !412, file: !370, line: 84, baseType: !20, size: 32, offset: 416)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !412, file: !370, line: 85, baseType: !20, size: 32, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !412, file: !370, line: 88, baseType: !20, size: 32, offset: 480)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !412, file: !370, line: 89, baseType: !20, size: 32, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !412, file: !370, line: 90, baseType: !20, size: 32, offset: 544)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !412, file: !370, line: 91, baseType: !20, size: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !412, file: !370, line: 92, baseType: !20, size: 32, offset: 608)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !412, file: !370, line: 93, baseType: !20, size: 32, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !412, file: !370, line: 95, baseType: !20, size: 32, offset: 672)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !412, file: !370, line: 98, baseType: !20, size: 32, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !412, file: !370, line: 99, baseType: !20, size: 32, offset: 736)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !412, file: !370, line: 100, baseType: !20, size: 32, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !412, file: !370, line: 103, baseType: !20, size: 32, offset: 800)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !412, file: !370, line: 103, baseType: !20, size: 32, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !412, file: !370, line: 104, baseType: !20, size: 32, offset: 864)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !412, file: !370, line: 104, baseType: !20, size: 32, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !412, file: !370, line: 104, baseType: !20, size: 32, offset: 928)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !412, file: !370, line: 104, baseType: !20, size: 32, offset: 960)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !412, file: !370, line: 107, baseType: !20, size: 32, offset: 992)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !412, file: !370, line: 108, baseType: !451, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rng", scope: !412, file: !370, line: 111, baseType: !453, size: 64, offset: 1088)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "RNG", file: !370, line: 111, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "f_noise", scope: !412, file: !370, line: 112, baseType: !20, size: 32, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !412, file: !370, line: 113, baseType: !14, size: 32, offset: 1184)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "f_source", scope: !412, file: !370, line: 115, baseType: !166, size: 64, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !167, file: !168, line: 264, baseType: !459, size: 64, offset: 9984)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !370, line: 268, size: 3776, elements: !461)
!461 = !{!462, !463, !464, !467, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !519, !520, !521, !553, !554, !570, !571, !574, !575}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !460, file: !370, line: 270, baseType: !14, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "totspring", scope: !460, file: !370, line: 270, baseType: !14, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bpoint", scope: !460, file: !370, line: 271, baseType: !465, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodyPoint", file: !370, line: 271, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "bspring", scope: !460, file: !370, line: 272, baseType: !468, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodySpring", file: !370, line: 272, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !460, file: !370, line: 273, baseType: !19, size: 8, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "msg_lock", scope: !460, file: !370, line: 274, baseType: !19, size: 8, offset: 200)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "msg_value", scope: !460, file: !370, line: 275, baseType: !66, size: 16, offset: 208)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "nodemass", scope: !460, file: !370, line: 280, baseType: !20, size: 32, offset: 224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Mass", scope: !460, file: !370, line: 281, baseType: !82, size: 512, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "grav", scope: !460, file: !370, line: 285, baseType: !20, size: 32, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mediafrict", scope: !460, file: !370, line: 286, baseType: !20, size: 32, offset: 800)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rklimit", scope: !460, file: !370, line: 287, baseType: !20, size: 32, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "physics_speed", scope: !460, file: !370, line: 288, baseType: !20, size: 32, offset: 864)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "goalspring", scope: !460, file: !370, line: 291, baseType: !20, size: 32, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "goalfrict", scope: !460, file: !370, line: 292, baseType: !20, size: 32, offset: 928)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mingoal", scope: !460, file: !370, line: 293, baseType: !20, size: 32, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "maxgoal", scope: !460, file: !370, line: 294, baseType: !20, size: 32, offset: 992)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "defgoal", scope: !460, file: !370, line: 295, baseType: !20, size: 32, offset: 1024)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vertgroup", scope: !460, file: !370, line: 296, baseType: !66, size: 16, offset: 1056)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Softgoal", scope: !460, file: !370, line: 297, baseType: !82, size: 512, offset: 1072)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fuzzyness", scope: !460, file: !370, line: 301, baseType: !66, size: 16, offset: 1584)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "inspring", scope: !460, file: !370, line: 304, baseType: !20, size: 32, offset: 1600)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "infrict", scope: !460, file: !370, line: 305, baseType: !20, size: 32, offset: 1632)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Spring_K", scope: !460, file: !370, line: 306, baseType: !82, size: 512, offset: 1664)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !460, file: !370, line: 312, baseType: !14, size: 32, offset: 2176)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !460, file: !370, line: 312, baseType: !14, size: 32, offset: 2208)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !460, file: !370, line: 313, baseType: !14, size: 32, offset: 2240)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !460, file: !370, line: 314, baseType: !66, size: 16, offset: 2272)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "solverflags", scope: !460, file: !370, line: 314, baseType: !66, size: 16, offset: 2288)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !460, file: !370, line: 317, baseType: !496, size: 64, offset: 2304)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBVertex", file: !370, line: 213, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBVertex", file: !370, line: 211, size: 128, elements: !500)
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !499, file: !370, line: 212, baseType: !302, size: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "totpointkey", scope: !460, file: !370, line: 318, baseType: !14, size: 32, offset: 2368)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "totkey", scope: !460, file: !370, line: 318, baseType: !14, size: 32, offset: 2400)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "secondspring", scope: !460, file: !370, line: 320, baseType: !20, size: 32, offset: 2432)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "colball", scope: !460, file: !370, line: 323, baseType: !20, size: 32, offset: 2464)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "balldamp", scope: !460, file: !370, line: 324, baseType: !20, size: 32, offset: 2496)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ballstiff", scope: !460, file: !370, line: 325, baseType: !20, size: 32, offset: 2528)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_mode", scope: !460, file: !370, line: 326, baseType: !66, size: 16, offset: 2560)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "aeroedge", scope: !460, file: !370, line: 327, baseType: !66, size: 16, offset: 2576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "minloops", scope: !460, file: !370, line: 328, baseType: !66, size: 16, offset: 2592)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "maxloops", scope: !460, file: !370, line: 329, baseType: !66, size: 16, offset: 2608)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "choke", scope: !460, file: !370, line: 330, baseType: !66, size: 16, offset: 2624)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "solver_ID", scope: !460, file: !370, line: 331, baseType: !66, size: 16, offset: 2640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "plastic", scope: !460, file: !370, line: 332, baseType: !66, size: 16, offset: 2656)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "springpreload", scope: !460, file: !370, line: 332, baseType: !66, size: 16, offset: 2672)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !460, file: !370, line: 335, baseType: !517, size: 64, offset: 2688)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "SBScratch", file: !370, line: 335, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "shearstiff", scope: !460, file: !370, line: 336, baseType: !20, size: 32, offset: 2752)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "inpush", scope: !460, file: !370, line: 337, baseType: !20, size: 32, offset: 2784)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pointcache", scope: !460, file: !370, line: 339, baseType: !522, size: 64, offset: 2816)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointCache", file: !370, line: 170, size: 10560, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !549}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !523, file: !370, line: 171, baseType: !522, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !523, file: !370, line: 171, baseType: !522, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !523, file: !370, line: 172, baseType: !14, size: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !523, file: !370, line: 174, baseType: !14, size: 32, offset: 160)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "simframe", scope: !523, file: !370, line: 186, baseType: !14, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "startframe", scope: !523, file: !370, line: 187, baseType: !14, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "endframe", scope: !523, file: !370, line: 188, baseType: !14, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "editframe", scope: !523, file: !370, line: 189, baseType: !14, size: 32, offset: 288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "last_exact", scope: !523, file: !370, line: 190, baseType: !14, size: 32, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "last_valid", scope: !523, file: !370, line: 191, baseType: !14, size: 32, offset: 352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !523, file: !370, line: 192, baseType: !14, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !523, file: !370, line: 195, baseType: !14, size: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !523, file: !370, line: 196, baseType: !14, size: 32, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !523, file: !370, line: 197, baseType: !66, size: 16, offset: 480)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !523, file: !370, line: 197, baseType: !66, size: 16, offset: 496)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !523, file: !370, line: 199, baseType: !82, size: 512, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "prev_name", scope: !523, file: !370, line: 200, baseType: !82, size: 512, offset: 1024)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !523, file: !370, line: 201, baseType: !82, size: 512, offset: 1536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !523, file: !370, line: 202, baseType: !53, size: 8192, offset: 2048)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cached_frames", scope: !523, file: !370, line: 203, baseType: !18, size: 64, offset: 10240)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mem_cache", scope: !523, file: !370, line: 205, baseType: !94, size: 128, offset: 10304)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "edit", scope: !523, file: !370, line: 207, baseType: !547, size: 64, offset: 10432)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "PTCacheEdit", file: !370, line: 207, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "free_edit", scope: !523, file: !370, line: 208, baseType: !550, size: 64, offset: 10496)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !547}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ptcaches", scope: !460, file: !370, line: 340, baseType: !94, size: 128, offset: 2880)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "effector_weights", scope: !460, file: !370, line: 342, baseType: !555, size: 64, offset: 3008)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EffectorWeights", file: !370, line: 118, size: 640, elements: !557)
!557 = !{!558, !561, !565, !566, !567, !569}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !556, file: !370, line: 119, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !370, line: 119, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !556, file: !370, line: 121, baseType: !562, size: 448, offset: 64)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 448, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 14)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "global_gravity", scope: !556, file: !370, line: 122, baseType: !20, size: 32, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !556, file: !370, line: 123, baseType: !66, size: 16, offset: 544)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !556, file: !370, line: 123, baseType: !568, size: 48, offset: 560)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 48, elements: !231)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !556, file: !370, line: 124, baseType: !14, size: 32, offset: 608)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lcom", scope: !460, file: !370, line: 344, baseType: !230, size: 96, offset: 3072)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "lrot", scope: !460, file: !370, line: 345, baseType: !572, size: 288, offset: 3168)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 288, elements: !573)
!573 = !{!197, !197}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lscale", scope: !460, file: !370, line: 346, baseType: !572, size: 288, offset: 3456)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "last_frame", scope: !460, file: !370, line: 348, baseType: !14, size: 32, offset: 3744)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !167, file: !168, line: 265, baseType: !559, size: 64, offset: 10048)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !167, file: !168, line: 267, baseType: !19, size: 8, offset: 10112)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !167, file: !168, line: 268, baseType: !19, size: 8, offset: 10120)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !167, file: !168, line: 269, baseType: !66, size: 16, offset: 10128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !167, file: !168, line: 270, baseType: !20, size: 32, offset: 10144)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !167, file: !168, line: 272, baseType: !582, size: 64, offset: 10176)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !584, line: 732, flags: DIFlagFwdDecl)
!584 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!585 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !167, file: !168, line: 275, baseType: !586, size: 64, offset: 10240)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !168, line: 275, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !167, file: !168, line: 277, baseType: !589, size: 64, offset: 10304)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !584, line: 592, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !167, file: !168, line: 277, baseType: !589, size: 64, offset: 10368)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !167, file: !168, line: 278, baseType: !593, size: 64, offset: 10432)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !594, line: 27, baseType: !595)
!594 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !596, line: 45, baseType: !7)
!596 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!597 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !167, file: !168, line: 279, baseType: !593, size: 64, offset: 10496)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !167, file: !168, line: 280, baseType: !226, size: 32, offset: 10560)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !167, file: !168, line: 281, baseType: !226, size: 32, offset: 10592)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !167, file: !168, line: 283, baseType: !92, size: 128, offset: 10624)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !167, file: !168, line: 284, baseType: !92, size: 128, offset: 10752)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !167, file: !168, line: 285, baseType: !603, size: 64, offset: 10880)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !167, file: !168, line: 287, baseType: !605, size: 64, offset: 10944)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !168, line: 59, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !167, file: !168, line: 288, baseType: !608, size: 64, offset: 11008)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !168, line: 288, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !167, file: !168, line: 290, baseType: !611, size: 64, offset: 11072)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 2)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !167, file: !168, line: 291, baseType: !615, size: 64, offset: 11136)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !156, line: 65, baseType: !155)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !167, file: !168, line: 293, baseType: !92, size: 128, offset: 11200)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !167, file: !168, line: 294, baseType: !619, size: 64, offset: 11328)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !168, line: 113, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !168, line: 108, size: 256, elements: !622)
!622 = !{!623, !625, !626, !627, !628}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !621, file: !168, line: 109, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !621, file: !168, line: 109, baseType: !624, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !621, file: !168, line: 110, baseType: !166, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !621, file: !168, line: 111, baseType: !14, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !621, file: !168, line: 112, baseType: !20, size: 32, offset: 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !160, file: !161, line: 1221, baseType: !630, size: 64, offset: 1088)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !632, line: 52, size: 4224, elements: !633)
!632 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !703, !704, !705, !780, !781, !782, !784, !800}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !631, file: !632, line: 53, baseType: !34, size: 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !631, file: !632, line: 54, baseType: !103, size: 64, offset: 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !631, file: !632, line: 56, baseType: !66, size: 16, offset: 1024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !631, file: !632, line: 56, baseType: !66, size: 16, offset: 1040)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !631, file: !632, line: 57, baseType: !66, size: 16, offset: 1056)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !631, file: !632, line: 57, baseType: !66, size: 16, offset: 1072)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !631, file: !632, line: 59, baseType: !20, size: 32, offset: 1088)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !631, file: !632, line: 59, baseType: !20, size: 32, offset: 1120)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !631, file: !632, line: 59, baseType: !20, size: 32, offset: 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !631, file: !632, line: 60, baseType: !20, size: 32, offset: 1184)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !631, file: !632, line: 60, baseType: !20, size: 32, offset: 1216)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !631, file: !632, line: 60, baseType: !20, size: 32, offset: 1248)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !631, file: !632, line: 61, baseType: !20, size: 32, offset: 1280)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !631, file: !632, line: 61, baseType: !20, size: 32, offset: 1312)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !631, file: !632, line: 61, baseType: !20, size: 32, offset: 1344)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !631, file: !632, line: 68, baseType: !20, size: 32, offset: 1376)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !631, file: !632, line: 68, baseType: !20, size: 32, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !631, file: !632, line: 68, baseType: !20, size: 32, offset: 1440)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !631, file: !632, line: 69, baseType: !20, size: 32, offset: 1472)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !631, file: !632, line: 69, baseType: !20, size: 32, offset: 1504)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !631, file: !632, line: 74, baseType: !20, size: 32, offset: 1536)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !631, file: !632, line: 79, baseType: !20, size: 32, offset: 1568)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !631, file: !632, line: 81, baseType: !66, size: 16, offset: 1600)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !631, file: !632, line: 91, baseType: !66, size: 16, offset: 1616)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !631, file: !632, line: 92, baseType: !66, size: 16, offset: 1632)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !631, file: !632, line: 93, baseType: !66, size: 16, offset: 1648)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !631, file: !632, line: 94, baseType: !66, size: 16, offset: 1664)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !631, file: !632, line: 94, baseType: !66, size: 16, offset: 1680)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !631, file: !632, line: 94, baseType: !66, size: 16, offset: 1696)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !631, file: !632, line: 94, baseType: !66, size: 16, offset: 1712)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !631, file: !632, line: 96, baseType: !20, size: 32, offset: 1728)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !631, file: !632, line: 96, baseType: !20, size: 32, offset: 1760)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !631, file: !632, line: 96, baseType: !20, size: 32, offset: 1792)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !631, file: !632, line: 96, baseType: !20, size: 32, offset: 1824)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !631, file: !632, line: 98, baseType: !20, size: 32, offset: 1856)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !631, file: !632, line: 98, baseType: !20, size: 32, offset: 1888)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !631, file: !632, line: 98, baseType: !20, size: 32, offset: 1920)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !631, file: !632, line: 98, baseType: !20, size: 32, offset: 1952)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !631, file: !632, line: 99, baseType: !20, size: 32, offset: 1984)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !631, file: !632, line: 99, baseType: !20, size: 32, offset: 2016)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !631, file: !632, line: 100, baseType: !20, size: 32, offset: 2048)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !631, file: !632, line: 100, baseType: !20, size: 32, offset: 2080)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !631, file: !632, line: 103, baseType: !66, size: 16, offset: 2112)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !631, file: !632, line: 103, baseType: !66, size: 16, offset: 2128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !631, file: !632, line: 103, baseType: !66, size: 16, offset: 2144)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !631, file: !632, line: 103, baseType: !66, size: 16, offset: 2160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !631, file: !632, line: 106, baseType: !20, size: 32, offset: 2176)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !631, file: !632, line: 106, baseType: !20, size: 32, offset: 2208)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !631, file: !632, line: 106, baseType: !20, size: 32, offset: 2240)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !631, file: !632, line: 106, baseType: !20, size: 32, offset: 2272)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !631, file: !632, line: 107, baseType: !66, size: 16, offset: 2304)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !631, file: !632, line: 107, baseType: !66, size: 16, offset: 2320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !631, file: !632, line: 107, baseType: !66, size: 16, offset: 2336)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !631, file: !632, line: 107, baseType: !66, size: 16, offset: 2352)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !631, file: !632, line: 108, baseType: !20, size: 32, offset: 2368)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !631, file: !632, line: 108, baseType: !20, size: 32, offset: 2400)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !631, file: !632, line: 109, baseType: !20, size: 32, offset: 2432)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !631, file: !632, line: 109, baseType: !20, size: 32, offset: 2464)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !631, file: !632, line: 110, baseType: !20, size: 32, offset: 2496)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !631, file: !632, line: 110, baseType: !20, size: 32, offset: 2528)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !631, file: !632, line: 110, baseType: !20, size: 32, offset: 2560)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !631, file: !632, line: 111, baseType: !66, size: 16, offset: 2592)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !631, file: !632, line: 111, baseType: !66, size: 16, offset: 2608)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !631, file: !632, line: 112, baseType: !66, size: 16, offset: 2624)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !631, file: !632, line: 112, baseType: !66, size: 16, offset: 2640)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !631, file: !632, line: 112, baseType: !66, size: 16, offset: 2656)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !631, file: !632, line: 115, baseType: !66, size: 16, offset: 2672)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !631, file: !632, line: 118, baseType: !702, size: 64, offset: 2688)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !631, file: !632, line: 118, baseType: !702, size: 64, offset: 2752)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !631, file: !632, line: 121, baseType: !187, size: 64, offset: 2816)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !631, file: !632, line: 122, baseType: !706, size: 1152, offset: 2880)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 1152, elements: !778)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !30, line: 57, size: 2496, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !708, file: !30, line: 59, baseType: !66, size: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !708, file: !30, line: 59, baseType: !66, size: 16, offset: 16)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !708, file: !30, line: 59, baseType: !66, size: 16, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !708, file: !30, line: 59, baseType: !66, size: 16, offset: 48)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !708, file: !30, line: 60, baseType: !166, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !708, file: !30, line: 61, baseType: !451, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !708, file: !30, line: 62, baseType: !82, size: 512, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !708, file: !30, line: 64, baseType: !19, size: 8, offset: 704)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !708, file: !30, line: 64, baseType: !19, size: 8, offset: 712)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !708, file: !30, line: 64, baseType: !19, size: 8, offset: 720)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !708, file: !30, line: 64, baseType: !19, size: 8, offset: 728)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !708, file: !30, line: 65, baseType: !230, size: 96, offset: 736)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !708, file: !30, line: 65, baseType: !230, size: 96, offset: 832)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !708, file: !30, line: 65, baseType: !20, size: 32, offset: 928)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !708, file: !30, line: 67, baseType: !66, size: 16, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !708, file: !30, line: 67, baseType: !66, size: 16, offset: 976)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !708, file: !30, line: 67, baseType: !66, size: 16, offset: 992)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !708, file: !30, line: 67, baseType: !66, size: 16, offset: 1008)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !708, file: !30, line: 68, baseType: !66, size: 16, offset: 1024)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !708, file: !30, line: 68, baseType: !66, size: 16, offset: 1040)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !708, file: !30, line: 69, baseType: !19, size: 8, offset: 1056)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !708, file: !30, line: 69, baseType: !732, size: 56, offset: 1064)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 56, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 7)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !708, file: !30, line: 70, baseType: !20, size: 32, offset: 1120)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !708, file: !30, line: 70, baseType: !20, size: 32, offset: 1152)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !708, file: !30, line: 70, baseType: !20, size: 32, offset: 1184)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !708, file: !30, line: 70, baseType: !20, size: 32, offset: 1216)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !708, file: !30, line: 71, baseType: !20, size: 32, offset: 1248)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !708, file: !30, line: 71, baseType: !20, size: 32, offset: 1280)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !708, file: !30, line: 74, baseType: !20, size: 32, offset: 1312)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !708, file: !30, line: 74, baseType: !20, size: 32, offset: 1344)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !708, file: !30, line: 77, baseType: !20, size: 32, offset: 1376)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !708, file: !30, line: 77, baseType: !20, size: 32, offset: 1408)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !708, file: !30, line: 77, baseType: !20, size: 32, offset: 1440)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !708, file: !30, line: 78, baseType: !20, size: 32, offset: 1472)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !708, file: !30, line: 78, baseType: !20, size: 32, offset: 1504)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !708, file: !30, line: 78, baseType: !20, size: 32, offset: 1536)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !708, file: !30, line: 79, baseType: !20, size: 32, offset: 1568)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !708, file: !30, line: 79, baseType: !20, size: 32, offset: 1600)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !708, file: !30, line: 79, baseType: !20, size: 32, offset: 1632)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !708, file: !30, line: 79, baseType: !20, size: 32, offset: 1664)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !708, file: !30, line: 80, baseType: !20, size: 32, offset: 1696)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !708, file: !30, line: 80, baseType: !20, size: 32, offset: 1728)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !708, file: !30, line: 80, baseType: !20, size: 32, offset: 1760)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !708, file: !30, line: 81, baseType: !20, size: 32, offset: 1792)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !708, file: !30, line: 81, baseType: !20, size: 32, offset: 1824)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !708, file: !30, line: 81, baseType: !20, size: 32, offset: 1856)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !708, file: !30, line: 82, baseType: !20, size: 32, offset: 1888)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !708, file: !30, line: 82, baseType: !20, size: 32, offset: 1920)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !708, file: !30, line: 82, baseType: !20, size: 32, offset: 1952)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !708, file: !30, line: 85, baseType: !20, size: 32, offset: 1984)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !708, file: !30, line: 85, baseType: !20, size: 32, offset: 2016)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !708, file: !30, line: 85, baseType: !20, size: 32, offset: 2048)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !708, file: !30, line: 85, baseType: !20, size: 32, offset: 2080)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !708, file: !30, line: 86, baseType: !20, size: 32, offset: 2112)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !708, file: !30, line: 86, baseType: !20, size: 32, offset: 2144)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !708, file: !30, line: 86, baseType: !20, size: 32, offset: 2176)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !708, file: !30, line: 86, baseType: !20, size: 32, offset: 2208)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !708, file: !30, line: 87, baseType: !20, size: 32, offset: 2240)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !708, file: !30, line: 87, baseType: !20, size: 32, offset: 2272)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !708, file: !30, line: 87, baseType: !20, size: 32, offset: 2304)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !708, file: !30, line: 87, baseType: !20, size: 32, offset: 2336)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !708, file: !30, line: 90, baseType: !20, size: 32, offset: 2368)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !708, file: !30, line: 93, baseType: !20, size: 32, offset: 2400)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !708, file: !30, line: 93, baseType: !20, size: 32, offset: 2432)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !708, file: !30, line: 93, baseType: !20, size: 32, offset: 2464)
!778 = !{!779}
!779 = !DISubrange(count: 18)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !631, file: !632, line: 123, baseType: !66, size: 16, offset: 4032)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !631, file: !632, line: 123, baseType: !66, size: 16, offset: 4048)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !631, file: !632, line: 123, baseType: !783, size: 32, offset: 4064)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 32, elements: !612)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !631, file: !632, line: 126, baseType: !785, size: 64, offset: 4096)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !35, line: 159, size: 448, elements: !787)
!787 = !{!788, !790, !791, !792, !793, !796}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !786, file: !35, line: 161, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 64, elements: !612)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !786, file: !35, line: 162, baseType: !789, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !786, file: !35, line: 163, baseType: !783, size: 32, offset: 128)
