; ModuleID = 'zlib/deflate.c'
source_filename = "zlib/deflate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.config_s = type { i16, i16, i16, i16, i32 (%struct.internal_state*, i32)* }
%struct.internal_state = type { %struct.z_stream_s*, i32, i8*, i64, i8*, i32, i32, %struct.gz_header_s*, i32, i8, i32, i32, i32, i32, i8*, i64, i16*, i16*, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [573 x %struct.ct_data_s], [61 x %struct.ct_data_s], [39 x %struct.ct_data_s], %struct.tree_desc_s, %struct.tree_desc_s, %struct.tree_desc_s, [16 x i16], [573 x i32], i32, i32, [573 x i8], i8*, i32, i32, i16*, i64, i64, i32, i32, i16, i32, i64 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }
%struct.ct_data_s = type { %union.anon, %union.anon.0 }
%union.anon = type { i16 }
%union.anon.0 = type { i16 }
%struct.tree_desc_s = type { %struct.ct_data_s*, i32, %struct.static_tree_desc_s* }
%struct.static_tree_desc_s = type { i32 }

@deflate_copyright = dso_local constant [68 x i8] c" deflate 1.2.6 Copyright 1995-2012 Jean-loup Gailly and Mark Adler \00", align 16, !dbg !0
@deflateInit2_.my_version = internal constant [6 x i8] c"1.2.6\00", align 1, !dbg !192

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "deflate_copyright", scope: !2, file: !3, line: 54, type: !222, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !191, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "zlib/deflate.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 66, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "need_more", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "block_done", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "finish_started", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "finish_done", value: 3, isUnsigned: true)
!12 = !{!13, !18, !22, !26, !53, !38, !97, !180, !175, !64, !50, !40, !6, !99, !109, !100, !21, !189, !112, !58}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !14, line: 80, baseType: !15)
!14 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !18, !21, !21}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !19, line: 383, baseType: !20)
!19 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !19, line: 367, baseType: !6)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !14, line: 81, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !18, !18}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "deflate_state", file: !28, line: 273, baseType: !29)
!28 = !DIFile(filename: "zlib/deflate.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !28, line: 97, size: 47488, elements: !30)
!30 = !{!31, !61, !62, !63, !66, !67, !68, !69, !88, !89, !90, !91, !92, !93, !94, !95, !96, !102, !103, !104, !105, !106, !107, !108, !110, !111, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !140, !144, !148, !161, !162, !163, !167, !169, !170, !171, !174, !177, !178, !179, !182, !183, !184, !185, !186, !187, !188}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !29, file: !28, line: 98, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !14, line: 106, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !14, line: 104, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !14, line: 85, size: 896, elements: !36)
!36 = !{!37, !42, !43, !46, !47, !48, !49, !52, !54, !55, !56, !57, !59, !60}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !35, file: !14, line: 86, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !19, line: 374, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !19, line: 365, baseType: !41)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !35, file: !14, line: 87, baseType: !21, size: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !35, file: !14, line: 88, baseType: !44, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !19, line: 368, baseType: !45)
!45 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !35, file: !14, line: 90, baseType: !38, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !35, file: !14, line: 91, baseType: !21, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !35, file: !14, line: 92, baseType: !44, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !35, file: !14, line: 94, baseType: !50, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !35, file: !14, line: 95, baseType: !53, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !35, file: !14, line: 97, baseType: !13, size: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !35, file: !14, line: 98, baseType: !22, size: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !35, file: !14, line: 99, baseType: !18, size: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !35, file: !14, line: 101, baseType: !58, size: 32, offset: 704)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !35, file: !14, line: 102, baseType: !44, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !35, file: !14, line: 103, baseType: !44, size: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !29, file: !28, line: 99, baseType: !58, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf", scope: !29, file: !28, line: 100, baseType: !38, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf_size", scope: !29, file: !28, line: 101, baseType: !64, size: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulg", file: !65, line: 45, baseType: !45)
!65 = !DIFile(filename: "zlib/zutil.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pending_out", scope: !29, file: !28, line: 102, baseType: !38, size: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !29, file: !28, line: 103, baseType: !21, size: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !29, file: !28, line: 104, baseType: !58, size: 32, offset: 352)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "gzhead", scope: !29, file: !28, line: 105, baseType: !70, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !14, line: 129, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !14, line: 127, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !14, line: 112, size: 640, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !73, file: !14, line: 113, baseType: !58, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !73, file: !14, line: 114, baseType: !44, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !73, file: !14, line: 115, baseType: !58, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !73, file: !14, line: 116, baseType: !58, size: 32, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !73, file: !14, line: 117, baseType: !38, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !73, file: !14, line: 118, baseType: !21, size: 32, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !73, file: !14, line: 119, baseType: !21, size: 32, offset: 288)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !14, line: 120, baseType: !38, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !73, file: !14, line: 121, baseType: !21, size: 32, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !73, file: !14, line: 122, baseType: !38, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !73, file: !14, line: 123, baseType: !21, size: 32, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !73, file: !14, line: 124, baseType: !58, size: 32, offset: 544)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !73, file: !14, line: 125, baseType: !58, size: 32, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "gzindex", scope: !29, file: !28, line: 106, baseType: !21, size: 32, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !29, file: !28, line: 107, baseType: !40, size: 8, offset: 480)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "last_flush", scope: !29, file: !28, line: 108, baseType: !58, size: 32, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "w_size", scope: !29, file: !28, line: 112, baseType: !21, size: 32, offset: 544)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "w_bits", scope: !29, file: !28, line: 113, baseType: !21, size: 32, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "w_mask", scope: !29, file: !28, line: 114, baseType: !21, size: 32, offset: 608)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !29, file: !28, line: 116, baseType: !38, size: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !29, file: !28, line: 126, baseType: !64, size: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !29, file: !28, line: 131, baseType: !97, size: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "Posf", file: !28, line: 90, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pos", file: !28, line: 89, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ush", file: !65, line: 43, baseType: !101)
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !29, file: !28, line: 137, baseType: !97, size: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ins_h", scope: !29, file: !28, line: 139, baseType: !21, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size", scope: !29, file: !28, line: 140, baseType: !21, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bits", scope: !29, file: !28, line: 141, baseType: !21, size: 32, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !29, file: !28, line: 142, baseType: !21, size: 32, offset: 992)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "hash_shift", scope: !29, file: !28, line: 144, baseType: !21, size: 32, offset: 1024)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !29, file: !28, line: 151, baseType: !109, size: 64, offset: 1088)
!109 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "match_length", scope: !29, file: !28, line: 156, baseType: !21, size: 32, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev_match", scope: !29, file: !28, line: 157, baseType: !112, size: 32, offset: 1184)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPos", file: !28, line: 91, baseType: !6)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "match_available", scope: !29, file: !28, line: 158, baseType: !58, size: 32, offset: 1216)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "strstart", scope: !29, file: !28, line: 159, baseType: !21, size: 32, offset: 1248)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "match_start", scope: !29, file: !28, line: 160, baseType: !21, size: 32, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "lookahead", scope: !29, file: !28, line: 161, baseType: !21, size: 32, offset: 1312)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev_length", scope: !29, file: !28, line: 163, baseType: !21, size: 32, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain_length", scope: !29, file: !28, line: 168, baseType: !21, size: 32, offset: 1376)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "max_lazy_match", scope: !29, file: !28, line: 174, baseType: !21, size: 32, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !29, file: !28, line: 185, baseType: !58, size: 32, offset: 1440)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !29, file: !28, line: 186, baseType: !58, size: 32, offset: 1472)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "good_match", scope: !29, file: !28, line: 188, baseType: !21, size: 32, offset: 1504)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nice_match", scope: !29, file: !28, line: 191, baseType: !58, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_ltree", scope: !29, file: !28, line: 195, baseType: !125, size: 18336, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 18336, elements: !138)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ct_data_s", file: !28, line: 65, size: 32, elements: !127)
!127 = !{!128, !133}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !126, file: !28, line: 69, baseType: !129, size: 16)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !28, line: 66, size: 16, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !129, file: !28, line: 67, baseType: !100, size: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !129, file: !28, line: 68, baseType: !100, size: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !126, file: !28, line: 73, baseType: !134, size: 16, offset: 16)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !28, line: 70, size: 16, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dad", scope: !134, file: !28, line: 71, baseType: !100, size: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !134, file: !28, line: 72, baseType: !100, size: 16)
!138 = !{!139}
!139 = !DISubrange(count: 573)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_dtree", scope: !29, file: !28, line: 196, baseType: !141, size: 1952, offset: 19904)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 1952, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 61)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bl_tree", scope: !29, file: !28, line: 197, baseType: !145, size: 1248, offset: 21856)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 1248, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 39)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "l_desc", scope: !29, file: !28, line: 199, baseType: !149, size: 192, offset: 23104)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_desc_s", file: !28, line: 83, size: 192, elements: !150)
!150 = !{!151, !154, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_tree", scope: !149, file: !28, line: 84, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_data", file: !28, line: 74, baseType: !126)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_code", scope: !149, file: !28, line: 85, baseType: !58, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "stat_desc", scope: !149, file: !28, line: 86, baseType: !156, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_tree_desc", file: !28, line: 81, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_tree_desc_s", file: !3, line: 156, size: 32, elements: !159)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !158, file: !3, line: 156, baseType: !58, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "d_desc", scope: !29, file: !28, line: 200, baseType: !149, size: 192, offset: 23296)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "bl_desc", scope: !29, file: !28, line: 201, baseType: !149, size: 192, offset: 23488)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "bl_count", scope: !29, file: !28, line: 203, baseType: !164, size: 256, offset: 23680)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 256, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 16)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !29, file: !28, line: 206, baseType: !168, size: 18336, offset: 23936)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 18336, elements: !138)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "heap_len", scope: !29, file: !28, line: 207, baseType: !58, size: 32, offset: 42272)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "heap_max", scope: !29, file: !28, line: 208, baseType: !58, size: 32, offset: 42304)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !29, file: !28, line: 213, baseType: !172, size: 4584, offset: 42336)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 4584, elements: !138)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uch", file: !65, line: 41, baseType: !41)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "l_buf", scope: !29, file: !28, line: 217, baseType: !175, size: 64, offset: 46976)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchf", file: !65, line: 42, baseType: !173)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "lit_bufsize", scope: !29, file: !28, line: 219, baseType: !21, size: 32, offset: 47040)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "last_lit", scope: !29, file: !28, line: 239, baseType: !21, size: 32, offset: 47072)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "d_buf", scope: !29, file: !28, line: 241, baseType: !180, size: 64, offset: 47104)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ushf", file: !65, line: 44, baseType: !100)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "opt_len", scope: !29, file: !28, line: 247, baseType: !64, size: 64, offset: 47168)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "static_len", scope: !29, file: !28, line: 248, baseType: !64, size: 64, offset: 47232)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !29, file: !28, line: 249, baseType: !21, size: 32, offset: 47296)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !29, file: !28, line: 250, baseType: !21, size: 32, offset: 47328)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bi_buf", scope: !29, file: !28, line: 257, baseType: !100, size: 16, offset: 47360)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "bi_valid", scope: !29, file: !28, line: 261, baseType: !58, size: 32, offset: 47392)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "high_water", scope: !29, file: !28, line: 266, baseType: !64, size: 64, offset: 47424)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "charf", file: !19, line: 376, baseType: !51)
!191 = !{!0, !192, !203}
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "my_version", scope: !194, file: !3, line: 227, type: !200, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "deflateInit2_", scope: !3, file: !3, line: 214, type: !195, scopeLine: 224, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !199)
!195 = !DISubroutineType(types: !196)
!196 = !{!58, !32, !58, !58, !58, !58, !58, !197, !58}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!199 = !{}
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 48, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 6)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "configuration_table", scope: !2, file: !3, line: 132, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 1280, elements: !220)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "config", file: !3, line: 124, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config_s", file: !3, line: 118, size: 128, elements: !209)
!209 = !{!210, !211, !212, !213, !214}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "good_length", scope: !208, file: !3, line: 119, baseType: !100, size: 16)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "max_lazy", scope: !208, file: !3, line: 120, baseType: !100, size: 16, offset: 16)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nice_length", scope: !208, file: !3, line: 121, baseType: !100, size: 16, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain", scope: !208, file: !3, line: 122, baseType: !100, size: 16, offset: 48)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !208, file: !3, line: 123, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "compress_func", file: !3, line: 73, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !26, !58}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_state", file: !3, line: 71, baseType: !5)
!220 = !{!221}
!221 = !DISubrange(count: 10)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 544, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 68)
!225 = !{i32 7, !"Dwarf Version", i32 4}
!226 = !{i32 2, !"Debug Info Version", i32 3}
!227 = !{i32 1, !"wchar_size", i32 4}
!228 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!229 = distinct !DISubprogram(name: "deflateInit_", scope: !3, file: !3, line: 202, type: !230, scopeLine: 207, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !199)
!230 = !DISubroutineType(types: !231)
!231 = !{!58, !32, !58, !197, !58}
!232 = !DILocalVariable(name: "strm", arg: 1, scope: !229, file: !3, line: 203, type: !32)
!233 = !DILocation(line: 203, column: 15, scope: !229)
!234 = !DILocalVariable(name: "level", arg: 2, scope: !229, file: !3, line: 204, type: !58)
!235 = !DILocation(line: 204, column: 9, scope: !229)
!236 = !DILocalVariable(name: "version", arg: 3, scope: !229, file: !3, line: 205, type: !197)
!237 = !DILocation(line: 205, column: 17, scope: !229)
!238 = !DILocalVariable(name: "stream_size", arg: 4, scope: !229, file: !3, line: 206, type: !58)
!239 = !DILocation(line: 206, column: 9, scope: !229)
!240 = !DILocation(line: 208, column: 26, scope: !229)
!241 = !DILocation(line: 208, column: 32, scope: !229)
!242 = !DILocation(line: 209, column: 46, scope: !229)
!243 = !DILocation(line: 209, column: 55, scope: !229)
!244 = !DILocation(line: 208, column: 12, scope: !229)
!245 = !DILocation(line: 208, column: 5, scope: !229)
!246 = !DILocalVariable(name: "strm", arg: 1, scope: !194, file: !3, line: 216, type: !32)
!247 = !DILocation(line: 216, column: 15, scope: !194)
!248 = !DILocalVariable(name: "level", arg: 2, scope: !194, file: !3, line: 217, type: !58)
!249 = !DILocation(line: 217, column: 10, scope: !194)
!250 = !DILocalVariable(name: "method", arg: 3, scope: !194, file: !3, line: 218, type: !58)
!251 = !DILocation(line: 218, column: 10, scope: !194)
!252 = !DILocalVariable(name: "windowBits", arg: 4, scope: !194, file: !3, line: 219, type: !58)
!253 = !DILocation(line: 219, column: 10, scope: !194)
!254 = !DILocalVariable(name: "memLevel", arg: 5, scope: !194, file: !3, line: 220, type: !58)
!255 = !DILocation(line: 220, column: 10, scope: !194)
!256 = !DILocalVariable(name: "strategy", arg: 6, scope: !194, file: !3, line: 221, type: !58)
!257 = !DILocation(line: 221, column: 10, scope: !194)
!258 = !DILocalVariable(name: "version", arg: 7, scope: !194, file: !3, line: 222, type: !197)
!259 = !DILocation(line: 222, column: 17, scope: !194)
!260 = !DILocalVariable(name: "stream_size", arg: 8, scope: !194, file: !3, line: 223, type: !58)
!261 = !DILocation(line: 223, column: 9, scope: !194)
!262 = !DILocalVariable(name: "s", scope: !194, file: !3, line: 225, type: !26)
!263 = !DILocation(line: 225, column: 20, scope: !194)
!264 = !DILocalVariable(name: "wrap", scope: !194, file: !3, line: 226, type: !58)
!265 = !DILocation(line: 226, column: 9, scope: !194)
!266 = !DILocalVariable(name: "overlay", scope: !194, file: !3, line: 229, type: !180)
!267 = !DILocation(line: 229, column: 11, scope: !194)
!268 = !DILocation(line: 234, column: 9, scope: !269)
!269 = distinct !DILexicalBlock(scope: !194, file: !3, line: 234, column: 9)
!270 = !DILocation(line: 234, column: 17, scope: !269)
!271 = !DILocation(line: 234, column: 27, scope: !269)
!272 = !DILocation(line: 234, column: 30, scope: !269)
