; ModuleID = 'blender/source/blender/blenkernel/intern/seqmodifier.c'
source_filename = "blender/source/blender/blenkernel/intern/seqmodifier.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SequenceModifierTypeInfo = type { [64 x i8], [64 x i8], i32, void (%struct.SequenceModifierData*)*, void (%struct.SequenceModifierData*)*, void (%struct.SequenceModifierData*, %struct.SequenceModifierData*)*, void (%struct.SequenceModifierData*, %struct.ImBuf*, %struct.ImBuf*)* }
%struct.SequenceModifierData = type { %struct.SequenceModifierData*, %struct.SequenceModifierData*, i32, i32, [64 x i8], i32, i32, %struct.Sequence*, %struct.Mask* }
%struct.Sequence = type { %struct.Sequence*, %struct.Sequence*, i8*, i8*, [64 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, float, i16, i16, i32, i32, %struct.Strip*, %struct.Ipo*, %struct.Scene*, %struct.Object*, %struct.MovieClip*, %struct.Mask*, %struct.anim*, float, float, %struct.Sequence*, %struct.Sequence*, %struct.Sequence*, %struct.ListBase, %struct.bSound*, i8*, float, float, float, float, i8*, i32, i32, i32, float, i32, i8, [3 x i8], %struct.ListBase }
%struct.Strip = type { %struct.Strip*, %struct.Strip*, i32, i32, i32, i32, %struct.StripElem*, [768 x i8], %struct.StripProxy*, %struct.StripCrop*, %struct.StripTransform*, %struct.StripColorBalance*, %struct.ColorManagedColorspaceSettings }

!22 = !DIEnumerator(name: "SEQ_EFFECT_NOT_LOADED", value: 512)
!23 = !DIEnumerator(name: "SEQ_FLAG_DELETE", value: 1024)
!24 = !DIEnumerator(name: "SEQ_FLIPX", value: 2048)
!25 = !DIEnumerator(name: "SEQ_FLIPY", value: 4096)
!26 = !DIEnumerator(name: "SEQ_MAKE_FLOAT", value: 8192)
!27 = !DIEnumerator(name: "SEQ_LOCK", value: 16384)
!28 = !DIEnumerator(name: "SEQ_USE_PROXY", value: 32768)
!29 = !DIEnumerator(name: "SEQ_USE_TRANSFORM", value: 65536)
!30 = !DIEnumerator(name: "SEQ_USE_CROP", value: 131072)
!31 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_DIR", value: 524288)
!32 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_FILE", value: 2097152)
!33 = !DIEnumerator(name: "SEQ_USE_EFFECT_DEFAULT_FADE", value: 4194304)
!34 = !DIEnumerator(name: "SEQ_USE_LINEAR_MODIFIERS", value: 8388608)
!35 = !DIEnumerator(name: "SEQ_AUDIO_VOLUME_ANIMATED", value: 16777216)
!36 = !DIEnumerator(name: "SEQ_AUDIO_PITCH_ANIMATED", value: 33554432)
!37 = !DIEnumerator(name: "SEQ_AUDIO_PAN_ANIMATED", value: 67108864)
!38 = !DIEnumerator(name: "SEQ_AUDIO_DRAW_WAVEFORM", value: 134217728)
!39 = !DIEnumerator(name: "SEQ_INVALID_EFFECT", value: -2147483648)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 404, baseType: !7, size: 32, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!42 = !DIEnumerator(name: "SEQ_TYPE_IMAGE", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "SEQ_TYPE_META", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "SEQ_TYPE_SCENE", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "SEQ_TYPE_MOVIE", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "SEQ_TYPE_SOUND_RAM", value: 4, isUnsigned: true)
!47 = !DIEnumerator(name: "SEQ_TYPE_SOUND_HD", value: 5, isUnsigned: true)
!48 = !DIEnumerator(name: "SEQ_TYPE_MOVIECLIP", value: 6, isUnsigned: true)
!49 = !DIEnumerator(name: "SEQ_TYPE_MASK", value: 7, isUnsigned: true)
!50 = !DIEnumerator(name: "SEQ_TYPE_EFFECT", value: 8, isUnsigned: true)
!51 = !DIEnumerator(name: "SEQ_TYPE_CROSS", value: 8, isUnsigned: true)
!52 = !DIEnumerator(name: "SEQ_TYPE_ADD", value: 9, isUnsigned: true)
!53 = !DIEnumerator(name: "SEQ_TYPE_SUB", value: 10, isUnsigned: true)
!54 = !DIEnumerator(name: "SEQ_TYPE_ALPHAOVER", value: 11, isUnsigned: true)
!55 = !DIEnumerator(name: "SEQ_TYPE_ALPHAUNDER", value: 12, isUnsigned: true)
!56 = !DIEnumerator(name: "SEQ_TYPE_GAMCROSS", value: 13, isUnsigned: true)
!57 = !DIEnumerator(name: "SEQ_TYPE_MUL", value: 14, isUnsigned: true)
!58 = !DIEnumerator(name: "SEQ_TYPE_OVERDROP", value: 15, isUnsigned: true)
!59 = !DIEnumerator(name: "SEQ_TYPE_WIPE", value: 25, isUnsigned: true)
!60 = !DIEnumerator(name: "SEQ_TYPE_GLOW", value: 26, isUnsigned: true)
!61 = !DIEnumerator(name: "SEQ_TYPE_TRANSFORM", value: 27, isUnsigned: true)
!62 = !DIEnumerator(name: "SEQ_TYPE_COLOR", value: 28, isUnsigned: true)
!63 = !DIEnumerator(name: "SEQ_TYPE_SPEED", value: 29, isUnsigned: true)
!64 = !DIEnumerator(name: "SEQ_TYPE_MULTICAM", value: 30, isUnsigned: true)
!65 = !DIEnumerator(name: "SEQ_TYPE_ADJUSTMENT", value: 31, isUnsigned: true)
!66 = !DIEnumerator(name: "SEQ_TYPE_GAUSSIAN_BLUR", value: 40, isUnsigned: true)
!67 = !DIEnumerator(name: "SEQ_TYPE_EFFECT_MAX", value: 40, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 450, baseType: !7, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75}
!70 = !DIEnumerator(name: "seqModifierType_ColorBalance", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "seqModifierType_Curves", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "seqModifierType_HueCorrect", value: 3, isUnsigned: true)
!73 = !DIEnumerator(name: "seqModifierType_BrightContrast", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "seqModifierType_Mask", value: 5, isUnsigned: true)
!75 = !DIEnumerator(name: "NUM_SEQUENCE_MODIFIER_TYPES", value: 6, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CurveMappingPreset", file: !77, line: 93, baseType: !7, size: 32, elements: !78)
!77 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!78 = !{!79, !80, !81, !82, !83, !84, !85}
!79 = !DIEnumerator(name: "CURVE_PRESET_LINE", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "CURVE_PRESET_SHARP", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "CURVE_PRESET_SMOOTH", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "CURVE_PRESET_MAX", value: 3, isUnsigned: true)
!83 = !DIEnumerator(name: "CURVE_PRESET_MID9", value: 4, isUnsigned: true)
!84 = !DIEnumerator(name: "CURVE_PRESET_ROUND", value: 5, isUnsigned: true)
!85 = !DIEnumerator(name: "CURVE_PRESET_ROOT", value: 6, isUnsigned: true)
!86 = !{!87, !88, !262, !318, !337, !325, !424, !130, !103, !426, !432, !439}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorBalanceModifierData", file: !6, line: 278, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBalanceModifierData", file: !6, line: 273, size: 1280, elements: !91)
!91 = !{!92, !260, !261}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !90, file: !6, line: 274, baseType: !93, size: 896)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "SequenceModifierData", file: !6, line: 271, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SequenceModifierData", file: !6, line: 261, size: 896, elements: !95)
!95 = !{!96, !98, !99, !100, !101, !106, !107, !108, !259}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !6, line: 262, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !94, file: !6, line: 262, baseType: !97, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !6, line: 263, baseType: !12, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !6, line: 263, baseType: !12, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !6, line: 264, baseType: !102, size: 512, offset: 192)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !104)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !{!105}
!105 = !DISubrange(count: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mask_input_type", scope: !94, file: !6, line: 267, baseType: !12, size: 32, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !94, file: !6, line: 267, baseType: !12, size: 32, offset: 736)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mask_sequence", scope: !94, file: !6, line: 269, baseType: !109, size: 64, offset: 768)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !6, line: 126, size: 2816, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !131, !132, !133, !135, !136, !137, !138, !213, !216, !219, !222, !225, !228, !229, !230, !231, !232, !233, !234, !241, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !258}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !6, line: 127, baseType: !109, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !6, line: 127, baseType: !109, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !110, file: !6, line: 128, baseType: !87, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !110, file: !6, line: 129, baseType: !87, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !6, line: 130, baseType: !102, size: 512, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !110, file: !6, line: 132, baseType: !12, size: 32, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !6, line: 132, baseType: !12, size: 32, offset: 800)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !110, file: !6, line: 133, baseType: !12, size: 32, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !110, file: !6, line: 134, baseType: !12, size: 32, offset: 864)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !110, file: !6, line: 134, baseType: !12, size: 32, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !110, file: !6, line: 134, baseType: !12, size: 32, offset: 928)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !110, file: !6, line: 135, baseType: !12, size: 32, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !110, file: !6, line: 135, baseType: !12, size: 32, offset: 992)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !110, file: !6, line: 136, baseType: !12, size: 32, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !110, file: !6, line: 136, baseType: !12, size: 32, offset: 1056)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !110, file: !6, line: 137, baseType: !12, size: 32, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !110, file: !6, line: 137, baseType: !12, size: 32, offset: 1120)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !110, file: !6, line: 138, baseType: !130, size: 32, offset: 1152)
!130 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !110, file: !6, line: 139, baseType: !130, size: 32, offset: 1184)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !110, file: !6, line: 139, baseType: !130, size: 32, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !110, file: !6, line: 141, baseType: !134, size: 16, offset: 1248)
!134 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !110, file: !6, line: 142, baseType: !134, size: 16, offset: 1264)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !110, file: !6, line: 143, baseType: !12, size: 32, offset: 1280)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !110, file: !6, line: 144, baseType: !12, size: 32, offset: 1312)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !110, file: !6, line: 146, baseType: !139, size: 64, offset: 1344)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !6, line: 114, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !6, line: 99, size: 7232, elements: !142)
!142 = !{!143, !145, !146, !147, !148, !149, !150, !161, !165, !179, !188, !195, !208}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !6, line: 100, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !6, line: 100, baseType: !144, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !141, file: !6, line: 101, baseType: !12, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !141, file: !6, line: 101, baseType: !12, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !141, file: !6, line: 102, baseType: !12, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !141, file: !6, line: 102, baseType: !12, size: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !141, file: !6, line: 103, baseType: !151, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !6, line: 59, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !6, line: 56, size: 2112, elements: !154)
!154 = !{!155, !159, !160}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !6, line: 57, baseType: !156, size: 2048)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 2048, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !153, file: !6, line: 58, baseType: !12, size: 32, offset: 2048)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !153, file: !6, line: 58, baseType: !12, size: 32, offset: 2080)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !141, file: !6, line: 106, baseType: !162, size: 6144, offset: 320)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 6144, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !141, file: !6, line: 107, baseType: !166, size: 64, offset: 6464)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !6, line: 97, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !6, line: 83, size: 8320, elements: !169)
!169 = !{!170, !171, !172, !175, !176, !177, !178}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !168, file: !6, line: 84, baseType: !162, size: 6144)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !168, file: !6, line: 87, baseType: !156, size: 2048, offset: 6144)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !168, file: !6, line: 88, baseType: !173, size: 64, offset: 8192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !6, line: 88, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !168, file: !6, line: 90, baseType: !134, size: 16, offset: 8256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !168, file: !6, line: 92, baseType: !134, size: 16, offset: 8272)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !168, file: !6, line: 93, baseType: !134, size: 16, offset: 8288)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !168, file: !6, line: 95, baseType: !134, size: 16, offset: 8304)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !141, file: !6, line: 108, baseType: !180, size: 64, offset: 6528)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !6, line: 66, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !6, line: 61, size: 128, elements: !183)
!183 = !{!184, !185, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !182, file: !6, line: 62, baseType: !12, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !182, file: !6, line: 63, baseType: !12, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !182, file: !6, line: 64, baseType: !12, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !182, file: !6, line: 65, baseType: !12, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !141, file: !6, line: 109, baseType: !189, size: 64, offset: 6592)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !6, line: 71, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !6, line: 68, size: 64, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !191, file: !6, line: 69, baseType: !12, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !191, file: !6, line: 70, baseType: !12, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !141, file: !6, line: 110, baseType: !196, size: 64, offset: 6656)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !6, line: 81, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !6, line: 73, size: 352, elements: !199)
!199 = !{!200, !204, !205, !206, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !198, file: !6, line: 74, baseType: !201, size: 96)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 96, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 3)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !198, file: !6, line: 75, baseType: !201, size: 96, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !198, file: !6, line: 76, baseType: !201, size: 96, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !198, file: !6, line: 77, baseType: !12, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !198, file: !6, line: 78, baseType: !12, size: 32, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !141, file: !6, line: 113, baseType: !209, size: 512, offset: 6720)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !77, line: 182, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !77, line: 180, size: 512, elements: !211)
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !77, line: 181, baseType: !102, size: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !110, file: !6, line: 148, baseType: !214, size: 64, offset: 1408)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !6, line: 49, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !110, file: !6, line: 151, baseType: !217, size: 64, offset: 1472)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !6, line: 50, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !110, file: !6, line: 152, baseType: !220, size: 64, offset: 1536)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 152, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !110, file: !6, line: 153, baseType: !223, size: 64, offset: 1600)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !6, line: 52, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !110, file: !6, line: 154, baseType: !226, size: 64, offset: 1664)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !6, line: 154, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !110, file: !6, line: 156, baseType: !173, size: 64, offset: 1728)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !110, file: !6, line: 158, baseType: !130, size: 32, offset: 1792)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !110, file: !6, line: 159, baseType: !130, size: 32, offset: 1824)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !110, file: !6, line: 162, baseType: !109, size: 64, offset: 1856)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !110, file: !6, line: 162, baseType: !109, size: 64, offset: 1920)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !110, file: !6, line: 162, baseType: !109, size: 64, offset: 1984)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !110, file: !6, line: 164, baseType: !235, size: 128, offset: 2048)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !236, line: 71, baseType: !237)
!236 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !236, line: 69, size: 128, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !237, file: !236, line: 70, baseType: !87, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !237, file: !236, line: 70, baseType: !87, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !110, file: !6, line: 166, baseType: !242, size: 64, offset: 2176)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !6, line: 51, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !110, file: !6, line: 167, baseType: !87, size: 64, offset: 2240)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !110, file: !6, line: 168, baseType: !130, size: 32, offset: 2304)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !110, file: !6, line: 170, baseType: !130, size: 32, offset: 2336)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !110, file: !6, line: 170, baseType: !130, size: 32, offset: 2368)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !110, file: !6, line: 171, baseType: !130, size: 32, offset: 2400)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !110, file: !6, line: 173, baseType: !87, size: 64, offset: 2432)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !110, file: !6, line: 175, baseType: !12, size: 32, offset: 2496)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !110, file: !6, line: 176, baseType: !12, size: 32, offset: 2528)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !110, file: !6, line: 179, baseType: !12, size: 32, offset: 2560)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !110, file: !6, line: 180, baseType: !130, size: 32, offset: 2592)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !110, file: !6, line: 183, baseType: !12, size: 32, offset: 2624)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !110, file: !6, line: 185, baseType: !103, size: 8, offset: 2656)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !110, file: !6, line: 186, baseType: !257, size: 24, offset: 2664)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 24, elements: !202)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !110, file: !6, line: 189, baseType: !235, size: 128, offset: 2688)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mask_id", scope: !94, file: !6, line: 270, baseType: !226, size: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !90, file: !6, line: 276, baseType: !197, size: 352, offset: 896)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "color_multiply", scope: !90, file: !6, line: 277, baseType: !130, size: 32, offset: 1248)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurvesModifierData", file: !6, line: 284, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurvesModifierData", file: !6, line: 280, size: 3968, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !264, file: !6, line: 281, baseType: !93, size: 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !264, file: !6, line: 283, baseType: !268, size: 3072, offset: 896)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !77, line: 72, size: 3072, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !283, !284, !314, !315, !316, !317}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !77, line: 73, baseType: !12, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !268, file: !77, line: 73, baseType: !12, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !268, file: !77, line: 74, baseType: !12, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !268, file: !77, line: 75, baseType: !12, size: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !268, file: !77, line: 77, baseType: !275, size: 128, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !276, line: 95, baseType: !277)
!276 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !276, line: 92, size: 128, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !277, file: !276, line: 93, baseType: !130, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !277, file: !276, line: 93, baseType: !130, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !277, file: !276, line: 94, baseType: !130, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !277, file: !276, line: 94, baseType: !130, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !268, file: !77, line: 77, baseType: !275, size: 128, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !268, file: !77, line: 79, baseType: !285, size: 2304, offset: 384)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 2304, elements: !312)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !77, line: 67, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !77, line: 55, size: 576, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !298, !299, !308, !309, !310, !311}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !287, file: !77, line: 56, baseType: !134, size: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !287, file: !77, line: 56, baseType: !134, size: 16, offset: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !287, file: !77, line: 58, baseType: !130, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !287, file: !77, line: 59, baseType: !130, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !287, file: !77, line: 59, baseType: !130, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !287, file: !77, line: 60, baseType: !295, size: 64, offset: 128)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 2)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !287, file: !77, line: 60, baseType: !295, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !287, file: !77, line: 61, baseType: !300, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !77, line: 47, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !77, line: 44, size: 96, elements: !303)
!303 = !{!304, !305, !306, !307}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !302, file: !77, line: 45, baseType: !130, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !302, file: !77, line: 45, baseType: !130, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !302, file: !77, line: 46, baseType: !134, size: 16, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !302, file: !77, line: 46, baseType: !134, size: 16, offset: 80)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !287, file: !77, line: 62, baseType: !300, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !287, file: !77, line: 64, baseType: !300, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !287, file: !77, line: 65, baseType: !295, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !287, file: !77, line: 66, baseType: !295, size: 64, offset: 512)
!312 = !{!313}
!313 = !DISubrange(count: 4)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !268, file: !77, line: 80, baseType: !201, size: 96, offset: 2688)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !268, file: !77, line: 80, baseType: !201, size: 96, offset: 2784)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !268, file: !77, line: 81, baseType: !201, size: 96, offset: 2880)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !268, file: !77, line: 83, baseType: !201, size: 96, offset: 2976)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierThread", file: !3, line: 77, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierThread", file: !3, line: 68, size: 448, elements: !321)
!321 = !{!322, !323, !324, !327, !328, !330, !331, !332}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !320, file: !3, line: 69, baseType: !12, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !320, file: !3, line: 69, baseType: !12, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !320, file: !3, line: 71, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mask_rect", scope: !320, file: !3, line: 71, baseType: !325, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !320, file: !3, line: 72, baseType: !329, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mask_rect_float", scope: !320, file: !3, line: 72, baseType: !329, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !320, file: !3, line: 74, baseType: !87, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "apply_callback", scope: !320, file: !3, line: 76, baseType: !333, size: 64, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "modifier_apply_threaded_cb", file: !3, line: 57, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !12, !12, !325, !329, !325, !329, !87}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierInitData", file: !3, line: 66, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierInitData", file: !3, line: 60, size: 256, elements: !340)
!340 = !{!341, !421, !422, !423}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !339, file: !3, line: 61, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !344, line: 141, baseType: !345)
!344 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !344, line: 70, size: 19840, elements: !346)
!346 = !{!347, !349, !350, !351, !352, !353, !354, !355, !356, !358, !359, !362, !363, !364, !365, !366, !368, !370, !371, !372, !376, !377, !378, !379, !380, !383, !384, !385, !389, !390, !393, !394, !395, !396, !397, !400, !401, !402, !405, !406, !414}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !344, line: 71, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !345, file: !344, line: 71, baseType: !348, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !345, file: !344, line: 74, baseType: !12, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !345, file: !344, line: 74, baseType: !12, size: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !345, file: !344, line: 79, baseType: !326, size: 8, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !345, file: !344, line: 80, baseType: !12, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !345, file: !344, line: 83, baseType: !12, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !345, file: !344, line: 84, baseType: !12, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !345, file: !344, line: 87, baseType: !357, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !345, file: !344, line: 88, baseType: !329, size: 64, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !345, file: !344, line: 93, baseType: !360, size: 128, offset: 448)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 128, elements: !296)
!361 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !345, file: !344, line: 96, baseType: !12, size: 32, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !345, file: !344, line: 96, baseType: !12, size: 32, offset: 608)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !345, file: !344, line: 97, baseType: !12, size: 32, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !345, file: !344, line: 97, baseType: !12, size: 32, offset: 672)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !345, file: !344, line: 98, baseType: !367, size: 64, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !345, file: !344, line: 101, baseType: !369, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !345, file: !344, line: 102, baseType: !329, size: 64, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !345, file: !344, line: 105, baseType: !130, size: 32, offset: 896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !345, file: !344, line: 108, baseType: !373, size: 1280, offset: 960)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 1280, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 20)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !345, file: !344, line: 109, baseType: !12, size: 32, offset: 2240)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !345, file: !344, line: 109, baseType: !12, size: 32, offset: 2272)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !345, file: !344, line: 112, baseType: !12, size: 32, offset: 2304)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !345, file: !344, line: 113, baseType: !12, size: 32, offset: 2336)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !345, file: !344, line: 114, baseType: !381, size: 64, offset: 2368)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !344, line: 50, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !345, file: !344, line: 115, baseType: !87, size: 64, offset: 2432)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !345, file: !344, line: 118, baseType: !12, size: 32, offset: 2496)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !345, file: !344, line: 119, baseType: !386, size: 8192, offset: 2528)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8192, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 1024)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !345, file: !344, line: 120, baseType: !386, size: 8192, offset: 10720)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !345, file: !344, line: 123, baseType: !391, size: 64, offset: 18944)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !344, line: 123, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !345, file: !344, line: 124, baseType: !12, size: 32, offset: 19008)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !345, file: !344, line: 127, baseType: !325, size: 64, offset: 19072)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !345, file: !344, line: 128, baseType: !7, size: 32, offset: 19136)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !345, file: !344, line: 129, baseType: !7, size: 32, offset: 19168)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !345, file: !344, line: 132, baseType: !398, size: 64, offset: 19200)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !344, line: 132, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !345, file: !344, line: 133, baseType: !398, size: 64, offset: 19264)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !345, file: !344, line: 134, baseType: !357, size: 64, offset: 19328)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !345, file: !344, line: 135, baseType: !403, size: 64, offset: 19392)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !344, line: 135, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !345, file: !344, line: 136, baseType: !12, size: 32, offset: 19456)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !345, file: !344, line: 137, baseType: !407, size: 128, offset: 19488)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !276, line: 89, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !276, line: 86, size: 128, elements: !409)
!409 = !{!410, !411, !412, !413}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !408, file: !276, line: 87, baseType: !12, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !408, file: !276, line: 87, baseType: !12, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !408, file: !276, line: 88, baseType: !12, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !408, file: !276, line: 88, baseType: !12, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !345, file: !344, line: 140, baseType: !415, size: 192, offset: 19648)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !344, line: 55, size: 192, elements: !416)
!416 = !{!417, !418, !419, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !415, file: !344, line: 56, baseType: !7, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !415, file: !344, line: 57, baseType: !7, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !344, line: 58, baseType: !325, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !415, file: !344, line: 59, baseType: !7, size: 32, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !339, file: !3, line: 62, baseType: !342, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !339, file: !3, line: 63, baseType: !87, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "apply_callback", scope: !339, file: !3, line: 65, baseType: !333, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapping", file: !77, line: 84, baseType: !268)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "HueCorrectModifierData", file: !6, line: 290, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HueCorrectModifierData", file: !6, line: 286, size: 3968, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !428, file: !6, line: 287, baseType: !93, size: 896)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !428, file: !6, line: 289, baseType: !268, size: 3072, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "BrightContrastModifierData", file: !6, line: 297, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BrightContrastModifierData", file: !6, line: 292, size: 960, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !434, file: !6, line: 293, baseType: !93, size: 896)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !434, file: !6, line: 295, baseType: !130, size: 32, offset: 896)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !434, file: !6, line: 296, baseType: !130, size: 32, offset: 928)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "BrightContrastThreadData", file: !3, line: 398, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BrightContrastThreadData", file: !3, line: 395, size: 64, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !441, file: !3, line: 396, baseType: !130, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !441, file: !3, line: 397, baseType: !130, size: 32, offset: 32)
!445 = !{!446, !0, !472, !474, !476, !478, !480}
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "modifiersTypes", scope: !2, file: !3, line: 52, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 384, elements: !470)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "SequenceModifierTypeInfo", file: !451, line: 417, baseType: !452)
!451 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sequencer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SequenceModifierTypeInfo", file: !451, line: 393, size: 1344, elements: !453)
!453 = !{!454, !455, !456, !457, !461, !462, !466}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !451, line: 395, baseType: !102, size: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "struct_name", scope: !452, file: !451, line: 398, baseType: !102, size: 512, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "struct_size", scope: !452, file: !451, line: 401, baseType: !12, size: 32, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !452, file: !451, line: 404, baseType: !458, size: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !97}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "free_data", scope: !452, file: !451, line: 410, baseType: !458, size: 64, offset: 1152)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "copy_data", scope: !452, file: !451, line: 413, baseType: !463, size: 64, offset: 1216)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !97, !97}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !452, file: !451, line: 416, baseType: !467, size: 64, offset: 1280)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !97, !348, !348}
!470 = !{!471}
!471 = !DISubrange(count: 6)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "seqModifier_ColorBalance", scope: !2, file: !3, line: 166, type: !450, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "seqModifier_Curves", scope: !2, file: !3, line: 275, type: !450, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "seqModifier_HueCorrect", scope: !2, file: !3, line: 383, type: !450, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "seqModifier_BrightContrast", scope: !2, file: !3, line: 480, type: !450, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "seqModifier_Mask", scope: !2, file: !3, line: 545, type: !450, isLocal: true, isDefinition: true)
!482 = !{i32 7, !"Dwarf Version", i32 4}
!483 = !{i32 2, !"Debug Info Version", i32 3}
!484 = !{i32 1, !"wchar_size", i32 4}
!485 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!486 = distinct !DISubprogram(name: "BKE_sequence_modifier_type_info_get", scope: !3, file: !3, line: 570, type: !487, scopeLine: 571, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !490)
!487 = !DISubroutineType(types: !488)
!488 = !{!489, !12}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!490 = !{}
!491 = !DILocalVariable(name: "type", arg: 1, scope: !486, file: !3, line: 570, type: !12)
!492 = !DILocation(line: 570, column: 67, scope: !486)
!493 = !DILocation(line: 572, column: 7, scope: !494)
!494 = distinct !DILexicalBlock(scope: !486, file: !3, line: 572, column: 6)
!495 = !DILocation(line: 572, column: 6, scope: !486)
!496 = !DILocation(line: 573, column: 3, scope: !497)
!497 = distinct !DILexicalBlock(scope: !494, file: !3, line: 572, column: 26)
!498 = !DILocation(line: 574, column: 21, scope: !497)
!499 = !DILocation(line: 575, column: 2, scope: !497)
!500 = !DILocation(line: 577, column: 24, scope: !486)
!501 = !DILocation(line: 577, column: 9, scope: !486)
!502 = !DILocation(line: 577, column: 2, scope: !486)
!503 = distinct !DISubprogram(name: "sequence_modifier_type_info_init", scope: !3, file: !3, line: 557, type: !504, scopeLine: 558, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !490)
!504 = !DISubroutineType(types: !505)
!505 = !{null}
!506 = !DILocation(line: 561, column: 2, scope: !503)
!507 = !DILocation(line: 562, column: 2, scope: !503)
!508 = !DILocation(line: 563, column: 2, scope: !503)
!509 = !DILocation(line: 564, column: 2, scope: !503)
!510 = !DILocation(line: 565, column: 2, scope: !503)
!511 = !DILocation(line: 568, column: 1, scope: !503)
!512 = distinct !DISubprogram(name: "BKE_sequence_modifier_new", scope: !3, file: !3, line: 580, type: !513, scopeLine: 581, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !490)
!513 = !DISubroutineType(types: !514)
!514 = !{!97, !515, !517, !12}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !6, line: 190, baseType: !110)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!519 = !DILocalVariable(name: "seq", arg: 1, scope: !512, file: !3, line: 580, type: !515)
!520 = !DILocation(line: 580, column: 59, scope: !512)
!521 = !DILocalVariable(name: "name", arg: 2, scope: !512, file: !3, line: 580, type: !517)
!522 = !DILocation(line: 580, column: 76, scope: !512)
!523 = !DILocalVariable(name: "type", arg: 3, scope: !512, file: !3, line: 580, type: !12)
!524 = !DILocation(line: 580, column: 86, scope: !512)
!525 = !DILocalVariable(name: "smd", scope: !512, file: !3, line: 582, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!527 = !DILocation(line: 582, column: 24, scope: !512)
!528 = !DILocalVariable(name: "smti", scope: !512, file: !3, line: 583, type: !449)
!529 = !DILocation(line: 583, column: 28, scope: !512)
!530 = !DILocation(line: 583, column: 71, scope: !512)
!531 = !DILocation(line: 583, column: 35, scope: !512)
!532 = !DILocation(line: 585, column: 8, scope: !512)
!533 = !DILocation(line: 585, column: 20, scope: !512)
!534 = !DILocation(line: 585, column: 26, scope: !512)
!535 = !DILocation(line: 585, column: 6, scope: !512)
!536 = !DILocation(line: 587, column: 14, scope: !512)
!537 = !DILocation(line: 587, column: 2, scope: !512)
!538 = !DILocation(line: 587, column: 7, scope: !512)
!539 = !DILocation(line: 587, column: 12, scope: !512)
!540 = !DILocation(line: 588, column: 2, scope: !512)
!541 = !DILocation(line: 588, column: 7, scope: !512)
!542 = !DILocation(line: 588, column: 12, scope: !512)
!543 = !DILocation(line: 590, column: 7, scope: !544)
!544 = distinct !DILexicalBlock(scope: !512, file: !3, line: 590, column: 6)
!545 = !DILocation(line: 590, column: 12, scope: !544)
!546 = !DILocation(line: 590, column: 16, scope: !544)
!547 = !DILocation(line: 590, column: 6, scope: !512)
!548 = !DILocation(line: 591, column: 15, scope: !544)
!549 = !DILocation(line: 591, column: 20, scope: !544)
!550 = !DILocation(line: 591, column: 26, scope: !544)
!551 = !DILocation(line: 591, column: 32, scope: !544)
!552 = !DILocation(line: 591, column: 3, scope: !544)
!553 = !DILocation(line: 593, column: 15, scope: !544)
!554 = !DILocation(line: 593, column: 20, scope: !544)
!555 = !DILocation(line: 593, column: 26, scope: !544)
!556 = !DILocation(line: 593, column: 3, scope: !544)
!557 = !DILocation(line: 595, column: 15, scope: !512)
!558 = !DILocation(line: 595, column: 20, scope: !512)
!559 = !DILocation(line: 595, column: 31, scope: !512)
!560 = !DILocation(line: 595, column: 2, scope: !512)
!561 = !DILocation(line: 597, column: 36, scope: !512)
!562 = !DILocation(line: 597, column: 41, scope: !512)
!563 = !DILocation(line: 597, column: 2, scope: !512)
!564 = !DILocation(line: 599, column: 6, scope: !565)
!565 = distinct !DILexicalBlock(scope: !512, file: !3, line: 599, column: 6)
!566 = !DILocation(line: 599, column: 12, scope: !565)
!567 = !DILocation(line: 599, column: 6, scope: !512)
!568 = !DILocation(line: 600, column: 3, scope: !565)
!569 = !DILocation(line: 600, column: 9, scope: !565)
!570 = !DILocation(line: 600, column: 19, scope: !565)
!571 = !DILocation(line: 602, column: 9, scope: !512)
!572 = !DILocation(line: 602, column: 2, scope: !512)
!573 = distinct !DISubprogram(name: "BKE_sequence_modifier_unique_name", scope: !3, file: !3, line: 639, type: !574, scopeLine: 640, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !490)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !515, !526}
!576 = !DILocalVariable(name: "seq", arg: 1, scope: !573, file: !3, line: 639, type: !515)
!577 = !DILocation(line: 639, column: 50, scope: !573)
!578 = !DILocalVariable(name: "smd", arg: 2, scope: !573, file: !3, line: 639, type: !526)
!579 = !DILocation(line: 639, column: 77, scope: !573)
!580 = !DILocalVariable(name: "smti", scope: !573, file: !3, line: 641, type: !449)
!581 = !DILocation(line: 641, column: 28, scope: !573)
!582 = !DILocation(line: 641, column: 71, scope: !573)
!583 = !DILocation(line: 641, column: 76, scope: !573)
!584 = !DILocation(line: 641, column: 35, scope: !573)
!585 = !DILocation(line: 643, column: 18, scope: !573)
!586 = !DILocation(line: 643, column: 23, scope: !573)
!587 = !DILocation(line: 643, column: 34, scope: !573)
!588 = !DILocation(line: 643, column: 39, scope: !573)
!589 = !DILocation(line: 643, column: 2, scope: !573)
!590 = !DILocation(line: 645, column: 1, scope: !573)
!591 = distinct !DISubprogram(name: "BKE_sequence_modifier_remove", scope: !3, file: !3, line: 605, type: !592, scopeLine: 606, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !490)
!592 = !DISubroutineType(types: !593)
!593 = !{!326, !515, !526}
!594 = !DILocalVariable(name: "seq", arg: 1, scope: !591, file: !3, line: 605, type: !515)
!595 = !DILocation(line: 605, column: 45, scope: !591)
!596 = !DILocalVariable(name: "smd", arg: 2, scope: !591, file: !3, line: 605, type: !526)
!597 = !DILocation(line: 605, column: 72, scope: !591)
!598 = !DILocation(line: 607, column: 21, scope: !599)
!599 = distinct !DILexicalBlock(scope: !591, file: !3, line: 607, column: 6)
!600 = !DILocation(line: 607, column: 26, scope: !599)
!601 = !DILocation(line: 607, column: 37, scope: !599)
!602 = !DILocation(line: 607, column: 6, scope: !599)
!603 = !DILocation(line: 607, column: 42, scope: !599)
!604 = !DILocation(line: 607, column: 6, scope: !591)
!605 = !DILocation(line: 608, column: 3, scope: !599)
!606 = !DILocation(line: 610, column: 15, scope: !591)
!607 = !DILocation(line: 610, column: 20, scope: !591)
!608 = !DILocation(line: 610, column: 31, scope: !591)
!609 = !DILocation(line: 610, column: 2, scope: !591)
!610 = !DILocation(line: 611, column: 29, scope: !591)
!611 = !DILocation(line: 611, column: 2, scope: !591)
!612 = !DILocation(line: 613, column: 2, scope: !591)
!613 = !DILocation(line: 614, column: 1, scope: !591)
!614 = distinct !DISubprogram(name: "BKE_sequence_modifier_free", scope: !3, file: !3, line: 628, type: !615, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !490)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !526}
!617 = !DILocalVariable(name: "smd", arg: 1, scope: !614, file: !3, line: 628, type: !526)
!618 = !DILocation(line: 628, column: 55, scope: !614)
!619 = !DILocalVariable(name: "smti", scope: !614, file: !3, line: 630, type: !449)
!620 = !DILocation(line: 630, column: 28, scope: !614)
!621 = !DILocation(line: 630, column: 71, scope: !614)
!622 = !DILocation(line: 630, column: 76, scope: !614)
!623 = !DILocation(line: 630, column: 35, scope: !614)
!624 = !DILocation(line: 632, column: 6, scope: !625)
!625 = distinct !DILexicalBlock(scope: !614, file: !3, line: 632, column: 6)
!626 = !DILocation(line: 632, column: 11, scope: !625)
!627 = !DILocation(line: 632, column: 14, scope: !625)
!628 = !DILocation(line: 632, column: 20, scope: !625)
!629 = !DILocation(line: 632, column: 6, scope: !614)
!630 = !DILocation(line: 633, column: 3, scope: !631)
!631 = distinct !DILexicalBlock(scope: !625, file: !3, line: 632, column: 31)
!632 = !DILocation(line: 633, column: 9, scope: !631)
!633 = !DILocation(line: 633, column: 19, scope: !631)
!634 = !DILocation(line: 634, column: 2, scope: !631)
!635 = !DILocation(line: 636, column: 2, scope: !614)
!636 = !DILocation(line: 636, column: 12, scope: !614)
!637 = !DILocation(line: 637, column: 1, scope: !614)
!638 = distinct !DISubprogram(name: "BKE_sequence_modifier_clear", scope: !3, file: !3, line: 616, type: !639, scopeLine: 617, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !490)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !515}
!641 = !DILocalVariable(name: "seq", arg: 1, scope: !638, file: !3, line: 616, type: !515)
!642 = !DILocation(line: 616, column: 44, scope: !638)
!643 = !DILocalVariable(name: "smd", scope: !638, file: !3, line: 618, type: !526)
!644 = !DILocation(line: 618, column: 24, scope: !638)
!645 = !DILocalVariable(name: "smd_next", scope: !638, file: !3, line: 618, type: !526)
!646 = !DILocation(line: 618, column: 30, scope: !638)
!647 = !DILocation(line: 620, column: 13, scope: !648)
!648 = distinct !DILexicalBlock(scope: !638, file: !3, line: 620, column: 2)
!649 = !DILocation(line: 620, column: 18, scope: !648)
!650 = !DILocation(line: 620, column: 28, scope: !648)
!651 = !DILocation(line: 620, column: 11, scope: !648)
!652 = !DILocation(line: 620, column: 7, scope: !648)
!653 = !DILocation(line: 620, column: 35, scope: !654)
!654 = distinct !DILexicalBlock(scope: !648, file: !3, line: 620, column: 2)
!655 = !DILocation(line: 620, column: 2, scope: !648)
!656 = !DILocation(line: 621, column: 14, scope: !657)
!657 = distinct !DILexicalBlock(scope: !654, file: !3, line: 620, column: 56)
!658 = !DILocation(line: 621, column: 19, scope: !657)
!659 = !DILocation(line: 621, column: 12, scope: !657)
!660 = !DILocation(line: 622, column: 30, scope: !657)
!661 = !DILocation(line: 622, column: 3, scope: !657)
!662 = !DILocation(line: 623, column: 2, scope: !657)
!663 = !DILocation(line: 620, column: 46, scope: !654)
!664 = !DILocation(line: 620, column: 44, scope: !654)
!665 = !DILocation(line: 620, column: 2, scope: !654)
!666 = distinct !{!666, !655, !667}
!667 = !DILocation(line: 623, column: 2, scope: !648)
!668 = !DILocation(line: 625, column: 22, scope: !638)
!669 = !DILocation(line: 625, column: 27, scope: !638)
!670 = !DILocation(line: 625, column: 2, scope: !638)
!671 = !DILocation(line: 626, column: 1, scope: !638)
!672 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !673, file: !673, line: 89, type: !674, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !490)
!673 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!674 = !DISubroutineType(types: !675)
!675 = !{null, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!677 = !DILocalVariable(name: "lb", arg: 1, scope: !672, file: !673, line: 89, type: !676)
!678 = !DILocation(line: 89, column: 53, scope: !672)
!679 = !DILocation(line: 89, column: 71, scope: !672)
!680 = !DILocation(line: 89, column: 75, scope: !672)
!681 = !DILocation(line: 89, column: 80, scope: !672)
!682 = !DILocation(line: 89, column: 59, scope: !672)
!683 = !DILocation(line: 89, column: 63, scope: !672)
!684 = !DILocation(line: 89, column: 69, scope: !672)
!685 = !DILocation(line: 89, column: 93, scope: !672)
!686 = distinct !DISubprogram(name: "BKE_sequence_modifier_find_by_name", scope: !3, file: !3, line: 647, type: !687, scopeLine: 648, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !490)
!687 = !DISubroutineType(types: !688)
!688 = !{!97, !515, !517}
!689 = !DILocalVariable(name: "seq", arg: 1, scope: !686, file: !3, line: 647, type: !515)
!690 = !DILocation(line: 647, column: 68, scope: !686)
!691 = !DILocalVariable(name: "name", arg: 2, scope: !686, file: !3, line: 647, type: !517)
!692 = !DILocation(line: 647, column: 85, scope: !686)
!693 = !DILocation(line: 649, column: 26, scope: !686)
!694 = !DILocation(line: 649, column: 31, scope: !686)
!695 = !DILocation(line: 649, column: 43, scope: !686)
!696 = !DILocation(line: 649, column: 9, scope: !686)
!697 = !DILocation(line: 649, column: 2, scope: !686)
!698 = distinct !DISubprogram(name: "BKE_sequence_modifier_apply_stack", scope: !3, file: !3, line: 652, type: !699, scopeLine: 653, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !490)
!699 = !DISubroutineType(types: !700)
!700 = !{!348, !701, !515, !342, !12}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "SeqRenderData", file: !451, line: 103, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SeqRenderData", file: !451, line: 92, size: 384, elements: !705)
!705 = !{!706, !709, !712, !713, !714, !715, !716, !717, !718, !719}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !704, file: !451, line: 93, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !451, line: 34, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bmain", scope: !704, file: !451, line: 94, baseType: !710, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !451, line: 38, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !704, file: !451, line: 95, baseType: !217, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !704, file: !451, line: 96, baseType: !12, size: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !704, file: !451, line: 97, baseType: !12, size: 32, offset: 224)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "preview_render_size", scope: !704, file: !451, line: 98, baseType: !12, size: 32, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "motion_blur_samples", scope: !704, file: !451, line: 99, baseType: !12, size: 32, offset: 288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "motion_blur_shutter", scope: !704, file: !451, line: 100, baseType: !130, size: 32, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "skip_cache", scope: !704, file: !451, line: 101, baseType: !326, size: 8, offset: 352)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "is_proxy_render", scope: !704, file: !451, line: 102, baseType: !326, size: 8, offset: 360)
!720 = !DILocalVariable(name: "context", arg: 1, scope: !698, file: !3, line: 652, type: !701)
!721 = !DILocation(line: 652, column: 63, scope: !698)
!722 = !DILocalVariable(name: "seq", arg: 2, scope: !698, file: !3, line: 652, type: !515)
!723 = !DILocation(line: 652, column: 82, scope: !698)
!724 = !DILocalVariable(name: "ibuf", arg: 3, scope: !698, file: !3, line: 652, type: !342)
!725 = !DILocation(line: 652, column: 94, scope: !698)
!726 = !DILocalVariable(name: "cfra", arg: 4, scope: !698, file: !3, line: 652, type: !12)
!727 = !DILocation(line: 652, column: 104, scope: !698)
!728 = !DILocalVariable(name: "smd", scope: !698, file: !3, line: 654, type: !526)
!729 = !DILocation(line: 654, column: 24, scope: !698)
!730 = !DILocalVariable(name: "processed_ibuf", scope: !698, file: !3, line: 655, type: !342)
!731 = !DILocation(line: 655, column: 9, scope: !698)
!732 = !DILocation(line: 655, column: 26, scope: !698)
!733 = !DILocation(line: 657, column: 6, scope: !734)
!734 = distinct !DILexicalBlock(scope: !698, file: !3, line: 657, column: 6)
!735 = !DILocation(line: 657, column: 11, scope: !734)
!736 = !DILocation(line: 657, column: 21, scope: !734)
!737 = !DILocation(line: 657, column: 27, scope: !734)
!738 = !DILocation(line: 657, column: 31, scope: !734)
!739 = !DILocation(line: 657, column: 36, scope: !734)
!740 = !DILocation(line: 657, column: 41, scope: !734)
!741 = !DILocation(line: 657, column: 6, scope: !698)
!742 = !DILocation(line: 658, column: 33, scope: !743)
!743 = distinct !DILexicalBlock(scope: !734, file: !3, line: 657, column: 70)
!744 = !DILocation(line: 658, column: 20, scope: !743)
!745 = !DILocation(line: 658, column: 18, scope: !743)
!746 = !DILocation(line: 659, column: 44, scope: !743)
!747 = !DILocation(line: 659, column: 53, scope: !743)
!748 = !DILocation(line: 659, column: 60, scope: !743)
!749 = !DILocation(line: 659, column: 3, scope: !743)
!750 = !DILocation(line: 660, column: 2, scope: !743)
!751 = !DILocation(line: 662, column: 13, scope: !752)
!752 = distinct !DILexicalBlock(scope: !698, file: !3, line: 662, column: 2)
!753 = !DILocation(line: 662, column: 18, scope: !752)
!754 = !DILocation(line: 662, column: 28, scope: !752)
!755 = !DILocation(line: 662, column: 11, scope: !752)
!756 = !DILocation(line: 662, column: 7, scope: !752)
!757 = !DILocation(line: 662, column: 35, scope: !758)
!758 = distinct !DILexicalBlock(scope: !752, file: !3, line: 662, column: 2)
!759 = !DILocation(line: 662, column: 2, scope: !752)
!760 = !DILocalVariable(name: "smti", scope: !761, file: !3, line: 663, type: !449)
!761 = distinct !DILexicalBlock(scope: !758, file: !3, line: 662, column: 57)
!762 = !DILocation(line: 663, column: 29, scope: !761)
!763 = !DILocation(line: 663, column: 72, scope: !761)
!764 = !DILocation(line: 663, column: 77, scope: !761)
!765 = !DILocation(line: 663, column: 36, scope: !761)
!766 = !DILocation(line: 666, column: 8, scope: !767)
!767 = distinct !DILexicalBlock(scope: !761, file: !3, line: 666, column: 7)
!768 = !DILocation(line: 666, column: 7, scope: !761)
!769 = !DILocation(line: 667, column: 4, scope: !767)
!770 = !DILocation(line: 670, column: 7, scope: !771)
!771 = distinct !DILexicalBlock(scope: !761, file: !3, line: 670, column: 7)
!772 = !DILocation(line: 670, column: 12, scope: !771)
!773 = !DILocation(line: 670, column: 17, scope: !771)
!774 = !DILocation(line: 670, column: 7, scope: !761)
!775 = !DILocation(line: 671, column: 4, scope: !771)
!776 = !DILocation(line: 673, column: 7, scope: !777)
!777 = distinct !DILexicalBlock(scope: !761, file: !3, line: 673, column: 7)
!778 = !DILocation(line: 673, column: 13, scope: !777)
!779 = !DILocation(line: 673, column: 7, scope: !761)
!780 = !DILocalVariable(name: "mask", scope: !781, file: !3, line: 674, type: !342)
!781 = distinct !DILexicalBlock(scope: !777, file: !3, line: 673, column: 20)
