; ModuleID = 'blender/source/blender/nodes/composite/nodes/node_composite_outputFile.c'
source_filename = "blender/source/blender/nodes/composite/nodes/node_composite_outputFile.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !71, globals: !142, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22, !27, !39}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketInOut", file: !23, line: 148, baseType: !10, size: 32, elements: !24)
!23 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !{!25, !26}
!25 = !DIEnumerator(name: "SOCK_IN", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "SOCK_OUT", value: 2, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !23, line: 135, baseType: !28, size: 32, elements: !29)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38}
!30 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!31 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!32 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!33 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!34 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!35 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!36 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!37 = !DIEnumerator(name: "SOCK_INT", value: 6)
!38 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !40, line: 107, baseType: !10, size: 32, elements: !41)
!40 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!42 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!47 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!48 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!49 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!50 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!51 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!52 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!53 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!54 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!55 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!56 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!57 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!58 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!59 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!60 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!61 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!62 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!63 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!64 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!65 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!66 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!67 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!68 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!69 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!70 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !75, line: 130, baseType: !76)
!75 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !75, line: 117, size: 960, elements: !77)
!77 = !{!78, !79, !80, !82, !101, !105, !107, !108, !109, !110}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !75, line: 118, baseType: !72, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !76, file: !75, line: 118, baseType: !72, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !76, file: !75, line: 119, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !76, file: !75, line: 120, baseType: !83, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !75, line: 136, size: 17600, elements: !85)
!85 = !{!86, !87, !88, !91, !96, !97, !98}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !84, file: !75, line: 137, baseType: !74, size: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !84, file: !75, line: 138, baseType: !73, size: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !84, file: !75, line: 139, baseType: !89, size: 64, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !75, line: 43, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !75, line: 140, baseType: !92, size: 8192, offset: 1088)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8192, elements: !94)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !{!95}
!95 = !DISubrange(count: 1024)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !84, file: !75, line: 141, baseType: !92, size: 8192, offset: 9280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !84, file: !75, line: 148, baseType: !83, size: 64, offset: 17472)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !84, file: !75, line: 150, baseType: !99, size: 64, offset: 17536)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !75, line: 45, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !75, line: 121, baseType: !102, size: 528, offset: 256)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 528, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 66)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !76, file: !75, line: 126, baseType: !106, size: 16, offset: 784)
!106 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !76, file: !75, line: 127, baseType: !28, size: 32, offset: 800)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !76, file: !75, line: 128, baseType: !28, size: 32, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !76, file: !75, line: 128, baseType: !28, size: 32, offset: 864)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !76, file: !75, line: 129, baseType: !111, size: 64, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !75, line: 75, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !75, line: 62, size: 1024, elements: !114)
!114 = !{!115, !117, !118, !119, !120, !121, !125, !126, !140, !141}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !75, line: 63, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !75, line: 63, baseType: !116, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !75, line: 64, baseType: !93, size: 8, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !113, file: !75, line: 64, baseType: !93, size: 8, offset: 136)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !75, line: 65, baseType: !106, size: 16, offset: 144)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !75, line: 66, baseType: !122, size: 512, offset: 160)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 512, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !113, file: !75, line: 67, baseType: !28, size: 32, offset: 672)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !75, line: 69, baseType: !127, size: 256, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !75, line: 60, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !75, line: 48, size: 256, elements: !129)
!129 = !{!130, !131, !138, !139}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !128, file: !75, line: 49, baseType: !72, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !128, file: !75, line: 58, baseType: !132, size: 128, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !133, line: 71, baseType: !134)
!133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !133, line: 69, size: 128, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !134, file: !133, line: 70, baseType: !72, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !134, file: !133, line: 70, baseType: !72, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !128, file: !75, line: 59, baseType: !28, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !128, file: !75, line: 59, baseType: !28, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !113, file: !75, line: 70, baseType: !28, size: 32, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !113, file: !75, line: 74, baseType: !28, size: 32, offset: 992)
!142 = !{!0}
!143 = !{}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeType", file: !145, line: 221, baseType: !146)
!145 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !145, line: 144, size: 6016, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !158, !159, !161, !162, !163, !164, !165, !166, !167, !168, !169, !2109, !2110, !2111, !2119, !2123, !2127, !2128, !2132, !2136, !2140, !2141, !2142, !2143, !2147, !2148, !2152, !2156, !2160, !2164, !2168, !2172, !2176, !2177, !2187, !2189, !2215, !2235}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !145, line: 145, baseType: !72, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !145, line: 145, baseType: !72, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !146, file: !145, line: 146, baseType: !106, size: 16, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !146, file: !145, line: 148, baseType: !122, size: 512, offset: 144)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !145, line: 149, baseType: !28, size: 32, offset: 672)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !146, file: !145, line: 151, baseType: !122, size: 512, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !146, file: !145, line: 152, baseType: !155, size: 2048, offset: 1216)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 2048, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !146, file: !145, line: 153, baseType: !28, size: 32, offset: 3264)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !146, file: !145, line: 155, baseType: !160, size: 32, offset: 3296)
!160 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !146, file: !145, line: 155, baseType: !160, size: 32, offset: 3328)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !146, file: !145, line: 155, baseType: !160, size: 32, offset: 3360)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !146, file: !145, line: 156, baseType: !160, size: 32, offset: 3392)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !146, file: !145, line: 156, baseType: !160, size: 32, offset: 3424)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !146, file: !145, line: 156, baseType: !160, size: 32, offset: 3456)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !146, file: !145, line: 157, baseType: !106, size: 16, offset: 3488)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !146, file: !145, line: 157, baseType: !106, size: 16, offset: 3504)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !146, file: !145, line: 157, baseType: !106, size: 16, offset: 3520)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !146, file: !145, line: 160, baseType: !170, size: 64, offset: 3584)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !145, line: 109, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !145, line: 98, size: 1408, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !2108}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !172, file: !145, line: 99, baseType: !28, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !172, file: !145, line: 99, baseType: !28, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !145, line: 100, baseType: !122, size: 512, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !172, file: !145, line: 101, baseType: !160, size: 32, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !172, file: !145, line: 101, baseType: !160, size: 32, offset: 608)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !172, file: !145, line: 101, baseType: !160, size: 32, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !172, file: !145, line: 101, baseType: !160, size: 32, offset: 672)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !172, file: !145, line: 102, baseType: !160, size: 32, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !172, file: !145, line: 102, baseType: !160, size: 32, offset: 736)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !172, file: !145, line: 103, baseType: !28, size: 32, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !172, file: !145, line: 104, baseType: !28, size: 32, offset: 800)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !172, file: !145, line: 107, baseType: !186, size: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !23, line: 87, size: 2816, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !23, line: 88, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !187, file: !23, line: 88, baseType: !186, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !187, file: !23, line: 88, baseType: !186, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !187, file: !23, line: 90, baseType: !111, size: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !187, file: !23, line: 92, baseType: !122, size: 512, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !23, line: 94, baseType: !122, size: 512, offset: 768)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !187, file: !23, line: 99, baseType: !72, size: 64, offset: 1280)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !187, file: !23, line: 101, baseType: !106, size: 16, offset: 1344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !187, file: !23, line: 101, baseType: !106, size: 16, offset: 1360)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !187, file: !23, line: 102, baseType: !106, size: 16, offset: 1376)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !187, file: !23, line: 103, baseType: !106, size: 16, offset: 1392)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !187, file: !23, line: 104, baseType: !201, size: 64, offset: 1408)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !145, line: 114, size: 1600, elements: !203)
!203 = !{!204, !205, !226, !231, !235, !239, !2068, !2072, !2073, !2077, !2078, !2079, !2080}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !202, file: !145, line: 115, baseType: !122, size: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !202, file: !145, line: 117, baseType: !206, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209, !211, !213, !213, !224}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !40, line: 44, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !145, line: 73, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !40, line: 55, size: 192, elements: !215)
!215 = !{!216, !220, !223}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !214, file: !40, line: 58, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !40, line: 56, size: 64, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !217, file: !40, line: 57, baseType: !72, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !40, line: 60, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !40, line: 41, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !40, line: 61, baseType: !72, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !202, file: !145, line: 118, baseType: !227, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !209, !213, !213, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !202, file: !145, line: 120, baseType: !232, size: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !209, !211, !213}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !202, file: !145, line: 121, baseType: !236, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !209, !213, !230}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !202, file: !145, line: 122, baseType: !240, size: 64, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !243, !186, !221}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !23, line: 328, size: 3456, elements: !245)
!245 = !{!246, !247, !251, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2042, !2047, !2048, !2051, !2055, !2059, !2063, !2064, !2065, !2066, !2067}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !244, file: !23, line: 329, baseType: !74, size: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !244, file: !23, line: 330, baseType: !248, size: 64, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !250, line: 43, flags: DIFlagFwdDecl)
!250 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !244, file: !23, line: 332, baseType: !252, size: 64, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !145, line: 283, size: 4096, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !264, !332, !1944, !1950, !1956, !1960, !1961, !1962, !1963, !1982, !1983}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !253, file: !145, line: 284, baseType: !28, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !253, file: !145, line: 285, baseType: !122, size: 512, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !253, file: !145, line: 287, baseType: !122, size: 512, offset: 544)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !253, file: !145, line: 288, baseType: !155, size: 2048, offset: 1056)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !253, file: !145, line: 289, baseType: !28, size: 32, offset: 3104)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !253, file: !145, line: 292, baseType: !261, size: 64, offset: 3136)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !243}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !253, file: !145, line: 293, baseType: !265, size: 64, offset: 3200)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !243, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !23, line: 167, size: 3712, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !324, !325, !326, !327, !328, !329}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !23, line: 168, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !269, file: !23, line: 168, baseType: !268, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !269, file: !23, line: 168, baseType: !268, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !269, file: !23, line: 170, baseType: !111, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !269, file: !23, line: 172, baseType: !276, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !269, file: !23, line: 173, baseType: !122, size: 512, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !23, line: 175, baseType: !122, size: 512, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !23, line: 176, baseType: !28, size: 32, offset: 1344)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !23, line: 177, baseType: !106, size: 16, offset: 1376)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !269, file: !23, line: 177, baseType: !106, size: 16, offset: 1392)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !269, file: !23, line: 178, baseType: !106, size: 16, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !269, file: !23, line: 178, baseType: !106, size: 16, offset: 1424)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !269, file: !23, line: 179, baseType: !106, size: 16, offset: 1440)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !269, file: !23, line: 179, baseType: !106, size: 16, offset: 1456)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !269, file: !23, line: 180, baseType: !106, size: 16, offset: 1472)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !269, file: !23, line: 181, baseType: !106, size: 16, offset: 1488)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !269, file: !23, line: 182, baseType: !289, size: 96, offset: 1504)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 96, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 3)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !269, file: !23, line: 184, baseType: !132, size: 128, offset: 1600)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !269, file: !23, line: 184, baseType: !132, size: 128, offset: 1728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !269, file: !23, line: 185, baseType: !268, size: 64, offset: 1856)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !269, file: !23, line: 186, baseType: !81, size: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !269, file: !23, line: 187, baseType: !72, size: 64, offset: 1984)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !269, file: !23, line: 188, baseType: !268, size: 64, offset: 2048)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !269, file: !23, line: 189, baseType: !132, size: 128, offset: 2112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !269, file: !23, line: 191, baseType: !160, size: 32, offset: 2240)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !269, file: !23, line: 191, baseType: !160, size: 32, offset: 2272)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !269, file: !23, line: 192, baseType: !160, size: 32, offset: 2304)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !269, file: !23, line: 192, baseType: !160, size: 32, offset: 2336)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !269, file: !23, line: 193, baseType: !160, size: 32, offset: 2368)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !269, file: !23, line: 194, baseType: !160, size: 32, offset: 2400)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !269, file: !23, line: 194, baseType: !160, size: 32, offset: 2432)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !269, file: !23, line: 196, baseType: !28, size: 32, offset: 2464)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !269, file: !23, line: 198, baseType: !122, size: 512, offset: 2496)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !269, file: !23, line: 199, baseType: !106, size: 16, offset: 3008)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !269, file: !23, line: 199, baseType: !106, size: 16, offset: 3024)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !269, file: !23, line: 200, baseType: !160, size: 32, offset: 3040)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !269, file: !23, line: 200, baseType: !160, size: 32, offset: 3072)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !269, file: !23, line: 202, baseType: !106, size: 16, offset: 3104)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !269, file: !23, line: 202, baseType: !106, size: 16, offset: 3120)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !269, file: !23, line: 203, baseType: !72, size: 64, offset: 3136)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !269, file: !23, line: 204, baseType: !316, size: 128, offset: 3200)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !317, line: 95, baseType: !318)
!317 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !317, line: 92, size: 128, elements: !319)
!319 = !{!320, !321, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !318, file: !317, line: 93, baseType: !160, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !318, file: !317, line: 93, baseType: !160, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !318, file: !317, line: 94, baseType: !160, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !318, file: !317, line: 94, baseType: !160, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !269, file: !23, line: 205, baseType: !316, size: 128, offset: 3328)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !269, file: !23, line: 206, baseType: !316, size: 128, offset: 3456)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !269, file: !23, line: 215, baseType: !106, size: 16, offset: 3584)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !269, file: !23, line: 215, baseType: !106, size: 16, offset: 3600)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !269, file: !23, line: 216, baseType: !28, size: 32, offset: 3616)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !269, file: !23, line: 217, baseType: !330, size: 64, offset: 3648)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !23, line: 51, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !253, file: !145, line: 294, baseType: !333, size: 64, offset: 3264)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !336, !72, !1940}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !338, line: 1216, size: 39680, elements: !339)
!338 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!339 = !{!340, !341, !342, !346, !1120, !1121, !1122, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1149, !1361, !1364, !1606, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1628, !1629, !1630, !1631, !1632, !1640, !1706, !1713, !1717, !1724, !1927, !1933, !1934, !1935, !1936, !1937}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !337, file: !338, line: 1217, baseType: !74, size: 960)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !337, file: !338, line: 1218, baseType: !248, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !337, file: !338, line: 1220, baseType: !343, size: 64, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !345, line: 44, flags: DIFlagFwdDecl)
!345 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !337, file: !338, line: 1221, baseType: !347, size: 64, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !349, line: 52, size: 4224, elements: !350)
!349 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !424, !1115, !1116, !1117, !1118, !1119}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !348, file: !349, line: 53, baseType: !74, size: 960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !348, file: !349, line: 54, baseType: !248, size: 64, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !348, file: !349, line: 56, baseType: !106, size: 16, offset: 1024)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !348, file: !349, line: 56, baseType: !106, size: 16, offset: 1040)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !348, file: !349, line: 57, baseType: !106, size: 16, offset: 1056)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !348, file: !349, line: 57, baseType: !106, size: 16, offset: 1072)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !348, file: !349, line: 59, baseType: !160, size: 32, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !348, file: !349, line: 59, baseType: !160, size: 32, offset: 1120)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !348, file: !349, line: 59, baseType: !160, size: 32, offset: 1152)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !348, file: !349, line: 60, baseType: !160, size: 32, offset: 1184)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !348, file: !349, line: 60, baseType: !160, size: 32, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !348, file: !349, line: 60, baseType: !160, size: 32, offset: 1248)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !348, file: !349, line: 61, baseType: !160, size: 32, offset: 1280)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !348, file: !349, line: 61, baseType: !160, size: 32, offset: 1312)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !348, file: !349, line: 61, baseType: !160, size: 32, offset: 1344)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !348, file: !349, line: 68, baseType: !160, size: 32, offset: 1376)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !348, file: !349, line: 68, baseType: !160, size: 32, offset: 1408)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !348, file: !349, line: 68, baseType: !160, size: 32, offset: 1440)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !348, file: !349, line: 69, baseType: !160, size: 32, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !348, file: !349, line: 69, baseType: !160, size: 32, offset: 1504)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !348, file: !349, line: 74, baseType: !160, size: 32, offset: 1536)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !348, file: !349, line: 79, baseType: !160, size: 32, offset: 1568)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !348, file: !349, line: 81, baseType: !106, size: 16, offset: 1600)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !348, file: !349, line: 91, baseType: !106, size: 16, offset: 1616)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !348, file: !349, line: 92, baseType: !106, size: 16, offset: 1632)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !348, file: !349, line: 93, baseType: !106, size: 16, offset: 1648)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !348, file: !349, line: 94, baseType: !106, size: 16, offset: 1664)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !348, file: !349, line: 94, baseType: !106, size: 16, offset: 1680)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !348, file: !349, line: 94, baseType: !106, size: 16, offset: 1696)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !348, file: !349, line: 94, baseType: !106, size: 16, offset: 1712)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !348, file: !349, line: 96, baseType: !160, size: 32, offset: 1728)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !348, file: !349, line: 96, baseType: !160, size: 32, offset: 1760)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !348, file: !349, line: 96, baseType: !160, size: 32, offset: 1792)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !348, file: !349, line: 96, baseType: !160, size: 32, offset: 1824)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !348, file: !349, line: 98, baseType: !160, size: 32, offset: 1856)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !348, file: !349, line: 98, baseType: !160, size: 32, offset: 1888)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !348, file: !349, line: 98, baseType: !160, size: 32, offset: 1920)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !348, file: !349, line: 98, baseType: !160, size: 32, offset: 1952)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !348, file: !349, line: 99, baseType: !160, size: 32, offset: 1984)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !348, file: !349, line: 99, baseType: !160, size: 32, offset: 2016)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !348, file: !349, line: 100, baseType: !160, size: 32, offset: 2048)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !348, file: !349, line: 100, baseType: !160, size: 32, offset: 2080)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !348, file: !349, line: 103, baseType: !106, size: 16, offset: 2112)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !348, file: !349, line: 103, baseType: !106, size: 16, offset: 2128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !348, file: !349, line: 103, baseType: !106, size: 16, offset: 2144)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !348, file: !349, line: 103, baseType: !106, size: 16, offset: 2160)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !348, file: !349, line: 106, baseType: !160, size: 32, offset: 2176)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !348, file: !349, line: 106, baseType: !160, size: 32, offset: 2208)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !348, file: !349, line: 106, baseType: !160, size: 32, offset: 2240)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !348, file: !349, line: 106, baseType: !160, size: 32, offset: 2272)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !348, file: !349, line: 107, baseType: !106, size: 16, offset: 2304)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !348, file: !349, line: 107, baseType: !106, size: 16, offset: 2320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !348, file: !349, line: 107, baseType: !106, size: 16, offset: 2336)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !348, file: !349, line: 107, baseType: !106, size: 16, offset: 2352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !348, file: !349, line: 108, baseType: !160, size: 32, offset: 2368)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !348, file: !349, line: 108, baseType: !160, size: 32, offset: 2400)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !348, file: !349, line: 109, baseType: !160, size: 32, offset: 2432)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !348, file: !349, line: 109, baseType: !160, size: 32, offset: 2464)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !348, file: !349, line: 110, baseType: !160, size: 32, offset: 2496)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !348, file: !349, line: 110, baseType: !160, size: 32, offset: 2528)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !348, file: !349, line: 110, baseType: !160, size: 32, offset: 2560)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !348, file: !349, line: 111, baseType: !106, size: 16, offset: 2592)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !348, file: !349, line: 111, baseType: !106, size: 16, offset: 2608)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !348, file: !349, line: 112, baseType: !106, size: 16, offset: 2624)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !348, file: !349, line: 112, baseType: !106, size: 16, offset: 2640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !348, file: !349, line: 112, baseType: !106, size: 16, offset: 2656)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !348, file: !349, line: 115, baseType: !106, size: 16, offset: 2672)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !348, file: !349, line: 118, baseType: !230, size: 64, offset: 2688)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !348, file: !349, line: 118, baseType: !230, size: 64, offset: 2752)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !348, file: !349, line: 121, baseType: !421, size: 64, offset: 2816)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !423, line: 46, flags: DIFlagFwdDecl)
!423 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !348, file: !349, line: 122, baseType: !425, size: 1152, offset: 2880)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 1152, elements: !1113)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !423, line: 57, size: 2496, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !427, file: !423, line: 59, baseType: !106, size: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !427, file: !423, line: 59, baseType: !106, size: 16, offset: 16)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !427, file: !423, line: 59, baseType: !106, size: 16, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !427, file: !423, line: 59, baseType: !106, size: 16, offset: 48)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !427, file: !423, line: 60, baseType: !343, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !427, file: !423, line: 61, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !423, line: 202, size: 3328, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !507, !508, !509, !858, !859, !954, !955, !1023, !1044, !1052, !1053}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !436, file: !423, line: 203, baseType: !74, size: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !436, file: !423, line: 204, baseType: !248, size: 64, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !436, file: !423, line: 206, baseType: !160, size: 32, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !436, file: !423, line: 206, baseType: !160, size: 32, offset: 1056)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !436, file: !423, line: 207, baseType: !160, size: 32, offset: 1088)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !436, file: !423, line: 207, baseType: !160, size: 32, offset: 1120)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !436, file: !423, line: 207, baseType: !160, size: 32, offset: 1152)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !436, file: !423, line: 207, baseType: !160, size: 32, offset: 1184)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !436, file: !423, line: 207, baseType: !160, size: 32, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !436, file: !423, line: 207, baseType: !160, size: 32, offset: 1248)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !436, file: !423, line: 208, baseType: !160, size: 32, offset: 1280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !436, file: !423, line: 208, baseType: !160, size: 32, offset: 1312)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !436, file: !423, line: 211, baseType: !160, size: 32, offset: 1344)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !436, file: !423, line: 211, baseType: !160, size: 32, offset: 1376)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !436, file: !423, line: 211, baseType: !160, size: 32, offset: 1408)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !436, file: !423, line: 211, baseType: !160, size: 32, offset: 1440)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !436, file: !423, line: 211, baseType: !160, size: 32, offset: 1472)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !436, file: !423, line: 214, baseType: !160, size: 32, offset: 1504)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !436, file: !423, line: 214, baseType: !160, size: 32, offset: 1536)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !436, file: !423, line: 217, baseType: !160, size: 32, offset: 1568)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !436, file: !423, line: 218, baseType: !160, size: 32, offset: 1600)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !436, file: !423, line: 219, baseType: !160, size: 32, offset: 1632)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !436, file: !423, line: 220, baseType: !160, size: 32, offset: 1664)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !436, file: !423, line: 221, baseType: !160, size: 32, offset: 1696)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !436, file: !423, line: 222, baseType: !106, size: 16, offset: 1728)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !436, file: !423, line: 222, baseType: !106, size: 16, offset: 1744)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !436, file: !423, line: 224, baseType: !106, size: 16, offset: 1760)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !436, file: !423, line: 224, baseType: !106, size: 16, offset: 1776)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !436, file: !423, line: 227, baseType: !106, size: 16, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !436, file: !423, line: 227, baseType: !106, size: 16, offset: 1808)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !436, file: !423, line: 229, baseType: !106, size: 16, offset: 1824)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !423, line: 229, baseType: !106, size: 16, offset: 1840)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !423, line: 230, baseType: !106, size: 16, offset: 1856)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !436, file: !423, line: 230, baseType: !106, size: 16, offset: 1872)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !436, file: !423, line: 232, baseType: !160, size: 32, offset: 1888)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !436, file: !423, line: 232, baseType: !160, size: 32, offset: 1920)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !436, file: !423, line: 232, baseType: !160, size: 32, offset: 1952)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !436, file: !423, line: 232, baseType: !160, size: 32, offset: 1984)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !436, file: !423, line: 233, baseType: !28, size: 32, offset: 2016)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !436, file: !423, line: 234, baseType: !28, size: 32, offset: 2048)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !436, file: !423, line: 235, baseType: !106, size: 16, offset: 2080)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !436, file: !423, line: 235, baseType: !106, size: 16, offset: 2096)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !436, file: !423, line: 236, baseType: !106, size: 16, offset: 2112)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !436, file: !423, line: 239, baseType: !106, size: 16, offset: 2128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !436, file: !423, line: 240, baseType: !28, size: 32, offset: 2144)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !436, file: !423, line: 241, baseType: !28, size: 32, offset: 2176)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !436, file: !423, line: 241, baseType: !28, size: 32, offset: 2208)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !436, file: !423, line: 241, baseType: !28, size: 32, offset: 2240)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !436, file: !423, line: 243, baseType: !160, size: 32, offset: 2272)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !436, file: !423, line: 243, baseType: !160, size: 32, offset: 2304)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !436, file: !423, line: 244, baseType: !160, size: 32, offset: 2336)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !436, file: !423, line: 246, baseType: !490, size: 320, offset: 2368)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !491, line: 50, size: 320, elements: !492)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !490, file: !491, line: 51, baseType: !336, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !490, file: !491, line: 53, baseType: !28, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !490, file: !491, line: 54, baseType: !28, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !490, file: !491, line: 55, baseType: !28, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !490, file: !491, line: 55, baseType: !28, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !490, file: !491, line: 56, baseType: !93, size: 8, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !490, file: !491, line: 56, baseType: !93, size: 8, offset: 200)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !490, file: !491, line: 57, baseType: !93, size: 8, offset: 208)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !490, file: !491, line: 57, baseType: !93, size: 8, offset: 216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !490, file: !491, line: 59, baseType: !106, size: 16, offset: 224)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !490, file: !491, line: 59, baseType: !106, size: 16, offset: 240)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !490, file: !491, line: 59, baseType: !106, size: 16, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !491, line: 61, baseType: !106, size: 16, offset: 272)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !490, file: !491, line: 63, baseType: !28, size: 32, offset: 288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !436, file: !423, line: 248, baseType: !243, size: 64, offset: 2688)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !436, file: !423, line: 249, baseType: !421, size: 64, offset: 2752)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !436, file: !423, line: 250, baseType: !510, size: 64, offset: 2816)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !491, line: 77, size: 15424, elements: !512)
!512 = !{!513, !514, !515, !518, !521, !524, !808, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !847, !848, !852}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !511, file: !491, line: 78, baseType: !74, size: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !511, file: !491, line: 80, baseType: !92, size: 8192, offset: 960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !511, file: !491, line: 82, baseType: !516, size: 64, offset: 9152)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !491, line: 43, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !511, file: !491, line: 83, baseType: !519, size: 64, offset: 9216)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !75, line: 46, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !511, file: !491, line: 86, baseType: !522, size: 64, offset: 9280)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !250, line: 42, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !511, file: !491, line: 87, baseType: !525, size: 64, offset: 9344)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !527, line: 110, size: 1152, elements: !528)
!527 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!528 = !{!529, !530, !531, !532, !533, !534, !535, !537, !538, !539, !547, !548, !549, !550, !552, !804, !805, !806, !807}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !527, line: 111, baseType: !525, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !526, file: !527, line: 111, baseType: !525, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !526, file: !527, line: 114, baseType: !28, size: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !526, file: !527, line: 114, baseType: !28, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !526, file: !527, line: 115, baseType: !106, size: 16, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !526, file: !527, line: 115, baseType: !106, size: 16, offset: 208)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !526, file: !527, line: 118, baseType: !536, size: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !526, file: !527, line: 120, baseType: !230, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !526, file: !527, line: 122, baseType: !230, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !526, file: !527, line: 125, baseType: !540, size: 128, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !317, line: 89, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !317, line: 86, size: 128, elements: !542)
!542 = !{!543, !544, !545, !546}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !541, file: !317, line: 87, baseType: !28, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !541, file: !317, line: 87, baseType: !28, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !541, file: !317, line: 88, baseType: !28, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !541, file: !317, line: 88, baseType: !28, size: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !526, file: !527, line: 127, baseType: !28, size: 32, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !526, file: !527, line: 127, baseType: !28, size: 32, offset: 608)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !526, file: !527, line: 130, baseType: !132, size: 128, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !526, file: !527, line: 133, baseType: !551, size: 128, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !540)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !526, file: !527, line: 134, baseType: !553, size: 64, offset: 896)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !527, line: 108, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !527, line: 85, size: 1600, elements: !557)
!557 = !{!558, !560, !561, !565, !566, !567, !568, !569, !570, !571, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !556, file: !527, line: 86, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !556, file: !527, line: 86, baseType: !559, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !556, file: !527, line: 89, baseType: !562, size: 592, offset: 128)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 592, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 74)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !556, file: !527, line: 90, baseType: !10, size: 32, offset: 736)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !556, file: !527, line: 90, baseType: !10, size: 32, offset: 768)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !556, file: !527, line: 90, baseType: !10, size: 32, offset: 800)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !556, file: !527, line: 91, baseType: !28, size: 32, offset: 832)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !556, file: !527, line: 91, baseType: !28, size: 32, offset: 864)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !556, file: !527, line: 91, baseType: !28, size: 32, offset: 896)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !556, file: !527, line: 93, baseType: !572, size: 64, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !574, line: 93, size: 7552, elements: !575)
!574 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !624, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !693, !694, !695, !696, !697, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !739, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !785, !794}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !573, file: !574, line: 94, baseType: !74, size: 960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !573, file: !574, line: 95, baseType: !248, size: 64, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !573, file: !574, line: 97, baseType: !106, size: 16, offset: 1024)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !573, file: !574, line: 97, baseType: !106, size: 16, offset: 1040)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !573, file: !574, line: 99, baseType: !160, size: 32, offset: 1056)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !573, file: !574, line: 99, baseType: !160, size: 32, offset: 1088)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !573, file: !574, line: 99, baseType: !160, size: 32, offset: 1120)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !573, file: !574, line: 100, baseType: !160, size: 32, offset: 1152)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !573, file: !574, line: 100, baseType: !160, size: 32, offset: 1184)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !573, file: !574, line: 100, baseType: !160, size: 32, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !573, file: !574, line: 101, baseType: !160, size: 32, offset: 1248)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !573, file: !574, line: 101, baseType: !160, size: 32, offset: 1280)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !573, file: !574, line: 101, baseType: !160, size: 32, offset: 1312)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !573, file: !574, line: 102, baseType: !160, size: 32, offset: 1344)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !573, file: !574, line: 102, baseType: !160, size: 32, offset: 1376)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !573, file: !574, line: 102, baseType: !160, size: 32, offset: 1408)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !573, file: !574, line: 103, baseType: !160, size: 32, offset: 1440)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !573, file: !574, line: 103, baseType: !160, size: 32, offset: 1472)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !573, file: !574, line: 103, baseType: !160, size: 32, offset: 1504)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !573, file: !574, line: 103, baseType: !160, size: 32, offset: 1536)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !573, file: !574, line: 103, baseType: !160, size: 32, offset: 1568)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !573, file: !574, line: 104, baseType: !160, size: 32, offset: 1600)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !573, file: !574, line: 104, baseType: !160, size: 32, offset: 1632)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !573, file: !574, line: 104, baseType: !160, size: 32, offset: 1664)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !573, file: !574, line: 104, baseType: !160, size: 32, offset: 1696)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !573, file: !574, line: 104, baseType: !160, size: 32, offset: 1728)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !573, file: !574, line: 105, baseType: !160, size: 32, offset: 1760)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !573, file: !574, line: 108, baseType: !604, size: 704, offset: 1792)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !574, line: 53, size: 704, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !604, file: !574, line: 54, baseType: !160, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !604, file: !574, line: 55, baseType: !160, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !604, file: !574, line: 56, baseType: !160, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !604, file: !574, line: 57, baseType: !160, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !604, file: !574, line: 59, baseType: !289, size: 96, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !604, file: !574, line: 60, baseType: !289, size: 96, offset: 224)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !604, file: !574, line: 61, baseType: !289, size: 96, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !604, file: !574, line: 63, baseType: !160, size: 32, offset: 416)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !604, file: !574, line: 64, baseType: !160, size: 32, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !604, file: !574, line: 65, baseType: !160, size: 32, offset: 480)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !604, file: !574, line: 67, baseType: !106, size: 16, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !604, file: !574, line: 68, baseType: !106, size: 16, offset: 528)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !604, file: !574, line: 69, baseType: !106, size: 16, offset: 544)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !604, file: !574, line: 70, baseType: !106, size: 16, offset: 560)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !604, file: !574, line: 72, baseType: !160, size: 32, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !604, file: !574, line: 73, baseType: !160, size: 32, offset: 608)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !604, file: !574, line: 74, baseType: !160, size: 32, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !604, file: !574, line: 75, baseType: !160, size: 32, offset: 672)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !573, file: !574, line: 109, baseType: !625, size: 128, offset: 2496)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !574, line: 79, size: 128, elements: !626)
!626 = !{!627, !628, !629, !630}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !625, file: !574, line: 80, baseType: !28, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !625, file: !574, line: 81, baseType: !28, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !625, file: !574, line: 82, baseType: !28, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !625, file: !574, line: 83, baseType: !28, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !573, file: !574, line: 111, baseType: !160, size: 32, offset: 2624)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !573, file: !574, line: 111, baseType: !160, size: 32, offset: 2656)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !573, file: !574, line: 112, baseType: !160, size: 32, offset: 2688)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !573, file: !574, line: 112, baseType: !160, size: 32, offset: 2720)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !573, file: !574, line: 113, baseType: !160, size: 32, offset: 2752)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !573, file: !574, line: 114, baseType: !160, size: 32, offset: 2784)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !573, file: !574, line: 114, baseType: !160, size: 32, offset: 2816)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !573, file: !574, line: 115, baseType: !106, size: 16, offset: 2848)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !573, file: !574, line: 115, baseType: !106, size: 16, offset: 2864)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !573, file: !574, line: 116, baseType: !106, size: 16, offset: 2880)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !573, file: !574, line: 117, baseType: !93, size: 8, offset: 2896)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !573, file: !574, line: 117, baseType: !93, size: 8, offset: 2904)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !573, file: !574, line: 119, baseType: !160, size: 32, offset: 2912)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !573, file: !574, line: 119, baseType: !160, size: 32, offset: 2944)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !573, file: !574, line: 120, baseType: !106, size: 16, offset: 2976)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !573, file: !574, line: 120, baseType: !106, size: 16, offset: 2992)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !573, file: !574, line: 121, baseType: !160, size: 32, offset: 3008)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !573, file: !574, line: 121, baseType: !160, size: 32, offset: 3040)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !573, file: !574, line: 122, baseType: !160, size: 32, offset: 3072)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !573, file: !574, line: 123, baseType: !160, size: 32, offset: 3104)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !573, file: !574, line: 124, baseType: !106, size: 16, offset: 3136)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !573, file: !574, line: 125, baseType: !106, size: 16, offset: 3152)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !573, file: !574, line: 127, baseType: !28, size: 32, offset: 3168)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !573, file: !574, line: 127, baseType: !28, size: 32, offset: 3200)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !573, file: !574, line: 128, baseType: !28, size: 32, offset: 3232)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !573, file: !574, line: 128, baseType: !28, size: 32, offset: 3264)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !573, file: !574, line: 129, baseType: !106, size: 16, offset: 3296)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !573, file: !574, line: 129, baseType: !106, size: 16, offset: 3312)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !573, file: !574, line: 129, baseType: !106, size: 16, offset: 3328)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !573, file: !574, line: 129, baseType: !106, size: 16, offset: 3344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !573, file: !574, line: 130, baseType: !160, size: 32, offset: 3360)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !573, file: !574, line: 130, baseType: !160, size: 32, offset: 3392)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !573, file: !574, line: 130, baseType: !160, size: 32, offset: 3424)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !573, file: !574, line: 130, baseType: !160, size: 32, offset: 3456)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !573, file: !574, line: 131, baseType: !160, size: 32, offset: 3488)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !573, file: !574, line: 131, baseType: !160, size: 32, offset: 3520)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !573, file: !574, line: 131, baseType: !160, size: 32, offset: 3552)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !573, file: !574, line: 131, baseType: !160, size: 32, offset: 3584)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !573, file: !574, line: 132, baseType: !160, size: 32, offset: 3616)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !573, file: !574, line: 132, baseType: !160, size: 32, offset: 3648)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !573, file: !574, line: 133, baseType: !122, size: 512, offset: 3680)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !573, file: !574, line: 135, baseType: !160, size: 32, offset: 4192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !573, file: !574, line: 136, baseType: !160, size: 32, offset: 4224)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !573, file: !574, line: 137, baseType: !160, size: 32, offset: 4256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !573, file: !574, line: 138, baseType: !28, size: 32, offset: 4288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !573, file: !574, line: 141, baseType: !93, size: 8, offset: 4320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !573, file: !574, line: 141, baseType: !93, size: 8, offset: 4328)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !573, file: !574, line: 141, baseType: !93, size: 8, offset: 4336)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !573, file: !574, line: 141, baseType: !93, size: 8, offset: 4344)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !573, file: !574, line: 142, baseType: !106, size: 16, offset: 4352)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !573, file: !574, line: 142, baseType: !106, size: 16, offset: 4368)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !573, file: !574, line: 142, baseType: !106, size: 16, offset: 4384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !573, file: !574, line: 145, baseType: !93, size: 8, offset: 4400)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !573, file: !574, line: 145, baseType: !93, size: 8, offset: 4408)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !573, file: !574, line: 148, baseType: !106, size: 16, offset: 4416)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !573, file: !574, line: 148, baseType: !106, size: 16, offset: 4432)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !573, file: !574, line: 149, baseType: !160, size: 32, offset: 4448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !573, file: !574, line: 149, baseType: !160, size: 32, offset: 4480)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !573, file: !574, line: 152, baseType: !690, size: 128, offset: 4512)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 4)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !573, file: !574, line: 153, baseType: !160, size: 32, offset: 4640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !573, file: !574, line: 154, baseType: !160, size: 32, offset: 4672)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !573, file: !574, line: 157, baseType: !106, size: 16, offset: 4704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !573, file: !574, line: 157, baseType: !106, size: 16, offset: 4720)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !573, file: !574, line: 160, baseType: !698, size: 64, offset: 4736)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !423, line: 113, size: 6208, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !710}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !699, file: !423, line: 114, baseType: !106, size: 16)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !699, file: !423, line: 114, baseType: !106, size: 16, offset: 16)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !699, file: !423, line: 115, baseType: !93, size: 8, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !699, file: !423, line: 115, baseType: !93, size: 8, offset: 40)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !699, file: !423, line: 116, baseType: !93, size: 8, offset: 48)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !699, file: !423, line: 117, baseType: !707, size: 8, offset: 56)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 1)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !699, file: !423, line: 119, baseType: !711, size: 6144, offset: 64)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 6144, elements: !721)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !423, line: 109, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !423, line: 106, size: 192, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !713, file: !423, line: 107, baseType: !160, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !713, file: !423, line: 107, baseType: !160, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !713, file: !423, line: 107, baseType: !160, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !713, file: !423, line: 107, baseType: !160, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !713, file: !423, line: 107, baseType: !160, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !713, file: !423, line: 108, baseType: !28, size: 32, offset: 160)
!721 = !{!722}
!722 = !DISubrange(count: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !573, file: !574, line: 161, baseType: !698, size: 64, offset: 4800)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !573, file: !574, line: 162, baseType: !93, size: 8, offset: 4864)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !573, file: !574, line: 162, baseType: !93, size: 8, offset: 4872)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !573, file: !574, line: 163, baseType: !93, size: 8, offset: 4880)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !573, file: !574, line: 163, baseType: !93, size: 8, offset: 4888)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !573, file: !574, line: 164, baseType: !106, size: 16, offset: 4896)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !573, file: !574, line: 164, baseType: !106, size: 16, offset: 4912)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !573, file: !574, line: 165, baseType: !160, size: 32, offset: 4928)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !573, file: !574, line: 165, baseType: !160, size: 32, offset: 4960)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !573, file: !574, line: 167, baseType: !425, size: 1152, offset: 4992)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !573, file: !574, line: 168, baseType: !243, size: 64, offset: 6144)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !573, file: !574, line: 169, baseType: !421, size: 64, offset: 6208)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !573, file: !574, line: 170, baseType: !736, size: 64, offset: 6272)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !738, line: 43, flags: DIFlagFwdDecl)
!738 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!739 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !573, file: !574, line: 171, baseType: !740, size: 64, offset: 6336)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !75, line: 159, size: 448, elements: !742)
!742 = !{!743, !747, !748, !750, !751, !754}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !741, file: !75, line: 161, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 2)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !741, file: !75, line: 162, baseType: !744, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !741, file: !75, line: 163, baseType: !749, size: 32, offset: 128)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 32, elements: !745)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !741, file: !75, line: 164, baseType: !749, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !741, file: !75, line: 165, baseType: !752, size: 128, offset: 192)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 128, elements: !745)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !741, file: !75, line: 166, baseType: !755, size: 128, offset: 320)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 128, elements: !745)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !573, file: !574, line: 174, baseType: !160, size: 32, offset: 6400)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !573, file: !574, line: 174, baseType: !160, size: 32, offset: 6432)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reflect", scope: !573, file: !574, line: 174, baseType: !160, size: 32, offset: 6464)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fhdist", scope: !573, file: !574, line: 175, baseType: !160, size: 32, offset: 6496)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "xyfrict", scope: !573, file: !574, line: 175, baseType: !160, size: 32, offset: 6528)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "dynamode", scope: !573, file: !574, line: 176, baseType: !106, size: 16, offset: 6560)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !573, file: !574, line: 176, baseType: !106, size: 16, offset: 6576)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sss_radius", scope: !573, file: !574, line: 179, baseType: !289, size: 96, offset: 6592)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sss_col", scope: !573, file: !574, line: 179, baseType: !289, size: 96, offset: 6688)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sss_error", scope: !573, file: !574, line: 180, baseType: !160, size: 32, offset: 6784)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "sss_scale", scope: !573, file: !574, line: 180, baseType: !160, size: 32, offset: 6816)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sss_ior", scope: !573, file: !574, line: 180, baseType: !160, size: 32, offset: 6848)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sss_colfac", scope: !573, file: !574, line: 181, baseType: !160, size: 32, offset: 6880)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sss_texfac", scope: !573, file: !574, line: 181, baseType: !160, size: 32, offset: 6912)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sss_front", scope: !573, file: !574, line: 182, baseType: !160, size: 32, offset: 6944)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sss_back", scope: !573, file: !574, line: 182, baseType: !160, size: 32, offset: 6976)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sss_flag", scope: !573, file: !574, line: 183, baseType: !106, size: 16, offset: 7008)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sss_preset", scope: !573, file: !574, line: 183, baseType: !106, size: 16, offset: 7024)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mapto_textured", scope: !573, file: !574, line: 185, baseType: !28, size: 32, offset: 7040)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "shadowonly_flag", scope: !573, file: !574, line: 186, baseType: !106, size: 16, offset: 7072)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !573, file: !574, line: 187, baseType: !106, size: 16, offset: 7088)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "line_col", scope: !573, file: !574, line: 190, baseType: !690, size: 128, offset: 7104)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "line_priority", scope: !573, file: !574, line: 191, baseType: !106, size: 16, offset: 7232)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "vcol_alpha", scope: !573, file: !574, line: 192, baseType: !106, size: 16, offset: 7248)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "paint_active_slot", scope: !573, file: !574, line: 195, baseType: !106, size: 16, offset: 7264)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "paint_clone_slot", scope: !573, file: !574, line: 196, baseType: !106, size: 16, offset: 7280)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tot_slots", scope: !573, file: !574, line: 197, baseType: !106, size: 16, offset: 7296)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !573, file: !574, line: 198, baseType: !784, size: 48, offset: 7312)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 48, elements: !290)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "texpaintslot", scope: !573, file: !574, line: 200, baseType: !786, size: 64, offset: 7360)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TexPaintSlot", file: !574, line: 86, size: 192, elements: !788)
!788 = !{!789, !790, !792, !793}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !787, file: !574, line: 87, baseType: !510, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !787, file: !574, line: 88, baseType: !791, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !787, file: !574, line: 89, baseType: !28, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !787, file: !574, line: 90, baseType: !28, size: 32, offset: 160)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gpumaterial", scope: !573, file: !574, line: 202, baseType: !132, size: 128, offset: 7424)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !556, file: !527, line: 94, baseType: !736, size: 64, offset: 1024)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !556, file: !527, line: 96, baseType: !230, size: 64, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !556, file: !527, line: 97, baseType: !230, size: 64, offset: 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !556, file: !527, line: 98, baseType: !230, size: 64, offset: 1216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !556, file: !527, line: 99, baseType: !536, size: 64, offset: 1280)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !556, file: !527, line: 101, baseType: !28, size: 32, offset: 1344)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !556, file: !527, line: 101, baseType: !28, size: 32, offset: 1376)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !556, file: !527, line: 104, baseType: !72, size: 64, offset: 1408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !556, file: !527, line: 106, baseType: !132, size: 128, offset: 1472)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !526, file: !527, line: 137, baseType: !28, size: 32, offset: 960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !526, file: !527, line: 140, baseType: !28, size: 32, offset: 992)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !526, file: !527, line: 143, baseType: !28, size: 32, offset: 1024)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !526, file: !527, line: 146, baseType: !791, size: 64, offset: 1088)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !511, file: !491, line: 89, baseType: !809, size: 512, offset: 9408)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 512, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 8)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !511, file: !491, line: 90, baseType: !106, size: 16, offset: 9920)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !511, file: !491, line: 90, baseType: !106, size: 16, offset: 9936)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !511, file: !491, line: 92, baseType: !106, size: 16, offset: 9952)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !511, file: !491, line: 92, baseType: !106, size: 16, offset: 9968)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !511, file: !491, line: 93, baseType: !106, size: 16, offset: 9984)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !511, file: !491, line: 93, baseType: !106, size: 16, offset: 10000)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !511, file: !491, line: 94, baseType: !28, size: 32, offset: 10016)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !511, file: !491, line: 97, baseType: !106, size: 16, offset: 10048)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !511, file: !491, line: 97, baseType: !106, size: 16, offset: 10064)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !511, file: !491, line: 98, baseType: !106, size: 16, offset: 10080)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !511, file: !491, line: 98, baseType: !106, size: 16, offset: 10096)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !511, file: !491, line: 99, baseType: !106, size: 16, offset: 10112)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !511, file: !491, line: 99, baseType: !106, size: 16, offset: 10128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !511, file: !491, line: 100, baseType: !10, size: 32, offset: 10144)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !511, file: !491, line: 101, baseType: !753, size: 64, offset: 10176)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !511, file: !491, line: 103, baseType: !99, size: 64, offset: 10240)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !511, file: !491, line: 104, baseType: !740, size: 64, offset: 10304)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !511, file: !491, line: 107, baseType: !160, size: 32, offset: 10368)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !511, file: !491, line: 108, baseType: !28, size: 32, offset: 10400)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !511, file: !491, line: 109, baseType: !106, size: 16, offset: 10432)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !511, file: !491, line: 110, baseType: !106, size: 16, offset: 10448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !511, file: !491, line: 113, baseType: !28, size: 32, offset: 10464)
