; ModuleID = 'blender/source/blender/editors/render/render_preview.c'
source_filename = "blender/source/blender/editors/render/render_preview.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !3, line: 105, type: !3167, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "get_brush_icon", scope: !3, file: !3, line: 103, type: !4, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2868, retainedNodes: !3166)
!3 = !DIFile(filename: "blender/source/blender/editors/render/render_preview.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !95}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !8, line: 70, size: 19840, elements: !9)
!8 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !{!10, !11, !12, !14, !15, !17, !18, !19, !20, !23, !26, !31, !32, !33, !34, !35, !37, !39, !40, !41, !45, !46, !47, !48, !49, !52, !54, !55, !60, !61, !64, !65, !67, !68, !69, !73, !74, !75, !78, !79, !88}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 71, baseType: !6, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 71, baseType: !6, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !8, line: 74, baseType: !13, size: 32, offset: 128)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !8, line: 74, baseType: !13, size: 32, offset: 160)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !7, file: !8, line: 79, baseType: !16, size: 8, offset: 192)
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !7, file: !8, line: 80, baseType: !13, size: 32, offset: 224)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !7, file: !8, line: 83, baseType: !13, size: 32, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !7, file: !8, line: 84, baseType: !13, size: 32, offset: 288)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !7, file: !8, line: 87, baseType: !21, size: 64, offset: 320)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !7, file: !8, line: 88, baseType: !24, size: 64, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !7, file: !8, line: 93, baseType: !27, size: 128, offset: 448)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, elements: !29)
!28 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!29 = !{!30}
!30 = !DISubrange(count: 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !7, file: !8, line: 96, baseType: !13, size: 32, offset: 576)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !7, file: !8, line: 96, baseType: !13, size: 32, offset: 608)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !7, file: !8, line: 97, baseType: !13, size: 32, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !7, file: !8, line: 97, baseType: !13, size: 32, offset: 672)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !7, file: !8, line: 98, baseType: !36, size: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !7, file: !8, line: 101, baseType: !38, size: 64, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !7, file: !8, line: 102, baseType: !24, size: 64, offset: 832)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !7, file: !8, line: 105, baseType: !25, size: 32, offset: 896)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !7, file: !8, line: 108, baseType: !42, size: 1280, offset: 960)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1280, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 20)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !7, file: !8, line: 109, baseType: !13, size: 32, offset: 2240)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !7, file: !8, line: 109, baseType: !13, size: 32, offset: 2272)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !7, file: !8, line: 112, baseType: !13, size: 32, offset: 2304)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !7, file: !8, line: 113, baseType: !13, size: 32, offset: 2336)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !7, file: !8, line: 114, baseType: !50, size: 64, offset: 2368)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !8, line: 50, flags: DIFlagFwdDecl)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !7, file: !8, line: 115, baseType: !53, size: 64, offset: 2432)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !7, file: !8, line: 118, baseType: !13, size: 32, offset: 2496)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !7, file: !8, line: 119, baseType: !56, size: 8192, offset: 2528)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8192, elements: !58)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !{!59}
!59 = !DISubrange(count: 1024)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !7, file: !8, line: 120, baseType: !56, size: 8192, offset: 10720)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !7, file: !8, line: 123, baseType: !62, size: 64, offset: 18944)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !8, line: 123, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !7, file: !8, line: 124, baseType: !13, size: 32, offset: 19008)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !7, file: !8, line: 127, baseType: !66, size: 64, offset: 19072)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !7, file: !8, line: 128, baseType: !22, size: 32, offset: 19136)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !7, file: !8, line: 129, baseType: !22, size: 32, offset: 19168)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !7, file: !8, line: 132, baseType: !70, size: 64, offset: 19200)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !72, line: 63, flags: DIFlagFwdDecl)
!72 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !7, file: !8, line: 133, baseType: !70, size: 64, offset: 19264)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !7, file: !8, line: 134, baseType: !21, size: 64, offset: 19328)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !7, file: !8, line: 135, baseType: !76, size: 64, offset: 19392)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !8, line: 135, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !7, file: !8, line: 136, baseType: !13, size: 32, offset: 19456)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !7, file: !8, line: 137, baseType: !80, size: 128, offset: 19488)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !81, line: 89, baseType: !82)
!81 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !81, line: 86, size: 128, elements: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !82, file: !81, line: 87, baseType: !13, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !82, file: !81, line: 87, baseType: !13, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !82, file: !81, line: 88, baseType: !13, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !82, file: !81, line: 88, baseType: !13, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !7, file: !8, line: 140, baseType: !89, size: 192, offset: 19648)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !8, line: 55, size: 192, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !89, file: !8, line: 56, baseType: !22, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !89, file: !8, line: 57, baseType: !22, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !8, line: 58, baseType: !66, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !89, file: !8, line: 59, baseType: !22, size: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "Brush", file: !97, line: 138, baseType: !98)
!97 = !DIFile(filename: "blender/source/blender/makesdna/DNA_brush_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !97, line: 54, size: 16448, elements: !99)
!99 = !{!100, !167, !2777, !2778, !2779, !2780, !2781, !2782, !2785, !2786, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2867}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !98, file: !97, line: 55, baseType: !101, size: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !102, line: 130, baseType: !103)
!102 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !102, line: 117, size: 960, elements: !104)
!104 = !{!105, !106, !107, !109, !126, !130, !132, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !102, line: 118, baseType: !53, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !103, file: !102, line: 118, baseType: !53, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !103, file: !102, line: 119, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !103, file: !102, line: 120, baseType: !110, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !102, line: 136, size: 17600, elements: !112)
!112 = !{!113, !114, !116, !120, !121, !122, !123}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !111, file: !102, line: 137, baseType: !101, size: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !111, file: !102, line: 138, baseType: !115, size: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !111, file: !102, line: 139, baseType: !117, size: 64, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !119, line: 50, flags: DIFlagFwdDecl)
!119 = !DIFile(filename: "blender/source/blender/blenloader/BLO_readfile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !102, line: 140, baseType: !56, size: 8192, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !111, file: !102, line: 141, baseType: !56, size: 8192, offset: 9280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !111, file: !102, line: 148, baseType: !110, size: 64, offset: 17472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !111, file: !102, line: 150, baseType: !124, size: 64, offset: 17536)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !102, line: 45, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !103, file: !102, line: 121, baseType: !127, size: 528, offset: 256)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 528, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 66)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !103, file: !102, line: 126, baseType: !131, size: 16, offset: 784)
!131 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !103, file: !102, line: 127, baseType: !13, size: 32, offset: 800)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !103, file: !102, line: 128, baseType: !13, size: 32, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !103, file: !102, line: 128, baseType: !13, size: 32, offset: 864)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !103, file: !102, line: 129, baseType: !136, size: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !102, line: 75, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !102, line: 62, size: 1024, elements: !139)
!139 = !{!140, !142, !143, !144, !145, !146, !150, !151, !165, !166}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !102, line: 63, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !102, line: 63, baseType: !141, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !102, line: 64, baseType: !57, size: 8, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !138, file: !102, line: 64, baseType: !57, size: 8, offset: 136)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !138, file: !102, line: 65, baseType: !131, size: 16, offset: 144)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !102, line: 66, baseType: !147, size: 512, offset: 160)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 512, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !138, file: !102, line: 67, baseType: !13, size: 32, offset: 672)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !102, line: 69, baseType: !152, size: 256, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !102, line: 60, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !102, line: 48, size: 256, elements: !154)
!154 = !{!155, !156, !163, !164}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !153, file: !102, line: 49, baseType: !53, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !153, file: !102, line: 58, baseType: !157, size: 128, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !158, line: 71, baseType: !159)
!158 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !158, line: 69, size: 128, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !159, file: !158, line: 70, baseType: !53, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !159, file: !158, line: 70, baseType: !53, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !153, file: !102, line: 59, baseType: !13, size: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !153, file: !102, line: 59, baseType: !13, size: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, file: !102, line: 70, baseType: !13, size: 32, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !138, file: !102, line: 74, baseType: !13, size: 32, offset: 992)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !98, file: !97, line: 57, baseType: !168, size: 192, offset: 960)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BrushClone", file: !97, line: 48, size: 192, elements: !169)
!169 = !{!170, !2774, !2775, !2776}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !168, file: !97, line: 49, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !173, line: 77, size: 15424, elements: !174)
!173 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!174 = !{!175, !176, !177, !180, !183, !186, !2734, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2748, !2749, !2750, !2751, !2752, !2753, !2754, !2755, !2756, !2757, !2758, !2759, !2760, !2761, !2762, !2763, !2764, !2765, !2766, !2767, !2768}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !172, file: !173, line: 78, baseType: !101, size: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !173, line: 80, baseType: !56, size: 8192, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !172, file: !173, line: 82, baseType: !178, size: 64, offset: 9152)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !173, line: 43, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !172, file: !173, line: 83, baseType: !181, size: 64, offset: 9216)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !102, line: 46, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !172, file: !173, line: 86, baseType: !184, size: 64, offset: 9280)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !173, line: 41, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !172, file: !173, line: 87, baseType: !187, size: 64, offset: 9344)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !189, line: 110, size: 1152, elements: !190)
!189 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !206, !2730, !2731, !2732, !2733}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !189, line: 111, baseType: !187, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !188, file: !189, line: 111, baseType: !187, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !188, file: !189, line: 114, baseType: !13, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !188, file: !189, line: 114, baseType: !13, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !188, file: !189, line: 115, baseType: !131, size: 16, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !188, file: !189, line: 115, baseType: !131, size: 16, offset: 208)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !188, file: !189, line: 118, baseType: !38, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !188, file: !189, line: 120, baseType: !24, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !188, file: !189, line: 122, baseType: !24, size: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !188, file: !189, line: 125, baseType: !80, size: 128, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !188, file: !189, line: 127, baseType: !13, size: 32, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !188, file: !189, line: 127, baseType: !13, size: 32, offset: 608)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !188, file: !189, line: 130, baseType: !157, size: 128, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !188, file: !189, line: 133, baseType: !205, size: 128, offset: 768)
!205 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !188, file: !189, line: 134, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !189, line: 108, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !189, line: 85, size: 1600, elements: !211)
!211 = !{!212, !214, !215, !219, !220, !221, !222, !223, !224, !225, !2721, !2722, !2723, !2724, !2725, !2726, !2727, !2728, !2729}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !189, line: 86, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !189, line: 86, baseType: !213, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !189, line: 89, baseType: !216, size: 592, offset: 128)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 592, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 74)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !210, file: !189, line: 90, baseType: !22, size: 32, offset: 736)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !210, file: !189, line: 90, baseType: !22, size: 32, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !210, file: !189, line: 90, baseType: !22, size: 32, offset: 800)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !210, file: !189, line: 91, baseType: !13, size: 32, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !210, file: !189, line: 91, baseType: !13, size: 32, offset: 864)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !210, file: !189, line: 91, baseType: !13, size: 32, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !210, file: !189, line: 93, baseType: !226, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !228, line: 93, size: 7552, elements: !229)
!228 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!229 = !{!230, !231, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !284, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !353, !354, !355, !356, !357, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708, !2709, !2710, !2711, !2712, !2720}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !227, file: !228, line: 94, baseType: !101, size: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !227, file: !228, line: 95, baseType: !232, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !234, line: 38, flags: DIFlagFwdDecl)
!234 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !227, file: !228, line: 97, baseType: !131, size: 16, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !227, file: !228, line: 97, baseType: !131, size: 16, offset: 1040)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !227, file: !228, line: 99, baseType: !25, size: 32, offset: 1056)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !227, file: !228, line: 99, baseType: !25, size: 32, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !227, file: !228, line: 99, baseType: !25, size: 32, offset: 1120)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !227, file: !228, line: 100, baseType: !25, size: 32, offset: 1152)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !227, file: !228, line: 100, baseType: !25, size: 32, offset: 1184)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !227, file: !228, line: 100, baseType: !25, size: 32, offset: 1216)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !227, file: !228, line: 101, baseType: !25, size: 32, offset: 1248)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !227, file: !228, line: 101, baseType: !25, size: 32, offset: 1280)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !227, file: !228, line: 101, baseType: !25, size: 32, offset: 1312)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !227, file: !228, line: 102, baseType: !25, size: 32, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !227, file: !228, line: 102, baseType: !25, size: 32, offset: 1376)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !227, file: !228, line: 102, baseType: !25, size: 32, offset: 1408)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !227, file: !228, line: 103, baseType: !25, size: 32, offset: 1440)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !227, file: !228, line: 103, baseType: !25, size: 32, offset: 1472)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !227, file: !228, line: 103, baseType: !25, size: 32, offset: 1504)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !227, file: !228, line: 103, baseType: !25, size: 32, offset: 1536)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !227, file: !228, line: 103, baseType: !25, size: 32, offset: 1568)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !227, file: !228, line: 104, baseType: !25, size: 32, offset: 1600)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !227, file: !228, line: 104, baseType: !25, size: 32, offset: 1632)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !227, file: !228, line: 104, baseType: !25, size: 32, offset: 1664)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !227, file: !228, line: 104, baseType: !25, size: 32, offset: 1696)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !227, file: !228, line: 104, baseType: !25, size: 32, offset: 1728)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !227, file: !228, line: 105, baseType: !25, size: 32, offset: 1760)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !227, file: !228, line: 108, baseType: !261, size: 704, offset: 1792)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !228, line: 53, size: 704, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !261, file: !228, line: 54, baseType: !25, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !261, file: !228, line: 55, baseType: !25, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !261, file: !228, line: 56, baseType: !25, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !261, file: !228, line: 57, baseType: !25, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !261, file: !228, line: 59, baseType: !268, size: 96, offset: 128)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 96, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 3)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !261, file: !228, line: 60, baseType: !268, size: 96, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !261, file: !228, line: 61, baseType: !268, size: 96, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !261, file: !228, line: 63, baseType: !25, size: 32, offset: 416)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !261, file: !228, line: 64, baseType: !25, size: 32, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !261, file: !228, line: 65, baseType: !25, size: 32, offset: 480)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !261, file: !228, line: 67, baseType: !131, size: 16, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !261, file: !228, line: 68, baseType: !131, size: 16, offset: 528)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !261, file: !228, line: 69, baseType: !131, size: 16, offset: 544)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !261, file: !228, line: 70, baseType: !131, size: 16, offset: 560)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !261, file: !228, line: 72, baseType: !25, size: 32, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !261, file: !228, line: 73, baseType: !25, size: 32, offset: 608)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !261, file: !228, line: 74, baseType: !25, size: 32, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !261, file: !228, line: 75, baseType: !25, size: 32, offset: 672)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !227, file: !228, line: 109, baseType: !285, size: 128, offset: 2496)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !228, line: 79, size: 128, elements: !286)
!286 = !{!287, !288, !289, !290}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !228, line: 80, baseType: !13, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !285, file: !228, line: 81, baseType: !13, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !285, file: !228, line: 82, baseType: !13, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !285, file: !228, line: 83, baseType: !13, size: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !227, file: !228, line: 111, baseType: !25, size: 32, offset: 2624)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !227, file: !228, line: 111, baseType: !25, size: 32, offset: 2656)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !227, file: !228, line: 112, baseType: !25, size: 32, offset: 2688)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !227, file: !228, line: 112, baseType: !25, size: 32, offset: 2720)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !227, file: !228, line: 113, baseType: !25, size: 32, offset: 2752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !227, file: !228, line: 114, baseType: !25, size: 32, offset: 2784)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !227, file: !228, line: 114, baseType: !25, size: 32, offset: 2816)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !227, file: !228, line: 115, baseType: !131, size: 16, offset: 2848)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !227, file: !228, line: 115, baseType: !131, size: 16, offset: 2864)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !227, file: !228, line: 116, baseType: !131, size: 16, offset: 2880)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !227, file: !228, line: 117, baseType: !57, size: 8, offset: 2896)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !227, file: !228, line: 117, baseType: !57, size: 8, offset: 2904)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !227, file: !228, line: 119, baseType: !25, size: 32, offset: 2912)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !227, file: !228, line: 119, baseType: !25, size: 32, offset: 2944)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !227, file: !228, line: 120, baseType: !131, size: 16, offset: 2976)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !227, file: !228, line: 120, baseType: !131, size: 16, offset: 2992)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !227, file: !228, line: 121, baseType: !25, size: 32, offset: 3008)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !227, file: !228, line: 121, baseType: !25, size: 32, offset: 3040)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !227, file: !228, line: 122, baseType: !25, size: 32, offset: 3072)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !227, file: !228, line: 123, baseType: !25, size: 32, offset: 3104)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !227, file: !228, line: 124, baseType: !131, size: 16, offset: 3136)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !227, file: !228, line: 125, baseType: !131, size: 16, offset: 3152)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !227, file: !228, line: 127, baseType: !13, size: 32, offset: 3168)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !227, file: !228, line: 127, baseType: !13, size: 32, offset: 3200)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !227, file: !228, line: 128, baseType: !13, size: 32, offset: 3232)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !227, file: !228, line: 128, baseType: !13, size: 32, offset: 3264)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !227, file: !228, line: 129, baseType: !131, size: 16, offset: 3296)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !227, file: !228, line: 129, baseType: !131, size: 16, offset: 3312)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !227, file: !228, line: 129, baseType: !131, size: 16, offset: 3328)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !227, file: !228, line: 129, baseType: !131, size: 16, offset: 3344)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !227, file: !228, line: 130, baseType: !25, size: 32, offset: 3360)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !227, file: !228, line: 130, baseType: !25, size: 32, offset: 3392)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !227, file: !228, line: 130, baseType: !25, size: 32, offset: 3424)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !227, file: !228, line: 130, baseType: !25, size: 32, offset: 3456)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !227, file: !228, line: 131, baseType: !25, size: 32, offset: 3488)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !227, file: !228, line: 131, baseType: !25, size: 32, offset: 3520)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !227, file: !228, line: 131, baseType: !25, size: 32, offset: 3552)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !227, file: !228, line: 131, baseType: !25, size: 32, offset: 3584)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !227, file: !228, line: 132, baseType: !25, size: 32, offset: 3616)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !227, file: !228, line: 132, baseType: !25, size: 32, offset: 3648)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !227, file: !228, line: 133, baseType: !147, size: 512, offset: 3680)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !227, file: !228, line: 135, baseType: !25, size: 32, offset: 4192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !227, file: !228, line: 136, baseType: !25, size: 32, offset: 4224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !227, file: !228, line: 137, baseType: !25, size: 32, offset: 4256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !227, file: !228, line: 138, baseType: !13, size: 32, offset: 4288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !227, file: !228, line: 141, baseType: !57, size: 8, offset: 4320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !227, file: !228, line: 141, baseType: !57, size: 8, offset: 4328)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !227, file: !228, line: 141, baseType: !57, size: 8, offset: 4336)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !227, file: !228, line: 141, baseType: !57, size: 8, offset: 4344)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !227, file: !228, line: 142, baseType: !131, size: 16, offset: 4352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !227, file: !228, line: 142, baseType: !131, size: 16, offset: 4368)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !227, file: !228, line: 142, baseType: !131, size: 16, offset: 4384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !227, file: !228, line: 145, baseType: !57, size: 8, offset: 4400)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !227, file: !228, line: 145, baseType: !57, size: 8, offset: 4408)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !227, file: !228, line: 148, baseType: !131, size: 16, offset: 4416)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !227, file: !228, line: 148, baseType: !131, size: 16, offset: 4432)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !227, file: !228, line: 149, baseType: !25, size: 32, offset: 4448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !227, file: !228, line: 149, baseType: !25, size: 32, offset: 4480)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !227, file: !228, line: 152, baseType: !350, size: 128, offset: 4512)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 4)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !227, file: !228, line: 153, baseType: !25, size: 32, offset: 4640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !227, file: !228, line: 154, baseType: !25, size: 32, offset: 4672)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !227, file: !228, line: 157, baseType: !131, size: 16, offset: 4704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !227, file: !228, line: 157, baseType: !131, size: 16, offset: 4720)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !227, file: !228, line: 160, baseType: !358, size: 64, offset: 4736)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !360, line: 113, size: 6208, elements: !361)
!360 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!361 = !{!362, !363, !364, !365, !366, !367, !371}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !359, file: !360, line: 114, baseType: !131, size: 16)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !359, file: !360, line: 114, baseType: !131, size: 16, offset: 16)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !359, file: !360, line: 115, baseType: !57, size: 8, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !359, file: !360, line: 115, baseType: !57, size: 8, offset: 40)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !359, file: !360, line: 116, baseType: !57, size: 8, offset: 48)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !359, file: !360, line: 117, baseType: !368, size: 8, offset: 56)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 1)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !359, file: !360, line: 119, baseType: !372, size: 6144, offset: 64)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 6144, elements: !382)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !360, line: 109, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !360, line: 106, size: 192, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !374, file: !360, line: 107, baseType: !25, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !374, file: !360, line: 107, baseType: !25, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !374, file: !360, line: 107, baseType: !25, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !374, file: !360, line: 107, baseType: !25, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !374, file: !360, line: 107, baseType: !25, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !374, file: !360, line: 108, baseType: !13, size: 32, offset: 160)
!382 = !{!383}
!383 = !DISubrange(count: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !227, file: !228, line: 161, baseType: !358, size: 64, offset: 4800)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !227, file: !228, line: 162, baseType: !57, size: 8, offset: 4864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !227, file: !228, line: 162, baseType: !57, size: 8, offset: 4872)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !227, file: !228, line: 163, baseType: !57, size: 8, offset: 4880)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !227, file: !228, line: 163, baseType: !57, size: 8, offset: 4888)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !227, file: !228, line: 164, baseType: !131, size: 16, offset: 4896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !227, file: !228, line: 164, baseType: !131, size: 16, offset: 4912)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !227, file: !228, line: 165, baseType: !25, size: 32, offset: 4928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !227, file: !228, line: 165, baseType: !25, size: 32, offset: 4960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !227, file: !228, line: 167, baseType: !394, size: 1152, offset: 4992)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 1152, elements: !2678)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !360, line: 57, size: 2496, elements: !397)
!397 = !{!398, !399, !400, !401, !402, !2475, !2619, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2677}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !396, file: !360, line: 59, baseType: !131, size: 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !396, file: !360, line: 59, baseType: !131, size: 16, offset: 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !396, file: !360, line: 59, baseType: !131, size: 16, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !396, file: !360, line: 59, baseType: !131, size: 16, offset: 48)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !396, file: !360, line: 60, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !405, line: 115, size: 11392, elements: !406)
!405 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!406 = !{!407, !408, !409, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !426, !436, !450, !451, !492, !493, !496, !497, !513, !514, !515, !516, !517, !518, !519, !521, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !599, !600, !601, !602, !603, !604, !605, !606, !607, !610, !613, !616, !617, !618, !619, !620, !623, !626, !629, !630, !636, !637, !638, !639, !640, !641, !643, !646, !649, !651, !2463, !2464}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !404, file: !405, line: 116, baseType: !101, size: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !404, file: !405, line: 117, baseType: !232, size: 64, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !404, file: !405, line: 119, baseType: !410, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !405, line: 57, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !404, file: !405, line: 121, baseType: !131, size: 16, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !404, file: !405, line: 121, baseType: !131, size: 16, offset: 1104)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !404, file: !405, line: 122, baseType: !13, size: 32, offset: 1120)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !404, file: !405, line: 122, baseType: !13, size: 32, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !404, file: !405, line: 122, baseType: !13, size: 32, offset: 1184)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !404, file: !405, line: 123, baseType: !147, size: 512, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !404, file: !405, line: 124, baseType: !403, size: 64, offset: 1728)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !404, file: !405, line: 124, baseType: !403, size: 64, offset: 1792)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !404, file: !405, line: 127, baseType: !403, size: 64, offset: 1856)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !404, file: !405, line: 127, baseType: !403, size: 64, offset: 1920)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !404, file: !405, line: 127, baseType: !403, size: 64, offset: 1984)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !404, file: !405, line: 128, baseType: !424, size: 64, offset: 2048)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !234, line: 40, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !404, file: !405, line: 130, baseType: !427, size: 64, offset: 2112)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !405, line: 97, size: 832, elements: !429)
!429 = !{!430, !434, !435}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !428, file: !405, line: 98, baseType: !431, size: 768)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 768, elements: !432)
!432 = !{!433, !270}
!433 = !DISubrange(count: 8)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !405, line: 99, baseType: !13, size: 32, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !428, file: !405, line: 99, baseType: !13, size: 32, offset: 800)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !404, file: !405, line: 131, baseType: !437, size: 64, offset: 2176)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !439, line: 486, size: 1600, elements: !440)
!439 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !438, file: !439, line: 487, baseType: !101, size: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !438, file: !439, line: 489, baseType: !157, size: 128, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !438, file: !439, line: 490, baseType: !157, size: 128, offset: 1088)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !438, file: !439, line: 491, baseType: !157, size: 128, offset: 1216)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !438, file: !439, line: 492, baseType: !157, size: 128, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !438, file: !439, line: 494, baseType: !13, size: 32, offset: 1472)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !438, file: !439, line: 495, baseType: !13, size: 32, offset: 1504)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !438, file: !439, line: 497, baseType: !13, size: 32, offset: 1536)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !438, file: !439, line: 498, baseType: !13, size: 32, offset: 1568)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !404, file: !405, line: 132, baseType: !437, size: 64, offset: 2240)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !404, file: !405, line: 133, baseType: !452, size: 64, offset: 2304)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !439, line: 334, size: 1728, elements: !454)
!454 = !{!455, !456, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !491}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !453, file: !439, line: 335, baseType: !157, size: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !453, file: !439, line: 336, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !439, line: 47, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !439, line: 338, baseType: !131, size: 16, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !453, file: !439, line: 338, baseType: !131, size: 16, offset: 208)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !453, file: !439, line: 339, baseType: !22, size: 32, offset: 224)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !453, file: !439, line: 340, baseType: !13, size: 32, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !453, file: !439, line: 342, baseType: !25, size: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !453, file: !439, line: 343, baseType: !268, size: 96, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !453, file: !439, line: 344, baseType: !268, size: 96, offset: 416)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !453, file: !439, line: 347, baseType: !157, size: 128, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !453, file: !439, line: 349, baseType: !13, size: 32, offset: 640)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !453, file: !439, line: 350, baseType: !13, size: 32, offset: 672)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !453, file: !439, line: 351, baseType: !53, size: 64, offset: 704)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !453, file: !439, line: 352, baseType: !53, size: 64, offset: 768)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !453, file: !439, line: 354, baseType: !472, size: 384, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !439, line: 116, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !439, line: 94, size: 384, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !473, file: !439, line: 96, baseType: !13, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !473, file: !439, line: 96, baseType: !13, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !473, file: !439, line: 97, baseType: !13, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !473, file: !439, line: 97, baseType: !13, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !473, file: !439, line: 99, baseType: !131, size: 16, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !473, file: !439, line: 100, baseType: !131, size: 16, offset: 144)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !473, file: !439, line: 102, baseType: !131, size: 16, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !473, file: !439, line: 105, baseType: !131, size: 16, offset: 176)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !473, file: !439, line: 108, baseType: !131, size: 16, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !473, file: !439, line: 109, baseType: !131, size: 16, offset: 208)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !473, file: !439, line: 111, baseType: !131, size: 16, offset: 224)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !473, file: !439, line: 112, baseType: !131, size: 16, offset: 240)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !473, file: !439, line: 114, baseType: !13, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !473, file: !439, line: 114, baseType: !13, size: 32, offset: 288)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !473, file: !439, line: 115, baseType: !13, size: 32, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !473, file: !439, line: 115, baseType: !13, size: 32, offset: 352)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !453, file: !439, line: 355, baseType: !147, size: 512, offset: 1216)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !405, line: 134, baseType: !53, size: 64, offset: 2368)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !404, file: !405, line: 136, baseType: !494, size: 64, offset: 2432)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !72, line: 61, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !404, file: !405, line: 138, baseType: !472, size: 384, offset: 2496)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !404, file: !405, line: 139, baseType: !498, size: 64, offset: 2880)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !439, line: 80, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !439, line: 72, size: 192, elements: !501)
!501 = !{!502, !509, !510, !511, !512}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !500, file: !439, line: 73, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !439, line: 59, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !439, line: 56, size: 128, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !505, file: !439, line: 57, baseType: !268, size: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !505, file: !439, line: 58, baseType: !13, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !500, file: !439, line: 74, baseType: !13, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !500, file: !439, line: 76, baseType: !13, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !500, file: !439, line: 77, baseType: !13, size: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !500, file: !439, line: 79, baseType: !13, size: 32, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !404, file: !405, line: 141, baseType: !157, size: 128, offset: 2944)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !404, file: !405, line: 142, baseType: !157, size: 128, offset: 3072)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !404, file: !405, line: 143, baseType: !157, size: 128, offset: 3200)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !404, file: !405, line: 144, baseType: !157, size: 128, offset: 3328)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !404, file: !405, line: 146, baseType: !13, size: 32, offset: 3456)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !404, file: !405, line: 147, baseType: !13, size: 32, offset: 3488)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !404, file: !405, line: 150, baseType: !520, size: 64, offset: 3520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !404, file: !405, line: 151, baseType: !522, size: 64, offset: 3584)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !404, file: !405, line: 152, baseType: !13, size: 32, offset: 3648)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !404, file: !405, line: 153, baseType: !13, size: 32, offset: 3680)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !404, file: !405, line: 156, baseType: !268, size: 96, offset: 3712)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !404, file: !405, line: 156, baseType: !268, size: 96, offset: 3808)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !404, file: !405, line: 156, baseType: !268, size: 96, offset: 3904)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !404, file: !405, line: 157, baseType: !268, size: 96, offset: 4000)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !404, file: !405, line: 158, baseType: !268, size: 96, offset: 4096)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !404, file: !405, line: 159, baseType: !268, size: 96, offset: 4192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !404, file: !405, line: 160, baseType: !268, size: 96, offset: 4288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !404, file: !405, line: 160, baseType: !268, size: 96, offset: 4384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !404, file: !405, line: 161, baseType: !350, size: 128, offset: 4480)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !404, file: !405, line: 161, baseType: !350, size: 128, offset: 4608)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !404, file: !405, line: 162, baseType: !268, size: 96, offset: 4736)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !404, file: !405, line: 162, baseType: !268, size: 96, offset: 4832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !404, file: !405, line: 163, baseType: !25, size: 32, offset: 4928)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !404, file: !405, line: 163, baseType: !25, size: 32, offset: 4960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !404, file: !405, line: 164, baseType: !540, size: 512, offset: 4992)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, elements: !541)
!541 = !{!352, !352}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !404, file: !405, line: 165, baseType: !540, size: 512, offset: 5504)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !404, file: !405, line: 166, baseType: !540, size: 512, offset: 6016)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !404, file: !405, line: 167, baseType: !540, size: 512, offset: 6528)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !404, file: !405, line: 176, baseType: !540, size: 512, offset: 7040)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !404, file: !405, line: 178, baseType: !22, size: 32, offset: 7552)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !405, line: 180, baseType: !131, size: 16, offset: 7584)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !404, file: !405, line: 181, baseType: !131, size: 16, offset: 7600)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !404, file: !405, line: 183, baseType: !131, size: 16, offset: 7616)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !404, file: !405, line: 183, baseType: !131, size: 16, offset: 7632)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !404, file: !405, line: 184, baseType: !131, size: 16, offset: 7648)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !404, file: !405, line: 184, baseType: !131, size: 16, offset: 7664)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !404, file: !405, line: 185, baseType: !131, size: 16, offset: 7680)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !404, file: !405, line: 186, baseType: !131, size: 16, offset: 7696)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !404, file: !405, line: 187, baseType: !131, size: 16, offset: 7712)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !404, file: !405, line: 188, baseType: !57, size: 8, offset: 7728)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !404, file: !405, line: 189, baseType: !57, size: 8, offset: 7736)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !404, file: !405, line: 192, baseType: !13, size: 32, offset: 7744)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !404, file: !405, line: 192, baseType: !13, size: 32, offset: 7776)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !404, file: !405, line: 192, baseType: !13, size: 32, offset: 7808)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !404, file: !405, line: 192, baseType: !13, size: 32, offset: 7840)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !404, file: !405, line: 194, baseType: !13, size: 32, offset: 7872)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !404, file: !405, line: 202, baseType: !25, size: 32, offset: 7904)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !404, file: !405, line: 202, baseType: !25, size: 32, offset: 7936)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !404, file: !405, line: 202, baseType: !25, size: 32, offset: 7968)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !404, file: !405, line: 211, baseType: !25, size: 32, offset: 8000)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !404, file: !405, line: 212, baseType: !25, size: 32, offset: 8032)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !404, file: !405, line: 213, baseType: !25, size: 32, offset: 8064)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !404, file: !405, line: 214, baseType: !25, size: 32, offset: 8096)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !404, file: !405, line: 215, baseType: !25, size: 32, offset: 8128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !404, file: !405, line: 216, baseType: !25, size: 32, offset: 8160)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !404, file: !405, line: 219, baseType: !25, size: 32, offset: 8192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !404, file: !405, line: 220, baseType: !25, size: 32, offset: 8224)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !404, file: !405, line: 221, baseType: !25, size: 32, offset: 8256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !404, file: !405, line: 224, baseType: !576, size: 16, offset: 8288)
!576 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !404, file: !405, line: 224, baseType: !576, size: 16, offset: 8304)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !404, file: !405, line: 226, baseType: !131, size: 16, offset: 8320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !404, file: !405, line: 228, baseType: !57, size: 8, offset: 8336)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !404, file: !405, line: 229, baseType: !57, size: 8, offset: 8344)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !404, file: !405, line: 231, baseType: !131, size: 16, offset: 8352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !404, file: !405, line: 232, baseType: !57, size: 8, offset: 8368)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !404, file: !405, line: 233, baseType: !57, size: 8, offset: 8376)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !404, file: !405, line: 234, baseType: !25, size: 32, offset: 8384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !404, file: !405, line: 235, baseType: !25, size: 32, offset: 8416)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !404, file: !405, line: 237, baseType: !157, size: 128, offset: 8448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !404, file: !405, line: 238, baseType: !157, size: 128, offset: 8576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !404, file: !405, line: 239, baseType: !157, size: 128, offset: 8704)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !404, file: !405, line: 240, baseType: !157, size: 128, offset: 8832)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !404, file: !405, line: 242, baseType: !25, size: 32, offset: 8960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !404, file: !405, line: 244, baseType: !131, size: 16, offset: 8992)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !404, file: !405, line: 245, baseType: !576, size: 16, offset: 9008)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !404, file: !405, line: 246, baseType: !350, size: 128, offset: 9024)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !404, file: !405, line: 248, baseType: !13, size: 32, offset: 9152)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !404, file: !405, line: 249, baseType: !13, size: 32, offset: 9184)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !404, file: !405, line: 251, baseType: !597, size: 64, offset: 9216)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !405, line: 251, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !404, file: !405, line: 253, baseType: !57, size: 8, offset: 9280)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !404, file: !405, line: 254, baseType: !57, size: 8, offset: 9288)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !404, file: !405, line: 255, baseType: !131, size: 16, offset: 9296)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !404, file: !405, line: 256, baseType: !268, size: 96, offset: 9312)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !404, file: !405, line: 258, baseType: !157, size: 128, offset: 9408)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !404, file: !405, line: 259, baseType: !157, size: 128, offset: 9536)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !404, file: !405, line: 260, baseType: !157, size: 128, offset: 9664)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !404, file: !405, line: 261, baseType: !157, size: 128, offset: 9792)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !404, file: !405, line: 263, baseType: !608, size: 64, offset: 9920)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !405, line: 52, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !404, file: !405, line: 264, baseType: !611, size: 64, offset: 9984)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !405, line: 53, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !404, file: !405, line: 265, baseType: !614, size: 64, offset: 10048)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !228, line: 46, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !404, file: !405, line: 267, baseType: !57, size: 8, offset: 10112)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !404, file: !405, line: 268, baseType: !57, size: 8, offset: 10120)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !404, file: !405, line: 269, baseType: !131, size: 16, offset: 10128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !404, file: !405, line: 270, baseType: !25, size: 32, offset: 10144)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !404, file: !405, line: 272, baseType: !621, size: 64, offset: 10176)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !405, line: 54, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !404, file: !405, line: 275, baseType: !624, size: 64, offset: 10240)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !405, line: 275, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !404, file: !405, line: 277, baseType: !627, size: 64, offset: 10304)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !405, line: 56, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !404, file: !405, line: 277, baseType: !627, size: 64, offset: 10368)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !404, file: !405, line: 278, baseType: !631, size: 64, offset: 10432)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !632, line: 27, baseType: !633)
!632 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !634, line: 45, baseType: !635)
!634 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!635 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !404, file: !405, line: 279, baseType: !631, size: 64, offset: 10496)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !405, line: 280, baseType: !22, size: 32, offset: 10560)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !404, file: !405, line: 281, baseType: !22, size: 32, offset: 10592)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !404, file: !405, line: 283, baseType: !157, size: 128, offset: 10624)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !404, file: !405, line: 284, baseType: !157, size: 128, offset: 10752)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !404, file: !405, line: 285, baseType: !642, size: 64, offset: 10880)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !404, file: !405, line: 287, baseType: !644, size: 64, offset: 10944)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !405, line: 59, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !404, file: !405, line: 288, baseType: !647, size: 64, offset: 11008)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !405, line: 288, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !404, file: !405, line: 290, baseType: !650, size: 64, offset: 11072)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, elements: !29)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !404, file: !405, line: 291, baseType: !652, size: 64, offset: 11136)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !173, line: 65, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !173, line: 50, size: 320, elements: !655)
!655 = !{!656, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !654, file: !173, line: 51, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !72, line: 1216, size: 39680, elements: !659)
!659 = !{!660, !661, !662, !663, !1451, !1452, !1453, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1825, !2045, !2048, !2325, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2347, !2348, !2349, !2350, !2351, !2359, !2426, !2433, !2434, !2441, !2442, !2443, !2444, !2445, !2446, !2447}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !658, file: !72, line: 1217, baseType: !101, size: 960)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !658, file: !72, line: 1218, baseType: !232, size: 64, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !658, file: !72, line: 1220, baseType: !403, size: 64, offset: 1024)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !658, file: !72, line: 1221, baseType: !664, size: 64, offset: 1088)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !234, line: 52, size: 4224, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !742, !755}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !665, file: !234, line: 53, baseType: !101, size: 960)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !665, file: !234, line: 54, baseType: !232, size: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !665, file: !234, line: 56, baseType: !131, size: 16, offset: 1024)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !665, file: !234, line: 56, baseType: !131, size: 16, offset: 1040)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !665, file: !234, line: 57, baseType: !131, size: 16, offset: 1056)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !665, file: !234, line: 57, baseType: !131, size: 16, offset: 1072)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !665, file: !234, line: 59, baseType: !25, size: 32, offset: 1088)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !665, file: !234, line: 59, baseType: !25, size: 32, offset: 1120)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !665, file: !234, line: 59, baseType: !25, size: 32, offset: 1152)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !665, file: !234, line: 60, baseType: !25, size: 32, offset: 1184)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !665, file: !234, line: 60, baseType: !25, size: 32, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !665, file: !234, line: 60, baseType: !25, size: 32, offset: 1248)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !665, file: !234, line: 61, baseType: !25, size: 32, offset: 1280)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !665, file: !234, line: 61, baseType: !25, size: 32, offset: 1312)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !665, file: !234, line: 61, baseType: !25, size: 32, offset: 1344)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !665, file: !234, line: 68, baseType: !25, size: 32, offset: 1376)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !665, file: !234, line: 68, baseType: !25, size: 32, offset: 1408)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !665, file: !234, line: 68, baseType: !25, size: 32, offset: 1440)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !665, file: !234, line: 69, baseType: !25, size: 32, offset: 1472)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !665, file: !234, line: 69, baseType: !25, size: 32, offset: 1504)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !665, file: !234, line: 74, baseType: !25, size: 32, offset: 1536)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !665, file: !234, line: 79, baseType: !25, size: 32, offset: 1568)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !665, file: !234, line: 81, baseType: !131, size: 16, offset: 1600)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !665, file: !234, line: 91, baseType: !131, size: 16, offset: 1616)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !665, file: !234, line: 92, baseType: !131, size: 16, offset: 1632)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !665, file: !234, line: 93, baseType: !131, size: 16, offset: 1648)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !665, file: !234, line: 94, baseType: !131, size: 16, offset: 1664)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !665, file: !234, line: 94, baseType: !131, size: 16, offset: 1680)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !665, file: !234, line: 94, baseType: !131, size: 16, offset: 1696)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !665, file: !234, line: 94, baseType: !131, size: 16, offset: 1712)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !665, file: !234, line: 96, baseType: !25, size: 32, offset: 1728)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !665, file: !234, line: 96, baseType: !25, size: 32, offset: 1760)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !665, file: !234, line: 96, baseType: !25, size: 32, offset: 1792)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !665, file: !234, line: 96, baseType: !25, size: 32, offset: 1824)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !665, file: !234, line: 98, baseType: !25, size: 32, offset: 1856)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !665, file: !234, line: 98, baseType: !25, size: 32, offset: 1888)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !665, file: !234, line: 98, baseType: !25, size: 32, offset: 1920)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !665, file: !234, line: 98, baseType: !25, size: 32, offset: 1952)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !665, file: !234, line: 99, baseType: !25, size: 32, offset: 1984)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !665, file: !234, line: 99, baseType: !25, size: 32, offset: 2016)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !665, file: !234, line: 100, baseType: !25, size: 32, offset: 2048)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !665, file: !234, line: 100, baseType: !25, size: 32, offset: 2080)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !665, file: !234, line: 103, baseType: !131, size: 16, offset: 2112)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !665, file: !234, line: 103, baseType: !131, size: 16, offset: 2128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !665, file: !234, line: 103, baseType: !131, size: 16, offset: 2144)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !665, file: !234, line: 103, baseType: !131, size: 16, offset: 2160)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !665, file: !234, line: 106, baseType: !25, size: 32, offset: 2176)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !665, file: !234, line: 106, baseType: !25, size: 32, offset: 2208)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !665, file: !234, line: 106, baseType: !25, size: 32, offset: 2240)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !665, file: !234, line: 106, baseType: !25, size: 32, offset: 2272)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !665, file: !234, line: 107, baseType: !131, size: 16, offset: 2304)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !665, file: !234, line: 107, baseType: !131, size: 16, offset: 2320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !665, file: !234, line: 107, baseType: !131, size: 16, offset: 2336)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !665, file: !234, line: 107, baseType: !131, size: 16, offset: 2352)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !665, file: !234, line: 108, baseType: !25, size: 32, offset: 2368)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !665, file: !234, line: 108, baseType: !25, size: 32, offset: 2400)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !665, file: !234, line: 109, baseType: !25, size: 32, offset: 2432)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !665, file: !234, line: 109, baseType: !25, size: 32, offset: 2464)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !665, file: !234, line: 110, baseType: !25, size: 32, offset: 2496)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !665, file: !234, line: 110, baseType: !25, size: 32, offset: 2528)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !665, file: !234, line: 110, baseType: !25, size: 32, offset: 2560)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !665, file: !234, line: 111, baseType: !131, size: 16, offset: 2592)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !665, file: !234, line: 111, baseType: !131, size: 16, offset: 2608)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !665, file: !234, line: 112, baseType: !131, size: 16, offset: 2624)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !665, file: !234, line: 112, baseType: !131, size: 16, offset: 2640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !665, file: !234, line: 112, baseType: !131, size: 16, offset: 2656)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !665, file: !234, line: 115, baseType: !131, size: 16, offset: 2672)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !665, file: !234, line: 118, baseType: !24, size: 64, offset: 2688)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !665, file: !234, line: 118, baseType: !24, size: 64, offset: 2752)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !665, file: !234, line: 121, baseType: !424, size: 64, offset: 2816)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !665, file: !234, line: 122, baseType: !394, size: 1152, offset: 2880)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !665, file: !234, line: 123, baseType: !131, size: 16, offset: 4032)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !665, file: !234, line: 123, baseType: !131, size: 16, offset: 4048)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !665, file: !234, line: 123, baseType: !741, size: 32, offset: 4064)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !29)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !665, file: !234, line: 126, baseType: !743, size: 64, offset: 4096)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !102, line: 159, size: 448, elements: !745)
!745 = !{!746, !748, !749, !750, !751, !753}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !744, file: !102, line: 161, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !29)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !744, file: !102, line: 162, baseType: !747, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !744, file: !102, line: 163, baseType: !741, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !744, file: !102, line: 164, baseType: !741, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !744, file: !102, line: 165, baseType: !752, size: 128, offset: 192)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !29)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !744, file: !102, line: 166, baseType: !754, size: 128, offset: 320)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 128, elements: !29)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !665, file: !234, line: 129, baseType: !756, size: 64, offset: 4160)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !758, line: 328, size: 3456, elements: !759)
!758 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!759 = !{!760, !761, !762, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1429, !1430, !1431, !1434, !1438, !1442, !1446, !1447, !1448, !1449, !1450}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !757, file: !758, line: 329, baseType: !101, size: 960)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !757, file: !758, line: 330, baseType: !232, size: 64, offset: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !757, file: !758, line: 332, baseType: !763, size: 64, offset: 1024)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !765, line: 283, size: 4096, elements: !766)
!765 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!766 = !{!767, !768, !769, !770, !774, !775, !779, !1369, !1377, !1381, !1387, !1391, !1392, !1393, !1394, !1398, !1399}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !765, line: 284, baseType: !13, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !764, file: !765, line: 285, baseType: !147, size: 512, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !764, file: !765, line: 287, baseType: !147, size: 512, offset: 544)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !764, file: !765, line: 288, baseType: !771, size: 2048, offset: 1056)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !764, file: !765, line: 289, baseType: !13, size: 32, offset: 3104)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !764, file: !765, line: 292, baseType: !776, size: 64, offset: 3136)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !756}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !764, file: !765, line: 293, baseType: !780, size: 64, offset: 3200)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !756, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !758, line: 167, size: 3712, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !758, line: 168, baseType: !783, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !784, file: !758, line: 168, baseType: !783, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !784, file: !758, line: 168, baseType: !783, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !784, file: !758, line: 170, baseType: !136, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !784, file: !758, line: 172, baseType: !791, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
