; ModuleID = 'blender/source/blender/editors/uvedit/uvedit_draw.c'
source_filename = "blender/source/blender/editors/uvedit/uvedit_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!360 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !361, line: 57, baseType: !5, size: 32, elements: !362)
!361 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376}
!363 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!364 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!365 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!366 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!367 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!368 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!369 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!370 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!371 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!372 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!373 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!374 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!375 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!376 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !378, line: 260, baseType: !5, size: 32, elements: !379)
!378 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!379 = !{!380, !381, !382, !383, !384, !385, !386}
!380 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!381 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!382 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!383 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!384 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!385 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!386 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!387 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceImage_UVDT", file: !32, line: 747, baseType: !5, size: 32, elements: !388)
!388 = !{!389, !390, !391, !392}
!389 = !DIEnumerator(name: "SI_UVDT_OUTLINE", value: 0, isUnsigned: true)
!390 = !DIEnumerator(name: "SI_UVDT_DASH", value: 1, isUnsigned: true)
!391 = !DIEnumerator(name: "SI_UVDT_BLACK", value: 2, isUnsigned: true)
!392 = !DIEnumerator(name: "SI_UVDT_WHITE", value: 3, isUnsigned: true)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 115, baseType: !5, size: 32, elements: !395)
!394 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!395 = !{!396, !397, !398}
!396 = !DIEnumerator(name: "MLOOPUV_EDGESEL", value: 1, isUnsigned: true)
!397 = !DIEnumerator(name: "MLOOPUV_VERTSEL", value: 2, isUnsigned: true)
!398 = !DIEnumerator(name: "MLOOPUV_PINNED", value: 4, isUnsigned: true)
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 619, baseType: !5, size: 32, elements: !400)
!400 = !{!401, !402, !403}
!401 = !DIEnumerator(name: "OB_RESTRICT_VIEW", value: 1, isUnsigned: true)
!402 = !DIEnumerator(name: "OB_RESTRICT_SELECT", value: 2, isUnsigned: true)
!403 = !DIEnumerator(name: "OB_RESTRICT_RENDER", value: 4, isUnsigned: true)
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !405, line: 50, baseType: !5, size: 32, elements: !406)
!405 = !DIFile(filename: "blender/source/blender/blenlib/BLI_buffer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!406 = !{!407, !408, !409}
!407 = !DIEnumerator(name: "BLI_BUFFER_NOP", value: 0, isUnsigned: true)
!408 = !DIEnumerator(name: "BLI_BUFFER_USE_STATIC", value: 1, isUnsigned: true)
!409 = !DIEnumerator(name: "BLI_BUFFER_USE_CALLOC", value: 2, isUnsigned: true)
!410 = !{!411, !412, !413, !414, !418, !422, !487, !489, !471, !491, !492, !496, !432, !497, !3072, !3075, !3076, !3082, !1263, !1272, !3084, !434}
!411 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !361, line: 79, baseType: !360)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !361, line: 158, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !412}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !361, line: 159, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!412, !412}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !378, line: 103, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !378, line: 90, size: 448, elements: !425)
!425 = !{!426, !437, !443, !447, !448}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !424, file: !378, line: 91, baseType: !427, size: 128)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !378, line: 82, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !378, line: 64, size: 128, elements: !429)
!429 = !{!430, !431, !433, !435, !436}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !428, file: !378, line: 65, baseType: !412, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !428, file: !378, line: 66, baseType: !432, size: 32, offset: 64)
!432 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !428, file: !378, line: 73, baseType: !434, size: 8, offset: 96)
!434 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !428, file: !378, line: 74, baseType: !434, size: 8, offset: 104)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !428, file: !378, line: 80, baseType: !434, size: 8, offset: 112)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !424, file: !378, line: 92, baseType: !438, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !378, line: 180, size: 16, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !439, file: !378, line: 181, baseType: !442, size: 16)
!442 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !424, file: !378, line: 94, baseType: !444, size: 96, offset: 192)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 96, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 3)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !424, file: !378, line: 95, baseType: !444, size: 96, offset: 288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !424, file: !378, line: 102, baseType: !449, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !378, line: 110, size: 640, elements: !451)
!451 = !{!452, !453, !454, !456, !457, !480, !486}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !450, file: !378, line: 111, baseType: !427, size: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !450, file: !378, line: 112, baseType: !438, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !450, file: !378, line: 114, baseType: !455, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !450, file: !378, line: 114, baseType: !455, size: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !450, file: !378, line: 118, baseType: !458, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !378, line: 125, size: 576, elements: !460)
!460 = !{!461, !462, !463, !464, !476, !477, !478, !479}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !459, file: !378, line: 126, baseType: !427, size: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !459, file: !378, line: 129, baseType: !455, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !459, file: !378, line: 130, baseType: !449, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !459, file: !378, line: 131, baseType: !465, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !378, line: 164, size: 448, elements: !467)
!467 = !{!468, !469, !470, !473, !474, !475}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !466, file: !378, line: 165, baseType: !427, size: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !466, file: !378, line: 166, baseType: !438, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !466, file: !378, line: 172, baseType: !471, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !378, line: 140, baseType: !459)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !466, file: !378, line: 174, baseType: !432, size: 32, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !466, file: !378, line: 175, baseType: !444, size: 96, offset: 288)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !466, file: !378, line: 176, baseType: !442, size: 16, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !459, file: !378, line: 135, baseType: !458, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !459, file: !378, line: 135, baseType: !458, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !378, line: 139, baseType: !458, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !378, line: 139, baseType: !458, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !450, file: !378, line: 122, baseType: !481, size: 128, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !378, line: 108, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !378, line: 106, size: 128, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !378, line: 107, baseType: !449, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !482, file: !378, line: 107, baseType: !449, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !450, file: !378, line: 122, baseType: !481, size: 128, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !378, line: 123, baseType: !450)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !378, line: 178, baseType: !466)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLubyte", file: !494, line: 278, baseType: !495)
!494 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!495 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !499, line: 133, baseType: !500)
!499 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !499, line: 58, size: 11008, elements: !501)
!501 = !{!502, !570, !574, !584, !587, !590, !2844, !2850, !2851, !2861, !2862, !2868, !2876, !2877, !2878, !2891, !2892, !2893, !2894, !2902, !2904, !3024, !3025, !3026, !3027, !3028, !3029, !3030, !3031, !3032, !3033, !3034, !3035, !3036, !3037, !3038, !3039, !3040, !3041, !3042, !3043, !3044, !3045, !3046, !3047, !3048, !3049, !3050, !3051}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !500, file: !499, line: 59, baseType: !503, size: 960)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !504, line: 130, baseType: !505)
!504 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !504, line: 117, size: 960, elements: !506)
!506 = !{!507, !508, !509, !511, !530, !534, !535, !536, !537, !538}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !504, line: 118, baseType: !412, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !505, file: !504, line: 118, baseType: !412, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !505, file: !504, line: 119, baseType: !510, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !505, file: !504, line: 120, baseType: !512, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !504, line: 136, size: 17600, elements: !514)
!514 = !{!515, !516, !518, !521, !525, !526, !527}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !513, file: !504, line: 137, baseType: !503, size: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !513, file: !504, line: 138, baseType: !517, size: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !513, file: !504, line: 139, baseType: !519, size: 64, offset: 1024)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !504, line: 43, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !513, file: !504, line: 140, baseType: !522, size: 8192, offset: 1088)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 8192, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 1024)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !513, file: !504, line: 141, baseType: !522, size: 8192, offset: 9280)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !513, file: !504, line: 148, baseType: !512, size: 64, offset: 17472)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !513, file: !504, line: 150, baseType: !528, size: 64, offset: 17536)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !504, line: 45, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !505, file: !504, line: 121, baseType: !531, size: 528, offset: 256)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 528, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 66)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !505, file: !504, line: 126, baseType: !442, size: 16, offset: 784)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !505, file: !504, line: 127, baseType: !432, size: 32, offset: 800)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !505, file: !504, line: 128, baseType: !432, size: 32, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !505, file: !504, line: 128, baseType: !432, size: 32, offset: 864)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !505, file: !504, line: 129, baseType: !539, size: 64, offset: 896)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !504, line: 75, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !504, line: 62, size: 1024, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549, !553, !554, !568, !569}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !504, line: 63, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !541, file: !504, line: 63, baseType: !544, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !541, file: !504, line: 64, baseType: !434, size: 8, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !541, file: !504, line: 64, baseType: !434, size: 8, offset: 136)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !504, line: 65, baseType: !442, size: 16, offset: 144)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !541, file: !504, line: 66, baseType: !550, size: 512, offset: 160)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 512, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !541, file: !504, line: 67, baseType: !432, size: 32, offset: 672)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !541, file: !504, line: 69, baseType: !555, size: 256, offset: 704)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !504, line: 60, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !504, line: 48, size: 256, elements: !557)
!557 = !{!558, !559, !566, !567}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !556, file: !504, line: 49, baseType: !412, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !556, file: !504, line: 58, baseType: !560, size: 128, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !561, line: 71, baseType: !562)
!561 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !561, line: 69, size: 128, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !562, file: !561, line: 70, baseType: !412, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !562, file: !561, line: 70, baseType: !412, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !556, file: !504, line: 59, baseType: !432, size: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !556, file: !504, line: 59, baseType: !432, size: 32, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !541, file: !504, line: 70, baseType: !432, size: 32, offset: 960)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !541, file: !504, line: 74, baseType: !432, size: 32, offset: 992)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !500, file: !499, line: 60, baseType: !571, size: 64, offset: 960)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !573, line: 48, flags: DIFlagFwdDecl)
!573 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !500, file: !499, line: 62, baseType: !575, size: 64, offset: 1024)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !59, line: 97, size: 832, elements: !577)
!577 = !{!578, !582, !583}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !576, file: !59, line: 98, baseType: !579, size: 768)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 768, elements: !580)
!580 = !{!581, !446}
!581 = !DISubrange(count: 8)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !59, line: 99, baseType: !432, size: 32, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !576, file: !59, line: 99, baseType: !432, size: 32, offset: 800)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !500, file: !499, line: 64, baseType: !585, size: 64, offset: 1088)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !573, line: 49, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !500, file: !499, line: 65, baseType: !588, size: 64, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !499, line: 42, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !500, file: !499, line: 66, baseType: !591, size: 64, offset: 1216)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !573, line: 93, size: 7552, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !643, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !712, !713, !714, !715, !716, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2843}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !593, file: !573, line: 94, baseType: !503, size: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !593, file: !573, line: 95, baseType: !571, size: 64, offset: 960)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !593, file: !573, line: 97, baseType: !442, size: 16, offset: 1024)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !593, file: !573, line: 97, baseType: !442, size: 16, offset: 1040)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !593, file: !573, line: 99, baseType: !411, size: 32, offset: 1056)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !593, file: !573, line: 99, baseType: !411, size: 32, offset: 1088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !593, file: !573, line: 99, baseType: !411, size: 32, offset: 1120)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !593, file: !573, line: 100, baseType: !411, size: 32, offset: 1152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !593, file: !573, line: 100, baseType: !411, size: 32, offset: 1184)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !593, file: !573, line: 100, baseType: !411, size: 32, offset: 1216)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !593, file: !573, line: 101, baseType: !411, size: 32, offset: 1248)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !593, file: !573, line: 101, baseType: !411, size: 32, offset: 1280)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !593, file: !573, line: 101, baseType: !411, size: 32, offset: 1312)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !593, file: !573, line: 102, baseType: !411, size: 32, offset: 1344)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !593, file: !573, line: 102, baseType: !411, size: 32, offset: 1376)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !593, file: !573, line: 102, baseType: !411, size: 32, offset: 1408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !593, file: !573, line: 103, baseType: !411, size: 32, offset: 1440)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !593, file: !573, line: 103, baseType: !411, size: 32, offset: 1472)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !593, file: !573, line: 103, baseType: !411, size: 32, offset: 1504)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !593, file: !573, line: 103, baseType: !411, size: 32, offset: 1536)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !593, file: !573, line: 103, baseType: !411, size: 32, offset: 1568)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !593, file: !573, line: 104, baseType: !411, size: 32, offset: 1600)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !593, file: !573, line: 104, baseType: !411, size: 32, offset: 1632)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !593, file: !573, line: 104, baseType: !411, size: 32, offset: 1664)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !593, file: !573, line: 104, baseType: !411, size: 32, offset: 1696)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !593, file: !573, line: 104, baseType: !411, size: 32, offset: 1728)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !593, file: !573, line: 105, baseType: !411, size: 32, offset: 1760)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !593, file: !573, line: 108, baseType: !623, size: 704, offset: 1792)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !573, line: 53, size: 704, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !623, file: !573, line: 54, baseType: !411, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !623, file: !573, line: 55, baseType: !411, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !623, file: !573, line: 56, baseType: !411, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !623, file: !573, line: 57, baseType: !411, size: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !623, file: !573, line: 59, baseType: !444, size: 96, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !623, file: !573, line: 60, baseType: !444, size: 96, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !623, file: !573, line: 61, baseType: !444, size: 96, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !623, file: !573, line: 63, baseType: !411, size: 32, offset: 416)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !623, file: !573, line: 64, baseType: !411, size: 32, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !623, file: !573, line: 65, baseType: !411, size: 32, offset: 480)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !623, file: !573, line: 67, baseType: !442, size: 16, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !623, file: !573, line: 68, baseType: !442, size: 16, offset: 528)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !623, file: !573, line: 69, baseType: !442, size: 16, offset: 544)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !623, file: !573, line: 70, baseType: !442, size: 16, offset: 560)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !623, file: !573, line: 72, baseType: !411, size: 32, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !623, file: !573, line: 73, baseType: !411, size: 32, offset: 608)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !623, file: !573, line: 74, baseType: !411, size: 32, offset: 640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !623, file: !573, line: 75, baseType: !411, size: 32, offset: 672)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !593, file: !573, line: 109, baseType: !644, size: 128, offset: 2496)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !573, line: 79, size: 128, elements: !645)
!645 = !{!646, !647, !648, !649}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !644, file: !573, line: 80, baseType: !432, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !644, file: !573, line: 81, baseType: !432, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !644, file: !573, line: 82, baseType: !432, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !644, file: !573, line: 83, baseType: !432, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !593, file: !573, line: 111, baseType: !411, size: 32, offset: 2624)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !593, file: !573, line: 111, baseType: !411, size: 32, offset: 2656)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !593, file: !573, line: 112, baseType: !411, size: 32, offset: 2688)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !593, file: !573, line: 112, baseType: !411, size: 32, offset: 2720)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !593, file: !573, line: 113, baseType: !411, size: 32, offset: 2752)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !593, file: !573, line: 114, baseType: !411, size: 32, offset: 2784)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !593, file: !573, line: 114, baseType: !411, size: 32, offset: 2816)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !593, file: !573, line: 115, baseType: !442, size: 16, offset: 2848)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !593, file: !573, line: 115, baseType: !442, size: 16, offset: 2864)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !593, file: !573, line: 116, baseType: !442, size: 16, offset: 2880)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !593, file: !573, line: 117, baseType: !434, size: 8, offset: 2896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !593, file: !573, line: 117, baseType: !434, size: 8, offset: 2904)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !593, file: !573, line: 119, baseType: !411, size: 32, offset: 2912)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !593, file: !573, line: 119, baseType: !411, size: 32, offset: 2944)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !593, file: !573, line: 120, baseType: !442, size: 16, offset: 2976)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !593, file: !573, line: 120, baseType: !442, size: 16, offset: 2992)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !593, file: !573, line: 121, baseType: !411, size: 32, offset: 3008)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !593, file: !573, line: 121, baseType: !411, size: 32, offset: 3040)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !593, file: !573, line: 122, baseType: !411, size: 32, offset: 3072)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !593, file: !573, line: 123, baseType: !411, size: 32, offset: 3104)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !593, file: !573, line: 124, baseType: !442, size: 16, offset: 3136)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !593, file: !573, line: 125, baseType: !442, size: 16, offset: 3152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !593, file: !573, line: 127, baseType: !432, size: 32, offset: 3168)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !593, file: !573, line: 127, baseType: !432, size: 32, offset: 3200)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !593, file: !573, line: 128, baseType: !432, size: 32, offset: 3232)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !593, file: !573, line: 128, baseType: !432, size: 32, offset: 3264)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !593, file: !573, line: 129, baseType: !442, size: 16, offset: 3296)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !593, file: !573, line: 129, baseType: !442, size: 16, offset: 3312)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !593, file: !573, line: 129, baseType: !442, size: 16, offset: 3328)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !593, file: !573, line: 129, baseType: !442, size: 16, offset: 3344)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !593, file: !573, line: 130, baseType: !411, size: 32, offset: 3360)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !593, file: !573, line: 130, baseType: !411, size: 32, offset: 3392)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !593, file: !573, line: 130, baseType: !411, size: 32, offset: 3424)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !593, file: !573, line: 130, baseType: !411, size: 32, offset: 3456)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !593, file: !573, line: 131, baseType: !411, size: 32, offset: 3488)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !593, file: !573, line: 131, baseType: !411, size: 32, offset: 3520)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !593, file: !573, line: 131, baseType: !411, size: 32, offset: 3552)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !593, file: !573, line: 131, baseType: !411, size: 32, offset: 3584)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !593, file: !573, line: 132, baseType: !411, size: 32, offset: 3616)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !593, file: !573, line: 132, baseType: !411, size: 32, offset: 3648)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !593, file: !573, line: 133, baseType: !550, size: 512, offset: 3680)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !593, file: !573, line: 135, baseType: !411, size: 32, offset: 4192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !593, file: !573, line: 136, baseType: !411, size: 32, offset: 4224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !593, file: !573, line: 137, baseType: !411, size: 32, offset: 4256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !593, file: !573, line: 138, baseType: !432, size: 32, offset: 4288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !593, file: !573, line: 141, baseType: !434, size: 8, offset: 4320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !593, file: !573, line: 141, baseType: !434, size: 8, offset: 4328)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !593, file: !573, line: 141, baseType: !434, size: 8, offset: 4336)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !593, file: !573, line: 141, baseType: !434, size: 8, offset: 4344)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !593, file: !573, line: 142, baseType: !442, size: 16, offset: 4352)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !593, file: !573, line: 142, baseType: !442, size: 16, offset: 4368)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !593, file: !573, line: 142, baseType: !442, size: 16, offset: 4384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !593, file: !573, line: 145, baseType: !434, size: 8, offset: 4400)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !593, file: !573, line: 145, baseType: !434, size: 8, offset: 4408)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !593, file: !573, line: 148, baseType: !442, size: 16, offset: 4416)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !593, file: !573, line: 148, baseType: !442, size: 16, offset: 4432)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !593, file: !573, line: 149, baseType: !411, size: 32, offset: 4448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !593, file: !573, line: 149, baseType: !411, size: 32, offset: 4480)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !593, file: !573, line: 152, baseType: !709, size: 128, offset: 4512)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 128, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 4)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !593, file: !573, line: 153, baseType: !411, size: 32, offset: 4640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !593, file: !573, line: 154, baseType: !411, size: 32, offset: 4672)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !593, file: !573, line: 157, baseType: !442, size: 16, offset: 4704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !593, file: !573, line: 157, baseType: !442, size: 16, offset: 4720)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !593, file: !573, line: 160, baseType: !717, size: 64, offset: 4736)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !719, line: 113, size: 6208, elements: !720)
!719 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!720 = !{!721, !722, !723, !724, !725, !726, !730}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !718, file: !719, line: 114, baseType: !442, size: 16)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !718, file: !719, line: 114, baseType: !442, size: 16, offset: 16)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !718, file: !719, line: 115, baseType: !434, size: 8, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !718, file: !719, line: 115, baseType: !434, size: 8, offset: 40)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !718, file: !719, line: 116, baseType: !434, size: 8, offset: 48)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !718, file: !719, line: 117, baseType: !727, size: 8, offset: 56)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 8, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 1)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !718, file: !719, line: 119, baseType: !731, size: 6144, offset: 64)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 6144, elements: !741)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !719, line: 109, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !719, line: 106, size: 192, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !733, file: !719, line: 107, baseType: !411, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !733, file: !719, line: 107, baseType: !411, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !733, file: !719, line: 107, baseType: !411, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !733, file: !719, line: 107, baseType: !411, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !733, file: !719, line: 107, baseType: !411, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !733, file: !719, line: 108, baseType: !432, size: 32, offset: 160)
!741 = !{!742}
!742 = !DISubrange(count: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !593, file: !573, line: 161, baseType: !717, size: 64, offset: 4800)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !593, file: !573, line: 162, baseType: !434, size: 8, offset: 4864)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !593, file: !573, line: 162, baseType: !434, size: 8, offset: 4872)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !593, file: !573, line: 163, baseType: !434, size: 8, offset: 4880)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !593, file: !573, line: 163, baseType: !434, size: 8, offset: 4888)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !593, file: !573, line: 164, baseType: !442, size: 16, offset: 4896)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !593, file: !573, line: 164, baseType: !442, size: 16, offset: 4912)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !593, file: !573, line: 165, baseType: !411, size: 32, offset: 4928)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !593, file: !573, line: 165, baseType: !411, size: 32, offset: 4960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !593, file: !573, line: 167, baseType: !753, size: 1152, offset: 4992)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 1152, elements: !2801)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !719, line: 57, size: 2496, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !2596, !2742, !2743, !2744, !2745, !2746, !2747, !2748, !2749, !2750, !2751, !2752, !2753, !2754, !2755, !2756, !2757, !2758, !2759, !2760, !2761, !2762, !2763, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786, !2787, !2788, !2789, !2790, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !755, file: !719, line: 59, baseType: !442, size: 16)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !755, file: !719, line: 59, baseType: !442, size: 16, offset: 16)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !755, file: !719, line: 59, baseType: !442, size: 16, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !755, file: !719, line: 59, baseType: !442, size: 16, offset: 48)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !755, file: !719, line: 60, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !59, line: 115, size: 11392, elements: !764)
!764 = !{!765, !766, !767, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !797, !798, !839, !840, !843, !844, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !944, !945, !946, !947, !948, !949, !950, !951, !952, !955, !958, !961, !962, !963, !964, !965, !968, !971, !1456, !1457, !1463, !1464, !1465, !1466, !1467, !1468, !1470, !1473, !1476, !1478, !2584, !2585}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !763, file: !59, line: 116, baseType: !503, size: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !763, file: !59, line: 117, baseType: !571, size: 64, offset: 960)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !763, file: !59, line: 119, baseType: !768, size: 64, offset: 1024)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !59, line: 57, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !763, file: !59, line: 121, baseType: !442, size: 16, offset: 1088)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !763, file: !59, line: 121, baseType: !442, size: 16, offset: 1104)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !763, file: !59, line: 122, baseType: !432, size: 32, offset: 1120)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !763, file: !59, line: 122, baseType: !432, size: 32, offset: 1152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !763, file: !59, line: 122, baseType: !432, size: 32, offset: 1184)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !763, file: !59, line: 123, baseType: !550, size: 512, offset: 1216)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !763, file: !59, line: 124, baseType: !762, size: 64, offset: 1728)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !763, file: !59, line: 124, baseType: !762, size: 64, offset: 1792)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !763, file: !59, line: 127, baseType: !762, size: 64, offset: 1856)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !763, file: !59, line: 127, baseType: !762, size: 64, offset: 1920)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !763, file: !59, line: 127, baseType: !762, size: 64, offset: 1984)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !763, file: !59, line: 128, baseType: !585, size: 64, offset: 2048)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !763, file: !59, line: 130, baseType: !575, size: 64, offset: 2112)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !763, file: !59, line: 131, baseType: !784, size: 64, offset: 2176)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !786, line: 486, size: 1600, elements: !787)
!786 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !785, file: !786, line: 487, baseType: !503, size: 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !785, file: !786, line: 489, baseType: !560, size: 128, offset: 960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !785, file: !786, line: 490, baseType: !560, size: 128, offset: 1088)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !785, file: !786, line: 491, baseType: !560, size: 128, offset: 1216)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !785, file: !786, line: 492, baseType: !560, size: 128, offset: 1344)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !785, file: !786, line: 494, baseType: !432, size: 32, offset: 1472)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !785, file: !786, line: 495, baseType: !432, size: 32, offset: 1504)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !785, file: !786, line: 497, baseType: !432, size: 32, offset: 1536)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !785, file: !786, line: 498, baseType: !432, size: 32, offset: 1568)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !763, file: !59, line: 132, baseType: !784, size: 64, offset: 2240)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !763, file: !59, line: 133, baseType: !799, size: 64, offset: 2304)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !786, line: 334, size: 1728, elements: !801)
!801 = !{!802, !803, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !838}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !800, file: !786, line: 335, baseType: !560, size: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !800, file: !786, line: 336, baseType: !804, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !786, line: 47, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !800, file: !786, line: 338, baseType: !442, size: 16, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !800, file: !786, line: 338, baseType: !442, size: 16, offset: 208)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !800, file: !786, line: 339, baseType: !5, size: 32, offset: 224)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !800, file: !786, line: 340, baseType: !432, size: 32, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !800, file: !786, line: 342, baseType: !411, size: 32, offset: 288)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !800, file: !786, line: 343, baseType: !444, size: 96, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !800, file: !786, line: 344, baseType: !444, size: 96, offset: 416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !800, file: !786, line: 347, baseType: !560, size: 128, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !800, file: !786, line: 349, baseType: !432, size: 32, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !800, file: !786, line: 350, baseType: !432, size: 32, offset: 672)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !800, file: !786, line: 351, baseType: !412, size: 64, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !800, file: !786, line: 352, baseType: !412, size: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !800, file: !786, line: 354, baseType: !819, size: 384, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !786, line: 116, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !786, line: 94, size: 384, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !820, file: !786, line: 96, baseType: !432, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !820, file: !786, line: 96, baseType: !432, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !820, file: !786, line: 97, baseType: !432, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !820, file: !786, line: 97, baseType: !432, size: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !820, file: !786, line: 99, baseType: !442, size: 16, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !820, file: !786, line: 100, baseType: !442, size: 16, offset: 144)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !820, file: !786, line: 102, baseType: !442, size: 16, offset: 160)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !820, file: !786, line: 105, baseType: !442, size: 16, offset: 176)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !820, file: !786, line: 108, baseType: !442, size: 16, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !820, file: !786, line: 109, baseType: !442, size: 16, offset: 208)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !820, file: !786, line: 111, baseType: !442, size: 16, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !820, file: !786, line: 112, baseType: !442, size: 16, offset: 240)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !820, file: !786, line: 114, baseType: !432, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !820, file: !786, line: 114, baseType: !432, size: 32, offset: 288)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !820, file: !786, line: 115, baseType: !432, size: 32, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !820, file: !786, line: 115, baseType: !432, size: 32, offset: 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !800, file: !786, line: 355, baseType: !550, size: 512, offset: 1216)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !763, file: !59, line: 134, baseType: !412, size: 64, offset: 2368)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !763, file: !59, line: 136, baseType: !841, size: 64, offset: 2432)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !59, line: 58, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !763, file: !59, line: 138, baseType: !819, size: 384, offset: 2496)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !763, file: !59, line: 139, baseType: !845, size: 64, offset: 2880)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !786, line: 80, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !786, line: 72, size: 192, elements: !848)
!848 = !{!849, !856, !857, !858, !859}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !847, file: !786, line: 73, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !786, line: 59, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !786, line: 56, size: 128, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !852, file: !786, line: 57, baseType: !444, size: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !852, file: !786, line: 58, baseType: !432, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !847, file: !786, line: 74, baseType: !432, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !847, file: !786, line: 76, baseType: !432, size: 32, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !847, file: !786, line: 77, baseType: !432, size: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !847, file: !786, line: 79, baseType: !432, size: 32, offset: 160)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !763, file: !59, line: 141, baseType: !560, size: 128, offset: 2944)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !763, file: !59, line: 142, baseType: !560, size: 128, offset: 3072)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !763, file: !59, line: 143, baseType: !560, size: 128, offset: 3200)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !763, file: !59, line: 144, baseType: !560, size: 128, offset: 3328)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !763, file: !59, line: 146, baseType: !432, size: 32, offset: 3456)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !763, file: !59, line: 147, baseType: !432, size: 32, offset: 3488)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !763, file: !59, line: 150, baseType: !591, size: 64, offset: 3520)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !763, file: !59, line: 151, baseType: !491, size: 64, offset: 3584)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !763, file: !59, line: 152, baseType: !432, size: 32, offset: 3648)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !763, file: !59, line: 153, baseType: !432, size: 32, offset: 3680)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !763, file: !59, line: 156, baseType: !444, size: 96, offset: 3712)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !763, file: !59, line: 156, baseType: !444, size: 96, offset: 3808)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !763, file: !59, line: 156, baseType: !444, size: 96, offset: 3904)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !763, file: !59, line: 157, baseType: !444, size: 96, offset: 4000)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !763, file: !59, line: 158, baseType: !444, size: 96, offset: 4096)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !763, file: !59, line: 159, baseType: !444, size: 96, offset: 4192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !763, file: !59, line: 160, baseType: !444, size: 96, offset: 4288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !763, file: !59, line: 160, baseType: !444, size: 96, offset: 4384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !763, file: !59, line: 161, baseType: !709, size: 128, offset: 4480)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !763, file: !59, line: 161, baseType: !709, size: 128, offset: 4608)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !763, file: !59, line: 162, baseType: !444, size: 96, offset: 4736)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !763, file: !59, line: 162, baseType: !444, size: 96, offset: 4832)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !763, file: !59, line: 163, baseType: !411, size: 32, offset: 4928)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !763, file: !59, line: 163, baseType: !411, size: 32, offset: 4960)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !763, file: !59, line: 164, baseType: !885, size: 512, offset: 4992)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 512, elements: !886)
!886 = !{!711, !711}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !763, file: !59, line: 165, baseType: !885, size: 512, offset: 5504)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !763, file: !59, line: 166, baseType: !885, size: 512, offset: 6016)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !763, file: !59, line: 167, baseType: !885, size: 512, offset: 6528)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !763, file: !59, line: 176, baseType: !885, size: 512, offset: 7040)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !763, file: !59, line: 178, baseType: !5, size: 32, offset: 7552)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !763, file: !59, line: 180, baseType: !442, size: 16, offset: 7584)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !763, file: !59, line: 181, baseType: !442, size: 16, offset: 7600)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !763, file: !59, line: 183, baseType: !442, size: 16, offset: 7616)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !763, file: !59, line: 183, baseType: !442, size: 16, offset: 7632)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !763, file: !59, line: 184, baseType: !442, size: 16, offset: 7648)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !763, file: !59, line: 184, baseType: !442, size: 16, offset: 7664)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !763, file: !59, line: 185, baseType: !442, size: 16, offset: 7680)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !763, file: !59, line: 186, baseType: !442, size: 16, offset: 7696)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !763, file: !59, line: 187, baseType: !442, size: 16, offset: 7712)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !763, file: !59, line: 188, baseType: !434, size: 8, offset: 7728)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !763, file: !59, line: 189, baseType: !434, size: 8, offset: 7736)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !763, file: !59, line: 192, baseType: !432, size: 32, offset: 7744)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !763, file: !59, line: 192, baseType: !432, size: 32, offset: 7776)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !763, file: !59, line: 192, baseType: !432, size: 32, offset: 7808)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !763, file: !59, line: 192, baseType: !432, size: 32, offset: 7840)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !763, file: !59, line: 194, baseType: !432, size: 32, offset: 7872)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !763, file: !59, line: 202, baseType: !411, size: 32, offset: 7904)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !763, file: !59, line: 202, baseType: !411, size: 32, offset: 7936)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !763, file: !59, line: 202, baseType: !411, size: 32, offset: 7968)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !763, file: !59, line: 211, baseType: !411, size: 32, offset: 8000)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !763, file: !59, line: 212, baseType: !411, size: 32, offset: 8032)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !763, file: !59, line: 213, baseType: !411, size: 32, offset: 8064)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !763, file: !59, line: 214, baseType: !411, size: 32, offset: 8096)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !763, file: !59, line: 215, baseType: !411, size: 32, offset: 8128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !763, file: !59, line: 216, baseType: !411, size: 32, offset: 8160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !763, file: !59, line: 219, baseType: !411, size: 32, offset: 8192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !763, file: !59, line: 220, baseType: !411, size: 32, offset: 8224)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !763, file: !59, line: 221, baseType: !411, size: 32, offset: 8256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !763, file: !59, line: 224, baseType: !921, size: 16, offset: 8288)
!921 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !763, file: !59, line: 224, baseType: !921, size: 16, offset: 8304)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !763, file: !59, line: 226, baseType: !442, size: 16, offset: 8320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !763, file: !59, line: 228, baseType: !434, size: 8, offset: 8336)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !763, file: !59, line: 229, baseType: !434, size: 8, offset: 8344)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !763, file: !59, line: 231, baseType: !442, size: 16, offset: 8352)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !763, file: !59, line: 232, baseType: !434, size: 8, offset: 8368)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !763, file: !59, line: 233, baseType: !434, size: 8, offset: 8376)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !763, file: !59, line: 234, baseType: !411, size: 32, offset: 8384)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !763, file: !59, line: 235, baseType: !411, size: 32, offset: 8416)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !763, file: !59, line: 237, baseType: !560, size: 128, offset: 8448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !763, file: !59, line: 238, baseType: !560, size: 128, offset: 8576)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !763, file: !59, line: 239, baseType: !560, size: 128, offset: 8704)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !763, file: !59, line: 240, baseType: !560, size: 128, offset: 8832)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !763, file: !59, line: 242, baseType: !411, size: 32, offset: 8960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !763, file: !59, line: 244, baseType: !442, size: 16, offset: 8992)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !763, file: !59, line: 245, baseType: !921, size: 16, offset: 9008)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !763, file: !59, line: 246, baseType: !709, size: 128, offset: 9024)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !763, file: !59, line: 248, baseType: !432, size: 32, offset: 9152)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !763, file: !59, line: 249, baseType: !432, size: 32, offset: 9184)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !763, file: !59, line: 251, baseType: !942, size: 64, offset: 9216)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !59, line: 251, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !763, file: !59, line: 253, baseType: !434, size: 8, offset: 9280)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !763, file: !59, line: 254, baseType: !434, size: 8, offset: 9288)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !763, file: !59, line: 255, baseType: !442, size: 16, offset: 9296)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !763, file: !59, line: 256, baseType: !444, size: 96, offset: 9312)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !763, file: !59, line: 258, baseType: !560, size: 128, offset: 9408)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !763, file: !59, line: 259, baseType: !560, size: 128, offset: 9536)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !763, file: !59, line: 260, baseType: !560, size: 128, offset: 9664)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !763, file: !59, line: 261, baseType: !560, size: 128, offset: 9792)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !763, file: !59, line: 263, baseType: !953, size: 64, offset: 9920)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !59, line: 52, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !763, file: !59, line: 264, baseType: !956, size: 64, offset: 9984)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !59, line: 53, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !763, file: !59, line: 265, baseType: !959, size: 64, offset: 10048)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !573, line: 46, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !763, file: !59, line: 267, baseType: !434, size: 8, offset: 10112)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !763, file: !59, line: 268, baseType: !434, size: 8, offset: 10120)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !763, file: !59, line: 269, baseType: !442, size: 16, offset: 10128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !763, file: !59, line: 270, baseType: !411, size: 32, offset: 10144)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !763, file: !59, line: 272, baseType: !966, size: 64, offset: 10176)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !59, line: 54, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !763, file: !59, line: 275, baseType: !969, size: 64, offset: 10240)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !59, line: 275, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !763, file: !59, line: 277, baseType: !972, size: 64, offset: 10304)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !974)
!974 = !{!975, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1026, !1029, !1031, !1032, !1034, !1035, !1036, !1037, !1043, !1048, !1049, !1053, !1054, !1055, !1056, !1057, !1069, !1081, !1095, !1099, !1103, !1107, !1116, !1128, !1132, !1136, !1140, !1144, !1148, !1149, !1150, !1151, !1152, !1153, !1157, !1158, !1159, !1160, !1164, !1165, !1166, !1167, !1168, !1173, !1174, !1175, !1176, !1177, !1181, !1182, !1183, !1184, !1185, !1192, !1203, !1208, !1214, !1224, !1230, !1241, !1248, !1255, !1259, !1264, !1268, !1273, !1274, !1275, !1282, !1288, !1289, !1290, !1294, !1295, !1304, !1413, !1417, !1425, !1429, !1433, !1437, !1445, !1455}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !973, file: !4, line: 180, baseType: !976, size: 1600)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !121, line: 73, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !121, line: 64, size: 1600, elements: !978)
!978 = !{!979, !994, !998, !999, !1000, !1001, !1004}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !977, file: !121, line: 65, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !121, line: 53, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !121, line: 42, size: 832, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !982, file: !121, line: 43, baseType: !432, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !982, file: !121, line: 44, baseType: !432, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !982, file: !121, line: 45, baseType: !432, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !982, file: !121, line: 46, baseType: !432, size: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !982, file: !121, line: 47, baseType: !432, size: 32, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !982, file: !121, line: 48, baseType: !432, size: 32, offset: 160)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !982, file: !121, line: 49, baseType: !432, size: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !982, file: !121, line: 50, baseType: !432, size: 32, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !982, file: !121, line: 51, baseType: !550, size: 512, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !982, file: !121, line: 52, baseType: !412, size: 64, offset: 768)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !977, file: !121, line: 66, baseType: !995, size: 1312, offset: 64)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 1312, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 41)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !977, file: !121, line: 69, baseType: !432, size: 32, offset: 1376)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !977, file: !121, line: 69, baseType: !432, size: 32, offset: 1408)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !977, file: !121, line: 70, baseType: !432, size: 32, offset: 1440)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !977, file: !121, line: 71, baseType: !1002, size: 64, offset: 1472)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !121, line: 71, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !977, file: !121, line: 72, baseType: !1005, size: 64, offset: 1536)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !121, line: 59, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !121, line: 57, size: 8192, elements: !1008)
!1008 = !{!1009}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1007, file: !121, line: 58, baseType: !522, size: 8192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !973, file: !4, line: 180, baseType: !976, size: 1600, offset: 1600)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !973, file: !4, line: 180, baseType: !976, size: 1600, offset: 3200)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !973, file: !4, line: 180, baseType: !976, size: 1600, offset: 4800)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !973, file: !4, line: 180, baseType: !976, size: 1600, offset: 6400)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !973, file: !4, line: 181, baseType: !432, size: 32, offset: 8000)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !973, file: !4, line: 181, baseType: !432, size: 32, offset: 8032)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !973, file: !4, line: 181, baseType: !432, size: 32, offset: 8064)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !973, file: !4, line: 181, baseType: !432, size: 32, offset: 8096)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !973, file: !4, line: 181, baseType: !432, size: 32, offset: 8128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !973, file: !4, line: 182, baseType: !432, size: 32, offset: 8160)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !973, file: !4, line: 183, baseType: !432, size: 32, offset: 8192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !973, file: !4, line: 184, baseType: !1022, size: 64, offset: 8256)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !1023, line: 124, baseType: !1024)
!1023 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !1023, line: 124, flags: DIFlagFwdDecl)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !973, file: !4, line: 185, baseType: !1027, size: 64, offset: 8320)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !973, file: !4, line: 186, baseType: !1030, size: 32, offset: 8384)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !973, file: !4, line: 187, baseType: !411, size: 32, offset: 8416)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !973, file: !4, line: 188, baseType: !1033, size: 32, offset: 8448)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !973, file: !4, line: 189, baseType: !432, size: 32, offset: 8480)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !973, file: !4, line: 190, baseType: !591, size: 64, offset: 8512)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !973, file: !4, line: 193, baseType: !434, size: 8, offset: 8576)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !973, file: !4, line: 196, baseType: !1038, size: 64, offset: 8640)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !973)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !973, file: !4, line: 199, baseType: !1044, size: 64, offset: 8704)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !1041, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !973, file: !4, line: 202, baseType: !1038, size: 64, offset: 8768)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !973, file: !4, line: 207, baseType: !1050, size: 64, offset: 8832)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!432, !1041}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !973, file: !4, line: 208, baseType: !1050, size: 64, offset: 8896)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !973, file: !4, line: 209, baseType: !1050, size: 64, offset: 8960)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !973, file: !4, line: 210, baseType: !1050, size: 64, offset: 9024)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !973, file: !4, line: 211, baseType: !1050, size: 64, offset: 9088)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !973, file: !4, line: 218, baseType: !1058, size: 64, offset: 9152)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{null, !1041, !432, !1061}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !394, line: 65, size: 160, elements: !1063)
!1063 = !{!1064, !1065, !1067, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1062, file: !394, line: 66, baseType: !444, size: 96)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1062, file: !394, line: 67, baseType: !1066, size: 48, offset: 96)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 48, elements: !445)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1062, file: !394, line: 68, baseType: !434, size: 8, offset: 144)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !1062, file: !394, line: 68, baseType: !434, size: 8, offset: 152)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !973, file: !4, line: 219, baseType: !1070, size: 64, offset: 9216)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !1041, !432, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !394, line: 48, size: 96, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1074, file: !394, line: 49, baseType: !5, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1074, file: !394, line: 49, baseType: !5, size: 32, offset: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !1074, file: !394, line: 50, baseType: !434, size: 8, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !1074, file: !394, line: 50, baseType: !434, size: 8, offset: 72)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1074, file: !394, line: 51, baseType: !442, size: 16, offset: 80)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !973, file: !4, line: 220, baseType: !1082, size: 64, offset: 9280)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !1041, !432, !1085}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !394, line: 42, size: 160, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1086, file: !394, line: 43, baseType: !5, size: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1086, file: !394, line: 43, baseType: !5, size: 32, offset: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !1086, file: !394, line: 43, baseType: !5, size: 32, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !1086, file: !394, line: 43, baseType: !5, size: 32, offset: 96)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1086, file: !394, line: 44, baseType: !442, size: 16, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !1086, file: !394, line: 45, baseType: !434, size: 8, offset: 144)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1086, file: !394, line: 45, baseType: !434, size: 8, offset: 152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !973, file: !4, line: 227, baseType: !1096, size: 64, offset: 9344)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!1061, !1041}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !973, file: !4, line: 228, baseType: !1100, size: 64, offset: 9408)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!1073, !1041}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !973, file: !4, line: 229, baseType: !1104, size: 64, offset: 9472)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!1085, !1041}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !973, file: !4, line: 230, baseType: !1108, size: 64, offset: 9536)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!1111, !1041}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !394, line: 88, size: 64, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1112, file: !394, line: 89, baseType: !5, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1112, file: !394, line: 90, baseType: !5, size: 32, offset: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !973, file: !4, line: 231, baseType: !1117, size: 64, offset: 9600)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!1120, !1041}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !394, line: 79, size: 96, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !1121, file: !394, line: 81, baseType: !432, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !1121, file: !394, line: 82, baseType: !432, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1121, file: !394, line: 83, baseType: !442, size: 16, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1121, file: !394, line: 84, baseType: !434, size: 8, offset: 80)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1121, file: !394, line: 84, baseType: !434, size: 8, offset: 88)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !973, file: !4, line: 236, baseType: !1129, size: 64, offset: 9664)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{null, !1041, !1061}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !973, file: !4, line: 237, baseType: !1133, size: 64, offset: 9728)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !1041, !1073}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !973, file: !4, line: 238, baseType: !1137, size: 64, offset: 9792)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{null, !1041, !1085}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !973, file: !4, line: 239, baseType: !1141, size: 64, offset: 9856)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{null, !1041, !1111}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !973, file: !4, line: 240, baseType: !1145, size: 64, offset: 9920)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !1041, !1120}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !973, file: !4, line: 245, baseType: !1096, size: 64, offset: 9984)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !973, file: !4, line: 246, baseType: !1100, size: 64, offset: 10048)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !973, file: !4, line: 247, baseType: !1104, size: 64, offset: 10112)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !973, file: !4, line: 248, baseType: !1108, size: 64, offset: 10176)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !973, file: !4, line: 249, baseType: !1117, size: 64, offset: 10240)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !973, file: !4, line: 255, baseType: !1154, size: 64, offset: 10304)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!412, !1041, !432, !432}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !973, file: !4, line: 256, baseType: !1154, size: 64, offset: 10368)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !973, file: !4, line: 257, baseType: !1154, size: 64, offset: 10432)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !973, file: !4, line: 258, baseType: !1154, size: 64, offset: 10496)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !973, file: !4, line: 264, baseType: !1161, size: 64, offset: 10560)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!412, !1041, !432}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !973, file: !4, line: 265, baseType: !1161, size: 64, offset: 10624)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !973, file: !4, line: 266, baseType: !1161, size: 64, offset: 10688)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !973, file: !4, line: 267, baseType: !1161, size: 64, offset: 10752)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !973, file: !4, line: 268, baseType: !1161, size: 64, offset: 10816)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !973, file: !4, line: 272, baseType: !1169, size: 64, offset: 10880)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!1172, !1041}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !973, file: !4, line: 273, baseType: !1169, size: 64, offset: 10944)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !973, file: !4, line: 274, baseType: !1169, size: 64, offset: 11008)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !973, file: !4, line: 275, baseType: !1169, size: 64, offset: 11072)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !973, file: !4, line: 276, baseType: !1169, size: 64, offset: 11136)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !973, file: !4, line: 279, baseType: !1178, size: 64, offset: 11200)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null, !1041, !432, !1172, !432}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !973, file: !4, line: 280, baseType: !1178, size: 64, offset: 11264)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !973, file: !4, line: 281, baseType: !1178, size: 64, offset: 11328)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !973, file: !4, line: 284, baseType: !1050, size: 64, offset: 11392)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !973, file: !4, line: 285, baseType: !1050, size: 64, offset: 11456)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !973, file: !4, line: 286, baseType: !1186, size: 64, offset: 11520)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!1189, !1041}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !973, file: !4, line: 287, baseType: !1193, size: 64, offset: 11584)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!1196, !1041}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !1199)
!1199 = !{!1200, !1202}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1198, file: !4, line: 118, baseType: !1201, size: 128)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 128, elements: !710)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !1198, file: !4, line: 119, baseType: !1201, size: 128, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !973, file: !4, line: 288, baseType: !1204, size: 64, offset: 11648)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!1207, !1041}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !973, file: !4, line: 289, baseType: !1209, size: 64, offset: 11712)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{null, !1041, !1212}
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !973, file: !4, line: 290, baseType: !1215, size: 64, offset: 11776)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!1218, !1041}
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !1221)
!1221 = !{!1222, !1223}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1220, file: !4, line: 124, baseType: !442, size: 16)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1220, file: !4, line: 125, baseType: !434, size: 8, offset: 16)
