; ModuleID = 'blender/source/blender/nodes/composite/nodes/node_composite_image.c'
source_filename = "blender/source/blender/nodes/composite/nodes/node_composite_image.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!54 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!55 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!56 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!57 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!58 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!59 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!60 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!61 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!62 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!63 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!64 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!65 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!66 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!67 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketInOut", file: !23, line: 148, baseType: !10, size: 32, elements: !69)
!69 = !{!70, !71}
!70 = !DIEnumerator(name: "SOCK_IN", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "SOCK_OUT", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !23, line: 135, baseType: !34, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82}
!74 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!75 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!76 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!77 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!78 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!79 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!80 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!81 = !DIEnumerator(name: "SOCK_INT", value: 6)
!82 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !84, line: 107, baseType: !10, size: 32, elements: !85)
!84 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!86 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!89 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!90 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!91 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!97 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!98 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!99 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!100 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!101 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!102 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!103 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!104 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!105 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!106 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!107 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!108 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!109 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!110 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!111 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!112 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!113 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!114 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!115 = !{!116, !126, !2277}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !33, line: 1299, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !33, line: 1216, size: 39680, elements: !119)
!119 = !{!120, !191, !195, !199, !1460, !1461, !1462, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1489, !1701, !1704, !1946, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1968, !1969, !1970, !1971, !1972, !1980, !2046, !2053, !2054, !2061, !2264, !2270, !2271, !2272, !2273, !2274}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !118, file: !33, line: 1217, baseType: !121, size: 960)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !122, line: 130, baseType: !123)
!122 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !122, line: 117, size: 960, elements: !124)
!124 = !{!125, !127, !128, !130, !150, !154, !156, !157, !158, !159}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !122, line: 118, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !123, file: !122, line: 118, baseType: !126, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !123, file: !122, line: 119, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !123, file: !122, line: 120, baseType: !131, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !122, line: 136, size: 17600, elements: !133)
!133 = !{!134, !135, !137, !140, !145, !146, !147}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !132, file: !122, line: 137, baseType: !121, size: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !132, file: !122, line: 138, baseType: !136, size: 64, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !132, file: !122, line: 139, baseType: !138, size: 64, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !122, line: 43, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !132, file: !122, line: 140, baseType: !141, size: 8192, offset: 1088)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 8192, elements: !143)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !{!144}
!144 = !DISubrange(count: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !132, file: !122, line: 141, baseType: !141, size: 8192, offset: 9280)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !132, file: !122, line: 148, baseType: !131, size: 64, offset: 17472)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !132, file: !122, line: 150, baseType: !148, size: 64, offset: 17536)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !122, line: 45, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !122, line: 121, baseType: !151, size: 528, offset: 256)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 528, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 66)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !123, file: !122, line: 126, baseType: !155, size: 16, offset: 784)
!155 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !123, file: !122, line: 127, baseType: !34, size: 32, offset: 800)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !123, file: !122, line: 128, baseType: !34, size: 32, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !123, file: !122, line: 128, baseType: !34, size: 32, offset: 864)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !123, file: !122, line: 129, baseType: !160, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !122, line: 75, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !122, line: 62, size: 1024, elements: !163)
!163 = !{!164, !166, !167, !168, !169, !170, !174, !175, !189, !190}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !122, line: 63, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !162, file: !122, line: 63, baseType: !165, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !162, file: !122, line: 64, baseType: !142, size: 8, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !162, file: !122, line: 64, baseType: !142, size: 8, offset: 136)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !162, file: !122, line: 65, baseType: !155, size: 16, offset: 144)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !122, line: 66, baseType: !171, size: 512, offset: 160)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 512, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !162, file: !122, line: 67, baseType: !34, size: 32, offset: 672)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !162, file: !122, line: 69, baseType: !176, size: 256, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !122, line: 60, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !122, line: 48, size: 256, elements: !178)
!178 = !{!179, !180, !187, !188}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !177, file: !122, line: 49, baseType: !126, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !177, file: !122, line: 58, baseType: !181, size: 128, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !182, line: 71, baseType: !183)
!182 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !182, line: 69, size: 128, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !183, file: !182, line: 70, baseType: !126, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !183, file: !182, line: 70, baseType: !126, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !177, file: !122, line: 59, baseType: !34, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !177, file: !122, line: 59, baseType: !34, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !162, file: !122, line: 70, baseType: !34, size: 32, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !162, file: !122, line: 74, baseType: !34, size: 32, offset: 992)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !118, file: !33, line: 1218, baseType: !192, size: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !194, line: 43, flags: DIFlagFwdDecl)
!194 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !118, file: !33, line: 1220, baseType: !196, size: 64, offset: 1024)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !198, line: 49, flags: DIFlagFwdDecl)
!198 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !118, file: !33, line: 1221, baseType: !200, size: 64, offset: 1088)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !202, line: 52, size: 4224, elements: !203)
!202 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !274, !275, !278, !1455, !1456, !1457, !1458, !1459}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !201, file: !202, line: 53, baseType: !121, size: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !201, file: !202, line: 54, baseType: !192, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !201, file: !202, line: 56, baseType: !155, size: 16, offset: 1024)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !201, file: !202, line: 56, baseType: !155, size: 16, offset: 1040)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !201, file: !202, line: 57, baseType: !155, size: 16, offset: 1056)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !201, file: !202, line: 57, baseType: !155, size: 16, offset: 1072)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !201, file: !202, line: 59, baseType: !211, size: 32, offset: 1088)
!211 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !201, file: !202, line: 59, baseType: !211, size: 32, offset: 1120)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !201, file: !202, line: 59, baseType: !211, size: 32, offset: 1152)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !201, file: !202, line: 60, baseType: !211, size: 32, offset: 1184)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !201, file: !202, line: 60, baseType: !211, size: 32, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !201, file: !202, line: 60, baseType: !211, size: 32, offset: 1248)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !201, file: !202, line: 61, baseType: !211, size: 32, offset: 1280)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !201, file: !202, line: 61, baseType: !211, size: 32, offset: 1312)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !201, file: !202, line: 61, baseType: !211, size: 32, offset: 1344)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !201, file: !202, line: 68, baseType: !211, size: 32, offset: 1376)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !201, file: !202, line: 68, baseType: !211, size: 32, offset: 1408)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !201, file: !202, line: 68, baseType: !211, size: 32, offset: 1440)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !201, file: !202, line: 69, baseType: !211, size: 32, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !201, file: !202, line: 69, baseType: !211, size: 32, offset: 1504)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !201, file: !202, line: 74, baseType: !211, size: 32, offset: 1536)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !201, file: !202, line: 79, baseType: !211, size: 32, offset: 1568)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !201, file: !202, line: 81, baseType: !155, size: 16, offset: 1600)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !201, file: !202, line: 91, baseType: !155, size: 16, offset: 1616)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !201, file: !202, line: 92, baseType: !155, size: 16, offset: 1632)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !201, file: !202, line: 93, baseType: !155, size: 16, offset: 1648)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !201, file: !202, line: 94, baseType: !155, size: 16, offset: 1664)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !201, file: !202, line: 94, baseType: !155, size: 16, offset: 1680)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !201, file: !202, line: 94, baseType: !155, size: 16, offset: 1696)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !201, file: !202, line: 94, baseType: !155, size: 16, offset: 1712)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !201, file: !202, line: 96, baseType: !211, size: 32, offset: 1728)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !201, file: !202, line: 96, baseType: !211, size: 32, offset: 1760)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !201, file: !202, line: 96, baseType: !211, size: 32, offset: 1792)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !201, file: !202, line: 96, baseType: !211, size: 32, offset: 1824)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !201, file: !202, line: 98, baseType: !211, size: 32, offset: 1856)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !201, file: !202, line: 98, baseType: !211, size: 32, offset: 1888)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !201, file: !202, line: 98, baseType: !211, size: 32, offset: 1920)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !201, file: !202, line: 98, baseType: !211, size: 32, offset: 1952)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !201, file: !202, line: 99, baseType: !211, size: 32, offset: 1984)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !201, file: !202, line: 99, baseType: !211, size: 32, offset: 2016)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !201, file: !202, line: 100, baseType: !211, size: 32, offset: 2048)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !201, file: !202, line: 100, baseType: !211, size: 32, offset: 2080)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !201, file: !202, line: 103, baseType: !155, size: 16, offset: 2112)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !201, file: !202, line: 103, baseType: !155, size: 16, offset: 2128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !201, file: !202, line: 103, baseType: !155, size: 16, offset: 2144)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !201, file: !202, line: 103, baseType: !155, size: 16, offset: 2160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !201, file: !202, line: 106, baseType: !211, size: 32, offset: 2176)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !201, file: !202, line: 106, baseType: !211, size: 32, offset: 2208)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !201, file: !202, line: 106, baseType: !211, size: 32, offset: 2240)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !201, file: !202, line: 106, baseType: !211, size: 32, offset: 2272)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !201, file: !202, line: 107, baseType: !155, size: 16, offset: 2304)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !201, file: !202, line: 107, baseType: !155, size: 16, offset: 2320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !201, file: !202, line: 107, baseType: !155, size: 16, offset: 2336)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !201, file: !202, line: 107, baseType: !155, size: 16, offset: 2352)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !201, file: !202, line: 108, baseType: !211, size: 32, offset: 2368)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !201, file: !202, line: 108, baseType: !211, size: 32, offset: 2400)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !201, file: !202, line: 109, baseType: !211, size: 32, offset: 2432)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !201, file: !202, line: 109, baseType: !211, size: 32, offset: 2464)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !201, file: !202, line: 110, baseType: !211, size: 32, offset: 2496)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !201, file: !202, line: 110, baseType: !211, size: 32, offset: 2528)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !201, file: !202, line: 110, baseType: !211, size: 32, offset: 2560)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !201, file: !202, line: 111, baseType: !155, size: 16, offset: 2592)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !201, file: !202, line: 111, baseType: !155, size: 16, offset: 2608)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !201, file: !202, line: 112, baseType: !155, size: 16, offset: 2624)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !201, file: !202, line: 112, baseType: !155, size: 16, offset: 2640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !201, file: !202, line: 112, baseType: !155, size: 16, offset: 2656)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !201, file: !202, line: 115, baseType: !155, size: 16, offset: 2672)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !201, file: !202, line: 118, baseType: !273, size: 64, offset: 2688)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !201, file: !202, line: 118, baseType: !273, size: 64, offset: 2752)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !201, file: !202, line: 121, baseType: !276, size: 64, offset: 2816)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !198, line: 46, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !201, file: !202, line: 122, baseType: !279, size: 1152, offset: 2880)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 1152, elements: !1453)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !198, line: 57, size: 2496, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !281, file: !198, line: 59, baseType: !155, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !281, file: !198, line: 59, baseType: !155, size: 16, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !281, file: !198, line: 59, baseType: !155, size: 16, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !281, file: !198, line: 59, baseType: !155, size: 16, offset: 48)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !281, file: !198, line: 60, baseType: !196, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !281, file: !198, line: 61, baseType: !289, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !198, line: 202, size: 3328, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !362, !932, !933, !1266, !1267, !1295, !1296, !1363, !1384, !1392, !1393}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !290, file: !198, line: 203, baseType: !121, size: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !290, file: !198, line: 204, baseType: !192, size: 64, offset: 960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !290, file: !198, line: 206, baseType: !211, size: 32, offset: 1024)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !290, file: !198, line: 206, baseType: !211, size: 32, offset: 1056)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !290, file: !198, line: 207, baseType: !211, size: 32, offset: 1088)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !290, file: !198, line: 207, baseType: !211, size: 32, offset: 1120)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !290, file: !198, line: 207, baseType: !211, size: 32, offset: 1152)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !290, file: !198, line: 207, baseType: !211, size: 32, offset: 1184)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !290, file: !198, line: 207, baseType: !211, size: 32, offset: 1216)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !290, file: !198, line: 207, baseType: !211, size: 32, offset: 1248)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !290, file: !198, line: 208, baseType: !211, size: 32, offset: 1280)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !290, file: !198, line: 208, baseType: !211, size: 32, offset: 1312)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !290, file: !198, line: 211, baseType: !211, size: 32, offset: 1344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !290, file: !198, line: 211, baseType: !211, size: 32, offset: 1376)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !290, file: !198, line: 211, baseType: !211, size: 32, offset: 1408)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !290, file: !198, line: 211, baseType: !211, size: 32, offset: 1440)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !290, file: !198, line: 211, baseType: !211, size: 32, offset: 1472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !290, file: !198, line: 214, baseType: !211, size: 32, offset: 1504)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !290, file: !198, line: 214, baseType: !211, size: 32, offset: 1536)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !290, file: !198, line: 217, baseType: !211, size: 32, offset: 1568)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !290, file: !198, line: 218, baseType: !211, size: 32, offset: 1600)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !290, file: !198, line: 219, baseType: !211, size: 32, offset: 1632)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !290, file: !198, line: 220, baseType: !211, size: 32, offset: 1664)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !290, file: !198, line: 221, baseType: !211, size: 32, offset: 1696)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !290, file: !198, line: 222, baseType: !155, size: 16, offset: 1728)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !290, file: !198, line: 222, baseType: !155, size: 16, offset: 1744)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !290, file: !198, line: 224, baseType: !155, size: 16, offset: 1760)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !290, file: !198, line: 224, baseType: !155, size: 16, offset: 1776)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !290, file: !198, line: 227, baseType: !155, size: 16, offset: 1792)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !290, file: !198, line: 227, baseType: !155, size: 16, offset: 1808)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !290, file: !198, line: 229, baseType: !155, size: 16, offset: 1824)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !290, file: !198, line: 229, baseType: !155, size: 16, offset: 1840)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !198, line: 230, baseType: !155, size: 16, offset: 1856)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !290, file: !198, line: 230, baseType: !155, size: 16, offset: 1872)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !290, file: !198, line: 232, baseType: !211, size: 32, offset: 1888)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !290, file: !198, line: 232, baseType: !211, size: 32, offset: 1920)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !290, file: !198, line: 232, baseType: !211, size: 32, offset: 1952)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !290, file: !198, line: 232, baseType: !211, size: 32, offset: 1984)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !290, file: !198, line: 233, baseType: !34, size: 32, offset: 2016)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !290, file: !198, line: 234, baseType: !34, size: 32, offset: 2048)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !290, file: !198, line: 235, baseType: !155, size: 16, offset: 2080)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !290, file: !198, line: 235, baseType: !155, size: 16, offset: 2096)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !290, file: !198, line: 236, baseType: !155, size: 16, offset: 2112)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !290, file: !198, line: 239, baseType: !155, size: 16, offset: 2128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !290, file: !198, line: 240, baseType: !34, size: 32, offset: 2144)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !290, file: !198, line: 241, baseType: !34, size: 32, offset: 2176)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !198, line: 241, baseType: !34, size: 32, offset: 2208)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !290, file: !198, line: 241, baseType: !34, size: 32, offset: 2240)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !290, file: !198, line: 243, baseType: !211, size: 32, offset: 2272)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !290, file: !198, line: 243, baseType: !211, size: 32, offset: 2304)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !290, file: !198, line: 244, baseType: !211, size: 32, offset: 2336)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !290, file: !198, line: 246, baseType: !344, size: 320, offset: 2368)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !345, line: 50, size: 320, elements: !346)
!345 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!346 = !{!347, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !344, file: !345, line: 51, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !344, file: !345, line: 53, baseType: !34, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !344, file: !345, line: 54, baseType: !34, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !344, file: !345, line: 55, baseType: !34, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !344, file: !345, line: 55, baseType: !34, size: 32, offset: 160)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !344, file: !345, line: 56, baseType: !142, size: 8, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !344, file: !345, line: 56, baseType: !142, size: 8, offset: 200)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !344, file: !345, line: 57, baseType: !142, size: 8, offset: 208)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !344, file: !345, line: 57, baseType: !142, size: 8, offset: 216)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !344, file: !345, line: 59, baseType: !155, size: 16, offset: 224)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !344, file: !345, line: 59, baseType: !155, size: 16, offset: 240)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !344, file: !345, line: 59, baseType: !155, size: 16, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !344, file: !345, line: 61, baseType: !155, size: 16, offset: 272)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !344, file: !345, line: 63, baseType: !34, size: 32, offset: 288)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !290, file: !198, line: 248, baseType: !363, size: 64, offset: 2688)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !23, line: 328, size: 3456, elements: !365)
!365 = !{!366, !367, !368, !884, !885, !886, !890, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !915, !919, !923, !927, !928, !929, !930, !931}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !364, file: !23, line: 329, baseType: !121, size: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !364, file: !23, line: 330, baseType: !192, size: 64, offset: 960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !364, file: !23, line: 332, baseType: !369, size: 64, offset: 1024)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !371, line: 283, size: 4096, elements: !372)
!371 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!372 = !{!373, !374, !375, !376, !380, !381, !385, !853, !861, !865, !871, !875, !876, !877, !878, !882, !883}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !370, file: !371, line: 284, baseType: !34, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !370, file: !371, line: 285, baseType: !171, size: 512, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !370, file: !371, line: 287, baseType: !171, size: 512, offset: 544)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !370, file: !371, line: 288, baseType: !377, size: 2048, offset: 1056)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 2048, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !370, file: !371, line: 289, baseType: !34, size: 32, offset: 3104)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !370, file: !371, line: 292, baseType: !382, size: 64, offset: 3136)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !363}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !370, file: !371, line: 293, baseType: !386, size: 64, offset: 3200)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !363, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !23, line: 167, size: 3712, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !845, !846, !847, !848, !849, !850}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !390, file: !23, line: 168, baseType: !389, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !390, file: !23, line: 168, baseType: !389, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !390, file: !23, line: 168, baseType: !389, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !390, file: !23, line: 170, baseType: !160, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !390, file: !23, line: 172, baseType: !397, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !371, line: 144, size: 6016, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !580, !581, !582, !596, !600, !604, !605, !686, !691, !695, !696, !697, !698, !702, !703, !707, !711, !715, !719, !723, !727, !731, !732, !750, !752, !778, !798}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !371, line: 145, baseType: !126, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !398, file: !371, line: 145, baseType: !126, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !398, file: !371, line: 146, baseType: !155, size: 16, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !398, file: !371, line: 148, baseType: !171, size: 512, offset: 144)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !398, file: !371, line: 149, baseType: !34, size: 32, offset: 672)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !398, file: !371, line: 151, baseType: !171, size: 512, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !398, file: !371, line: 152, baseType: !377, size: 2048, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !398, file: !371, line: 153, baseType: !34, size: 32, offset: 3264)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !398, file: !371, line: 155, baseType: !211, size: 32, offset: 3296)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !398, file: !371, line: 155, baseType: !211, size: 32, offset: 3328)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !398, file: !371, line: 155, baseType: !211, size: 32, offset: 3360)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !398, file: !371, line: 156, baseType: !211, size: 32, offset: 3392)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !398, file: !371, line: 156, baseType: !211, size: 32, offset: 3424)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !398, file: !371, line: 156, baseType: !211, size: 32, offset: 3456)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !398, file: !371, line: 157, baseType: !155, size: 16, offset: 3488)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !371, line: 157, baseType: !155, size: 16, offset: 3504)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !398, file: !371, line: 157, baseType: !155, size: 16, offset: 3520)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !398, file: !371, line: 160, baseType: !418, size: 64, offset: 3584)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !371, line: 109, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !371, line: 98, size: 1408, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !579}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !420, file: !371, line: 99, baseType: !34, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !420, file: !371, line: 99, baseType: !34, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !420, file: !371, line: 100, baseType: !171, size: 512, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !420, file: !371, line: 101, baseType: !211, size: 32, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !420, file: !371, line: 101, baseType: !211, size: 32, offset: 608)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !420, file: !371, line: 101, baseType: !211, size: 32, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !420, file: !371, line: 101, baseType: !211, size: 32, offset: 672)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !420, file: !371, line: 102, baseType: !211, size: 32, offset: 704)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !420, file: !371, line: 102, baseType: !211, size: 32, offset: 736)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !420, file: !371, line: 103, baseType: !34, size: 32, offset: 768)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !420, file: !371, line: 104, baseType: !34, size: 32, offset: 800)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !420, file: !371, line: 107, baseType: !434, size: 64, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !23, line: 87, size: 2816, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !558}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !435, file: !23, line: 88, baseType: !434, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !435, file: !23, line: 88, baseType: !434, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !435, file: !23, line: 88, baseType: !434, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !435, file: !23, line: 90, baseType: !160, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !435, file: !23, line: 92, baseType: !171, size: 512, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !435, file: !23, line: 94, baseType: !171, size: 512, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !435, file: !23, line: 99, baseType: !126, size: 64, offset: 1280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !435, file: !23, line: 101, baseType: !155, size: 16, offset: 1344)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !23, line: 101, baseType: !155, size: 16, offset: 1360)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !435, file: !23, line: 102, baseType: !155, size: 16, offset: 1376)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !435, file: !23, line: 103, baseType: !155, size: 16, offset: 1392)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !435, file: !23, line: 104, baseType: !449, size: 64, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !371, line: 114, size: 1600, elements: !451)
!451 = !{!452, !453, !474, !478, !482, !486, !490, !494, !495, !499, !528, !529, !530}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !450, file: !371, line: 115, baseType: !171, size: 512)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !450, file: !371, line: 117, baseType: !454, size: 64, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !457, !459, !461, !461, !472}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !84, line: 44, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !371, line: 73, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !84, line: 55, size: 192, elements: !463)
!463 = !{!464, !468, !471}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !462, file: !84, line: 58, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !462, file: !84, line: 56, size: 64, elements: !466)
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !465, file: !84, line: 57, baseType: !126, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !84, line: 60, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !23, line: 335, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !462, file: !84, line: 61, baseType: !126, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !450, file: !371, line: 118, baseType: !475, size: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !457, !461, !461, !273}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !450, file: !371, line: 120, baseType: !479, size: 64, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !457, !459, !461}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !450, file: !371, line: 121, baseType: !483, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !457, !461, !273}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !450, file: !371, line: 122, baseType: !487, size: 64, offset: 768)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !363, !434, !469}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !450, file: !371, line: 123, baseType: !491, size: 64, offset: 832)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !363, !434, !389, !434, !472}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !450, file: !371, line: 124, baseType: !491, size: 64, offset: 896)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !450, file: !371, line: 125, baseType: !496, size: 64, offset: 960)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !363, !434, !389, !434}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !450, file: !371, line: 128, baseType: !500, size: 256, offset: 1024)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !84, line: 436, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !84, line: 430, size: 256, elements: !502)
!502 = !{!503, !504, !507, !523}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !501, file: !84, line: 431, baseType: !126, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !501, file: !84, line: 432, baseType: !505, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !84, line: 417, baseType: !470)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !501, file: !84, line: 433, baseType: !508, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !84, line: 408, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!34, !457, !461, !512, !514}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !84, line: 38, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !84, line: 348, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !84, line: 337, size: 256, elements: !517)
!517 = !{!518, !519, !520, !521, !522}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !516, file: !84, line: 339, baseType: !126, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !516, file: !84, line: 342, baseType: !512, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !516, file: !84, line: 345, baseType: !34, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !516, file: !84, line: 347, baseType: !34, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !516, file: !84, line: 347, baseType: !34, size: 32, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !501, file: !84, line: 434, baseType: !524, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !84, line: 409, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !126}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !450, file: !371, line: 129, baseType: !500, size: 256, offset: 1280)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !450, file: !371, line: 132, baseType: !34, size: 32, offset: 1536)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !450, file: !371, line: 132, baseType: !34, size: 32, offset: 1568)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !435, file: !23, line: 105, baseType: !171, size: 512, offset: 1472)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !435, file: !23, line: 107, baseType: !211, size: 32, offset: 1984)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !435, file: !23, line: 107, baseType: !211, size: 32, offset: 2016)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !435, file: !23, line: 109, baseType: !126, size: 64, offset: 2048)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !435, file: !23, line: 112, baseType: !155, size: 16, offset: 2112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !435, file: !23, line: 114, baseType: !155, size: 16, offset: 2128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !435, file: !23, line: 115, baseType: !34, size: 32, offset: 2144)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !435, file: !23, line: 117, baseType: !126, size: 64, offset: 2176)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !435, file: !23, line: 122, baseType: !34, size: 32, offset: 2240)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !435, file: !23, line: 124, baseType: !34, size: 32, offset: 2272)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !435, file: !23, line: 126, baseType: !434, size: 64, offset: 2304)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !435, file: !23, line: 128, baseType: !543, size: 64, offset: 2368)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !23, line: 298, size: 448, elements: !545)
!545 = !{!546, !547, !548, !551, !552, !555, !556, !557}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !544, file: !23, line: 299, baseType: !543, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !544, file: !23, line: 299, baseType: !543, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !544, file: !23, line: 301, baseType: !549, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !23, line: 218, baseType: !390)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !544, file: !23, line: 301, baseType: !549, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !544, file: !23, line: 302, baseType: !553, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !23, line: 132, baseType: !435)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !544, file: !23, line: 302, baseType: !553, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !544, file: !23, line: 304, baseType: !34, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !544, file: !23, line: 305, baseType: !34, size: 32, offset: 416)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !435, file: !23, line: 131, baseType: !559, size: 384, offset: 2432)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !23, line: 73, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !23, line: 62, size: 384, elements: !561)
!561 = !{!562, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !560, file: !23, line: 63, baseType: !563, size: 128)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 4)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !560, file: !23, line: 64, baseType: !211, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !560, file: !23, line: 64, baseType: !211, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !560, file: !23, line: 65, baseType: !126, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !560, file: !23, line: 66, baseType: !155, size: 16, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !560, file: !23, line: 67, baseType: !155, size: 16, offset: 272)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !560, file: !23, line: 68, baseType: !155, size: 16, offset: 288)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !560, file: !23, line: 69, baseType: !155, size: 16, offset: 304)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !560, file: !23, line: 70, baseType: !155, size: 16, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !560, file: !23, line: 71, baseType: !155, size: 16, offset: 336)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !560, file: !23, line: 72, baseType: !576, size: 32, offset: 352)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 32, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 2)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !420, file: !371, line: 108, baseType: !171, size: 512, offset: 896)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !398, file: !371, line: 160, baseType: !418, size: 64, offset: 3648)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !398, file: !371, line: 162, baseType: !171, size: 512, offset: 3712)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !398, file: !371, line: 165, baseType: !583, size: 64, offset: 4224)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !586, !588, !590, !363, !389, !592}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !371, line: 81, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !23, line: 43, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !23, line: 274, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !23, line: 271, size: 32, elements: !594)
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !593, file: !23, line: 273, baseType: !10, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !398, file: !371, line: 168, baseType: !597, size: 64, offset: 4288)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !586, !363, !389}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !398, file: !371, line: 171, baseType: !601, size: 64, offset: 4352)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !459, !457, !461}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !398, file: !371, line: 173, baseType: !601, size: 64, offset: 4416)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !398, file: !371, line: 176, baseType: !606, size: 64, offset: 4480)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !590, !609, !389, !34, !34}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !611, line: 70, size: 19840, elements: !612)
!611 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!612 = !{!613, !614, !615, !616, !617, !619, !620, !621, !622, !624, !625, !628, !629, !630, !631, !632, !634, !636, !637, !638, !642, !643, !644, !645, !646, !649, !650, !651, !652, !653, !656, !657, !659, !660, !661, !664, !665, !666, !669, !670, !679}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !611, line: 71, baseType: !609, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !610, file: !611, line: 71, baseType: !609, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !610, file: !611, line: 74, baseType: !34, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !610, file: !611, line: 74, baseType: !34, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !610, file: !611, line: 79, baseType: !618, size: 8, offset: 192)
!618 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !610, file: !611, line: 80, baseType: !34, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !610, file: !611, line: 83, baseType: !34, size: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !610, file: !611, line: 84, baseType: !34, size: 32, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !610, file: !611, line: 87, baseType: !623, size: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !610, file: !611, line: 88, baseType: !273, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !610, file: !611, line: 93, baseType: !626, size: 128, offset: 448)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 128, elements: !577)
!627 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !610, file: !611, line: 96, baseType: !34, size: 32, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !610, file: !611, line: 96, baseType: !34, size: 32, offset: 608)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !610, file: !611, line: 97, baseType: !34, size: 32, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !610, file: !611, line: 97, baseType: !34, size: 32, offset: 672)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !610, file: !611, line: 98, baseType: !633, size: 64, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !610, file: !611, line: 101, baseType: !635, size: 64, offset: 768)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !610, file: !611, line: 102, baseType: !273, size: 64, offset: 832)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !610, file: !611, line: 105, baseType: !211, size: 32, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !610, file: !611, line: 108, baseType: !639, size: 1280, offset: 960)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 1280, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 20)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !610, file: !611, line: 109, baseType: !34, size: 32, offset: 2240)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !610, file: !611, line: 109, baseType: !34, size: 32, offset: 2272)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !610, file: !611, line: 112, baseType: !34, size: 32, offset: 2304)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !610, file: !611, line: 113, baseType: !34, size: 32, offset: 2336)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !610, file: !611, line: 114, baseType: !647, size: 64, offset: 2368)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !611, line: 50, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !610, file: !611, line: 115, baseType: !126, size: 64, offset: 2432)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !610, file: !611, line: 118, baseType: !34, size: 32, offset: 2496)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !611, line: 119, baseType: !141, size: 8192, offset: 2528)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !610, file: !611, line: 120, baseType: !141, size: 8192, offset: 10720)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !610, file: !611, line: 123, baseType: !654, size: 64, offset: 18944)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !611, line: 123, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !610, file: !611, line: 124, baseType: !34, size: 32, offset: 19008)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !610, file: !611, line: 127, baseType: !658, size: 64, offset: 19072)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !610, file: !611, line: 128, baseType: !10, size: 32, offset: 19136)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !610, file: !611, line: 129, baseType: !10, size: 32, offset: 19168)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !610, file: !611, line: 132, baseType: !662, size: 64, offset: 19200)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !33, line: 63, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !610, file: !611, line: 133, baseType: !662, size: 64, offset: 19264)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !610, file: !611, line: 134, baseType: !623, size: 64, offset: 19328)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !610, file: !611, line: 135, baseType: !667, size: 64, offset: 19392)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !611, line: 135, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !610, file: !611, line: 136, baseType: !34, size: 32, offset: 19456)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !610, file: !611, line: 137, baseType: !671, size: 128, offset: 19488)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !672, line: 89, baseType: !673)
!672 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !672, line: 86, size: 128, elements: !674)
!674 = !{!675, !676, !677, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !673, file: !672, line: 87, baseType: !34, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !673, file: !672, line: 87, baseType: !34, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !673, file: !672, line: 88, baseType: !34, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !673, file: !672, line: 88, baseType: !34, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !610, file: !611, line: 140, baseType: !680, size: 192, offset: 19648)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !611, line: 55, size: 192, elements: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !680, file: !611, line: 56, baseType: !10, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !680, file: !611, line: 57, baseType: !10, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !680, file: !611, line: 58, baseType: !658, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !680, file: !611, line: 59, baseType: !10, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !398, file: !371, line: 179, baseType: !687, size: 64, offset: 4544)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !363, !389, !690, !34}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !398, file: !371, line: 181, baseType: !692, size: 64, offset: 4608)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!34, !389, !34, !34}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !398, file: !371, line: 183, baseType: !692, size: 64, offset: 4672)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !398, file: !371, line: 185, baseType: !692, size: 64, offset: 4736)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !398, file: !371, line: 188, baseType: !386, size: 64, offset: 4800)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !398, file: !371, line: 190, baseType: !699, size: 64, offset: 4864)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !363, !389, !129}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !398, file: !371, line: 193, baseType: !386, size: 64, offset: 4928)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !398, file: !371, line: 195, baseType: !704, size: 64, offset: 4992)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !389}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !398, file: !371, line: 197, baseType: !708, size: 64, offset: 5056)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !363, !389, !389}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !398, file: !371, line: 200, baseType: !712, size: 64, offset: 5120)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !586, !461}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !398, file: !371, line: 201, baseType: !716, size: 64, offset: 5184)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !461}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !398, file: !371, line: 202, baseType: !720, size: 64, offset: 5248)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !461, !389}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !398, file: !371, line: 205, baseType: !724, size: 64, offset: 5312)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!34, !397, !363}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !398, file: !371, line: 207, baseType: !728, size: 64, offset: 5376)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!34, !389, !363}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !398, file: !371, line: 210, baseType: !386, size: 64, offset: 5440)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !398, file: !371, line: 213, baseType: !733, size: 64, offset: 5504)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !371, line: 135, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!126, !737, !389, !592}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !739, line: 54, size: 64, elements: !740)
!739 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!740 = !{!741}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !738, file: !739, line: 55, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !371, line: 500, size: 64, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !743, file: !371, line: 502, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !748, line: 48, baseType: !749)
!748 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !748, line: 48, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !398, file: !371, line: 214, baseType: !751, size: 64, offset: 5568)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !371, line: 136, baseType: !525)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !398, file: !371, line: 215, baseType: !753, size: 64, offset: 5632)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !371, line: 137, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !126, !34, !389, !757, !776, !776}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !739, line: 58, size: 128, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !758, file: !739, line: 59, baseType: !126, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !758, file: !739, line: 60, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !23, line: 289, size: 192, elements: !764)
!764 = !{!765, !772, !773, !774, !775}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !763, file: !23, line: 290, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !23, line: 286, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !23, line: 280, size: 64, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !767, file: !23, line: 281, baseType: !592, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !767, file: !23, line: 284, baseType: !155, size: 16, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !767, file: !23, line: 285, baseType: !155, size: 16, offset: 48)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !763, file: !23, line: 292, baseType: !658, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !763, file: !23, line: 293, baseType: !155, size: 16, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !763, file: !23, line: 293, baseType: !155, size: 16, offset: 144)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !763, file: !23, line: 294, baseType: !34, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !398, file: !371, line: 217, baseType: !779, size: 64, offset: 5696)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !371, line: 138, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!34, !783, !389, !757, !785, !785}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !371, line: 64, flags: DIFlagFwdDecl)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !9, line: 106, size: 384, elements: !787)
!787 = !{!788, !790, !791, !792, !795, !796, !797}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !786, file: !9, line: 107, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !9, line: 80, baseType: !8)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !9, line: 108, baseType: !472, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !786, file: !9, line: 109, baseType: !563, size: 128, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !786, file: !9, line: 110, baseType: !793, size: 64, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !9, line: 55, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !786, file: !9, line: 111, baseType: !618, size: 8, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !786, file: !9, line: 112, baseType: !618, size: 8, offset: 328)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !786, file: !9, line: 113, baseType: !155, size: 16, offset: 336)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !398, file: !371, line: 220, baseType: !500, size: 256, offset: 5760)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !390, file: !23, line: 173, baseType: !171, size: 512, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !390, file: !23, line: 175, baseType: !171, size: 512, offset: 832)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !390, file: !23, line: 176, baseType: !34, size: 32, offset: 1344)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !23, line: 177, baseType: !155, size: 16, offset: 1376)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !390, file: !23, line: 177, baseType: !155, size: 16, offset: 1392)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !390, file: !23, line: 178, baseType: !155, size: 16, offset: 1408)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !390, file: !23, line: 178, baseType: !155, size: 16, offset: 1424)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !390, file: !23, line: 179, baseType: !155, size: 16, offset: 1440)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !390, file: !23, line: 179, baseType: !155, size: 16, offset: 1456)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !390, file: !23, line: 180, baseType: !155, size: 16, offset: 1472)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !390, file: !23, line: 181, baseType: !155, size: 16, offset: 1488)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !390, file: !23, line: 182, baseType: !811, size: 96, offset: 1504)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 96, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 3)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !390, file: !23, line: 184, baseType: !181, size: 128, offset: 1600)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !390, file: !23, line: 184, baseType: !181, size: 128, offset: 1728)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !390, file: !23, line: 185, baseType: !389, size: 64, offset: 1856)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !390, file: !23, line: 186, baseType: !129, size: 64, offset: 1920)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !390, file: !23, line: 187, baseType: !126, size: 64, offset: 1984)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !390, file: !23, line: 188, baseType: !389, size: 64, offset: 2048)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !390, file: !23, line: 189, baseType: !181, size: 128, offset: 2112)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !390, file: !23, line: 191, baseType: !211, size: 32, offset: 2240)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !390, file: !23, line: 191, baseType: !211, size: 32, offset: 2272)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !390, file: !23, line: 192, baseType: !211, size: 32, offset: 2304)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !390, file: !23, line: 192, baseType: !211, size: 32, offset: 2336)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !390, file: !23, line: 193, baseType: !211, size: 32, offset: 2368)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !390, file: !23, line: 194, baseType: !211, size: 32, offset: 2400)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !390, file: !23, line: 194, baseType: !211, size: 32, offset: 2432)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !390, file: !23, line: 196, baseType: !34, size: 32, offset: 2464)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !390, file: !23, line: 198, baseType: !171, size: 512, offset: 2496)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !390, file: !23, line: 199, baseType: !155, size: 16, offset: 3008)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !390, file: !23, line: 199, baseType: !155, size: 16, offset: 3024)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !390, file: !23, line: 200, baseType: !211, size: 32, offset: 3040)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !390, file: !23, line: 200, baseType: !211, size: 32, offset: 3072)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !390, file: !23, line: 202, baseType: !155, size: 16, offset: 3104)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !390, file: !23, line: 202, baseType: !155, size: 16, offset: 3120)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !390, file: !23, line: 203, baseType: !126, size: 64, offset: 3136)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !390, file: !23, line: 204, baseType: !838, size: 128, offset: 3200)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !672, line: 95, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !672, line: 92, size: 128, elements: !840)
!840 = !{!841, !842, !843, !844}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !839, file: !672, line: 93, baseType: !211, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !839, file: !672, line: 93, baseType: !211, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !839, file: !672, line: 94, baseType: !211, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !839, file: !672, line: 94, baseType: !211, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !390, file: !23, line: 205, baseType: !838, size: 128, offset: 3328)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !390, file: !23, line: 206, baseType: !838, size: 128, offset: 3456)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !390, file: !23, line: 215, baseType: !155, size: 16, offset: 3584)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !390, file: !23, line: 215, baseType: !155, size: 16, offset: 3600)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !390, file: !23, line: 216, baseType: !34, size: 32, offset: 3616)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !390, file: !23, line: 217, baseType: !851, size: 64, offset: 3648)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !23, line: 51, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !370, file: !371, line: 294, baseType: !854, size: 64, offset: 3264)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !348, !126, !857}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeClassCallback", file: !371, line: 282, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !126, !34, !472}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !370, file: !371, line: 296, baseType: !862, size: 64, offset: 3328)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!34, !586, !369}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "get_from_context", scope: !370, file: !371, line: 298, baseType: !866, size: 64, offset: 3392)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !586, !369, !869, !870, !870}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "localize", scope: !370, file: !371, line: 302, baseType: !872, size: 64, offset: 3456)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !363, !363}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "local_sync", scope: !370, file: !371, line: 303, baseType: !872, size: 64, offset: 3520)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "local_merge", scope: !370, file: !371, line: 304, baseType: !872, size: 64, offset: 3584)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !370, file: !371, line: 307, baseType: !382, size: 64, offset: 3648)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "validate_link", scope: !370, file: !371, line: 309, baseType: !879, size: 64, offset: 3712)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!34, !363, !543}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "node_add_init", scope: !370, file: !371, line: 311, baseType: !386, size: 64, offset: 3776)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !370, file: !371, line: 314, baseType: !500, size: 256, offset: 3840)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !364, file: !23, line: 333, baseType: !171, size: 512, offset: 1088)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !364, file: !23, line: 335, baseType: !469, size: 64, offset: 1600)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !364, file: !23, line: 337, baseType: !887, size: 64, offset: 1664)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !889, line: 45, flags: DIFlagFwdDecl)
!889 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!890 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !364, file: !23, line: 338, baseType: !891, size: 64, offset: 1728)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 64, elements: !577)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !364, file: !23, line: 340, baseType: !181, size: 128, offset: 1792)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !364, file: !23, line: 340, baseType: !181, size: 128, offset: 1920)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !23, line: 342, baseType: !34, size: 32, offset: 2048)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !364, file: !23, line: 342, baseType: !34, size: 32, offset: 2080)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !364, file: !23, line: 343, baseType: !34, size: 32, offset: 2112)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !364, file: !23, line: 345, baseType: !34, size: 32, offset: 2144)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !364, file: !23, line: 346, baseType: !34, size: 32, offset: 2176)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !364, file: !23, line: 347, baseType: !155, size: 16, offset: 2208)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !364, file: !23, line: 348, baseType: !155, size: 16, offset: 2224)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !364, file: !23, line: 349, baseType: !34, size: 32, offset: 2240)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !364, file: !23, line: 351, baseType: !34, size: 32, offset: 2272)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !364, file: !23, line: 353, baseType: !155, size: 16, offset: 2304)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !364, file: !23, line: 354, baseType: !155, size: 16, offset: 2320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !364, file: !23, line: 355, baseType: !34, size: 32, offset: 2336)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !364, file: !23, line: 357, baseType: !838, size: 128, offset: 2368)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !364, file: !23, line: 363, baseType: !181, size: 128, offset: 2496)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !364, file: !23, line: 363, baseType: !181, size: 128, offset: 2624)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !364, file: !23, line: 368, baseType: !742, size: 64, offset: 2752)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !364, file: !23, line: 372, baseType: !592, size: 32, offset: 2816)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !364, file: !23, line: 373, baseType: !34, size: 32, offset: 2848)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !364, file: !23, line: 382, baseType: !913, size: 64, offset: 2880)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !23, line: 46, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !364, file: !23, line: 385, baseType: !916, size: 64, offset: 2944)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !126, !211}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !364, file: !23, line: 386, baseType: !920, size: 64, offset: 3008)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !126, !690}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !364, file: !23, line: 387, baseType: !924, size: 64, offset: 3072)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!34, !126}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !364, file: !23, line: 388, baseType: !525, size: 64, offset: 3136)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !364, file: !23, line: 389, baseType: !126, size: 64, offset: 3200)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !364, file: !23, line: 389, baseType: !126, size: 64, offset: 3264)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !364, file: !23, line: 389, baseType: !126, size: 64, offset: 3328)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !364, file: !23, line: 389, baseType: !126, size: 64, offset: 3392)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !290, file: !198, line: 249, baseType: !276, size: 64, offset: 2752)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !290, file: !198, line: 250, baseType: !934, size: 64, offset: 2816)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !345, line: 77, size: 15424, elements: !936)
!936 = !{!937, !938, !939, !942, !945, !948, !1216, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1255, !1256, !1260}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !935, file: !345, line: 78, baseType: !121, size: 960)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !345, line: 80, baseType: !141, size: 8192, offset: 960)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !935, file: !345, line: 82, baseType: !940, size: 64, offset: 9152)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !345, line: 43, flags: DIFlagFwdDecl)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !935, file: !345, line: 83, baseType: !943, size: 64, offset: 9216)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !122, line: 46, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !935, file: !345, line: 86, baseType: !946, size: 64, offset: 9280)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !194, line: 42, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !935, file: !345, line: 87, baseType: !949, size: 64, offset: 9344)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !951, line: 110, size: 1152, elements: !952)
!951 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!952 = !{!953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !968, !1212, !1213, !1214, !1215}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !951, line: 111, baseType: !949, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !950, file: !951, line: 111, baseType: !949, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !950, file: !951, line: 114, baseType: !34, size: 32, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !950, file: !951, line: 114, baseType: !34, size: 32, offset: 160)
