; ModuleID = 'blender/source/blender/editors/space_view3d/drawmesh.c'
source_filename = "blender/source/blender/editors/space_view3d/drawmesh.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.TextureDrawState = type { %struct.Object*, %struct.Image*, %struct.Image*, i8, i32, i32, i32, i8, [4 x i8], i8, i8 }

!355 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!356 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!357 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!358 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!359 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!360 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!361 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!362 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!363 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!364 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!365 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!366 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!367 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!368 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!369 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!370 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!371 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!372 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!373 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ImagePaintMode", file: !374, line: 1717, baseType: !7, size: 32, elements: !375)
!374 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!375 = !{!376, !377}
!376 = !DIEnumerator(name: "IMAGEPAINT_MODE_MATERIAL", value: 0, isUnsigned: true)
!377 = !DIEnumerator(name: "IMAGEPAINT_MODE_IMAGE", value: 1, isUnsigned: true)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUBlendMode", file: !379, line: 98, baseType: !7, size: 32, elements: !380)
!379 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!380 = !{!381, !382, !383, !384, !385}
!381 = !DIEnumerator(name: "GPU_BLEND_SOLID", value: 0, isUnsigned: true)
!382 = !DIEnumerator(name: "GPU_BLEND_ADD", value: 1, isUnsigned: true)
!383 = !DIEnumerator(name: "GPU_BLEND_ALPHA", value: 2, isUnsigned: true)
!384 = !DIEnumerator(name: "GPU_BLEND_CLIP", value: 4, isUnsigned: true)
!385 = !DIEnumerator(name: "GPU_BLEND_ALPHA_SORT", value: 8, isUnsigned: true)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !387, line: 260, baseType: !7, size: 32, elements: !388)
!387 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!388 = !{!389, !390, !391, !392, !393, !394, !395}
!389 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!390 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!391 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!392 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!393 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!394 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!395 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!396 = !{!397, !398, !404, !407, !3107, !492, !433, !943, !3118, !723}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !45, line: 149, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !397, !403}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !45, line: 143, baseType: !59)
!403 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !406, line: 33, baseType: !7)
!406 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !409, line: 133, baseType: !410)
!409 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !409, line: 58, size: 11008, elements: !411)
!411 = !{!412, !482, !486, !498, !501, !504, !2973, !2979, !2980, !2990, !2991, !2997, !3005, !3006, !3007, !3020, !3021, !3022, !3023, !3031, !3033, !3059, !3060, !3061, !3062, !3063, !3064, !3065, !3066, !3067, !3068, !3069, !3070, !3071, !3072, !3073, !3074, !3075, !3076, !3077, !3078, !3079, !3080, !3081, !3082, !3083, !3084, !3085, !3086}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !410, file: !409, line: 59, baseType: !413, size: 960)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !414, line: 130, baseType: !415)
!414 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !414, line: 117, size: 960, elements: !416)
!416 = !{!417, !418, !419, !421, !441, !445, !447, !448, !449, !450}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !415, file: !414, line: 118, baseType: !397, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !415, file: !414, line: 118, baseType: !397, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !415, file: !414, line: 119, baseType: !420, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !415, file: !414, line: 120, baseType: !422, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !414, line: 136, size: 17600, elements: !424)
!424 = !{!425, !426, !428, !431, !436, !437, !438}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !423, file: !414, line: 137, baseType: !413, size: 960)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !423, file: !414, line: 138, baseType: !427, size: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !423, file: !414, line: 139, baseType: !429, size: 64, offset: 1024)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !414, line: 43, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !423, file: !414, line: 140, baseType: !432, size: 8192, offset: 1088)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 8192, elements: !434)
!433 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!434 = !{!435}
!435 = !DISubrange(count: 1024)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !423, file: !414, line: 141, baseType: !432, size: 8192, offset: 9280)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !423, file: !414, line: 148, baseType: !422, size: 64, offset: 17472)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !423, file: !414, line: 150, baseType: !439, size: 64, offset: 17536)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !414, line: 45, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !414, line: 121, baseType: !442, size: 528, offset: 256)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 528, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 66)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !414, line: 126, baseType: !446, size: 16, offset: 784)
!446 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !415, file: !414, line: 127, baseType: !403, size: 32, offset: 800)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !415, file: !414, line: 128, baseType: !403, size: 32, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !415, file: !414, line: 128, baseType: !403, size: 32, offset: 864)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !415, file: !414, line: 129, baseType: !451, size: 64, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !414, line: 75, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !414, line: 62, size: 1024, elements: !454)
!454 = !{!455, !457, !458, !459, !460, !461, !465, !466, !480, !481}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !414, line: 63, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !414, line: 63, baseType: !456, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !453, file: !414, line: 64, baseType: !433, size: 8, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !453, file: !414, line: 64, baseType: !433, size: 8, offset: 136)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !414, line: 65, baseType: !446, size: 16, offset: 144)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !453, file: !414, line: 66, baseType: !462, size: 512, offset: 160)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 512, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !453, file: !414, line: 67, baseType: !403, size: 32, offset: 672)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !453, file: !414, line: 69, baseType: !467, size: 256, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !414, line: 60, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !414, line: 48, size: 256, elements: !469)
!469 = !{!470, !471, !478, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !468, file: !414, line: 49, baseType: !397, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !468, file: !414, line: 58, baseType: !472, size: 128, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !473, line: 71, baseType: !474)
!473 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !473, line: 69, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !474, file: !473, line: 70, baseType: !397, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !474, file: !473, line: 70, baseType: !397, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !468, file: !414, line: 59, baseType: !403, size: 32, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !468, file: !414, line: 59, baseType: !403, size: 32, offset: 224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !453, file: !414, line: 70, baseType: !403, size: 32, offset: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !453, file: !414, line: 74, baseType: !403, size: 32, offset: 992)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !410, file: !409, line: 60, baseType: !483, size: 64, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !485, line: 48, flags: DIFlagFwdDecl)
!485 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!486 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !410, file: !409, line: 62, baseType: !487, size: 64, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !273, line: 97, size: 832, elements: !489)
!489 = !{!490, !496, !497}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !488, file: !273, line: 98, baseType: !491, size: 768)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 768, elements: !493)
!492 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!493 = !{!494, !495}
!494 = !DISubrange(count: 8)
!495 = !DISubrange(count: 3)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !488, file: !273, line: 99, baseType: !403, size: 32, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !488, file: !273, line: 99, baseType: !403, size: 32, offset: 800)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !410, file: !409, line: 64, baseType: !499, size: 64, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !485, line: 49, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !410, file: !409, line: 65, baseType: !502, size: 64, offset: 1152)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !409, line: 42, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !410, file: !409, line: 66, baseType: !505, size: 64, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !485, line: 93, size: 7552, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !559, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !628, !629, !630, !631, !632, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2959, !2960, !2961, !2962, !2963, !2964, !2972}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !507, file: !485, line: 94, baseType: !413, size: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !507, file: !485, line: 95, baseType: !483, size: 64, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !507, file: !485, line: 97, baseType: !446, size: 16, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !507, file: !485, line: 97, baseType: !446, size: 16, offset: 1040)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !507, file: !485, line: 99, baseType: !492, size: 32, offset: 1056)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !507, file: !485, line: 99, baseType: !492, size: 32, offset: 1088)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !507, file: !485, line: 99, baseType: !492, size: 32, offset: 1120)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !507, file: !485, line: 100, baseType: !492, size: 32, offset: 1152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !507, file: !485, line: 100, baseType: !492, size: 32, offset: 1184)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !507, file: !485, line: 100, baseType: !492, size: 32, offset: 1216)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !507, file: !485, line: 101, baseType: !492, size: 32, offset: 1248)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !507, file: !485, line: 101, baseType: !492, size: 32, offset: 1280)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !507, file: !485, line: 101, baseType: !492, size: 32, offset: 1312)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !507, file: !485, line: 102, baseType: !492, size: 32, offset: 1344)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !507, file: !485, line: 102, baseType: !492, size: 32, offset: 1376)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !507, file: !485, line: 102, baseType: !492, size: 32, offset: 1408)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !507, file: !485, line: 103, baseType: !492, size: 32, offset: 1440)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !507, file: !485, line: 103, baseType: !492, size: 32, offset: 1472)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !507, file: !485, line: 103, baseType: !492, size: 32, offset: 1504)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !507, file: !485, line: 103, baseType: !492, size: 32, offset: 1536)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !507, file: !485, line: 103, baseType: !492, size: 32, offset: 1568)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !507, file: !485, line: 104, baseType: !492, size: 32, offset: 1600)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !507, file: !485, line: 104, baseType: !492, size: 32, offset: 1632)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !507, file: !485, line: 104, baseType: !492, size: 32, offset: 1664)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !507, file: !485, line: 104, baseType: !492, size: 32, offset: 1696)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !507, file: !485, line: 104, baseType: !492, size: 32, offset: 1728)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !507, file: !485, line: 105, baseType: !492, size: 32, offset: 1760)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !507, file: !485, line: 108, baseType: !537, size: 704, offset: 1792)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !485, line: 53, size: 704, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !537, file: !485, line: 54, baseType: !492, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !537, file: !485, line: 55, baseType: !492, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !537, file: !485, line: 56, baseType: !492, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !537, file: !485, line: 57, baseType: !492, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !537, file: !485, line: 59, baseType: !544, size: 96, offset: 128)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 96, elements: !545)
!545 = !{!495}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !537, file: !485, line: 60, baseType: !544, size: 96, offset: 224)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !537, file: !485, line: 61, baseType: !544, size: 96, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !537, file: !485, line: 63, baseType: !492, size: 32, offset: 416)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !537, file: !485, line: 64, baseType: !492, size: 32, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !537, file: !485, line: 65, baseType: !492, size: 32, offset: 480)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !537, file: !485, line: 67, baseType: !446, size: 16, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !537, file: !485, line: 68, baseType: !446, size: 16, offset: 528)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !537, file: !485, line: 69, baseType: !446, size: 16, offset: 544)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !537, file: !485, line: 70, baseType: !446, size: 16, offset: 560)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !537, file: !485, line: 72, baseType: !492, size: 32, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !537, file: !485, line: 73, baseType: !492, size: 32, offset: 608)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !537, file: !485, line: 74, baseType: !492, size: 32, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !537, file: !485, line: 75, baseType: !492, size: 32, offset: 672)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !507, file: !485, line: 109, baseType: !560, size: 128, offset: 2496)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !485, line: 79, size: 128, elements: !561)
!561 = !{!562, !563, !564, !565}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !485, line: 80, baseType: !403, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !560, file: !485, line: 81, baseType: !403, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !560, file: !485, line: 82, baseType: !403, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !560, file: !485, line: 83, baseType: !403, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !507, file: !485, line: 111, baseType: !492, size: 32, offset: 2624)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !507, file: !485, line: 111, baseType: !492, size: 32, offset: 2656)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !507, file: !485, line: 112, baseType: !492, size: 32, offset: 2688)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !507, file: !485, line: 112, baseType: !492, size: 32, offset: 2720)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !507, file: !485, line: 113, baseType: !492, size: 32, offset: 2752)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !507, file: !485, line: 114, baseType: !492, size: 32, offset: 2784)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !507, file: !485, line: 114, baseType: !492, size: 32, offset: 2816)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !507, file: !485, line: 115, baseType: !446, size: 16, offset: 2848)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !507, file: !485, line: 115, baseType: !446, size: 16, offset: 2864)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !507, file: !485, line: 116, baseType: !446, size: 16, offset: 2880)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !507, file: !485, line: 117, baseType: !433, size: 8, offset: 2896)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !507, file: !485, line: 117, baseType: !433, size: 8, offset: 2904)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !507, file: !485, line: 119, baseType: !492, size: 32, offset: 2912)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !507, file: !485, line: 119, baseType: !492, size: 32, offset: 2944)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !507, file: !485, line: 120, baseType: !446, size: 16, offset: 2976)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !507, file: !485, line: 120, baseType: !446, size: 16, offset: 2992)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !507, file: !485, line: 121, baseType: !492, size: 32, offset: 3008)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !507, file: !485, line: 121, baseType: !492, size: 32, offset: 3040)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !507, file: !485, line: 122, baseType: !492, size: 32, offset: 3072)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !507, file: !485, line: 123, baseType: !492, size: 32, offset: 3104)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !507, file: !485, line: 124, baseType: !446, size: 16, offset: 3136)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !507, file: !485, line: 125, baseType: !446, size: 16, offset: 3152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !507, file: !485, line: 127, baseType: !403, size: 32, offset: 3168)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !507, file: !485, line: 127, baseType: !403, size: 32, offset: 3200)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !507, file: !485, line: 128, baseType: !403, size: 32, offset: 3232)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !507, file: !485, line: 128, baseType: !403, size: 32, offset: 3264)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !507, file: !485, line: 129, baseType: !446, size: 16, offset: 3296)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !507, file: !485, line: 129, baseType: !446, size: 16, offset: 3312)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !507, file: !485, line: 129, baseType: !446, size: 16, offset: 3328)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !507, file: !485, line: 129, baseType: !446, size: 16, offset: 3344)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !507, file: !485, line: 130, baseType: !492, size: 32, offset: 3360)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !507, file: !485, line: 130, baseType: !492, size: 32, offset: 3392)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !507, file: !485, line: 130, baseType: !492, size: 32, offset: 3424)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !507, file: !485, line: 130, baseType: !492, size: 32, offset: 3456)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !507, file: !485, line: 131, baseType: !492, size: 32, offset: 3488)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !507, file: !485, line: 131, baseType: !492, size: 32, offset: 3520)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !507, file: !485, line: 131, baseType: !492, size: 32, offset: 3552)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !507, file: !485, line: 131, baseType: !492, size: 32, offset: 3584)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !507, file: !485, line: 132, baseType: !492, size: 32, offset: 3616)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !507, file: !485, line: 132, baseType: !492, size: 32, offset: 3648)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !507, file: !485, line: 133, baseType: !462, size: 512, offset: 3680)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !507, file: !485, line: 135, baseType: !492, size: 32, offset: 4192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !507, file: !485, line: 136, baseType: !492, size: 32, offset: 4224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !507, file: !485, line: 137, baseType: !492, size: 32, offset: 4256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !507, file: !485, line: 138, baseType: !403, size: 32, offset: 4288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !507, file: !485, line: 141, baseType: !433, size: 8, offset: 4320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !507, file: !485, line: 141, baseType: !433, size: 8, offset: 4328)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !507, file: !485, line: 141, baseType: !433, size: 8, offset: 4336)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !507, file: !485, line: 141, baseType: !433, size: 8, offset: 4344)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !507, file: !485, line: 142, baseType: !446, size: 16, offset: 4352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !507, file: !485, line: 142, baseType: !446, size: 16, offset: 4368)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !507, file: !485, line: 142, baseType: !446, size: 16, offset: 4384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !507, file: !485, line: 145, baseType: !433, size: 8, offset: 4400)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !507, file: !485, line: 145, baseType: !433, size: 8, offset: 4408)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !507, file: !485, line: 148, baseType: !446, size: 16, offset: 4416)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !507, file: !485, line: 148, baseType: !446, size: 16, offset: 4432)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !507, file: !485, line: 149, baseType: !492, size: 32, offset: 4448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !507, file: !485, line: 149, baseType: !492, size: 32, offset: 4480)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !507, file: !485, line: 152, baseType: !625, size: 128, offset: 4512)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 128, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 4)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !507, file: !485, line: 153, baseType: !492, size: 32, offset: 4640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !507, file: !485, line: 154, baseType: !492, size: 32, offset: 4672)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !507, file: !485, line: 157, baseType: !446, size: 16, offset: 4704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !507, file: !485, line: 157, baseType: !446, size: 16, offset: 4720)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !507, file: !485, line: 160, baseType: !633, size: 64, offset: 4736)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !635, line: 113, size: 6208, elements: !636)
!635 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!636 = !{!637, !638, !639, !640, !641, !642, !646}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !634, file: !635, line: 114, baseType: !446, size: 16)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !634, file: !635, line: 114, baseType: !446, size: 16, offset: 16)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !634, file: !635, line: 115, baseType: !433, size: 8, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !634, file: !635, line: 115, baseType: !433, size: 8, offset: 40)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !634, file: !635, line: 116, baseType: !433, size: 8, offset: 48)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !634, file: !635, line: 117, baseType: !643, size: 8, offset: 56)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 8, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 1)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !634, file: !635, line: 119, baseType: !647, size: 6144, offset: 64)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 6144, elements: !657)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !635, line: 109, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !635, line: 106, size: 192, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !649, file: !635, line: 107, baseType: !492, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !649, file: !635, line: 107, baseType: !492, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !649, file: !635, line: 107, baseType: !492, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !649, file: !635, line: 107, baseType: !492, size: 32, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !649, file: !635, line: 107, baseType: !492, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !649, file: !635, line: 108, baseType: !403, size: 32, offset: 160)
!657 = !{!658}
!658 = !DISubrange(count: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !507, file: !485, line: 161, baseType: !633, size: 64, offset: 4800)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !507, file: !485, line: 162, baseType: !433, size: 8, offset: 4864)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !507, file: !485, line: 162, baseType: !433, size: 8, offset: 4872)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !507, file: !485, line: 163, baseType: !433, size: 8, offset: 4880)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !507, file: !485, line: 163, baseType: !433, size: 8, offset: 4888)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !507, file: !485, line: 164, baseType: !446, size: 16, offset: 4896)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !507, file: !485, line: 164, baseType: !446, size: 16, offset: 4912)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !507, file: !485, line: 165, baseType: !492, size: 32, offset: 4928)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !507, file: !485, line: 165, baseType: !492, size: 32, offset: 4960)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !507, file: !485, line: 167, baseType: !669, size: 1152, offset: 4992)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 1152, elements: !2930)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !635, line: 57, size: 2496, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !2729, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !671, file: !635, line: 59, baseType: !446, size: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !671, file: !635, line: 59, baseType: !446, size: 16, offset: 16)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !671, file: !635, line: 59, baseType: !446, size: 16, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !671, file: !635, line: 59, baseType: !446, size: 16, offset: 48)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !671, file: !635, line: 60, baseType: !678, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !273, line: 115, size: 11392, elements: !680)
!680 = !{!681, !682, !683, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !986, !987, !1027, !1028, !1031, !1032, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1144, !1147, !1150, !1151, !1152, !1153, !1154, !1157, !1160, !1611, !1612, !1618, !1619, !1620, !1621, !1622, !1623, !1625, !1628, !1631, !1633, !2717, !2718}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !679, file: !273, line: 116, baseType: !413, size: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !679, file: !273, line: 117, baseType: !483, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !679, file: !273, line: 119, baseType: !684, size: 64, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !686, line: 155, size: 1856, elements: !687)
!686 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!687 = !{!688, !691, !700, !709, !715, !716, !717, !719, !722, !724, !728, !922, !923, !924, !926, !929, !932, !933, !934, !935, !936, !940, !941, !942, !944, !945, !949, !950, !953, !956, !957, !958, !959}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !685, file: !686, line: 157, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !686, line: 157, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !685, file: !686, line: 158, baseType: !692, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !319, line: 65, size: 160, elements: !694)
!694 = !{!695, !696, !698, !699}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !693, file: !319, line: 66, baseType: !544, size: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !693, file: !319, line: 67, baseType: !697, size: 48, offset: 96)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 48, elements: !545)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !693, file: !319, line: 68, baseType: !433, size: 8, offset: 144)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !693, file: !319, line: 68, baseType: !433, size: 8, offset: 152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !685, file: !686, line: 159, baseType: !701, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !319, line: 79, size: 96, elements: !703)
!703 = !{!704, !705, !706, !707, !708}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !702, file: !319, line: 81, baseType: !403, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !702, file: !319, line: 82, baseType: !403, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !702, file: !319, line: 83, baseType: !446, size: 16, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !702, file: !319, line: 84, baseType: !433, size: 8, offset: 80)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !702, file: !319, line: 84, baseType: !433, size: 8, offset: 88)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !685, file: !686, line: 160, baseType: !710, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !319, line: 88, size: 64, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !711, file: !319, line: 89, baseType: !7, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !711, file: !319, line: 90, baseType: !7, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !685, file: !686, line: 161, baseType: !403, size: 32, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !685, file: !686, line: 161, baseType: !403, size: 32, offset: 288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !685, file: !686, line: 162, baseType: !718, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !685, file: !686, line: 163, baseType: !720, size: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !45, line: 92, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !685, file: !686, line: 164, baseType: !723, size: 64, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !685, file: !686, line: 167, baseType: !725, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !45, line: 355, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !685, file: !686, line: 170, baseType: !729, size: 64, offset: 576)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !387, line: 186, size: 8064, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !744, !745, !746, !747, !808, !812, !816, !817, !818, !819, !820, !821, !822, !823, !878, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !730, file: !387, line: 187, baseType: !403, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !730, file: !387, line: 187, baseType: !403, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !730, file: !387, line: 187, baseType: !403, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !730, file: !387, line: 187, baseType: !403, size: 32, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !730, file: !387, line: 188, baseType: !403, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !730, file: !387, line: 188, baseType: !403, size: 32, offset: 160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !730, file: !387, line: 188, baseType: !403, size: 32, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !730, file: !387, line: 193, baseType: !433, size: 8, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !730, file: !387, line: 197, baseType: !433, size: 8, offset: 232)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !730, file: !387, line: 201, baseType: !742, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !330, line: 71, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !730, file: !387, line: 201, baseType: !742, size: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !730, file: !387, line: 201, baseType: !742, size: 64, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !730, file: !387, line: 201, baseType: !742, size: 64, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !730, file: !387, line: 208, baseType: !748, size: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !387, line: 103, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !387, line: 90, size: 448, elements: !752)
!752 = !{!753, !762, !767, !768, !769}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !751, file: !387, line: 91, baseType: !754, size: 128)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !387, line: 82, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !387, line: 64, size: 128, elements: !756)
!756 = !{!757, !758, !759, !760, !761}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !755, file: !387, line: 65, baseType: !397, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !755, file: !387, line: 66, baseType: !403, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !755, file: !387, line: 73, baseType: !433, size: 8, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !755, file: !387, line: 74, baseType: !433, size: 8, offset: 104)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !755, file: !387, line: 80, baseType: !433, size: 8, offset: 112)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !751, file: !387, line: 92, baseType: !763, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !387, line: 180, size: 16, elements: !765)
!765 = !{!766}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !764, file: !387, line: 181, baseType: !446, size: 16)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !751, file: !387, line: 94, baseType: !544, size: 96, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !751, file: !387, line: 95, baseType: !544, size: 96, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !751, file: !387, line: 102, baseType: !770, size: 64, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !387, line: 110, size: 640, elements: !772)
!772 = !{!773, !774, !775, !777, !778, !801, !807}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !771, file: !387, line: 111, baseType: !754, size: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !771, file: !387, line: 112, baseType: !763, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !771, file: !387, line: 114, baseType: !776, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !771, file: !387, line: 114, baseType: !776, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !771, file: !387, line: 118, baseType: !779, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !387, line: 125, size: 576, elements: !781)
!781 = !{!782, !783, !784, !785, !797, !798, !799, !800}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !780, file: !387, line: 126, baseType: !754, size: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !780, file: !387, line: 129, baseType: !776, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !780, file: !387, line: 130, baseType: !770, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !780, file: !387, line: 131, baseType: !786, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !387, line: 164, size: 448, elements: !788)
!788 = !{!789, !790, !791, !794, !795, !796}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !787, file: !387, line: 165, baseType: !754, size: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !787, file: !387, line: 166, baseType: !763, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !787, file: !387, line: 172, baseType: !792, size: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !387, line: 140, baseType: !780)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !787, file: !387, line: 174, baseType: !403, size: 32, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !787, file: !387, line: 175, baseType: !544, size: 96, offset: 288)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !787, file: !387, line: 176, baseType: !446, size: 16, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !780, file: !387, line: 135, baseType: !779, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !780, file: !387, line: 135, baseType: !779, size: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !780, file: !387, line: 139, baseType: !779, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !780, file: !387, line: 139, baseType: !779, size: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !771, file: !387, line: 122, baseType: !802, size: 128, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !387, line: 108, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !387, line: 106, size: 128, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !387, line: 107, baseType: !770, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !803, file: !387, line: 107, baseType: !770, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !771, file: !387, line: 122, baseType: !802, size: 128, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !730, file: !387, line: 209, baseType: !809, size: 64, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !387, line: 123, baseType: !771)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !730, file: !387, line: 210, baseType: !813, size: 64, offset: 640)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !387, line: 178, baseType: !787)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !730, file: !387, line: 213, baseType: !403, size: 32, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !730, file: !387, line: 214, baseType: !403, size: 32, offset: 736)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !730, file: !387, line: 215, baseType: !403, size: 32, offset: 768)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !730, file: !387, line: 218, baseType: !742, size: 64, offset: 832)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !730, file: !387, line: 218, baseType: !742, size: 64, offset: 896)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !730, file: !387, line: 218, baseType: !742, size: 64, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !730, file: !387, line: 220, baseType: !403, size: 32, offset: 1024)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !730, file: !387, line: 221, baseType: !824, size: 64, offset: 1088)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !826)
!826 = !{!827, !864, !865, !871, !874, !875, !877}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !825, file: !6, line: 191, baseType: !828, size: 5120)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 5120, elements: !862)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !830)
!830 = !{!831, !834, !836, !846, !847}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !829, file: !6, line: 148, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !829, file: !6, line: 149, baseType: !835, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !829, file: !6, line: 150, baseType: !837, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !839)
!839 = !{!840, !842, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !838, file: !6, line: 139, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !838, file: !6, line: 140, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !838, file: !6, line: 141, baseType: !845, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !829, file: !6, line: 152, baseType: !403, size: 32, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !829, file: !6, line: 162, baseType: !848, size: 128, offset: 192)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !829, file: !6, line: 155, size: 128, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !856}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !848, file: !6, line: 156, baseType: !403, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !848, file: !6, line: 157, baseType: !492, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !848, file: !6, line: 158, baseType: !397, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !848, file: !6, line: 159, baseType: !544, size: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !848, file: !6, line: 160, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !848, file: !6, line: 161, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !859, line: 48, baseType: !860)
!859 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !861, line: 47, flags: DIFlagFwdDecl)
!861 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!862 = !{!863}
!863 = !DISubrange(count: 16)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !825, file: !6, line: 192, baseType: !828, size: 5120, offset: 5120)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !825, file: !6, line: 193, baseType: !866, size: 64, offset: 10240)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !869, !824}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !387, line: 246, baseType: !730)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !825, file: !6, line: 194, baseType: !872, size: 64, offset: 10304)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !6, line: 194, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !825, file: !6, line: 195, baseType: !403, size: 32, offset: 10368)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !825, file: !6, line: 196, baseType: !876, size: 32, offset: 10400)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !825, file: !6, line: 197, baseType: !403, size: 32, offset: 10432)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !730, file: !387, line: 223, baseType: !879, size: 1600, offset: 1152)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !330, line: 73, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !330, line: 64, size: 1600, elements: !881)
!881 = !{!882, !897, !901, !902, !903, !904, !905}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !880, file: !330, line: 65, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !330, line: 53, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !330, line: 42, size: 832, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !885, file: !330, line: 43, baseType: !403, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !885, file: !330, line: 44, baseType: !403, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !885, file: !330, line: 45, baseType: !403, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !885, file: !330, line: 46, baseType: !403, size: 32, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !885, file: !330, line: 47, baseType: !403, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !885, file: !330, line: 48, baseType: !403, size: 32, offset: 160)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !885, file: !330, line: 49, baseType: !403, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !885, file: !330, line: 50, baseType: !403, size: 32, offset: 224)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !330, line: 51, baseType: !462, size: 512, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !885, file: !330, line: 52, baseType: !397, size: 64, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !880, file: !330, line: 66, baseType: !898, size: 1312, offset: 64)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 1312, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 41)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !880, file: !330, line: 69, baseType: !403, size: 32, offset: 1376)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !880, file: !330, line: 69, baseType: !403, size: 32, offset: 1408)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !880, file: !330, line: 70, baseType: !403, size: 32, offset: 1440)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !880, file: !330, line: 71, baseType: !742, size: 64, offset: 1472)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !880, file: !330, line: 72, baseType: !906, size: 64, offset: 1536)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !330, line: 59, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !330, line: 57, size: 8192, elements: !909)
!909 = !{!910}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !908, file: !330, line: 58, baseType: !432, size: 8192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !730, file: !387, line: 223, baseType: !879, size: 1600, offset: 2752)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !730, file: !387, line: 223, baseType: !879, size: 1600, offset: 4352)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !730, file: !387, line: 223, baseType: !879, size: 1600, offset: 5952)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !730, file: !387, line: 233, baseType: !446, size: 16, offset: 7552)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !730, file: !387, line: 236, baseType: !403, size: 32, offset: 7584)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !730, file: !387, line: 238, baseType: !403, size: 32, offset: 7616)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !730, file: !387, line: 238, baseType: !403, size: 32, offset: 7648)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !730, file: !387, line: 239, baseType: !472, size: 128, offset: 7680)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !730, file: !387, line: 241, baseType: !814, size: 64, offset: 7808)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !730, file: !387, line: 243, baseType: !472, size: 128, offset: 7872)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !730, file: !387, line: 245, baseType: !397, size: 64, offset: 8000)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !685, file: !686, line: 171, baseType: !403, size: 32, offset: 640)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !685, file: !686, line: 172, baseType: !403, size: 32, offset: 672)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !685, file: !686, line: 173, baseType: !925, size: 8, offset: 704)
!925 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !685, file: !686, line: 175, baseType: !927, size: 64, offset: 768)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !686, line: 175, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !685, file: !686, line: 178, baseType: !930, size: 64, offset: 832)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !45, line: 100, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !685, file: !686, line: 179, baseType: !925, size: 8, offset: 896)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !685, file: !686, line: 182, baseType: !925, size: 8, offset: 904)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !685, file: !686, line: 183, baseType: !718, size: 64, offset: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !685, file: !686, line: 184, baseType: !718, size: 64, offset: 1024)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !685, file: !686, line: 185, baseType: !937, size: 64, offset: 1088)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 288, elements: !939)
!939 = !{!495, !495}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !685, file: !686, line: 188, baseType: !925, size: 8, offset: 1152)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !685, file: !686, line: 191, baseType: !7, size: 32, offset: 1184)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !685, file: !686, line: 191, baseType: !943, size: 64, offset: 1216)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !685, file: !686, line: 191, baseType: !7, size: 32, offset: 1280)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !685, file: !686, line: 192, baseType: !946, size: 64, offset: 1344)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !948, line: 47, flags: DIFlagFwdDecl)
!948 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!949 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !685, file: !686, line: 195, baseType: !718, size: 64, offset: 1408)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !685, file: !686, line: 197, baseType: !951, size: 64, offset: 1472)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !686, line: 197, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !685, file: !686, line: 198, baseType: !954, size: 64, offset: 1536)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !686, line: 59, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !685, file: !686, line: 201, baseType: !925, size: 8, offset: 1600)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !685, file: !686, line: 202, baseType: !544, size: 96, offset: 1632)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !685, file: !686, line: 204, baseType: !544, size: 96, offset: 1728)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !685, file: !686, line: 205, baseType: !403, size: 32, offset: 1824)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !679, file: !273, line: 121, baseType: !446, size: 16, offset: 1088)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !679, file: !273, line: 121, baseType: !446, size: 16, offset: 1104)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !679, file: !273, line: 122, baseType: !403, size: 32, offset: 1120)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !679, file: !273, line: 122, baseType: !403, size: 32, offset: 1152)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !679, file: !273, line: 122, baseType: !403, size: 32, offset: 1184)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !679, file: !273, line: 123, baseType: !462, size: 512, offset: 1216)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !679, file: !273, line: 124, baseType: !678, size: 64, offset: 1728)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !679, file: !273, line: 124, baseType: !678, size: 64, offset: 1792)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !679, file: !273, line: 127, baseType: !678, size: 64, offset: 1856)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !679, file: !273, line: 127, baseType: !678, size: 64, offset: 1920)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !679, file: !273, line: 127, baseType: !678, size: 64, offset: 1984)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !679, file: !273, line: 128, baseType: !499, size: 64, offset: 2048)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !679, file: !273, line: 130, baseType: !487, size: 64, offset: 2112)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !679, file: !273, line: 131, baseType: !974, size: 64, offset: 2176)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !861, line: 486, size: 1600, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !982, !983, !984, !985}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !975, file: !861, line: 487, baseType: !413, size: 960)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !975, file: !861, line: 489, baseType: !472, size: 128, offset: 960)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !975, file: !861, line: 490, baseType: !472, size: 128, offset: 1088)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !975, file: !861, line: 491, baseType: !472, size: 128, offset: 1216)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !975, file: !861, line: 492, baseType: !472, size: 128, offset: 1344)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !975, file: !861, line: 494, baseType: !403, size: 32, offset: 1472)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !975, file: !861, line: 495, baseType: !403, size: 32, offset: 1504)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !975, file: !861, line: 497, baseType: !403, size: 32, offset: 1536)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !975, file: !861, line: 498, baseType: !403, size: 32, offset: 1568)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !679, file: !273, line: 132, baseType: !974, size: 64, offset: 2240)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !679, file: !273, line: 133, baseType: !988, size: 64, offset: 2304)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !861, line: 334, size: 1728, elements: !990)
!990 = !{!991, !992, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1026}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !989, file: !861, line: 335, baseType: !472, size: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !989, file: !861, line: 336, baseType: !993, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !989, file: !861, line: 338, baseType: !446, size: 16, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !989, file: !861, line: 338, baseType: !446, size: 16, offset: 208)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !989, file: !861, line: 339, baseType: !7, size: 32, offset: 224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !989, file: !861, line: 340, baseType: !403, size: 32, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !989, file: !861, line: 342, baseType: !492, size: 32, offset: 288)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !989, file: !861, line: 343, baseType: !544, size: 96, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !989, file: !861, line: 344, baseType: !544, size: 96, offset: 416)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !989, file: !861, line: 347, baseType: !472, size: 128, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !989, file: !861, line: 349, baseType: !403, size: 32, offset: 640)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !989, file: !861, line: 350, baseType: !403, size: 32, offset: 672)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !989, file: !861, line: 351, baseType: !397, size: 64, offset: 704)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !989, file: !861, line: 352, baseType: !397, size: 64, offset: 768)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !989, file: !861, line: 354, baseType: !1007, size: 384, offset: 832)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !861, line: 116, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !861, line: 94, size: 384, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1008, file: !861, line: 96, baseType: !403, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1008, file: !861, line: 96, baseType: !403, size: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1008, file: !861, line: 97, baseType: !403, size: 32, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1008, file: !861, line: 97, baseType: !403, size: 32, offset: 96)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1008, file: !861, line: 99, baseType: !446, size: 16, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1008, file: !861, line: 100, baseType: !446, size: 16, offset: 144)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1008, file: !861, line: 102, baseType: !446, size: 16, offset: 160)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1008, file: !861, line: 105, baseType: !446, size: 16, offset: 176)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1008, file: !861, line: 108, baseType: !446, size: 16, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1008, file: !861, line: 109, baseType: !446, size: 16, offset: 208)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1008, file: !861, line: 111, baseType: !446, size: 16, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1008, file: !861, line: 112, baseType: !446, size: 16, offset: 240)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1008, file: !861, line: 114, baseType: !403, size: 32, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1008, file: !861, line: 114, baseType: !403, size: 32, offset: 288)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1008, file: !861, line: 115, baseType: !403, size: 32, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1008, file: !861, line: 115, baseType: !403, size: 32, offset: 352)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !989, file: !861, line: 355, baseType: !462, size: 512, offset: 1216)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !679, file: !273, line: 134, baseType: !397, size: 64, offset: 2368)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !679, file: !273, line: 136, baseType: !1029, size: 64, offset: 2432)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !374, line: 61, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !679, file: !273, line: 138, baseType: !1007, size: 384, offset: 2496)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !679, file: !273, line: 139, baseType: !1033, size: 64, offset: 2880)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !861, line: 80, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !861, line: 72, size: 192, elements: !1036)
!1036 = !{!1037, !1044, !1045, !1046, !1047}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1035, file: !861, line: 73, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !861, line: 59, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !861, line: 56, size: 128, elements: !1041)
!1041 = !{!1042, !1043}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1040, file: !861, line: 57, baseType: !544, size: 96)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1040, file: !861, line: 58, baseType: !403, size: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1035, file: !861, line: 74, baseType: !403, size: 32, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1035, file: !861, line: 76, baseType: !403, size: 32, offset: 96)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1035, file: !861, line: 77, baseType: !403, size: 32, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1035, file: !861, line: 79, baseType: !403, size: 32, offset: 160)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !679, file: !273, line: 141, baseType: !472, size: 128, offset: 2944)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !679, file: !273, line: 142, baseType: !472, size: 128, offset: 3072)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !679, file: !273, line: 143, baseType: !472, size: 128, offset: 3200)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !679, file: !273, line: 144, baseType: !472, size: 128, offset: 3328)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !679, file: !273, line: 146, baseType: !403, size: 32, offset: 3456)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !679, file: !273, line: 147, baseType: !403, size: 32, offset: 3488)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !679, file: !273, line: 150, baseType: !505, size: 64, offset: 3520)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !679, file: !273, line: 151, baseType: !1056, size: 64, offset: 3584)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !679, file: !273, line: 152, baseType: !403, size: 32, offset: 3648)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !679, file: !273, line: 153, baseType: !403, size: 32, offset: 3680)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !679, file: !273, line: 156, baseType: !544, size: 96, offset: 3712)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !679, file: !273, line: 156, baseType: !544, size: 96, offset: 3808)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !679, file: !273, line: 156, baseType: !544, size: 96, offset: 3904)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !679, file: !273, line: 157, baseType: !544, size: 96, offset: 4000)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !679, file: !273, line: 158, baseType: !544, size: 96, offset: 4096)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !679, file: !273, line: 159, baseType: !544, size: 96, offset: 4192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !679, file: !273, line: 160, baseType: !544, size: 96, offset: 4288)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !679, file: !273, line: 160, baseType: !544, size: 96, offset: 4384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !679, file: !273, line: 161, baseType: !625, size: 128, offset: 4480)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !679, file: !273, line: 161, baseType: !625, size: 128, offset: 4608)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !679, file: !273, line: 162, baseType: !544, size: 96, offset: 4736)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !679, file: !273, line: 162, baseType: !544, size: 96, offset: 4832)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !679, file: !273, line: 163, baseType: !492, size: 32, offset: 4928)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !679, file: !273, line: 163, baseType: !492, size: 32, offset: 4960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !679, file: !273, line: 164, baseType: !1074, size: 512, offset: 4992)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 512, elements: !1075)
!1075 = !{!627, !627}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !679, file: !273, line: 165, baseType: !1074, size: 512, offset: 5504)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !679, file: !273, line: 166, baseType: !1074, size: 512, offset: 6016)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !679, file: !273, line: 167, baseType: !1074, size: 512, offset: 6528)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !679, file: !273, line: 176, baseType: !1074, size: 512, offset: 7040)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !679, file: !273, line: 178, baseType: !7, size: 32, offset: 7552)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !273, line: 180, baseType: !446, size: 16, offset: 7584)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !679, file: !273, line: 181, baseType: !446, size: 16, offset: 7600)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !679, file: !273, line: 183, baseType: !446, size: 16, offset: 7616)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !679, file: !273, line: 183, baseType: !446, size: 16, offset: 7632)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !679, file: !273, line: 184, baseType: !446, size: 16, offset: 7648)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !679, file: !273, line: 184, baseType: !446, size: 16, offset: 7664)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !679, file: !273, line: 185, baseType: !446, size: 16, offset: 7680)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !679, file: !273, line: 186, baseType: !446, size: 16, offset: 7696)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !679, file: !273, line: 187, baseType: !446, size: 16, offset: 7712)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !679, file: !273, line: 188, baseType: !433, size: 8, offset: 7728)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !679, file: !273, line: 189, baseType: !433, size: 8, offset: 7736)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !679, file: !273, line: 192, baseType: !403, size: 32, offset: 7744)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !679, file: !273, line: 192, baseType: !403, size: 32, offset: 7776)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !679, file: !273, line: 192, baseType: !403, size: 32, offset: 7808)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !679, file: !273, line: 192, baseType: !403, size: 32, offset: 7840)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !679, file: !273, line: 194, baseType: !403, size: 32, offset: 7872)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !679, file: !273, line: 202, baseType: !492, size: 32, offset: 7904)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !679, file: !273, line: 202, baseType: !492, size: 32, offset: 7936)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !679, file: !273, line: 202, baseType: !492, size: 32, offset: 7968)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !679, file: !273, line: 211, baseType: !492, size: 32, offset: 8000)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !679, file: !273, line: 212, baseType: !492, size: 32, offset: 8032)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !679, file: !273, line: 213, baseType: !492, size: 32, offset: 8064)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !679, file: !273, line: 214, baseType: !492, size: 32, offset: 8096)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !679, file: !273, line: 215, baseType: !492, size: 32, offset: 8128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !679, file: !273, line: 216, baseType: !492, size: 32, offset: 8160)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !679, file: !273, line: 219, baseType: !492, size: 32, offset: 8192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !679, file: !273, line: 220, baseType: !492, size: 32, offset: 8224)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !679, file: !273, line: 221, baseType: !492, size: 32, offset: 8256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !679, file: !273, line: 224, baseType: !1110, size: 16, offset: 8288)
!1110 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !679, file: !273, line: 224, baseType: !1110, size: 16, offset: 8304)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !679, file: !273, line: 226, baseType: !446, size: 16, offset: 8320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !679, file: !273, line: 228, baseType: !433, size: 8, offset: 8336)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !679, file: !273, line: 229, baseType: !433, size: 8, offset: 8344)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !679, file: !273, line: 231, baseType: !446, size: 16, offset: 8352)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !679, file: !273, line: 232, baseType: !433, size: 8, offset: 8368)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !679, file: !273, line: 233, baseType: !433, size: 8, offset: 8376)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !679, file: !273, line: 234, baseType: !492, size: 32, offset: 8384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !679, file: !273, line: 235, baseType: !492, size: 32, offset: 8416)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !679, file: !273, line: 237, baseType: !472, size: 128, offset: 8448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !679, file: !273, line: 238, baseType: !472, size: 128, offset: 8576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !679, file: !273, line: 239, baseType: !472, size: 128, offset: 8704)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !679, file: !273, line: 240, baseType: !472, size: 128, offset: 8832)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !679, file: !273, line: 242, baseType: !492, size: 32, offset: 8960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !679, file: !273, line: 244, baseType: !446, size: 16, offset: 8992)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !679, file: !273, line: 245, baseType: !1110, size: 16, offset: 9008)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !679, file: !273, line: 246, baseType: !625, size: 128, offset: 9024)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !679, file: !273, line: 248, baseType: !403, size: 32, offset: 9152)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !679, file: !273, line: 249, baseType: !403, size: 32, offset: 9184)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !679, file: !273, line: 251, baseType: !1131, size: 64, offset: 9216)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !273, line: 251, flags: DIFlagFwdDecl)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !679, file: !273, line: 253, baseType: !433, size: 8, offset: 9280)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !679, file: !273, line: 254, baseType: !433, size: 8, offset: 9288)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !679, file: !273, line: 255, baseType: !446, size: 16, offset: 9296)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !679, file: !273, line: 256, baseType: !544, size: 96, offset: 9312)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !679, file: !273, line: 258, baseType: !472, size: 128, offset: 9408)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !679, file: !273, line: 259, baseType: !472, size: 128, offset: 9536)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !679, file: !273, line: 260, baseType: !472, size: 128, offset: 9664)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !679, file: !273, line: 261, baseType: !472, size: 128, offset: 9792)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !679, file: !273, line: 263, baseType: !1142, size: 64, offset: 9920)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !273, line: 52, flags: DIFlagFwdDecl)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !679, file: !273, line: 264, baseType: !1145, size: 64, offset: 9984)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !273, line: 53, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !679, file: !273, line: 265, baseType: !1148, size: 64, offset: 10048)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !485, line: 46, flags: DIFlagFwdDecl)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !679, file: !273, line: 267, baseType: !433, size: 8, offset: 10112)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !679, file: !273, line: 268, baseType: !433, size: 8, offset: 10120)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !679, file: !273, line: 269, baseType: !446, size: 16, offset: 10128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !679, file: !273, line: 270, baseType: !492, size: 32, offset: 10144)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !679, file: !273, line: 272, baseType: !1155, size: 64, offset: 10176)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !273, line: 54, flags: DIFlagFwdDecl)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !679, file: !273, line: 275, baseType: !1158, size: 64, offset: 10240)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !273, line: 275, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !679, file: !273, line: 277, baseType: !1161, size: 64, offset: 10304)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !45, line: 178, size: 13504, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1181, !1219, !1221, !1222, !1224, !1225, !1226, !1227, !1233, !1238, !1239, !1243, !1244, !1245, !1246, !1247, !1251, !1263, !1277, !1281, !1285, !1289, !1293, !1297, !1301, !1305, !1309, !1313, !1317, !1318, !1319, !1320, !1321, !1322, !1326, !1327, !1328, !1329, !1333, !1334, !1335, !1336, !1337, !1342, !1343, !1344, !1345, !1346, !1350, !1351, !1352, !1353, !1354, !1361, !1372, !1376, !1382, !1392, !1397, !1408, !1415, !1422, !1426, !1430, !1434, !1438, !1439, !1440, !1444, !1448, !1449, !1450, !1454, !1455, !1464, !1572, !1576, !1580, !1584, !1588, !1592, !1600, !1610}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !1162, file: !45, line: 180, baseType: !879, size: 1600)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !1162, file: !45, line: 180, baseType: !879, size: 1600, offset: 1600)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !1162, file: !45, line: 180, baseType: !879, size: 1600, offset: 3200)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !1162, file: !45, line: 180, baseType: !879, size: 1600, offset: 4800)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !1162, file: !45, line: 180, baseType: !879, size: 1600, offset: 6400)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !1162, file: !45, line: 181, baseType: !403, size: 32, offset: 8000)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !1162, file: !45, line: 181, baseType: !403, size: 32, offset: 8032)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !1162, file: !45, line: 181, baseType: !403, size: 32, offset: 8064)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !1162, file: !45, line: 181, baseType: !403, size: 32, offset: 8096)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !1162, file: !45, line: 181, baseType: !403, size: 32, offset: 8128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !1162, file: !45, line: 182, baseType: !403, size: 32, offset: 8160)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !1162, file: !45, line: 183, baseType: !403, size: 32, offset: 8192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !1162, file: !45, line: 184, baseType: !1177, size: 64, offset: 8256)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !1178, line: 124, baseType: !1179)
!1178 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !1178, line: 124, flags: DIFlagFwdDecl)
