; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_controller_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_controller_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "controller_type_items", scope: !2, file: !1925, line: 43, type: !1919, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !1606, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_controller_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !{!57, !1527, !48, !1590, !1595, !215, !1533, !134, !1563, !1547, !1603, !444, !1605}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !60, line: 157, size: 1344, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !64, !65, !66, !70, !71, !72, !73, !74, !75, !77, !79, !453, !454, !458, !459, !1511, !1512, !1517, !1522, !1523, !1525, !1526}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !60, line: 158, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !60, line: 158, baseType: !63, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !59, file: !60, line: 161, baseType: !48, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !59, file: !60, line: 164, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !60, line: 166, baseType: !48, size: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !60, line: 169, baseType: !67, size: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !59, file: !60, line: 171, baseType: !67, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !59, file: !60, line: 173, baseType: !48, size: 32, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !59, file: !60, line: 175, baseType: !67, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !60, line: 178, baseType: !76, size: 32, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !59, file: !60, line: 180, baseType: !78, size: 32, offset: 608)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !59, file: !60, line: 182, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !60, line: 73, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!48, !84, !399}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !86)
!86 = !{!87, !92, !452}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !85, file: !6, line: 58, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !85, file: !6, line: 56, size: 64, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !6, line: 57, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !6, line: 60, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !60, line: 339, size: 1600, elements: !95)
!95 = !{!96, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !129, !135, !434, !439, !445, !451}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !94, file: !60, line: 341, baseType: !97, size: 320)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !60, line: 135, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !60, line: 130, size: 320, elements: !99)
!99 = !{!100, !101, !102, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !60, line: 131, baseType: !91, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !98, file: !60, line: 131, baseType: !91, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !98, file: !60, line: 133, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !60, line: 46, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !98, file: !60, line: 134, baseType: !106, size: 128, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !107, line: 71, baseType: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !107, line: 69, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !108, file: !107, line: 70, baseType: !91, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !108, file: !107, line: 70, baseType: !91, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !94, file: !60, line: 344, baseType: !67, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !94, file: !60, line: 348, baseType: !91, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !94, file: !60, line: 349, baseType: !91, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !60, line: 352, baseType: !48, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !60, line: 355, baseType: !67, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !94, file: !60, line: 357, baseType: !67, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !94, file: !60, line: 359, baseType: !67, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !94, file: !60, line: 361, baseType: !48, size: 32, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !94, file: !60, line: 364, baseType: !57, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !94, file: !60, line: 367, baseType: !57, size: 64, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !94, file: !60, line: 370, baseType: !93, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !94, file: !60, line: 376, baseType: !93, size: 64, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !94, file: !60, line: 379, baseType: !125, size: 64, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !60, line: 70, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!93, !84}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !94, file: !60, line: 382, baseType: !130, size: 64, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !60, line: 71, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !84}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !94, file: !60, line: 385, baseType: !136, size: 64, offset: 1216)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!93, !140, !269, !91, !67, !395, !400, !430}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !142, line: 53, size: 15232, elements: !143)
!142 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = !{!144, !145, !146, !150, !152, !153, !154, !155, !161, !165, !166, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !263, !266}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !142, line: 54, baseType: !140, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !142, line: 54, baseType: !140, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !142, line: 55, baseType: !147, size: 8192, offset: 128)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8192, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !141, file: !142, line: 56, baseType: !151, size: 16, offset: 8320)
!151 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !141, file: !142, line: 56, baseType: !151, size: 16, offset: 8336)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !141, file: !142, line: 57, baseType: !151, size: 16, offset: 8352)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !141, file: !142, line: 57, baseType: !151, size: 16, offset: 8368)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !141, file: !142, line: 58, baseType: !156, size: 64, offset: 8384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !157, line: 27, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !159, line: 45, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!160 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !141, file: !142, line: 59, baseType: !162, size: 128, offset: 8448)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !141, file: !142, line: 60, baseType: !151, size: 16, offset: 8576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !141, file: !142, line: 62, baseType: !167, size: 64, offset: 8640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !169, line: 136, size: 17600, elements: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !{!171, !214, !216, !219, !220, !221, !222}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !169, line: 137, baseType: !172, size: 960)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !169, line: 130, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !169, line: 117, size: 960, elements: !174)
!174 = !{!175, !176, !177, !179, !180, !184, !185, !186, !187, !188}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !169, line: 118, baseType: !91, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !173, file: !169, line: 118, baseType: !91, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !173, file: !169, line: 119, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !173, file: !169, line: 120, baseType: !167, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !169, line: 121, baseType: !181, size: 528, offset: 256)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 528, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 66)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !169, line: 126, baseType: !151, size: 16, offset: 784)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !173, file: !169, line: 127, baseType: !48, size: 32, offset: 800)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !173, file: !169, line: 128, baseType: !48, size: 32, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !173, file: !169, line: 128, baseType: !48, size: 32, offset: 864)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !173, file: !169, line: 129, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !169, line: 75, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !169, line: 62, size: 1024, elements: !192)
!192 = !{!193, !195, !196, !197, !198, !199, !203, !204, !212, !213}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !169, line: 63, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !169, line: 63, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !169, line: 64, baseType: !69, size: 8, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !191, file: !169, line: 64, baseType: !69, size: 8, offset: 136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !169, line: 65, baseType: !151, size: 16, offset: 144)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !169, line: 66, baseType: !200, size: 512, offset: 160)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !191, file: !169, line: 67, baseType: !48, size: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !169, line: 69, baseType: !205, size: 256, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !169, line: 60, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !169, line: 48, size: 256, elements: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !206, file: !169, line: 49, baseType: !91, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !206, file: !169, line: 58, baseType: !106, size: 128, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !206, file: !169, line: 59, baseType: !48, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !206, file: !169, line: 59, baseType: !48, size: 32, offset: 224)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, file: !169, line: 70, baseType: !48, size: 32, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !191, file: !169, line: 74, baseType: !48, size: 32, offset: 992)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !168, file: !169, line: 138, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !168, file: !169, line: 139, baseType: !217, size: 64, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !169, line: 43, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !169, line: 140, baseType: !147, size: 8192, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !168, file: !169, line: 141, baseType: !147, size: 8192, offset: 9280)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !168, file: !169, line: 148, baseType: !167, size: 64, offset: 17472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !168, file: !169, line: 150, baseType: !223, size: 64, offset: 17536)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !169, line: 45, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !141, file: !142, line: 63, baseType: !106, size: 128, offset: 8704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !141, file: !142, line: 64, baseType: !106, size: 128, offset: 8832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !141, file: !142, line: 65, baseType: !106, size: 128, offset: 8960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !141, file: !142, line: 66, baseType: !106, size: 128, offset: 9088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !141, file: !142, line: 67, baseType: !106, size: 128, offset: 9216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !141, file: !142, line: 68, baseType: !106, size: 128, offset: 9344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !141, file: !142, line: 69, baseType: !106, size: 128, offset: 9472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !141, file: !142, line: 70, baseType: !106, size: 128, offset: 9600)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !141, file: !142, line: 71, baseType: !106, size: 128, offset: 9728)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !141, file: !142, line: 72, baseType: !106, size: 128, offset: 9856)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !141, file: !142, line: 73, baseType: !106, size: 128, offset: 9984)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !141, file: !142, line: 74, baseType: !106, size: 128, offset: 10112)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !141, file: !142, line: 75, baseType: !106, size: 128, offset: 10240)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !141, file: !142, line: 76, baseType: !106, size: 128, offset: 10368)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !141, file: !142, line: 77, baseType: !106, size: 128, offset: 10496)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !141, file: !142, line: 78, baseType: !106, size: 128, offset: 10624)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !141, file: !142, line: 79, baseType: !106, size: 128, offset: 10752)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !141, file: !142, line: 80, baseType: !106, size: 128, offset: 10880)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !141, file: !142, line: 81, baseType: !106, size: 128, offset: 11008)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !141, file: !142, line: 82, baseType: !106, size: 128, offset: 11136)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !141, file: !142, line: 83, baseType: !106, size: 128, offset: 11264)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !141, file: !142, line: 84, baseType: !106, size: 128, offset: 11392)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !141, file: !142, line: 85, baseType: !106, size: 128, offset: 11520)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !141, file: !142, line: 86, baseType: !106, size: 128, offset: 11648)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !141, file: !142, line: 87, baseType: !106, size: 128, offset: 11776)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !141, file: !142, line: 88, baseType: !106, size: 128, offset: 11904)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !141, file: !142, line: 89, baseType: !106, size: 128, offset: 12032)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !141, file: !142, line: 90, baseType: !106, size: 128, offset: 12160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !141, file: !142, line: 91, baseType: !106, size: 128, offset: 12288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !141, file: !142, line: 92, baseType: !106, size: 128, offset: 12416)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !141, file: !142, line: 93, baseType: !106, size: 128, offset: 12544)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !141, file: !142, line: 94, baseType: !106, size: 128, offset: 12672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !141, file: !142, line: 95, baseType: !106, size: 128, offset: 12800)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !141, file: !142, line: 96, baseType: !106, size: 128, offset: 12928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !141, file: !142, line: 98, baseType: !260, size: 2048, offset: 13056)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2048, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !141, file: !142, line: 101, baseType: !264, size: 64, offset: 15104)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !142, line: 49, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !141, file: !142, line: 103, baseType: !267, size: 64, offset: 15168)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !142, line: 51, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !271, line: 106, size: 320, elements: !272)
!271 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!272 = !{!273, !274, !275, !276, !277, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !270, file: !271, line: 107, baseType: !106, size: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !270, file: !271, line: 108, baseType: !48, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !270, file: !271, line: 109, baseType: !48, size: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !271, line: 110, baseType: !48, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !270, file: !271, line: 110, baseType: !48, size: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !270, file: !271, line: 111, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !281, line: 490, size: 768, elements: !282)
!281 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!282 = !{!283, !284, !285, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !281, line: 491, baseType: !279, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !280, file: !281, line: 491, baseType: !279, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !280, file: !281, line: 493, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !271, line: 169, size: 2048, elements: !288)
!288 = !{!289, !290, !291, !292, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !361, !364, !378, !379, !380, !381, !382, !383, !384, !385}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !271, line: 170, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !287, file: !271, line: 170, baseType: !286, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !287, file: !271, line: 172, baseType: !91, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !287, file: !271, line: 174, baseType: !293, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !295, line: 41, flags: DIFlagFwdDecl)
!295 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !287, file: !271, line: 175, baseType: !293, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !287, file: !271, line: 176, baseType: !200, size: 512, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !287, file: !271, line: 178, baseType: !151, size: 16, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !287, file: !271, line: 178, baseType: !151, size: 16, offset: 848)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !287, file: !271, line: 178, baseType: !151, size: 16, offset: 864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !287, file: !271, line: 178, baseType: !151, size: 16, offset: 880)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !287, file: !271, line: 179, baseType: !151, size: 16, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !287, file: !271, line: 180, baseType: !151, size: 16, offset: 912)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !287, file: !271, line: 181, baseType: !151, size: 16, offset: 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !287, file: !271, line: 182, baseType: !151, size: 16, offset: 944)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !287, file: !271, line: 183, baseType: !151, size: 16, offset: 960)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !287, file: !271, line: 184, baseType: !151, size: 16, offset: 976)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !287, file: !271, line: 185, baseType: !151, size: 16, offset: 992)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !287, file: !271, line: 186, baseType: !151, size: 16, offset: 1008)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !287, file: !271, line: 188, baseType: !48, size: 32, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !287, file: !271, line: 190, baseType: !151, size: 16, offset: 1056)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !287, file: !271, line: 191, baseType: !151, size: 16, offset: 1072)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !287, file: !271, line: 194, baseType: !314, size: 64, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !281, line: 421, size: 960, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !327, !331, !332, !333, !334, !335, !336, !337, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !357, !358, !359, !360}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !281, line: 422, baseType: !314, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !315, file: !281, line: 422, baseType: !314, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !281, line: 424, baseType: !151, size: 16, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !315, file: !281, line: 425, baseType: !151, size: 16, offset: 144)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !315, file: !281, line: 426, baseType: !48, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !315, file: !281, line: 426, baseType: !48, size: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !315, file: !281, line: 427, baseType: !324, size: 64, offset: 224)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 2)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !315, file: !281, line: 428, baseType: !328, size: 48, offset: 288)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 48, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 6)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !315, file: !281, line: 431, baseType: !69, size: 8, offset: 336)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !315, file: !281, line: 432, baseType: !69, size: 8, offset: 344)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !315, file: !281, line: 435, baseType: !151, size: 16, offset: 352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !315, file: !281, line: 436, baseType: !151, size: 16, offset: 368)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !315, file: !281, line: 437, baseType: !48, size: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !315, file: !281, line: 437, baseType: !48, size: 32, offset: 416)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !315, file: !281, line: 438, baseType: !338, size: 64, offset: 448)
!338 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !315, file: !281, line: 439, baseType: !48, size: 32, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !315, file: !281, line: 439, baseType: !48, size: 32, offset: 544)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !315, file: !281, line: 442, baseType: !151, size: 16, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !315, file: !281, line: 442, baseType: !151, size: 16, offset: 592)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !315, file: !281, line: 442, baseType: !151, size: 16, offset: 608)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !315, file: !281, line: 442, baseType: !151, size: 16, offset: 624)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !315, file: !281, line: 443, baseType: !151, size: 16, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !315, file: !281, line: 446, baseType: !151, size: 16, offset: 656)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !315, file: !281, line: 449, baseType: !67, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !315, file: !281, line: 452, baseType: !349, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !281, line: 463, size: 128, elements: !351)
!351 = !{!352, !353, !355, !356}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !350, file: !281, line: 464, baseType: !48, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !350, file: !281, line: 465, baseType: !354, size: 32, offset: 32)
!354 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !350, file: !281, line: 466, baseType: !354, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !350, file: !281, line: 467, baseType: !354, size: 32, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !315, file: !281, line: 455, baseType: !151, size: 16, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !315, file: !281, line: 456, baseType: !151, size: 16, offset: 848)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !315, file: !281, line: 457, baseType: !48, size: 32, offset: 864)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !315, file: !281, line: 458, baseType: !91, size: 64, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !287, file: !271, line: 196, baseType: !362, size: 64, offset: 1152)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !271, line: 55, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !287, file: !271, line: 198, baseType: !365, size: 64, offset: 1216)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !281, line: 398, size: 448, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !281, line: 399, baseType: !365, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !366, file: !281, line: 399, baseType: !365, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !366, file: !281, line: 400, baseType: !48, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !366, file: !281, line: 401, baseType: !48, size: 32, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !281, line: 402, baseType: !48, size: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !366, file: !281, line: 403, baseType: !48, size: 32, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !366, file: !281, line: 404, baseType: !48, size: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !281, line: 405, baseType: !48, size: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !366, file: !281, line: 407, baseType: !91, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !366, file: !281, line: 414, baseType: !91, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !287, file: !271, line: 200, baseType: !48, size: 32, offset: 1280)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !287, file: !271, line: 200, baseType: !48, size: 32, offset: 1312)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !287, file: !271, line: 201, baseType: !91, size: 64, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !287, file: !271, line: 203, baseType: !106, size: 128, offset: 1408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !287, file: !271, line: 204, baseType: !106, size: 128, offset: 1536)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !287, file: !271, line: 205, baseType: !106, size: 128, offset: 1664)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !287, file: !271, line: 207, baseType: !106, size: 128, offset: 1792)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !287, file: !271, line: 208, baseType: !106, size: 128, offset: 1920)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !280, file: !281, line: 495, baseType: !338, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !280, file: !281, line: 496, baseType: !48, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !280, file: !281, line: 497, baseType: !91, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !280, file: !281, line: 499, baseType: !338, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !280, file: !281, line: 500, baseType: !338, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !280, file: !281, line: 502, baseType: !338, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !280, file: !281, line: 503, baseType: !338, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !280, file: !281, line: 504, baseType: !338, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !280, file: !281, line: 505, baseType: !48, size: 32, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!48, !84, !91, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!48, !404, !84, !406, !420}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !60, line: 137, size: 640, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !429}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !407, file: !60, line: 139, baseType: !97, size: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !407, file: !60, line: 142, baseType: !67, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !407, file: !60, line: 144, baseType: !48, size: 32, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !407, file: !60, line: 147, baseType: !67, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !407, file: !60, line: 150, baseType: !414, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !404, !269, !418, !420}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !85)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !423)
!423 = !{!424, !425, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !422, file: !6, line: 339, baseType: !91, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !422, file: !6, line: 342, baseType: !406, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !422, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !422, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !422, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !407, file: !60, line: 154, baseType: !57, size: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !91}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !94, file: !60, line: 386, baseType: !435, size: 64, offset: 1280)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !140, !93}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !94, file: !60, line: 387, baseType: !440, size: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !418}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !94, file: !60, line: 390, baseType: !446, size: 64, offset: 1408)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !60, line: 69, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!194, !84, !450}
!450 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !94, file: !60, line: 393, baseType: !106, size: 128, offset: 1472)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !6, line: 61, baseType: !91, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !59, file: !60, line: 184, baseType: !7, size: 32, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !59, file: !60, line: 186, baseType: !455, size: 96, offset: 736)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 3)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !59, file: !60, line: 187, baseType: !7, size: 32, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !59, file: !60, line: 190, baseType: !460, size: 64, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !60, line: 64, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !140, !464, !84}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !466, line: 1216, size: 39680, elements: !467)
!466 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !{!468, !469, !472, !753, !756, !757, !758, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !784, !787, !790, !1085, !1088, !1384, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1406, !1407, !1408, !1409, !1410, !1418, !1485, !1492, !1493, !1500, !1503, !1504, !1505, !1506, !1507, !1508}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !465, file: !466, line: 1217, baseType: !172, size: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !465, file: !466, line: 1218, baseType: !470, size: 64, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !466, line: 58, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !465, file: !466, line: 1220, baseType: !473, size: 64, offset: 1024)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !475, line: 115, size: 11392, elements: !476)
!475 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!476 = !{!477, !478, !479, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !497, !507, !521, !522, !562, !563, !566, !567, !583, !584, !585, !586, !587, !588, !589, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !608, !609, !610, !611, !612, !613, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !673, !674, !675, !676, !677, !678, !679, !680, !681, !684, !687, !691, !692, !693, !694, !695, !698, !701, !704, !705, !706, !707, !708, !709, !710, !711, !713, !716, !719, !721, !741, !742}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !474, file: !475, line: 116, baseType: !172, size: 960)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !474, file: !475, line: 117, baseType: !470, size: 64, offset: 960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !474, file: !475, line: 119, baseType: !480, size: 64, offset: 1024)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !475, line: 57, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !474, file: !475, line: 121, baseType: !151, size: 16, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !474, file: !475, line: 121, baseType: !151, size: 16, offset: 1104)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !474, file: !475, line: 122, baseType: !48, size: 32, offset: 1120)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !474, file: !475, line: 122, baseType: !48, size: 32, offset: 1152)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !474, file: !475, line: 122, baseType: !48, size: 32, offset: 1184)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !474, file: !475, line: 123, baseType: !200, size: 512, offset: 1216)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !474, file: !475, line: 124, baseType: !473, size: 64, offset: 1728)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !474, file: !475, line: 124, baseType: !473, size: 64, offset: 1792)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !474, file: !475, line: 127, baseType: !473, size: 64, offset: 1856)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !474, file: !475, line: 127, baseType: !473, size: 64, offset: 1920)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !474, file: !475, line: 127, baseType: !473, size: 64, offset: 1984)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !474, file: !475, line: 128, baseType: !494, size: 64, offset: 2048)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !496, line: 46, flags: DIFlagFwdDecl)
!496 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !474, file: !475, line: 130, baseType: !498, size: 64, offset: 2112)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !475, line: 97, size: 832, elements: !500)
!500 = !{!501, !505, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !499, file: !475, line: 98, baseType: !502, size: 768)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 768, elements: !503)
!503 = !{!504, !457}
!504 = !DISubrange(count: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !499, file: !475, line: 99, baseType: !48, size: 32, offset: 768)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !499, file: !475, line: 99, baseType: !48, size: 32, offset: 800)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !474, file: !475, line: 131, baseType: !508, size: 64, offset: 2176)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !510, line: 486, size: 1600, elements: !511)
!510 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !509, file: !510, line: 487, baseType: !172, size: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !509, file: !510, line: 489, baseType: !106, size: 128, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !509, file: !510, line: 490, baseType: !106, size: 128, offset: 1088)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !509, file: !510, line: 491, baseType: !106, size: 128, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !509, file: !510, line: 492, baseType: !106, size: 128, offset: 1344)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !510, line: 494, baseType: !48, size: 32, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !509, file: !510, line: 495, baseType: !48, size: 32, offset: 1504)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !509, file: !510, line: 497, baseType: !48, size: 32, offset: 1536)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !509, file: !510, line: 498, baseType: !48, size: 32, offset: 1568)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !474, file: !475, line: 132, baseType: !508, size: 64, offset: 2240)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !474, file: !475, line: 133, baseType: !523, size: 64, offset: 2304)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !510, line: 334, size: 1728, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !535, !536, !537, !538, !539, !540, !541, !561}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !524, file: !510, line: 335, baseType: !106, size: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !524, file: !510, line: 336, baseType: !103, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !510, line: 338, baseType: !151, size: 16, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !524, file: !510, line: 338, baseType: !151, size: 16, offset: 208)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !524, file: !510, line: 339, baseType: !7, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !524, file: !510, line: 340, baseType: !48, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !524, file: !510, line: 342, baseType: !354, size: 32, offset: 288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !524, file: !510, line: 343, baseType: !534, size: 96, offset: 320)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 96, elements: !456)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !524, file: !510, line: 344, baseType: !534, size: 96, offset: 416)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !524, file: !510, line: 347, baseType: !106, size: 128, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !524, file: !510, line: 349, baseType: !48, size: 32, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !524, file: !510, line: 350, baseType: !48, size: 32, offset: 672)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !524, file: !510, line: 351, baseType: !91, size: 64, offset: 704)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !524, file: !510, line: 352, baseType: !91, size: 64, offset: 768)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !524, file: !510, line: 354, baseType: !542, size: 384, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !510, line: 116, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !510, line: 94, size: 384, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !543, file: !510, line: 96, baseType: !48, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !543, file: !510, line: 96, baseType: !48, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !543, file: !510, line: 97, baseType: !48, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !543, file: !510, line: 97, baseType: !48, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !543, file: !510, line: 99, baseType: !151, size: 16, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !543, file: !510, line: 100, baseType: !151, size: 16, offset: 144)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !543, file: !510, line: 102, baseType: !151, size: 16, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !543, file: !510, line: 105, baseType: !151, size: 16, offset: 176)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !543, file: !510, line: 108, baseType: !151, size: 16, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !543, file: !510, line: 109, baseType: !151, size: 16, offset: 208)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !543, file: !510, line: 111, baseType: !151, size: 16, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !543, file: !510, line: 112, baseType: !151, size: 16, offset: 240)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !543, file: !510, line: 114, baseType: !48, size: 32, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !543, file: !510, line: 114, baseType: !48, size: 32, offset: 288)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !543, file: !510, line: 115, baseType: !48, size: 32, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !543, file: !510, line: 115, baseType: !48, size: 32, offset: 352)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !524, file: !510, line: 355, baseType: !200, size: 512, offset: 1216)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !475, line: 134, baseType: !91, size: 64, offset: 2368)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !474, file: !475, line: 136, baseType: !564, size: 64, offset: 2432)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !466, line: 61, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !474, file: !475, line: 138, baseType: !542, size: 384, offset: 2496)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !474, file: !475, line: 139, baseType: !568, size: 64, offset: 2880)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !510, line: 80, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !510, line: 72, size: 192, elements: !571)
!571 = !{!572, !579, !580, !581, !582}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !570, file: !510, line: 73, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !510, line: 59, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !510, line: 56, size: 128, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !575, file: !510, line: 57, baseType: !534, size: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !575, file: !510, line: 58, baseType: !48, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !570, file: !510, line: 74, baseType: !48, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !570, file: !510, line: 76, baseType: !48, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !570, file: !510, line: 77, baseType: !48, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !570, file: !510, line: 79, baseType: !48, size: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !474, file: !475, line: 141, baseType: !106, size: 128, offset: 2944)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !474, file: !475, line: 142, baseType: !106, size: 128, offset: 3072)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !474, file: !475, line: 143, baseType: !106, size: 128, offset: 3200)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !474, file: !475, line: 144, baseType: !106, size: 128, offset: 3328)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !474, file: !475, line: 146, baseType: !48, size: 32, offset: 3456)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !474, file: !475, line: 147, baseType: !48, size: 32, offset: 3488)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !474, file: !475, line: 150, baseType: !590, size: 64, offset: 3520)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !466, line: 179, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !474, file: !475, line: 151, baseType: !134, size: 64, offset: 3584)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !474, file: !475, line: 152, baseType: !48, size: 32, offset: 3648)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !474, file: !475, line: 153, baseType: !48, size: 32, offset: 3680)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !474, file: !475, line: 156, baseType: !534, size: 96, offset: 3712)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !474, file: !475, line: 156, baseType: !534, size: 96, offset: 3808)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !474, file: !475, line: 156, baseType: !534, size: 96, offset: 3904)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !474, file: !475, line: 157, baseType: !534, size: 96, offset: 4000)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !474, file: !475, line: 158, baseType: !534, size: 96, offset: 4096)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !474, file: !475, line: 159, baseType: !534, size: 96, offset: 4192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !474, file: !475, line: 160, baseType: !534, size: 96, offset: 4288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !474, file: !475, line: 160, baseType: !534, size: 96, offset: 4384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !474, file: !475, line: 161, baseType: !605, size: 128, offset: 4480)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 128, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 4)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !474, file: !475, line: 161, baseType: !605, size: 128, offset: 4608)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !474, file: !475, line: 162, baseType: !534, size: 96, offset: 4736)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !474, file: !475, line: 162, baseType: !534, size: 96, offset: 4832)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !474, file: !475, line: 163, baseType: !354, size: 32, offset: 4928)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !474, file: !475, line: 163, baseType: !354, size: 32, offset: 4960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !474, file: !475, line: 164, baseType: !614, size: 512, offset: 4992)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 512, elements: !615)
!615 = !{!607, !607}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !474, file: !475, line: 165, baseType: !614, size: 512, offset: 5504)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !474, file: !475, line: 166, baseType: !614, size: 512, offset: 6016)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !474, file: !475, line: 167, baseType: !614, size: 512, offset: 6528)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !474, file: !475, line: 176, baseType: !614, size: 512, offset: 7040)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !474, file: !475, line: 178, baseType: !7, size: 32, offset: 7552)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !475, line: 180, baseType: !151, size: 16, offset: 7584)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !474, file: !475, line: 181, baseType: !151, size: 16, offset: 7600)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !474, file: !475, line: 183, baseType: !151, size: 16, offset: 7616)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !474, file: !475, line: 183, baseType: !151, size: 16, offset: 7632)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !474, file: !475, line: 184, baseType: !151, size: 16, offset: 7648)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !474, file: !475, line: 184, baseType: !151, size: 16, offset: 7664)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !474, file: !475, line: 185, baseType: !151, size: 16, offset: 7680)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !474, file: !475, line: 186, baseType: !151, size: 16, offset: 7696)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !474, file: !475, line: 187, baseType: !151, size: 16, offset: 7712)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !474, file: !475, line: 188, baseType: !69, size: 8, offset: 7728)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !474, file: !475, line: 189, baseType: !69, size: 8, offset: 7736)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !474, file: !475, line: 192, baseType: !48, size: 32, offset: 7744)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !474, file: !475, line: 192, baseType: !48, size: 32, offset: 7776)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !474, file: !475, line: 192, baseType: !48, size: 32, offset: 7808)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !474, file: !475, line: 192, baseType: !48, size: 32, offset: 7840)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !474, file: !475, line: 194, baseType: !48, size: 32, offset: 7872)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !474, file: !475, line: 202, baseType: !354, size: 32, offset: 7904)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !474, file: !475, line: 202, baseType: !354, size: 32, offset: 7936)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !474, file: !475, line: 202, baseType: !354, size: 32, offset: 7968)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !474, file: !475, line: 211, baseType: !354, size: 32, offset: 8000)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !474, file: !475, line: 212, baseType: !354, size: 32, offset: 8032)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !474, file: !475, line: 213, baseType: !354, size: 32, offset: 8064)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !474, file: !475, line: 214, baseType: !354, size: 32, offset: 8096)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !474, file: !475, line: 215, baseType: !354, size: 32, offset: 8128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !474, file: !475, line: 216, baseType: !354, size: 32, offset: 8160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !474, file: !475, line: 219, baseType: !354, size: 32, offset: 8192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !474, file: !475, line: 220, baseType: !354, size: 32, offset: 8224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !474, file: !475, line: 221, baseType: !354, size: 32, offset: 8256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !474, file: !475, line: 224, baseType: !650, size: 16, offset: 8288)
!650 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !474, file: !475, line: 224, baseType: !650, size: 16, offset: 8304)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !474, file: !475, line: 226, baseType: !151, size: 16, offset: 8320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !474, file: !475, line: 228, baseType: !69, size: 8, offset: 8336)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !474, file: !475, line: 229, baseType: !69, size: 8, offset: 8344)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !474, file: !475, line: 231, baseType: !151, size: 16, offset: 8352)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !474, file: !475, line: 232, baseType: !69, size: 8, offset: 8368)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !474, file: !475, line: 233, baseType: !69, size: 8, offset: 8376)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !474, file: !475, line: 234, baseType: !354, size: 32, offset: 8384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !474, file: !475, line: 235, baseType: !354, size: 32, offset: 8416)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !474, file: !475, line: 237, baseType: !106, size: 128, offset: 8448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !474, file: !475, line: 238, baseType: !106, size: 128, offset: 8576)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !474, file: !475, line: 239, baseType: !106, size: 128, offset: 8704)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !474, file: !475, line: 240, baseType: !106, size: 128, offset: 8832)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !474, file: !475, line: 242, baseType: !354, size: 32, offset: 8960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !474, file: !475, line: 244, baseType: !151, size: 16, offset: 8992)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !474, file: !475, line: 245, baseType: !650, size: 16, offset: 9008)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !474, file: !475, line: 246, baseType: !605, size: 128, offset: 9024)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !474, file: !475, line: 248, baseType: !48, size: 32, offset: 9152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !474, file: !475, line: 249, baseType: !48, size: 32, offset: 9184)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !474, file: !475, line: 251, baseType: !671, size: 64, offset: 9216)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !475, line: 251, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !474, file: !475, line: 253, baseType: !69, size: 8, offset: 9280)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !474, file: !475, line: 254, baseType: !69, size: 8, offset: 9288)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !474, file: !475, line: 255, baseType: !151, size: 16, offset: 9296)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !474, file: !475, line: 256, baseType: !534, size: 96, offset: 9312)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !474, file: !475, line: 258, baseType: !106, size: 128, offset: 9408)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !474, file: !475, line: 259, baseType: !106, size: 128, offset: 9536)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !474, file: !475, line: 260, baseType: !106, size: 128, offset: 9664)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !474, file: !475, line: 261, baseType: !106, size: 128, offset: 9792)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !474, file: !475, line: 263, baseType: !682, size: 64, offset: 9920)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !475, line: 52, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !474, file: !475, line: 264, baseType: !685, size: 64, offset: 9984)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !475, line: 53, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !474, file: !475, line: 265, baseType: !688, size: 64, offset: 10048)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !690, line: 43, flags: DIFlagFwdDecl)
!690 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!691 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !474, file: !475, line: 267, baseType: !69, size: 8, offset: 10112)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !474, file: !475, line: 268, baseType: !69, size: 8, offset: 10120)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !474, file: !475, line: 269, baseType: !151, size: 16, offset: 10128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !474, file: !475, line: 270, baseType: !354, size: 32, offset: 10144)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !474, file: !475, line: 272, baseType: !696, size: 64, offset: 10176)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !475, line: 54, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !474, file: !475, line: 275, baseType: !699, size: 64, offset: 10240)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !475, line: 275, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !474, file: !475, line: 277, baseType: !702, size: 64, offset: 10304)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !475, line: 56, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !474, file: !475, line: 277, baseType: !702, size: 64, offset: 10368)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !474, file: !475, line: 278, baseType: !156, size: 64, offset: 10432)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !474, file: !475, line: 279, baseType: !156, size: 64, offset: 10496)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !474, file: !475, line: 280, baseType: !7, size: 32, offset: 10560)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !474, file: !475, line: 281, baseType: !7, size: 32, offset: 10592)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !474, file: !475, line: 283, baseType: !106, size: 128, offset: 10624)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !474, file: !475, line: 284, baseType: !106, size: 128, offset: 10752)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !474, file: !475, line: 285, baseType: !712, size: 64, offset: 10880)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !474, file: !475, line: 287, baseType: !714, size: 64, offset: 10944)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !475, line: 59, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !474, file: !475, line: 288, baseType: !717, size: 64, offset: 11008)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !475, line: 288, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !474, file: !475, line: 290, baseType: !720, size: 64, offset: 11072)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, elements: !325)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !474, file: !475, line: 291, baseType: !722, size: 64, offset: 11136)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !724, line: 65, baseType: !725)
!724 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !724, line: 50, size: 320, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !725, file: !724, line: 51, baseType: !464, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !725, file: !724, line: 53, baseType: !48, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !725, file: !724, line: 54, baseType: !48, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !725, file: !724, line: 55, baseType: !48, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !725, file: !724, line: 55, baseType: !48, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !725, file: !724, line: 56, baseType: !69, size: 8, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !725, file: !724, line: 56, baseType: !69, size: 8, offset: 200)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !725, file: !724, line: 57, baseType: !69, size: 8, offset: 208)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !725, file: !724, line: 57, baseType: !69, size: 8, offset: 216)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !725, file: !724, line: 59, baseType: !151, size: 16, offset: 224)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !725, file: !724, line: 59, baseType: !151, size: 16, offset: 240)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !725, file: !724, line: 59, baseType: !151, size: 16, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !725, file: !724, line: 61, baseType: !151, size: 16, offset: 272)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !725, file: !724, line: 63, baseType: !48, size: 32, offset: 288)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !474, file: !475, line: 293, baseType: !106, size: 128, offset: 11200)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !474, file: !475, line: 294, baseType: !743, size: 64, offset: 11328)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !475, line: 113, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !475, line: 108, size: 256, elements: !746)
!746 = !{!747, !749, !750, !751, !752}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !475, line: 109, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !745, file: !475, line: 109, baseType: !748, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !745, file: !475, line: 110, baseType: !473, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !745, file: !475, line: 111, baseType: !48, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !745, file: !475, line: 112, baseType: !354, size: 32, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !465, file: !466, line: 1221, baseType: !754, size: 64, offset: 1088)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !466, line: 52, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !465, file: !466, line: 1223, baseType: !464, size: 64, offset: 1152)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !465, file: !466, line: 1225, baseType: !106, size: 128, offset: 1216)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !465, file: !466, line: 1226, baseType: !759, size: 64, offset: 1344)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !466, line: 69, size: 320, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !466, line: 70, baseType: !759, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !760, file: !466, line: 70, baseType: !759, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !760, file: !466, line: 71, baseType: !7, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !760, file: !466, line: 71, baseType: !7, size: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !760, file: !466, line: 72, baseType: !48, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !760, file: !466, line: 73, baseType: !151, size: 16, offset: 224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !760, file: !466, line: 73, baseType: !151, size: 16, offset: 240)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !760, file: !466, line: 74, baseType: !473, size: 64, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !465, file: !466, line: 1227, baseType: !473, size: 64, offset: 1408)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !465, file: !466, line: 1229, baseType: !534, size: 96, offset: 1472)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !465, file: !466, line: 1230, baseType: !534, size: 96, offset: 1568)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !465, file: !466, line: 1231, baseType: !534, size: 96, offset: 1664)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !465, file: !466, line: 1231, baseType: !534, size: 96, offset: 1760)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !465, file: !466, line: 1233, baseType: !7, size: 32, offset: 1856)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !465, file: !466, line: 1234, baseType: !48, size: 32, offset: 1888)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !465, file: !466, line: 1235, baseType: !7, size: 32, offset: 1920)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !466, line: 1237, baseType: !151, size: 16, offset: 1952)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !465, file: !466, line: 1239, baseType: !69, size: 8, offset: 1968)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !466, line: 1240, baseType: !781, size: 8, offset: 1976)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 1)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !465, file: !466, line: 1242, baseType: !785, size: 64, offset: 1984)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !466, line: 57, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !465, file: !466, line: 1244, baseType: !788, size: 64, offset: 2048)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !466, line: 59, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !465, file: !466, line: 1246, baseType: !791, size: 64, offset: 2112)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !466, line: 1067, size: 5184, elements: !793)
!793 = !{!794, !824, !825, !840, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !862, !957, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1068}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !792, file: !466, line: 1068, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !466, line: 934, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !466, line: 925, size: 576, elements: !798)
!798 = !{!799, !815, !816, !817, !818, !820, !823}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !797, file: !466, line: 926, baseType: !800, size: 320)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !466, line: 830, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !466, line: 813, size: 320, elements: !802)
!802 = !{!803, !806, !809, !810, !812, !813, !814}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !801, file: !466, line: 814, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !466, line: 51, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !801, file: !466, line: 815, baseType: !807, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !466, line: 815, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !801, file: !466, line: 818, baseType: !91, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !801, file: !466, line: 819, baseType: !811, size: 32, offset: 192)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 32, elements: !606)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !801, file: !466, line: 822, baseType: !48, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !801, file: !466, line: 826, baseType: !48, size: 32, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !801, file: !466, line: 829, baseType: !48, size: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !797, file: !466, line: 928, baseType: !151, size: 16, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !797, file: !466, line: 928, baseType: !151, size: 16, offset: 336)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !797, file: !466, line: 929, baseType: !48, size: 32, offset: 352)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !797, file: !466, line: 930, baseType: !819, size: 64, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !797, file: !466, line: 931, baseType: !821, size: 64, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !466, line: 931, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !797, file: !466, line: 933, baseType: !91, size: 64, offset: 512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !792, file: !466, line: 1069, baseType: !795, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !792, file: !466, line: 1070, baseType: !826, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !466, line: 916, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !466, line: 891, size: 704, elements: !829)
!829 = !{!830, !831, !832, !834, !835, !836, !837, !838, !839}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !828, file: !466, line: 892, baseType: !800, size: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !828, file: !466, line: 896, baseType: !48, size: 32, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !828, file: !466, line: 900, baseType: !833, size: 96, offset: 352)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !456)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !828, file: !466, line: 903, baseType: !354, size: 32, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !828, file: !466, line: 906, baseType: !48, size: 32, offset: 480)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !828, file: !466, line: 909, baseType: !354, size: 32, offset: 512)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !828, file: !466, line: 912, baseType: !354, size: 32, offset: 544)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !828, file: !466, line: 914, baseType: !473, size: 64, offset: 576)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !828, file: !466, line: 915, baseType: !91, size: 64, offset: 640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !792, file: !466, line: 1071, baseType: !841, size: 64, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !466, line: 920, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !466, line: 918, size: 320, elements: !844)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !843, file: !466, line: 919, baseType: !800, size: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !792, file: !466, line: 1075, baseType: !354, size: 32, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !792, file: !466, line: 1077, baseType: !354, size: 32, offset: 288)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !792, file: !466, line: 1078, baseType: !354, size: 32, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !792, file: !466, line: 1079, baseType: !151, size: 16, offset: 352)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !792, file: !466, line: 1082, baseType: !151, size: 16, offset: 368)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !792, file: !466, line: 1085, baseType: !69, size: 8, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !792, file: !466, line: 1086, baseType: !69, size: 8, offset: 392)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !792, file: !466, line: 1087, baseType: !69, size: 8, offset: 400)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !792, file: !466, line: 1088, baseType: !69, size: 8, offset: 408)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !792, file: !466, line: 1090, baseType: !354, size: 32, offset: 416)
