; ModuleID = 'blender/source/blender/editors/metaball/mball_ops.c'
source_filename = "blender/source/blender/editors/metaball/mball_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!155 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CW", value: 415, isUnsigned: true)
!156 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CCW", value: 416, isUnsigned: true)
!157 = !DIEnumerator(name: "NDOF_BUTTON_ROTATE", value: 417, isUnsigned: true)
!158 = !DIEnumerator(name: "NDOF_BUTTON_PANZOOM", value: 418, isUnsigned: true)
!159 = !DIEnumerator(name: "NDOF_BUTTON_DOMINANT", value: 419, isUnsigned: true)
!160 = !DIEnumerator(name: "NDOF_BUTTON_PLUS", value: 420, isUnsigned: true)
!161 = !DIEnumerator(name: "NDOF_BUTTON_MINUS", value: 421, isUnsigned: true)
!162 = !DIEnumerator(name: "NDOF_BUTTON_ESC", value: 422, isUnsigned: true)
!163 = !DIEnumerator(name: "NDOF_BUTTON_ALT", value: 423, isUnsigned: true)
!164 = !DIEnumerator(name: "NDOF_BUTTON_SHIFT", value: 424, isUnsigned: true)
!165 = !DIEnumerator(name: "NDOF_BUTTON_CTRL", value: 425, isUnsigned: true)
!166 = !DIEnumerator(name: "NDOF_BUTTON_1", value: 426, isUnsigned: true)
!167 = !DIEnumerator(name: "NDOF_BUTTON_2", value: 427, isUnsigned: true)
!168 = !DIEnumerator(name: "NDOF_BUTTON_3", value: 428, isUnsigned: true)
!169 = !DIEnumerator(name: "NDOF_BUTTON_4", value: 429, isUnsigned: true)
!170 = !DIEnumerator(name: "NDOF_BUTTON_5", value: 430, isUnsigned: true)
!171 = !DIEnumerator(name: "NDOF_BUTTON_6", value: 431, isUnsigned: true)
!172 = !DIEnumerator(name: "NDOF_BUTTON_7", value: 432, isUnsigned: true)
!173 = !DIEnumerator(name: "NDOF_BUTTON_8", value: 433, isUnsigned: true)
!174 = !DIEnumerator(name: "NDOF_BUTTON_9", value: 434, isUnsigned: true)
!175 = !DIEnumerator(name: "NDOF_BUTTON_10", value: 435, isUnsigned: true)
!176 = !DIEnumerator(name: "NDOF_BUTTON_A", value: 436, isUnsigned: true)
!177 = !DIEnumerator(name: "NDOF_BUTTON_B", value: 437, isUnsigned: true)
!178 = !DIEnumerator(name: "NDOF_BUTTON_C", value: 438, isUnsigned: true)
!179 = !DIEnumerator(name: "NDOF_LAST", value: 439, isUnsigned: true)
!180 = !DIEnumerator(name: "INPUTCHANGE", value: 259, isUnsigned: true)
!181 = !DIEnumerator(name: "WINDEACTIVATE", value: 260, isUnsigned: true)
!182 = !DIEnumerator(name: "TIMER", value: 272, isUnsigned: true)
!183 = !DIEnumerator(name: "TIMER0", value: 273, isUnsigned: true)
!184 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!185 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!186 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!187 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!188 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!189 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!190 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!191 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!192 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!193 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!194 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!195 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!196 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!197 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!198 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!199 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!200 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!201 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!202 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!203 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!204 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!205 = !{i32 7, !"Dwarf Version", i32 4}
!206 = !{i32 2, !"Debug Info Version", i32 3}
!207 = !{i32 1, !"wchar_size", i32 4}
!208 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!209 = distinct !DISubprogram(name: "ED_operatortypes_metaball", scope: !1, file: !1, line: 46, type: !210, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !212)
!210 = !DISubroutineType(types: !211)
!211 = !{null}
!212 = !{}
!213 = !DILocation(line: 48, column: 2, scope: !209)
!214 = !DILocation(line: 49, column: 2, scope: !209)
!215 = !DILocation(line: 51, column: 2, scope: !209)
!216 = !DILocation(line: 52, column: 2, scope: !209)
!217 = !DILocation(line: 54, column: 2, scope: !209)
!218 = !DILocation(line: 55, column: 2, scope: !209)
!219 = !DILocation(line: 56, column: 2, scope: !209)
!220 = !DILocation(line: 57, column: 1, scope: !209)
!221 = distinct !DISubprogram(name: "ED_operatormacros_metaball", scope: !1, file: !1, line: 59, type: !210, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !212)
!222 = !DILocalVariable(name: "ot", scope: !221, file: !1, line: 61, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !225, line: 568, baseType: !226)
!225 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !225, line: 508, size: 1536, elements: !227)
!227 = !{!228, !232, !233, !234, !235, !1947, !1951, !1957, !1961, !1962, !1966, !1967, !1968, !1969, !1973, !1974, !1989, !1990, !1994, !2020}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !226, file: !225, line: 509, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!231 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !226, file: !225, line: 510, baseType: !229, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !226, file: !225, line: 511, baseType: !229, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !226, file: !225, line: 512, baseType: !229, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !226, file: !225, line: 518, baseType: !236, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !240, !243}
!239 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !242, line: 44, flags: DIFlagFwdDecl)
!242 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !245, line: 328, size: 1344, elements: !246)
!245 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!246 = !{!247, !248, !249, !253, !285, !287, !288, !289, !301, !1940, !1941, !1942, !1945, !1946}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !245, line: 329, baseType: !243, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !244, file: !245, line: 329, baseType: !243, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !244, file: !245, line: 332, baseType: !250, size: 512, offset: 128)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 512, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !244, file: !245, line: 333, baseType: !254, size: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !256, line: 75, baseType: !257)
!256 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !256, line: 62, size: 1024, elements: !258)
!258 = !{!259, !261, !262, !263, !264, !266, !267, !268, !283, !284}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !256, line: 63, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !257, file: !256, line: 63, baseType: !260, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !256, line: 64, baseType: !231, size: 8, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !257, file: !256, line: 64, baseType: !231, size: 8, offset: 136)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !257, file: !256, line: 65, baseType: !265, size: 16, offset: 144)
!265 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !257, file: !256, line: 66, baseType: !250, size: 512, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !257, file: !256, line: 67, baseType: !239, size: 32, offset: 672)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !256, line: 69, baseType: !269, size: 256, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !256, line: 60, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !256, line: 48, size: 256, elements: !271)
!271 = !{!272, !274, !281, !282}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !270, file: !256, line: 49, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !270, file: !256, line: 58, baseType: !275, size: 128, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !276, line: 71, baseType: !277)
!276 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !276, line: 69, size: 128, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !277, file: !276, line: 70, baseType: !273, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !277, file: !276, line: 70, baseType: !273, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !270, file: !256, line: 59, baseType: !239, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !270, file: !256, line: 59, baseType: !239, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !257, file: !256, line: 70, baseType: !239, size: 32, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !257, file: !256, line: 74, baseType: !239, size: 32, offset: 992)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !244, file: !245, line: 336, baseType: !286, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !244, file: !245, line: 337, baseType: !273, size: 64, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !244, file: !245, line: 338, baseType: !273, size: 64, offset: 832)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !244, file: !245, line: 340, baseType: !290, size: 64, offset: 896)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !242, line: 55, size: 192, elements: !292)
!292 = !{!293, !297, !300}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !291, file: !242, line: 58, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !242, line: 56, size: 64, elements: !295)
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !242, line: 57, baseType: !273, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !242, line: 60, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !242, line: 41, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !291, file: !242, line: 61, baseType: !273, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !244, file: !245, line: 341, baseType: !302, size: 64, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !245, line: 106, size: 320, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !310}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !303, file: !245, line: 107, baseType: !275, size: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !303, file: !245, line: 108, baseType: !239, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !303, file: !245, line: 109, baseType: !239, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !245, line: 110, baseType: !239, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !303, file: !245, line: 110, baseType: !239, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !303, file: !245, line: 111, baseType: !311, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !225, line: 490, size: 768, elements: !313)
!313 = !{!314, !315, !316, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !225, line: 491, baseType: !311, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !312, file: !225, line: 491, baseType: !311, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !312, file: !225, line: 493, baseType: !317, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !245, line: 169, size: 2048, elements: !319)
!319 = !{!320, !321, !322, !323, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1906, !1909, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !245, line: 170, baseType: !317, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !245, line: 170, baseType: !317, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !318, file: !245, line: 172, baseType: !273, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !318, file: !245, line: 174, baseType: !324, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !326, line: 49, size: 1984, elements: !327)
!326 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = !{!328, !364, !365, !366, !367, !368, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !325, file: !326, line: 50, baseType: !329, size: 960)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !256, line: 130, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !256, line: 117, size: 960, elements: !331)
!331 = !{!332, !333, !334, !336, !355, !359, !360, !361, !362, !363}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !256, line: 118, baseType: !273, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !330, file: !256, line: 118, baseType: !273, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !330, file: !256, line: 119, baseType: !335, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !330, file: !256, line: 120, baseType: !337, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !256, line: 136, size: 17600, elements: !339)
!339 = !{!340, !341, !343, !346, !350, !351, !352}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !338, file: !256, line: 137, baseType: !329, size: 960)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !338, file: !256, line: 138, baseType: !342, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !338, file: !256, line: 139, baseType: !344, size: 64, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !256, line: 43, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !338, file: !256, line: 140, baseType: !347, size: 8192, offset: 1088)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 8192, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 1024)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !338, file: !256, line: 141, baseType: !347, size: 8192, offset: 9280)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !338, file: !256, line: 148, baseType: !337, size: 64, offset: 17472)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !338, file: !256, line: 150, baseType: !353, size: 64, offset: 17536)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !256, line: 45, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !256, line: 121, baseType: !356, size: 528, offset: 256)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 528, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 66)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !256, line: 126, baseType: !265, size: 16, offset: 784)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !330, file: !256, line: 127, baseType: !239, size: 32, offset: 800)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !330, file: !256, line: 128, baseType: !239, size: 32, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !330, file: !256, line: 128, baseType: !239, size: 32, offset: 864)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !330, file: !256, line: 129, baseType: !254, size: 64, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !325, file: !326, line: 52, baseType: !275, size: 128, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !325, file: !326, line: 53, baseType: !275, size: 128, offset: 1088)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !325, file: !326, line: 54, baseType: !275, size: 128, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !325, file: !326, line: 55, baseType: !275, size: 128, offset: 1344)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !325, file: !326, line: 57, baseType: !369, size: 64, offset: 1472)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !371, line: 1216, size: 39680, elements: !372)
!371 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!372 = !{!373, !374, !377, !672, !675, !676, !677, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !703, !774, !1200, !1415, !1418, !1706, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1728, !1729, !1730, !1731, !1732, !1740, !1807, !1814, !1815, !1822, !1823, !1824, !1825, !1826, !1827, !1828}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !370, file: !371, line: 1217, baseType: !329, size: 960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !370, file: !371, line: 1218, baseType: !375, size: 64, offset: 960)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !371, line: 58, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !370, file: !371, line: 1220, baseType: !378, size: 64, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !380, line: 115, size: 11392, elements: !381)
!380 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!381 = !{!382, !383, !384, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !402, !414, !428, !429, !473, !474, !477, !478, !494, !495, !496, !497, !498, !499, !500, !504, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !520, !521, !522, !523, !524, !525, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !585, !586, !587, !588, !589, !590, !591, !592, !593, !596, !599, !603, !604, !605, !606, !607, !610, !613, !616, !617, !623, !624, !625, !626, !627, !628, !630, !633, !636, !640, !660, !661}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !379, file: !380, line: 116, baseType: !329, size: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !379, file: !380, line: 117, baseType: !375, size: 64, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !379, file: !380, line: 119, baseType: !385, size: 64, offset: 1024)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !380, line: 57, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !379, file: !380, line: 121, baseType: !265, size: 16, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !379, file: !380, line: 121, baseType: !265, size: 16, offset: 1104)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !379, file: !380, line: 122, baseType: !239, size: 32, offset: 1120)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !379, file: !380, line: 122, baseType: !239, size: 32, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !379, file: !380, line: 122, baseType: !239, size: 32, offset: 1184)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !379, file: !380, line: 123, baseType: !250, size: 512, offset: 1216)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !379, file: !380, line: 124, baseType: !378, size: 64, offset: 1728)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !379, file: !380, line: 124, baseType: !378, size: 64, offset: 1792)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !379, file: !380, line: 127, baseType: !378, size: 64, offset: 1856)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !379, file: !380, line: 127, baseType: !378, size: 64, offset: 1920)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !379, file: !380, line: 127, baseType: !378, size: 64, offset: 1984)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !379, file: !380, line: 128, baseType: !399, size: 64, offset: 2048)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !401, line: 49, flags: DIFlagFwdDecl)
!401 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !379, file: !380, line: 130, baseType: !403, size: 64, offset: 2112)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !380, line: 97, size: 832, elements: !405)
!405 = !{!406, !412, !413}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !404, file: !380, line: 98, baseType: !407, size: 768)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 768, elements: !409)
!408 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!409 = !{!410, !411}
!410 = !DISubrange(count: 8)
!411 = !DISubrange(count: 3)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !380, line: 99, baseType: !239, size: 32, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !404, file: !380, line: 99, baseType: !239, size: 32, offset: 800)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !379, file: !380, line: 131, baseType: !415, size: 64, offset: 2176)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !417, line: 486, size: 1600, elements: !418)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !416, file: !417, line: 487, baseType: !329, size: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !416, file: !417, line: 489, baseType: !275, size: 128, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !416, file: !417, line: 490, baseType: !275, size: 128, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !416, file: !417, line: 491, baseType: !275, size: 128, offset: 1216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !416, file: !417, line: 492, baseType: !275, size: 128, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !416, file: !417, line: 494, baseType: !239, size: 32, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !416, file: !417, line: 495, baseType: !239, size: 32, offset: 1504)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !416, file: !417, line: 497, baseType: !239, size: 32, offset: 1536)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !416, file: !417, line: 498, baseType: !239, size: 32, offset: 1568)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !379, file: !380, line: 132, baseType: !415, size: 64, offset: 2240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !379, file: !380, line: 133, baseType: !430, size: 64, offset: 2304)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !417, line: 334, size: 1728, elements: !432)
!432 = !{!433, !434, !438, !439, !440, !441, !442, !443, !446, !447, !448, !449, !450, !451, !452, !472}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !431, file: !417, line: 335, baseType: !275, size: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !431, file: !417, line: 336, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !437, line: 74, flags: DIFlagFwdDecl)
!437 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !431, file: !417, line: 338, baseType: !265, size: 16, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !431, file: !417, line: 338, baseType: !265, size: 16, offset: 208)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !431, file: !417, line: 339, baseType: !5, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !431, file: !417, line: 340, baseType: !239, size: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !431, file: !417, line: 342, baseType: !408, size: 32, offset: 288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !431, file: !417, line: 343, baseType: !444, size: 96, offset: 320)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 96, elements: !445)
!445 = !{!411}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !431, file: !417, line: 344, baseType: !444, size: 96, offset: 416)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !431, file: !417, line: 347, baseType: !275, size: 128, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !431, file: !417, line: 349, baseType: !239, size: 32, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !431, file: !417, line: 350, baseType: !239, size: 32, offset: 672)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !431, file: !417, line: 351, baseType: !273, size: 64, offset: 704)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !431, file: !417, line: 352, baseType: !273, size: 64, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !431, file: !417, line: 354, baseType: !453, size: 384, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !417, line: 116, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !417, line: 94, size: 384, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !454, file: !417, line: 96, baseType: !239, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !454, file: !417, line: 96, baseType: !239, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !454, file: !417, line: 97, baseType: !239, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !454, file: !417, line: 97, baseType: !239, size: 32, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !454, file: !417, line: 99, baseType: !265, size: 16, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !454, file: !417, line: 100, baseType: !265, size: 16, offset: 144)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !454, file: !417, line: 102, baseType: !265, size: 16, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !454, file: !417, line: 105, baseType: !265, size: 16, offset: 176)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !454, file: !417, line: 108, baseType: !265, size: 16, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !454, file: !417, line: 109, baseType: !265, size: 16, offset: 208)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !454, file: !417, line: 111, baseType: !265, size: 16, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !454, file: !417, line: 112, baseType: !265, size: 16, offset: 240)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !454, file: !417, line: 114, baseType: !239, size: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !454, file: !417, line: 114, baseType: !239, size: 32, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !454, file: !417, line: 115, baseType: !239, size: 32, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !454, file: !417, line: 115, baseType: !239, size: 32, offset: 352)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !431, file: !417, line: 355, baseType: !250, size: 512, offset: 1216)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !380, line: 134, baseType: !273, size: 64, offset: 2368)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !379, file: !380, line: 136, baseType: !475, size: 64, offset: 2432)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !371, line: 61, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !379, file: !380, line: 138, baseType: !453, size: 384, offset: 2496)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !379, file: !380, line: 139, baseType: !479, size: 64, offset: 2880)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !417, line: 80, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !417, line: 72, size: 192, elements: !482)
!482 = !{!483, !490, !491, !492, !493}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !481, file: !417, line: 73, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !417, line: 59, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !417, line: 56, size: 128, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !486, file: !417, line: 57, baseType: !444, size: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !486, file: !417, line: 58, baseType: !239, size: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !481, file: !417, line: 74, baseType: !239, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !481, file: !417, line: 76, baseType: !239, size: 32, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !481, file: !417, line: 77, baseType: !239, size: 32, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !481, file: !417, line: 79, baseType: !239, size: 32, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !379, file: !380, line: 141, baseType: !275, size: 128, offset: 2944)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !379, file: !380, line: 142, baseType: !275, size: 128, offset: 3072)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !379, file: !380, line: 143, baseType: !275, size: 128, offset: 3200)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !379, file: !380, line: 144, baseType: !275, size: 128, offset: 3328)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !379, file: !380, line: 146, baseType: !239, size: 32, offset: 3456)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !379, file: !380, line: 147, baseType: !239, size: 32, offset: 3488)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !379, file: !380, line: 150, baseType: !501, size: 64, offset: 3520)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !371, line: 179, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !379, file: !380, line: 151, baseType: !505, size: 64, offset: 3584)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !379, file: !380, line: 152, baseType: !239, size: 32, offset: 3648)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !379, file: !380, line: 153, baseType: !239, size: 32, offset: 3680)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !379, file: !380, line: 156, baseType: !444, size: 96, offset: 3712)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !379, file: !380, line: 156, baseType: !444, size: 96, offset: 3808)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !379, file: !380, line: 156, baseType: !444, size: 96, offset: 3904)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !379, file: !380, line: 157, baseType: !444, size: 96, offset: 4000)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !379, file: !380, line: 158, baseType: !444, size: 96, offset: 4096)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !379, file: !380, line: 159, baseType: !444, size: 96, offset: 4192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !379, file: !380, line: 160, baseType: !444, size: 96, offset: 4288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !379, file: !380, line: 160, baseType: !444, size: 96, offset: 4384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !379, file: !380, line: 161, baseType: !517, size: 128, offset: 4480)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 128, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 4)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !379, file: !380, line: 161, baseType: !517, size: 128, offset: 4608)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !379, file: !380, line: 162, baseType: !444, size: 96, offset: 4736)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !379, file: !380, line: 162, baseType: !444, size: 96, offset: 4832)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !379, file: !380, line: 163, baseType: !408, size: 32, offset: 4928)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !379, file: !380, line: 163, baseType: !408, size: 32, offset: 4960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !379, file: !380, line: 164, baseType: !526, size: 512, offset: 4992)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 512, elements: !527)
!527 = !{!519, !519}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !379, file: !380, line: 165, baseType: !526, size: 512, offset: 5504)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !379, file: !380, line: 166, baseType: !526, size: 512, offset: 6016)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !379, file: !380, line: 167, baseType: !526, size: 512, offset: 6528)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !379, file: !380, line: 176, baseType: !526, size: 512, offset: 7040)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !379, file: !380, line: 178, baseType: !5, size: 32, offset: 7552)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !380, line: 180, baseType: !265, size: 16, offset: 7584)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !379, file: !380, line: 181, baseType: !265, size: 16, offset: 7600)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !379, file: !380, line: 183, baseType: !265, size: 16, offset: 7616)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !379, file: !380, line: 183, baseType: !265, size: 16, offset: 7632)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !379, file: !380, line: 184, baseType: !265, size: 16, offset: 7648)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !379, file: !380, line: 184, baseType: !265, size: 16, offset: 7664)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !379, file: !380, line: 185, baseType: !265, size: 16, offset: 7680)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !379, file: !380, line: 186, baseType: !265, size: 16, offset: 7696)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !379, file: !380, line: 187, baseType: !265, size: 16, offset: 7712)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !379, file: !380, line: 188, baseType: !231, size: 8, offset: 7728)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !379, file: !380, line: 189, baseType: !231, size: 8, offset: 7736)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !379, file: !380, line: 192, baseType: !239, size: 32, offset: 7744)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !379, file: !380, line: 192, baseType: !239, size: 32, offset: 7776)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !379, file: !380, line: 192, baseType: !239, size: 32, offset: 7808)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !379, file: !380, line: 192, baseType: !239, size: 32, offset: 7840)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !379, file: !380, line: 194, baseType: !239, size: 32, offset: 7872)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !379, file: !380, line: 202, baseType: !408, size: 32, offset: 7904)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !379, file: !380, line: 202, baseType: !408, size: 32, offset: 7936)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !379, file: !380, line: 202, baseType: !408, size: 32, offset: 7968)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !379, file: !380, line: 211, baseType: !408, size: 32, offset: 8000)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !379, file: !380, line: 212, baseType: !408, size: 32, offset: 8032)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !379, file: !380, line: 213, baseType: !408, size: 32, offset: 8064)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !379, file: !380, line: 214, baseType: !408, size: 32, offset: 8096)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !379, file: !380, line: 215, baseType: !408, size: 32, offset: 8128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !379, file: !380, line: 216, baseType: !408, size: 32, offset: 8160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !379, file: !380, line: 219, baseType: !408, size: 32, offset: 8192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !379, file: !380, line: 220, baseType: !408, size: 32, offset: 8224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !379, file: !380, line: 221, baseType: !408, size: 32, offset: 8256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !379, file: !380, line: 224, baseType: !562, size: 16, offset: 8288)
!562 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !379, file: !380, line: 224, baseType: !562, size: 16, offset: 8304)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !379, file: !380, line: 226, baseType: !265, size: 16, offset: 8320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !379, file: !380, line: 228, baseType: !231, size: 8, offset: 8336)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !379, file: !380, line: 229, baseType: !231, size: 8, offset: 8344)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !379, file: !380, line: 231, baseType: !265, size: 16, offset: 8352)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !379, file: !380, line: 232, baseType: !231, size: 8, offset: 8368)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !379, file: !380, line: 233, baseType: !231, size: 8, offset: 8376)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !379, file: !380, line: 234, baseType: !408, size: 32, offset: 8384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !379, file: !380, line: 235, baseType: !408, size: 32, offset: 8416)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !379, file: !380, line: 237, baseType: !275, size: 128, offset: 8448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !379, file: !380, line: 238, baseType: !275, size: 128, offset: 8576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !379, file: !380, line: 239, baseType: !275, size: 128, offset: 8704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !379, file: !380, line: 240, baseType: !275, size: 128, offset: 8832)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !379, file: !380, line: 242, baseType: !408, size: 32, offset: 8960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !379, file: !380, line: 244, baseType: !265, size: 16, offset: 8992)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !379, file: !380, line: 245, baseType: !562, size: 16, offset: 9008)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !379, file: !380, line: 246, baseType: !517, size: 128, offset: 9024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !379, file: !380, line: 248, baseType: !239, size: 32, offset: 9152)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !379, file: !380, line: 249, baseType: !239, size: 32, offset: 9184)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !379, file: !380, line: 251, baseType: !583, size: 64, offset: 9216)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !380, line: 251, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !379, file: !380, line: 253, baseType: !231, size: 8, offset: 9280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !379, file: !380, line: 254, baseType: !231, size: 8, offset: 9288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !379, file: !380, line: 255, baseType: !265, size: 16, offset: 9296)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !379, file: !380, line: 256, baseType: !444, size: 96, offset: 9312)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !379, file: !380, line: 258, baseType: !275, size: 128, offset: 9408)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !379, file: !380, line: 259, baseType: !275, size: 128, offset: 9536)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !379, file: !380, line: 260, baseType: !275, size: 128, offset: 9664)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !379, file: !380, line: 261, baseType: !275, size: 128, offset: 9792)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !379, file: !380, line: 263, baseType: !594, size: 64, offset: 9920)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !380, line: 52, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !379, file: !380, line: 264, baseType: !597, size: 64, offset: 9984)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !380, line: 53, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !379, file: !380, line: 265, baseType: !600, size: 64, offset: 10048)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !602, line: 43, flags: DIFlagFwdDecl)
!602 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!603 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !379, file: !380, line: 267, baseType: !231, size: 8, offset: 10112)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !379, file: !380, line: 268, baseType: !231, size: 8, offset: 10120)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !379, file: !380, line: 269, baseType: !265, size: 16, offset: 10128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !379, file: !380, line: 270, baseType: !408, size: 32, offset: 10144)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !379, file: !380, line: 272, baseType: !608, size: 64, offset: 10176)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !380, line: 54, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !379, file: !380, line: 275, baseType: !611, size: 64, offset: 10240)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !380, line: 275, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !379, file: !380, line: 277, baseType: !614, size: 64, offset: 10304)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !380, line: 56, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !379, file: !380, line: 277, baseType: !614, size: 64, offset: 10368)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !379, file: !380, line: 278, baseType: !618, size: 64, offset: 10432)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !619, line: 27, baseType: !620)
!619 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !621, line: 45, baseType: !622)
!621 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!622 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !379, file: !380, line: 279, baseType: !618, size: 64, offset: 10496)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !379, file: !380, line: 280, baseType: !5, size: 32, offset: 10560)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !379, file: !380, line: 281, baseType: !5, size: 32, offset: 10592)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !379, file: !380, line: 283, baseType: !275, size: 128, offset: 10624)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !379, file: !380, line: 284, baseType: !275, size: 128, offset: 10752)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !379, file: !380, line: 285, baseType: !629, size: 64, offset: 10880)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !379, file: !380, line: 287, baseType: !631, size: 64, offset: 10944)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !380, line: 59, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !379, file: !380, line: 288, baseType: !634, size: 64, offset: 11008)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !380, line: 288, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !379, file: !380, line: 290, baseType: !637, size: 64, offset: 11072)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 64, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 2)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !379, file: !380, line: 291, baseType: !641, size: 64, offset: 11136)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !643, line: 65, baseType: !644)
!643 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !643, line: 50, size: 320, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !644, file: !643, line: 51, baseType: !369, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !644, file: !643, line: 53, baseType: !239, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !644, file: !643, line: 54, baseType: !239, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !644, file: !643, line: 55, baseType: !239, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !644, file: !643, line: 55, baseType: !239, size: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !644, file: !643, line: 56, baseType: !231, size: 8, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !644, file: !643, line: 56, baseType: !231, size: 8, offset: 200)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !644, file: !643, line: 57, baseType: !231, size: 8, offset: 208)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !644, file: !643, line: 57, baseType: !231, size: 8, offset: 216)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !644, file: !643, line: 59, baseType: !265, size: 16, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !644, file: !643, line: 59, baseType: !265, size: 16, offset: 240)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !644, file: !643, line: 59, baseType: !265, size: 16, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !644, file: !643, line: 61, baseType: !265, size: 16, offset: 272)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !644, file: !643, line: 63, baseType: !239, size: 32, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !379, file: !380, line: 293, baseType: !275, size: 128, offset: 11200)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !379, file: !380, line: 294, baseType: !662, size: 64, offset: 11328)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !380, line: 113, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !380, line: 108, size: 256, elements: !665)
!665 = !{!666, !668, !669, !670, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !664, file: !380, line: 109, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !664, file: !380, line: 109, baseType: !667, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !664, file: !380, line: 110, baseType: !378, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !664, file: !380, line: 111, baseType: !239, size: 32, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !664, file: !380, line: 112, baseType: !408, size: 32, offset: 224)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !370, file: !371, line: 1221, baseType: !673, size: 64, offset: 1088)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !371, line: 52, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !370, file: !371, line: 1223, baseType: !369, size: 64, offset: 1152)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !370, file: !371, line: 1225, baseType: !275, size: 128, offset: 1216)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !370, file: !371, line: 1226, baseType: !678, size: 64, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !371, line: 69, size: 320, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !679, file: !371, line: 70, baseType: !678, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !679, file: !371, line: 70, baseType: !678, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !679, file: !371, line: 71, baseType: !5, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !679, file: !371, line: 71, baseType: !5, size: 32, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !371, line: 72, baseType: !239, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !679, file: !371, line: 73, baseType: !265, size: 16, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !679, file: !371, line: 73, baseType: !265, size: 16, offset: 240)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !679, file: !371, line: 74, baseType: !378, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !370, file: !371, line: 1227, baseType: !378, size: 64, offset: 1408)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !370, file: !371, line: 1229, baseType: !444, size: 96, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !370, file: !371, line: 1230, baseType: !444, size: 96, offset: 1568)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !370, file: !371, line: 1231, baseType: !444, size: 96, offset: 1664)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !370, file: !371, line: 1231, baseType: !444, size: 96, offset: 1760)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !370, file: !371, line: 1233, baseType: !5, size: 32, offset: 1856)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !370, file: !371, line: 1234, baseType: !239, size: 32, offset: 1888)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !370, file: !371, line: 1235, baseType: !5, size: 32, offset: 1920)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !371, line: 1237, baseType: !265, size: 16, offset: 1952)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !370, file: !371, line: 1239, baseType: !231, size: 8, offset: 1968)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !370, file: !371, line: 1240, baseType: !700, size: 8, offset: 1976)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 8, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 1)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !370, file: !371, line: 1242, baseType: !704, size: 64, offset: 1984)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !706, line: 328, size: 3456, elements: !707)
!706 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!707 = !{!708, !709, !710, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !740, !741, !742, !745, !750, !751, !754, !758, !762, !766, !770, !771, !772, !773}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !705, file: !706, line: 329, baseType: !329, size: 960)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !705, file: !706, line: 330, baseType: !375, size: 64, offset: 960)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !705, file: !706, line: 332, baseType: !711, size: 64, offset: 1024)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !706, line: 332, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !705, file: !706, line: 333, baseType: !250, size: 512, offset: 1088)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !705, file: !706, line: 335, baseType: !298, size: 64, offset: 1600)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !705, file: !706, line: 337, baseType: !475, size: 64, offset: 1664)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !705, file: !706, line: 338, baseType: !637, size: 64, offset: 1728)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !705, file: !706, line: 340, baseType: !275, size: 128, offset: 1792)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !705, file: !706, line: 340, baseType: !275, size: 128, offset: 1920)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !705, file: !706, line: 342, baseType: !239, size: 32, offset: 2048)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !705, file: !706, line: 342, baseType: !239, size: 32, offset: 2080)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !705, file: !706, line: 343, baseType: !239, size: 32, offset: 2112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !705, file: !706, line: 345, baseType: !239, size: 32, offset: 2144)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !705, file: !706, line: 346, baseType: !239, size: 32, offset: 2176)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !705, file: !706, line: 347, baseType: !265, size: 16, offset: 2208)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !705, file: !706, line: 348, baseType: !265, size: 16, offset: 2224)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !705, file: !706, line: 349, baseType: !239, size: 32, offset: 2240)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !705, file: !706, line: 351, baseType: !239, size: 32, offset: 2272)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !705, file: !706, line: 353, baseType: !265, size: 16, offset: 2304)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !705, file: !706, line: 354, baseType: !265, size: 16, offset: 2320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !705, file: !706, line: 355, baseType: !239, size: 32, offset: 2336)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !705, file: !706, line: 357, baseType: !732, size: 128, offset: 2368)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !733, line: 95, baseType: !734)
!733 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !733, line: 92, size: 128, elements: !735)
!735 = !{!736, !737, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !734, file: !733, line: 93, baseType: !408, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !734, file: !733, line: 93, baseType: !408, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !734, file: !733, line: 94, baseType: !408, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !734, file: !733, line: 94, baseType: !408, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !705, file: !706, line: 363, baseType: !275, size: 128, offset: 2496)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !705, file: !706, line: 363, baseType: !275, size: 128, offset: 2624)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !705, file: !706, line: 368, baseType: !743, size: 64, offset: 2752)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !706, line: 48, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !705, file: !706, line: 372, baseType: !746, size: 32, offset: 2816)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !706, line: 274, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !706, line: 271, size: 32, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !747, file: !706, line: 273, baseType: !5, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !705, file: !706, line: 373, baseType: !239, size: 32, offset: 2848)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !705, file: !706, line: 382, baseType: !752, size: 64, offset: 2880)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !706, line: 46, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !705, file: !706, line: 385, baseType: !755, size: 64, offset: 2944)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !273, !408}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !705, file: !706, line: 386, baseType: !759, size: 64, offset: 3008)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !273, !505}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !705, file: !706, line: 387, baseType: !763, size: 64, offset: 3072)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!239, !273}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !705, file: !706, line: 388, baseType: !767, size: 64, offset: 3136)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !273}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !705, file: !706, line: 389, baseType: !273, size: 64, offset: 3200)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !705, file: !706, line: 389, baseType: !273, size: 64, offset: 3264)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !705, file: !706, line: 389, baseType: !273, size: 64, offset: 3328)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !705, file: !706, line: 389, baseType: !273, size: 64, offset: 3392)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !370, file: !371, line: 1244, baseType: !775, size: 64, offset: 2048)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !401, line: 200, size: 17024, elements: !777)
!777 = !{!778, !779, !780, !781, !1193, !1194, !1195, !1196, !1197, !1198, !1199}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !776, file: !401, line: 201, baseType: !629, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !776, file: !401, line: 202, baseType: !275, size: 128, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !776, file: !401, line: 203, baseType: !275, size: 128, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !776, file: !401, line: 206, baseType: !782, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !401, line: 190, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !401, line: 126, size: 2816, elements: !785)
!785 = !{!786, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !884, !885, !886, !887, !1165, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1192}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !401, line: 127, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !784, file: !401, line: 127, baseType: !787, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !784, file: !401, line: 128, baseType: !273, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !784, file: !401, line: 129, baseType: !273, size: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !784, file: !401, line: 130, baseType: !250, size: 512, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !784, file: !401, line: 132, baseType: !239, size: 32, offset: 768)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !784, file: !401, line: 132, baseType: !239, size: 32, offset: 800)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !784, file: !401, line: 133, baseType: !239, size: 32, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !784, file: !401, line: 134, baseType: !239, size: 32, offset: 864)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !784, file: !401, line: 134, baseType: !239, size: 32, offset: 896)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !784, file: !401, line: 134, baseType: !239, size: 32, offset: 928)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !784, file: !401, line: 135, baseType: !239, size: 32, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !784, file: !401, line: 135, baseType: !239, size: 32, offset: 992)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !784, file: !401, line: 136, baseType: !239, size: 32, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !784, file: !401, line: 136, baseType: !239, size: 32, offset: 1056)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !784, file: !401, line: 137, baseType: !239, size: 32, offset: 1088)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !784, file: !401, line: 137, baseType: !239, size: 32, offset: 1120)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !784, file: !401, line: 138, baseType: !408, size: 32, offset: 1152)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !784, file: !401, line: 139, baseType: !408, size: 32, offset: 1184)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !784, file: !401, line: 139, baseType: !408, size: 32, offset: 1216)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !784, file: !401, line: 141, baseType: !265, size: 16, offset: 1248)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !784, file: !401, line: 142, baseType: !265, size: 16, offset: 1264)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !784, file: !401, line: 143, baseType: !239, size: 32, offset: 1280)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !784, file: !401, line: 144, baseType: !239, size: 32, offset: 1312)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !784, file: !401, line: 146, baseType: !812, size: 64, offset: 1344)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !401, line: 114, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !401, line: 99, size: 7232, elements: !815)
!815 = !{!816, !818, !819, !820, !821, !822, !823, !834, !838, !852, !861, !868, !878}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !814, file: !401, line: 100, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !814, file: !401, line: 100, baseType: !817, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !814, file: !401, line: 101, baseType: !239, size: 32, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !814, file: !401, line: 101, baseType: !239, size: 32, offset: 160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !814, file: !401, line: 102, baseType: !239, size: 32, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !814, file: !401, line: 102, baseType: !239, size: 32, offset: 224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !814, file: !401, line: 103, baseType: !824, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !401, line: 59, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !401, line: 56, size: 2112, elements: !827)
!827 = !{!828, !832, !833}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !826, file: !401, line: 57, baseType: !829, size: 2048)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 2048, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !826, file: !401, line: 58, baseType: !239, size: 32, offset: 2048)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !826, file: !401, line: 58, baseType: !239, size: 32, offset: 2080)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !814, file: !401, line: 106, baseType: !835, size: 6144, offset: 320)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 6144, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 768)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !814, file: !401, line: 107, baseType: !839, size: 64, offset: 6464)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !401, line: 97, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !401, line: 83, size: 8320, elements: !842)
!842 = !{!843, !844, !845, !848, !849, !850, !851}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !841, file: !401, line: 84, baseType: !835, size: 6144)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !841, file: !401, line: 87, baseType: !829, size: 2048, offset: 6144)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !841, file: !401, line: 88, baseType: !846, size: 64, offset: 8192)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !643, line: 41, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !841, file: !401, line: 90, baseType: !265, size: 16, offset: 8256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !841, file: !401, line: 92, baseType: !265, size: 16, offset: 8272)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !841, file: !401, line: 93, baseType: !265, size: 16, offset: 8288)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !841, file: !401, line: 95, baseType: !265, size: 16, offset: 8304)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !814, file: !401, line: 108, baseType: !853, size: 64, offset: 6528)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !401, line: 66, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !401, line: 61, size: 128, elements: !856)
!856 = !{!857, !858, !859, !860}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !855, file: !401, line: 62, baseType: !239, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !855, file: !401, line: 63, baseType: !239, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !855, file: !401, line: 64, baseType: !239, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !855, file: !401, line: 65, baseType: !239, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !814, file: !401, line: 109, baseType: !862, size: 64, offset: 6592)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !401, line: 71, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !401, line: 68, size: 64, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !864, file: !401, line: 69, baseType: !239, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !864, file: !401, line: 70, baseType: !239, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !814, file: !401, line: 110, baseType: !869, size: 64, offset: 6656)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !401, line: 81, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !401, line: 73, size: 352, elements: !872)
!872 = !{!873, !874, !875, !876, !877}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !871, file: !401, line: 74, baseType: !444, size: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !871, file: !401, line: 75, baseType: !444, size: 96, offset: 96)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !871, file: !401, line: 76, baseType: !444, size: 96, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !871, file: !401, line: 77, baseType: !239, size: 32, offset: 288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !871, file: !401, line: 78, baseType: !239, size: 32, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !814, file: !401, line: 113, baseType: !879, size: 512, offset: 6720)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !880, line: 182, baseType: !881)
!880 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !880, line: 180, size: 512, elements: !882)
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !881, file: !880, line: 181, baseType: !250, size: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !784, file: !401, line: 148, baseType: !399, size: 64, offset: 1408)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !784, file: !401, line: 151, baseType: !369, size: 64, offset: 1472)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !784, file: !401, line: 152, baseType: !378, size: 64, offset: 1536)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !784, file: !401, line: 153, baseType: !888, size: 64, offset: 1600)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !890, line: 64, size: 19136, elements: !891)
!890 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!891 = !{!892, !893, !894, !895, !896, !897, !899, !900, !901, !902, !905, !906, !1151, !1152, !1160, !1161, !1162, !1163, !1164}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !889, file: !890, line: 65, baseType: !329, size: 960)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !889, file: !890, line: 66, baseType: !375, size: 64, offset: 960)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !889, file: !890, line: 68, baseType: !347, size: 8192, offset: 1024)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !889, file: !890, line: 70, baseType: !239, size: 32, offset: 9216)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !889, file: !890, line: 71, baseType: !239, size: 32, offset: 9248)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !889, file: !890, line: 72, baseType: !898, size: 64, offset: 9280)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 64, elements: !638)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !889, file: !890, line: 74, baseType: !408, size: 32, offset: 9344)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !889, file: !890, line: 74, baseType: !408, size: 32, offset: 9376)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !889, file: !890, line: 76, baseType: !846, size: 64, offset: 9408)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !889, file: !890, line: 77, baseType: !903, size: 64, offset: 9472)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !890, line: 77, flags: DIFlagFwdDecl)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !889, file: !890, line: 78, baseType: !475, size: 64, offset: 9536)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !889, file: !890, line: 80, baseType: !907, size: 2624, offset: 9600)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !908, line: 340, size: 2624, elements: !909)
!908 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!909 = !{!910, !938, !956, !957, !958, !973, !1031, !1032, !1131, !1132, !1133, !1134, !1140}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !907, file: !908, line: 341, baseType: !911, size: 576)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !908, line: 251, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !908, line: 207, size: 576, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !912, file: !908, line: 208, baseType: !239, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !912, file: !908, line: 211, baseType: !265, size: 16, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !912, file: !908, line: 212, baseType: !265, size: 16, offset: 48)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !912, file: !908, line: 213, baseType: !408, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !912, file: !908, line: 214, baseType: !265, size: 16, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !912, file: !908, line: 215, baseType: !265, size: 16, offset: 112)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !912, file: !908, line: 216, baseType: !265, size: 16, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !912, file: !908, line: 217, baseType: !265, size: 16, offset: 144)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !912, file: !908, line: 218, baseType: !265, size: 16, offset: 160)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !912, file: !908, line: 219, baseType: !265, size: 16, offset: 176)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !912, file: !908, line: 220, baseType: !408, size: 32, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !912, file: !908, line: 222, baseType: !265, size: 16, offset: 224)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !912, file: !908, line: 225, baseType: !265, size: 16, offset: 240)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !912, file: !908, line: 228, baseType: !239, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !912, file: !908, line: 229, baseType: !239, size: 32, offset: 288)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !912, file: !908, line: 233, baseType: !239, size: 32, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !912, file: !908, line: 236, baseType: !265, size: 16, offset: 352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !912, file: !908, line: 236, baseType: !265, size: 16, offset: 368)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !912, file: !908, line: 241, baseType: !408, size: 32, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !912, file: !908, line: 244, baseType: !239, size: 32, offset: 416)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !912, file: !908, line: 244, baseType: !239, size: 32, offset: 448)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !912, file: !908, line: 245, baseType: !408, size: 32, offset: 480)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !912, file: !908, line: 248, baseType: !408, size: 32, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !912, file: !908, line: 250, baseType: !239, size: 32, offset: 544)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !907, file: !908, line: 342, baseType: !939, size: 448, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !908, line: 79, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !908, line: 61, size: 448, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !940, file: !908, line: 62, baseType: !273, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !940, file: !908, line: 64, baseType: !265, size: 16, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !940, file: !908, line: 65, baseType: !265, size: 16, offset: 80)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !940, file: !908, line: 67, baseType: !408, size: 32, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !940, file: !908, line: 68, baseType: !408, size: 32, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !940, file: !908, line: 69, baseType: !408, size: 32, offset: 160)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !940, file: !908, line: 70, baseType: !265, size: 16, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !940, file: !908, line: 71, baseType: !265, size: 16, offset: 208)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !940, file: !908, line: 72, baseType: !637, size: 64, offset: 224)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !940, file: !908, line: 75, baseType: !408, size: 32, offset: 288)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !940, file: !908, line: 75, baseType: !408, size: 32, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !940, file: !908, line: 75, baseType: !408, size: 32, offset: 352)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !940, file: !908, line: 78, baseType: !408, size: 32, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !940, file: !908, line: 78, baseType: !408, size: 32, offset: 416)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !907, file: !908, line: 343, baseType: !275, size: 128, offset: 1024)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !907, file: !908, line: 344, baseType: !275, size: 128, offset: 1152)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !907, file: !908, line: 345, baseType: !959, size: 192, offset: 1280)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !908, line: 278, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !908, line: 270, size: 192, elements: !961)
!961 = !{!962, !963, !964, !965, !966}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !960, file: !908, line: 271, baseType: !239, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !960, file: !908, line: 273, baseType: !408, size: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !960, file: !908, line: 275, baseType: !239, size: 32, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !960, file: !908, line: 276, baseType: !239, size: 32, offset: 96)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !960, file: !908, line: 277, baseType: !967, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !908, line: 55, size: 576, elements: !969)
!969 = !{!970, !971, !972}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !968, file: !908, line: 56, baseType: !239, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !968, file: !908, line: 57, baseType: !408, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !968, file: !908, line: 58, baseType: !526, size: 512, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !907, file: !908, line: 346, baseType: !974, size: 384, offset: 1472)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !908, line: 268, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !908, line: 253, size: 384, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !1025, !1026, !1027, !1028, !1029, !1030}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !975, file: !908, line: 254, baseType: !239, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !975, file: !908, line: 255, baseType: !239, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !975, file: !908, line: 255, baseType: !239, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !975, file: !908, line: 258, baseType: !408, size: 32, offset: 96)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !975, file: !908, line: 259, baseType: !982, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !908, line: 164, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !908, line: 108, size: 1664, elements: !985)
!985 = !{!986, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !984, file: !908, line: 109, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !984, file: !908, line: 109, baseType: !987, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !984, file: !908, line: 111, baseType: !250, size: 512, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !984, file: !908, line: 119, baseType: !637, size: 64, offset: 640)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !984, file: !908, line: 119, baseType: !637, size: 64, offset: 704)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !984, file: !908, line: 125, baseType: !637, size: 64, offset: 768)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !984, file: !908, line: 125, baseType: !637, size: 64, offset: 832)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !984, file: !908, line: 127, baseType: !637, size: 64, offset: 896)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !984, file: !908, line: 130, baseType: !239, size: 32, offset: 960)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !984, file: !908, line: 131, baseType: !239, size: 32, offset: 992)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !984, file: !908, line: 132, baseType: !998, size: 64, offset: 1024)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !908, line: 106, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !908, line: 81, size: 512, elements: !1001)
