; ModuleID = 'blender/source/blender/editors/gpencil/gpencil_undo.c'
source_filename = "blender/source/blender/editors/gpencil/gpencil_undo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ListBase = type { i8*, i8* }
%struct.bGPundonode = type { %struct.bGPundonode*, %struct.bGPundonode*, [64 x i8], %struct.bGPdata* }
%struct.bGPdata = type { %struct.ID, %struct.ListBase, i32, i16, i16, i8* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.bContext = type opaque
%struct.bGPDlayer = type { %struct.bGPDlayer*, %struct.bGPDlayer*, %struct.ListBase, %struct.bGPDframe*, i32, i16, i16, [4 x float], [128 x i8] }
%struct.bGPDframe = type { %struct.bGPDframe*, %struct.bGPDframe*, %struct.ListBase, i32, i32 }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.StructRNA = type opaque

@undo_nodes = internal global %struct.ListBase zeroinitializer, align 8, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "undo_nodes", scope: !2, file: !3, line: 61, type: !94, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/editors/gpencil/gpencil_undo.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 351, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !{!0, !18}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "cur_node", scope: !2, file: !3, line: 62, type: !20, isLocal: true, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPundonode", file: !3, line: 59, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPundonode", file: !3, line: 54, size: 704, elements: !23)
!23 = !{!24, !26, !27, !32}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !22, file: !3, line: 55, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !22, file: !3, line: 55, baseType: !25, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !22, file: !3, line: 57, baseType: !28, size: 512, offset: 128)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, elements: !30)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !{!31}
!31 = !DISubrange(count: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !22, file: !3, line: 58, baseType: !33, size: 64, offset: 640)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !35, line: 130, size: 1216, elements: !36)
!35 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!36 = !{!37, !104, !105, !106, !107, !108}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !34, file: !35, line: 131, baseType: !38, size: 960)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !41)
!41 = !{!42, !43, !44, !46, !65, !69, !71, !73, !74, !75}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 118, baseType: !16, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 118, baseType: !16, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !40, file: !39, line: 119, baseType: !45, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !40, file: !39, line: 120, baseType: !47, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !49)
!49 = !{!50, !51, !53, !56, !60, !61, !62}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !48, file: !39, line: 137, baseType: !38, size: 960)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !48, file: !39, line: 138, baseType: !52, size: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !48, file: !39, line: 139, baseType: !54, size: 64, offset: 1024)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !39, line: 140, baseType: !57, size: 8192, offset: 1088)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8192, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 1024)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !48, file: !39, line: 141, baseType: !57, size: 8192, offset: 9280)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !48, file: !39, line: 148, baseType: !47, size: 64, offset: 17472)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !48, file: !39, line: 150, baseType: !63, size: 64, offset: 17536)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 121, baseType: !66, size: 528, offset: 256)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 528, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 66)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 126, baseType: !70, size: 16, offset: 784)
!70 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !40, file: !39, line: 127, baseType: !72, size: 32, offset: 800)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !40, file: !39, line: 128, baseType: !72, size: 32, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !40, file: !39, line: 128, baseType: !72, size: 32, offset: 864)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !40, file: !39, line: 129, baseType: !76, size: 64, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !79)
!79 = !{!80, !82, !83, !84, !85, !86, !87, !88, !102, !103}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !39, line: 63, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !78, file: !39, line: 63, baseType: !81, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !39, line: 64, baseType: !29, size: 8, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !78, file: !39, line: 64, baseType: !29, size: 8, offset: 136)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !78, file: !39, line: 65, baseType: !70, size: 16, offset: 144)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !39, line: 66, baseType: !28, size: 512, offset: 160)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !78, file: !39, line: 67, baseType: !72, size: 32, offset: 672)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !39, line: 69, baseType: !89, size: 256, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !91)
!91 = !{!92, !93, !100, !101}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !90, file: !39, line: 49, baseType: !16, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !90, file: !39, line: 58, baseType: !94, size: 128, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !95, line: 71, baseType: !96)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !95, line: 69, size: 128, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !96, file: !95, line: 70, baseType: !16, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !96, file: !95, line: 70, baseType: !16, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !90, file: !39, line: 59, baseType: !72, size: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !90, file: !39, line: 59, baseType: !72, size: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !78, file: !39, line: 70, baseType: !72, size: 32, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !78, file: !39, line: 74, baseType: !72, size: 32, offset: 992)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !34, file: !35, line: 134, baseType: !94, size: 128, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !34, file: !35, line: 135, baseType: !72, size: 32, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !34, file: !35, line: 141, baseType: !70, size: 16, offset: 1120)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !34, file: !35, line: 142, baseType: !70, size: 16, offset: 1136)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !34, file: !35, line: 143, baseType: !16, size: 64, offset: 1152)
!109 = !{i32 7, !"Dwarf Version", i32 4}
!110 = !{i32 2, !"Debug Info Version", i32 3}
!111 = !{i32 1, !"wchar_size", i32 4}
!112 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!113 = distinct !DISubprogram(name: "ED_gpencil_session_active", scope: !3, file: !3, line: 64, type: !114, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{!72}
!116 = !{}
!117 = !DILocation(line: 66, column: 10, scope: !113)
!118 = !DILocation(line: 66, column: 45, scope: !113)
!119 = !DILocation(line: 66, column: 2, scope: !113)
!120 = distinct !DISubprogram(name: "BLI_listbase_is_empty", scope: !121, file: !121, line: 88, type: !122, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !116)
!121 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !125}
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!127 = !DILocalVariable(name: "lb", arg: 1, scope: !120, file: !121, line: 88, type: !125)
!128 = !DILocation(line: 88, column: 62, scope: !120)
!129 = !DILocation(line: 88, column: 76, scope: !120)
!130 = !DILocation(line: 88, column: 80, scope: !120)
!131 = !DILocation(line: 88, column: 86, scope: !120)
!132 = !DILocation(line: 88, column: 75, scope: !120)
!133 = !DILocation(line: 88, column: 68, scope: !120)
!134 = distinct !DISubprogram(name: "ED_undo_gpencil_step", scope: !3, file: !3, line: 69, type: !135, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !116)
!135 = !DISubroutineType(types: !136)
!136 = !{!72, !137, !72, !141}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !139, line: 69, baseType: !140)
!139 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 51, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!143 = !DILocalVariable(name: "C", arg: 1, scope: !134, file: !3, line: 69, type: !137)
!144 = !DILocation(line: 69, column: 36, scope: !134)
!145 = !DILocalVariable(name: "step", arg: 2, scope: !134, file: !3, line: 69, type: !72)
!146 = !DILocation(line: 69, column: 43, scope: !134)
!147 = !DILocalVariable(name: "name", arg: 3, scope: !134, file: !3, line: 69, type: !141)
!148 = !DILocation(line: 69, column: 61, scope: !134)
!149 = !DILocalVariable(name: "gpd_ptr", scope: !134, file: !3, line: 71, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPdata", file: !35, line: 144, baseType: !34)
!153 = !DILocation(line: 71, column: 12, scope: !134)
!154 = !DILocalVariable(name: "new_gpd", scope: !134, file: !3, line: 71, type: !151)
!155 = !DILocation(line: 71, column: 29, scope: !134)
!156 = !DILocation(line: 73, column: 41, scope: !134)
!157 = !DILocation(line: 73, column: 12, scope: !134)
!158 = !DILocation(line: 73, column: 10, scope: !134)
!159 = !DILocation(line: 75, column: 6, scope: !160)
!160 = distinct !DILexicalBlock(scope: !134, file: !3, line: 75, column: 6)
!161 = !DILocation(line: 75, column: 11, scope: !160)
!162 = !DILocation(line: 75, column: 6, scope: !134)
!163 = !DILocation(line: 77, column: 7, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !3, line: 77, column: 7)
!165 = distinct !DILexicalBlock(scope: !160, file: !3, line: 75, column: 17)
!166 = !DILocation(line: 77, column: 17, scope: !164)
!167 = !DILocation(line: 77, column: 7, scope: !165)
!168 = !DILocation(line: 78, column: 9, scope: !169)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 78, column: 8)
!170 = distinct !DILexicalBlock(scope: !164, file: !3, line: 77, column: 23)
!171 = !DILocation(line: 78, column: 14, scope: !169)
!172 = !DILocation(line: 78, column: 24, scope: !169)
!173 = !DILocation(line: 78, column: 34, scope: !169)
!174 = !DILocation(line: 78, column: 40, scope: !169)
!175 = !DILocation(line: 78, column: 17, scope: !169)
!176 = !DILocation(line: 78, column: 46, scope: !169)
!177 = !DILocation(line: 78, column: 8, scope: !170)
!178 = !DILocation(line: 79, column: 16, scope: !179)
!179 = distinct !DILexicalBlock(scope: !169, file: !3, line: 78, column: 52)
!180 = !DILocation(line: 79, column: 26, scope: !179)
!181 = !DILocation(line: 79, column: 14, scope: !179)
!182 = !DILocation(line: 80, column: 15, scope: !179)
!183 = !DILocation(line: 80, column: 25, scope: !179)
!184 = !DILocation(line: 80, column: 13, scope: !179)
!185 = !DILocation(line: 81, column: 4, scope: !179)
!186 = !DILocation(line: 82, column: 3, scope: !170)
!187 = !DILocation(line: 83, column: 2, scope: !165)
!188 = !DILocation(line: 84, column: 11, scope: !189)
!189 = distinct !DILexicalBlock(scope: !160, file: !3, line: 84, column: 11)
!190 = !DILocation(line: 84, column: 16, scope: !189)
!191 = !DILocation(line: 84, column: 11, scope: !160)
!192 = !DILocation(line: 86, column: 7, scope: !193)
!193 = distinct !DILexicalBlock(scope: !194, file: !3, line: 86, column: 7)
!194 = distinct !DILexicalBlock(scope: !189, file: !3, line: 84, column: 23)
!195 = !DILocation(line: 86, column: 17, scope: !193)
!196 = !DILocation(line: 86, column: 7, scope: !194)
!197 = !DILocation(line: 87, column: 9, scope: !198)
!198 = distinct !DILexicalBlock(scope: !199, file: !3, line: 87, column: 8)
!199 = distinct !DILexicalBlock(scope: !193, file: !3, line: 86, column: 23)
!200 = !DILocation(line: 87, column: 14, scope: !198)
!201 = !DILocation(line: 87, column: 24, scope: !198)
!202 = !DILocation(line: 87, column: 34, scope: !198)
!203 = !DILocation(line: 87, column: 40, scope: !198)
!204 = !DILocation(line: 87, column: 17, scope: !198)
!205 = !DILocation(line: 87, column: 46, scope: !198)
!206 = !DILocation(line: 87, column: 8, scope: !199)
!207 = !DILocation(line: 88, column: 16, scope: !208)
!208 = distinct !DILexicalBlock(scope: !198, file: !3, line: 87, column: 52)
!209 = !DILocation(line: 88, column: 26, scope: !208)
!210 = !DILocation(line: 88, column: 14, scope: !208)
!211 = !DILocation(line: 89, column: 15, scope: !208)
!212 = !DILocation(line: 89, column: 25, scope: !208)
!213 = !DILocation(line: 89, column: 13, scope: !208)
!214 = !DILocation(line: 90, column: 4, scope: !208)
!215 = !DILocation(line: 91, column: 3, scope: !199)
!216 = !DILocation(line: 92, column: 2, scope: !194)
!217 = !DILocation(line: 94, column: 6, scope: !218)
!218 = distinct !DILexicalBlock(scope: !134, file: !3, line: 94, column: 6)
!219 = !DILocation(line: 94, column: 6, scope: !134)
!220 = !DILocation(line: 95, column: 7, scope: !221)
!221 = distinct !DILexicalBlock(scope: !222, file: !3, line: 95, column: 7)
!222 = distinct !DILexicalBlock(scope: !218, file: !3, line: 94, column: 15)
!223 = !DILocation(line: 95, column: 7, scope: !222)
!224 = !DILocation(line: 96, column: 9, scope: !225)
!225 = distinct !DILexicalBlock(scope: !226, file: !3, line: 96, column: 8)
!226 = distinct !DILexicalBlock(scope: !221, file: !3, line: 95, column: 16)
!227 = !DILocation(line: 96, column: 8, scope: !225)
!228 = !DILocation(line: 96, column: 8, scope: !226)
!229 = !DILocalVariable(name: "gpd", scope: !230, file: !3, line: 97, type: !151)
!230 = distinct !DILexicalBlock(scope: !225, file: !3, line: 96, column: 18)
!231 = !DILocation(line: 97, column: 14, scope: !230)
!232 = !DILocation(line: 97, column: 21, scope: !230)
!233 = !DILocation(line: 97, column: 20, scope: !230)
!234 = !DILocalVariable(name: "gpl", scope: !230, file: !3, line: 98, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPDlayer", file: !35, line: 108, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPDlayer", file: !35, line: 94, size: 1536, elements: !238)
!238 = !{!239, !241, !242, !243, !254, !255, !256, !257, !262}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !35, line: 95, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !237, file: !35, line: 95, baseType: !240, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !237, file: !35, line: 97, baseType: !94, size: 128, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "actframe", scope: !237, file: !35, line: 98, baseType: !244, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPDframe", file: !35, line: 84, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPDframe", file: !35, line: 77, size: 320, elements: !247)
!247 = !{!248, !250, !251, !252, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !35, line: 78, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !246, file: !35, line: 78, baseType: !249, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "strokes", scope: !246, file: !35, line: 80, baseType: !94, size: 128, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !246, file: !35, line: 82, baseType: !72, size: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !246, file: !35, line: 83, baseType: !72, size: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !237, file: !35, line: 100, baseType: !72, size: 32, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "thickness", scope: !237, file: !35, line: 101, baseType: !70, size: 16, offset: 352)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "gstep", scope: !237, file: !35, line: 102, baseType: !70, size: 16, offset: 368)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !237, file: !35, line: 104, baseType: !258, size: 128, offset: 384)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 128, elements: !260)
!259 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!260 = !{!261}
!261 = !DISubrange(count: 4)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !237, file: !35, line: 106, baseType: !263, size: 1024, offset: 512)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 128)
!266 = !DILocation(line: 98, column: 16, scope: !230)
!267 = !DILocalVariable(name: "gpld", scope: !230, file: !3, line: 98, type: !235)
!268 = !DILocation(line: 98, column: 22, scope: !230)
!269 = !DILocation(line: 100, column: 26, scope: !230)
!270 = !DILocation(line: 100, column: 31, scope: !230)
!271 = !DILocation(line: 100, column: 5, scope: !230)
!272 = !DILocation(line: 103, column: 25, scope: !230)
!273 = !DILocation(line: 103, column: 30, scope: !230)
!274 = !DILocation(line: 103, column: 5, scope: !230)
!275 = !DILocation(line: 105, column: 16, scope: !276)
!276 = distinct !DILexicalBlock(scope: !230, file: !3, line: 105, column: 5)
!277 = !DILocation(line: 105, column: 25, scope: !276)
!278 = !DILocation(line: 105, column: 32, scope: !276)
!279 = !DILocation(line: 105, column: 14, scope: !276)
!280 = !DILocation(line: 105, column: 10, scope: !276)
!281 = !DILocation(line: 105, column: 39, scope: !282)
!282 = distinct !DILexicalBlock(scope: !276, file: !3, line: 105, column: 5)
!283 = !DILocation(line: 105, column: 5, scope: !276)
!284 = !DILocation(line: 107, column: 37, scope: !285)
!285 = distinct !DILexicalBlock(scope: !282, file: !3, line: 105, column: 61)
!286 = !DILocation(line: 107, column: 13, scope: !285)
!287 = !DILocation(line: 107, column: 11, scope: !285)
!288 = !DILocation(line: 108, column: 19, scope: !285)
!289 = !DILocation(line: 108, column: 24, scope: !285)
!290 = !DILocation(line: 108, column: 32, scope: !285)
!291 = !DILocation(line: 108, column: 6, scope: !285)
!292 = !DILocation(line: 109, column: 5, scope: !285)
!293 = !DILocation(line: 105, column: 50, scope: !282)
!294 = !DILocation(line: 105, column: 55, scope: !282)
!295 = !DILocation(line: 105, column: 48, scope: !282)
!296 = !DILocation(line: 105, column: 5, scope: !282)
!297 = distinct !{!297, !283, !298}
!298 = !DILocation(line: 109, column: 5, scope: !276)
!299 = !DILocation(line: 110, column: 4, scope: !230)
!300 = !DILocation(line: 111, column: 3, scope: !226)
!301 = !DILocation(line: 112, column: 2, scope: !222)
!302 = !DILocation(line: 114, column: 24, scope: !134)
!303 = !DILocation(line: 114, column: 2, scope: !134)
!304 = !DILocation(line: 116, column: 2, scope: !134)
!305 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !121, file: !121, line: 89, type: !306, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !116)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!309 = !DILocalVariable(name: "lb", arg: 1, scope: !305, file: !121, line: 89, type: !308)
!310 = !DILocation(line: 89, column: 53, scope: !305)
!311 = !DILocation(line: 89, column: 71, scope: !305)
!312 = !DILocation(line: 89, column: 75, scope: !305)
!313 = !DILocation(line: 89, column: 80, scope: !305)
!314 = !DILocation(line: 89, column: 59, scope: !305)
!315 = !DILocation(line: 89, column: 63, scope: !305)
!316 = !DILocation(line: 89, column: 69, scope: !305)
!317 = !DILocation(line: 89, column: 93, scope: !305)
!318 = distinct !DISubprogram(name: "gpencil_undo_init", scope: !3, file: !3, line: 119, type: !319, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !116)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !151}
!321 = !DILocalVariable(name: "gpd", arg: 1, scope: !318, file: !3, line: 119, type: !151)
!322 = !DILocation(line: 119, column: 33, scope: !318)
!323 = !DILocation(line: 121, column: 20, scope: !318)
!324 = !DILocation(line: 121, column: 2, scope: !318)
!325 = !DILocation(line: 122, column: 1, scope: !318)
