; ModuleID = 'blender/source/blender/editors/object/object_relations.c'
source_filename = "blender/source/blender/editors/object/object_relations.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!1262 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eLockAxis_Modes", file: !225, line: 594, baseType: !7, size: 32, elements: !1263)
!1263 = !{!1264, !1265, !1266}
!1264 = !DIEnumerator(name: "LOCK_X", value: 0, isUnsigned: true)
!1265 = !DIEnumerator(name: "LOCK_Y", value: 1, isUnsigned: true)
!1266 = !DIEnumerator(name: "LOCK_Z", value: 2, isUnsigned: true)
!1267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1483, baseType: !7, size: 32, elements: !1268)
!1268 = !{!1269, !1270, !1271, !1272, !1273, !1274, !1275}
!1269 = !DIEnumerator(name: "MAKE_LINKS_OBDATA", value: 1, isUnsigned: true)
!1270 = !DIEnumerator(name: "MAKE_LINKS_MATERIALS", value: 2, isUnsigned: true)
!1271 = !DIEnumerator(name: "MAKE_LINKS_ANIMDATA", value: 3, isUnsigned: true)
!1272 = !DIEnumerator(name: "MAKE_LINKS_GROUP", value: 4, isUnsigned: true)
!1273 = !DIEnumerator(name: "MAKE_LINKS_DUPLIGROUP", value: 5, isUnsigned: true)
!1274 = !DIEnumerator(name: "MAKE_LINKS_MODIFIERS", value: 6, isUnsigned: true)
!1275 = !DIEnumerator(name: "MAKE_LINKS_FONTS", value: 7, isUnsigned: true)
!1276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1277, line: 72, baseType: !7, size: 32, elements: !1278)
!1277 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1278 = !{!1279, !1280, !1281}
!1279 = !DIEnumerator(name: "BKE_MAT_ASSIGN_USERPREF", value: 0, isUnsigned: true)
!1280 = !DIEnumerator(name: "BKE_MAT_ASSIGN_OBDATA", value: 1, isUnsigned: true)
!1281 = !DIEnumerator(name: "BKE_MAT_ASSIGN_OBJECT", value: 2, isUnsigned: true)
!1282 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 394, baseType: !7, size: 32, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296}
!1284 = !DIEnumerator(name: "OB_NEG_SCALE", value: 4, isUnsigned: true)
!1285 = !DIEnumerator(name: "OB_DUPLIFRAMES", value: 8, isUnsigned: true)
!1286 = !DIEnumerator(name: "OB_DUPLIVERTS", value: 16, isUnsigned: true)
!1287 = !DIEnumerator(name: "OB_DUPLIROT", value: 32, isUnsigned: true)
!1288 = !DIEnumerator(name: "OB_DUPLINOSPEED", value: 64, isUnsigned: true)
!1289 = !DIEnumerator(name: "OB_DUPLIGROUP", value: 256, isUnsigned: true)
!1290 = !DIEnumerator(name: "OB_DUPLIFACES", value: 512, isUnsigned: true)
!1291 = !DIEnumerator(name: "OB_DUPLIFACES_SCALE", value: 1024, isUnsigned: true)
!1292 = !DIEnumerator(name: "OB_DUPLIPARTS", value: 2048, isUnsigned: true)
!1293 = !DIEnumerator(name: "OB_RENDER_DUPLI", value: 4096, isUnsigned: true)
!1294 = !DIEnumerator(name: "OB_NO_CONSTRAINTS", value: 8192, isUnsigned: true)
!1295 = !DIEnumerator(name: "OB_NO_PSYS_UPDATE", value: 16384, isUnsigned: true)
!1296 = !DIEnumerator(name: "OB_DUPLI", value: 2840, isUnsigned: true)
!1297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1298, line: 123, baseType: !7, size: 32, elements: !1299)
!1298 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1299 = !{!1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308}
!1300 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!1301 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!1302 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!1303 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!1304 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!1305 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!1306 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!1307 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!1308 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!1309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 2111, baseType: !7, size: 32, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1314}
!1311 = !DIEnumerator(name: "MAKE_LOCAL_SELECT_OB", value: 1, isUnsigned: true)
!1312 = !DIEnumerator(name: "MAKE_LOCAL_SELECT_OBDATA", value: 2, isUnsigned: true)
!1313 = !DIEnumerator(name: "MAKE_LOCAL_SELECT_OBDATA_MATERIAL", value: 3, isUnsigned: true)
!1314 = !DIEnumerator(name: "MAKE_LOCAL_ALL", value: 4, isUnsigned: true)
!1315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1316, line: 50, baseType: !7, size: 32, elements: !1317)
!1316 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_library_query.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1317 = !{!1318}
!1318 = !DIEnumerator(name: "IDWALK_READONLY", value: 1, isUnsigned: true)
!1319 = !{!1320, !1321, !3854, !3864, !3875, !3876, !3877, !3881, !3940, !3942, !3924, !1362, !3944, !3946, !3948, !3950, !1901, !3952}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveModifierData", file: !146, line: 154, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveModifierData", file: !146, line: 147, size: 1536, elements: !1324)
!1324 = !{!1325, !3850, !3851, !3852, !3853}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !1323, file: !146, line: 148, baseType: !1326, size: 896)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !146, line: 110, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !146, line: 99, size: 896, elements: !1328)
!1328 = !{!1329, !1331, !1332, !1334, !1335, !1336, !1337, !1342, !3849}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1327, file: !146, line: 100, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1327, file: !146, line: 100, baseType: !1330, size: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1327, file: !146, line: 102, baseType: !1333, size: 32, offset: 128)
!1333 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1327, file: !146, line: 102, baseType: !1333, size: 32, offset: 160)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !1327, file: !146, line: 103, baseType: !1333, size: 32, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1327, file: !146, line: 103, baseType: !1333, size: 32, offset: 224)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1327, file: !146, line: 104, baseType: !1338, size: 512, offset: 256)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1339, size: 512, elements: !1340)
!1339 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1340 = !{!1341}
!1341 = !DISubrange(count: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1327, file: !146, line: 107, baseType: !1343, size: 64, offset: 768)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1345, line: 1216, size: 39680, elements: !1346)
!1345 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1346 = !{!1347, !1413, !1483, !2801, !2882, !2883, !2884, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !3254, !3476, !3479, !3725, !3737, !3738, !3739, !3740, !3741, !3742, !3743, !3744, !3747, !3748, !3749, !3750, !3751, !3759, !3825, !3832, !3833, !3840, !3841, !3842, !3843, !3844, !3845, !3846}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1344, file: !1345, line: 1217, baseType: !1348, size: 960)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1349, line: 130, baseType: !1350)
!1349 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1349, line: 117, size: 960, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1356, !1375, !1379, !1381, !1382, !1383, !1384}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1350, file: !1349, line: 118, baseType: !1320, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1350, file: !1349, line: 118, baseType: !1320, size: 64, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1350, file: !1349, line: 119, baseType: !1355, size: 64, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1350, file: !1349, line: 120, baseType: !1357, size: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1349, line: 136, size: 17600, elements: !1359)
!1359 = !{!1360, !1361, !1363, !1366, !1370, !1371, !1372}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1358, file: !1349, line: 137, baseType: !1348, size: 960)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1358, file: !1349, line: 138, baseType: !1362, size: 64, offset: 960)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1358, file: !1349, line: 139, baseType: !1364, size: 64, offset: 1024)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1349, line: 43, flags: DIFlagFwdDecl)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1358, file: !1349, line: 140, baseType: !1367, size: 8192, offset: 1088)
!1367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1339, size: 8192, elements: !1368)
!1368 = !{!1369}
!1369 = !DISubrange(count: 1024)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1358, file: !1349, line: 141, baseType: !1367, size: 8192, offset: 9280)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1358, file: !1349, line: 148, baseType: !1357, size: 64, offset: 17472)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1358, file: !1349, line: 150, baseType: !1373, size: 64, offset: 17536)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1349, line: 45, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1350, file: !1349, line: 121, baseType: !1376, size: 528, offset: 256)
!1376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1339, size: 528, elements: !1377)
!1377 = !{!1378}
!1378 = !DISubrange(count: 66)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1350, file: !1349, line: 126, baseType: !1380, size: 16, offset: 784)
!1380 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1350, file: !1349, line: 127, baseType: !1333, size: 32, offset: 800)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1350, file: !1349, line: 128, baseType: !1333, size: 32, offset: 832)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1350, file: !1349, line: 128, baseType: !1333, size: 32, offset: 864)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1350, file: !1349, line: 129, baseType: !1385, size: 64, offset: 896)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1349, line: 75, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1349, line: 62, size: 1024, elements: !1388)
!1388 = !{!1389, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1411, !1412}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1387, file: !1349, line: 63, baseType: !1390, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1387, file: !1349, line: 63, baseType: !1390, size: 64, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1387, file: !1349, line: 64, baseType: !1339, size: 8, offset: 128)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1387, file: !1349, line: 64, baseType: !1339, size: 8, offset: 136)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1387, file: !1349, line: 65, baseType: !1380, size: 16, offset: 144)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1387, file: !1349, line: 66, baseType: !1338, size: 512, offset: 160)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1387, file: !1349, line: 67, baseType: !1333, size: 32, offset: 672)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1387, file: !1349, line: 69, baseType: !1398, size: 256, offset: 704)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1349, line: 60, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1349, line: 48, size: 256, elements: !1400)
!1400 = !{!1401, !1402, !1409, !1410}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1399, file: !1349, line: 49, baseType: !1320, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1399, file: !1349, line: 58, baseType: !1403, size: 128, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1404, line: 71, baseType: !1405)
!1404 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1404, line: 69, size: 128, elements: !1406)
!1406 = !{!1407, !1408}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1405, file: !1404, line: 70, baseType: !1320, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1405, file: !1404, line: 70, baseType: !1320, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1399, file: !1349, line: 59, baseType: !1333, size: 32, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1399, file: !1349, line: 59, baseType: !1333, size: 32, offset: 224)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1387, file: !1349, line: 70, baseType: !1333, size: 32, offset: 960)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1387, file: !1349, line: 74, baseType: !1333, size: 32, offset: 992)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1344, file: !1345, line: 1218, baseType: !1414, size: 64, offset: 960)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !120, line: 838, size: 768, elements: !1416)
!1416 = !{!1417, !1432, !1433, !1443, !1444, !1476, !1477, !1478, !1479, !1480, !1481, !1482}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1415, file: !120, line: 840, baseType: !1418, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !1420, line: 499, baseType: !1421)
!1420 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1420, line: 486, size: 1600, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1421, file: !1420, line: 487, baseType: !1348, size: 960)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1421, file: !1420, line: 489, baseType: !1403, size: 128, offset: 960)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1421, file: !1420, line: 490, baseType: !1403, size: 128, offset: 1088)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1421, file: !1420, line: 491, baseType: !1403, size: 128, offset: 1216)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1421, file: !1420, line: 492, baseType: !1403, size: 128, offset: 1344)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1421, file: !1420, line: 494, baseType: !1333, size: 32, offset: 1472)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1421, file: !1420, line: 495, baseType: !1333, size: 32, offset: 1504)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1421, file: !1420, line: 497, baseType: !1333, size: 32, offset: 1536)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1421, file: !1420, line: 498, baseType: !1333, size: 32, offset: 1568)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1415, file: !120, line: 844, baseType: !1418, size: 64, offset: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1415, file: !120, line: 848, baseType: !1434, size: 64, offset: 128)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !120, line: 549, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !120, line: 544, size: 320, elements: !1437)
!1437 = !{!1438, !1440, !1441, !1442}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1436, file: !120, line: 545, baseType: !1439, size: 64)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1436, file: !120, line: 545, baseType: !1439, size: 64, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1436, file: !120, line: 547, baseType: !1418, size: 64, offset: 128)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1436, file: !120, line: 548, baseType: !1403, size: 128, offset: 192)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1415, file: !120, line: 851, baseType: !1403, size: 128, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1415, file: !120, line: 853, baseType: !1445, size: 64, offset: 320)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !120, line: 594, baseType: !1447)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !120, line: 561, size: 1664, elements: !1448)
!1448 = !{!1449, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1447, file: !120, line: 562, baseType: !1450, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1447, file: !120, line: 562, baseType: !1450, size: 64, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1447, file: !120, line: 564, baseType: !1403, size: 128, offset: 128)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1447, file: !120, line: 565, baseType: !1418, size: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1447, file: !120, line: 566, baseType: !1434, size: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1447, file: !120, line: 568, baseType: !1403, size: 128, offset: 384)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1447, file: !120, line: 569, baseType: !1403, size: 128, offset: 512)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1447, file: !120, line: 571, baseType: !1338, size: 512, offset: 640)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1447, file: !120, line: 573, baseType: !1459, size: 32, offset: 1152)
!1459 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1447, file: !120, line: 574, baseType: !1459, size: 32, offset: 1184)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1447, file: !120, line: 576, baseType: !1459, size: 32, offset: 1216)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1447, file: !120, line: 576, baseType: !1459, size: 32, offset: 1248)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1447, file: !120, line: 577, baseType: !1459, size: 32, offset: 1280)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1447, file: !120, line: 577, baseType: !1459, size: 32, offset: 1312)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1447, file: !120, line: 579, baseType: !1459, size: 32, offset: 1344)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1447, file: !120, line: 580, baseType: !1459, size: 32, offset: 1376)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1447, file: !120, line: 582, baseType: !1459, size: 32, offset: 1408)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1447, file: !120, line: 582, baseType: !1459, size: 32, offset: 1440)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1447, file: !120, line: 583, baseType: !1380, size: 16, offset: 1472)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1447, file: !120, line: 585, baseType: !1380, size: 16, offset: 1488)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1447, file: !120, line: 586, baseType: !1380, size: 16, offset: 1504)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1447, file: !120, line: 588, baseType: !1380, size: 16, offset: 1520)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1447, file: !120, line: 590, baseType: !1320, size: 64, offset: 1536)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1447, file: !120, line: 592, baseType: !1333, size: 32, offset: 1600)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1447, file: !120, line: 593, baseType: !1333, size: 32, offset: 1632)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !1415, file: !120, line: 858, baseType: !1403, size: 128, offset: 384)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !1415, file: !120, line: 859, baseType: !1403, size: 128, offset: 512)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1415, file: !120, line: 862, baseType: !1333, size: 32, offset: 640)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1415, file: !120, line: 863, baseType: !1333, size: 32, offset: 672)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !1415, file: !120, line: 866, baseType: !1380, size: 16, offset: 704)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !1415, file: !120, line: 867, baseType: !1380, size: 16, offset: 720)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !1415, file: !120, line: 868, baseType: !1459, size: 32, offset: 736)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1344, file: !1345, line: 1220, baseType: !1484, size: 64, offset: 1024)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !68, line: 115, size: 11392, elements: !1486)
!1486 = !{!1487, !1488, !1489, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1507, !1518, !1520, !1521, !1564, !1565, !1568, !1569, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2325, !2328, !2329, !2330, !2331, !2332, !2333, !2336, !2359, !2765, !2766, !2772, !2773, !2774, !2775, !2776, !2777, !2779, !2782, !2785, !2786, !2789, !2790}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1485, file: !68, line: 116, baseType: !1348, size: 960)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1485, file: !68, line: 117, baseType: !1414, size: 64, offset: 960)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1485, file: !68, line: 119, baseType: !1490, size: 64, offset: 1024)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64)
!1491 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !68, line: 57, flags: DIFlagFwdDecl)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1485, file: !68, line: 121, baseType: !1380, size: 16, offset: 1088)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1485, file: !68, line: 121, baseType: !1380, size: 16, offset: 1104)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1485, file: !68, line: 122, baseType: !1333, size: 32, offset: 1120)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1485, file: !68, line: 122, baseType: !1333, size: 32, offset: 1152)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1485, file: !68, line: 122, baseType: !1333, size: 32, offset: 1184)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1485, file: !68, line: 123, baseType: !1338, size: 512, offset: 1216)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1485, file: !68, line: 124, baseType: !1484, size: 64, offset: 1728)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1485, file: !68, line: 124, baseType: !1484, size: 64, offset: 1792)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1485, file: !68, line: 127, baseType: !1484, size: 64, offset: 1856)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1485, file: !68, line: 127, baseType: !1484, size: 64, offset: 1920)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1485, file: !68, line: 127, baseType: !1484, size: 64, offset: 1984)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1485, file: !68, line: 128, baseType: !1504, size: 64, offset: 2048)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64)
!1505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1506, line: 46, flags: DIFlagFwdDecl)
!1506 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1485, file: !68, line: 130, baseType: !1508, size: 64, offset: 2112)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64)
!1509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !68, line: 97, size: 832, elements: !1510)
!1510 = !{!1511, !1516, !1517}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1509, file: !68, line: 98, baseType: !1512, size: 768)
!1512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1459, size: 768, elements: !1513)
!1513 = !{!1514, !1515}
!1514 = !DISubrange(count: 8)
!1515 = !DISubrange(count: 3)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1509, file: !68, line: 99, baseType: !1333, size: 32, offset: 768)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1509, file: !68, line: 99, baseType: !1333, size: 32, offset: 800)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1485, file: !68, line: 131, baseType: !1519, size: 64, offset: 2176)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1485, file: !68, line: 132, baseType: !1519, size: 64, offset: 2240)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1485, file: !68, line: 133, baseType: !1522, size: 64, offset: 2304)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1420, line: 334, size: 1728, elements: !1524)
!1524 = !{!1525, !1526, !1529, !1530, !1531, !1532, !1533, !1534, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1563}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1523, file: !1420, line: 335, baseType: !1403, size: 128)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1523, file: !1420, line: 336, baseType: !1527, size: 64, offset: 128)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64)
!1528 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1420, line: 47, flags: DIFlagFwdDecl)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1523, file: !1420, line: 338, baseType: !1380, size: 16, offset: 192)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1523, file: !1420, line: 338, baseType: !1380, size: 16, offset: 208)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1523, file: !1420, line: 339, baseType: !7, size: 32, offset: 224)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1523, file: !1420, line: 340, baseType: !1333, size: 32, offset: 256)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1523, file: !1420, line: 342, baseType: !1459, size: 32, offset: 288)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1523, file: !1420, line: 343, baseType: !1535, size: 96, offset: 320)
!1535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1459, size: 96, elements: !1536)
!1536 = !{!1515}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1523, file: !1420, line: 344, baseType: !1535, size: 96, offset: 416)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1523, file: !1420, line: 347, baseType: !1403, size: 128, offset: 512)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1523, file: !1420, line: 349, baseType: !1333, size: 32, offset: 640)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1523, file: !1420, line: 350, baseType: !1333, size: 32, offset: 672)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1523, file: !1420, line: 351, baseType: !1320, size: 64, offset: 704)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1523, file: !1420, line: 352, baseType: !1320, size: 64, offset: 768)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1523, file: !1420, line: 354, baseType: !1544, size: 384, offset: 832)
!1544 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1420, line: 116, baseType: !1545)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1420, line: 94, size: 384, elements: !1546)
!1546 = !{!1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1545, file: !1420, line: 96, baseType: !1333, size: 32)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1545, file: !1420, line: 96, baseType: !1333, size: 32, offset: 32)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1545, file: !1420, line: 97, baseType: !1333, size: 32, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1545, file: !1420, line: 97, baseType: !1333, size: 32, offset: 96)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1545, file: !1420, line: 99, baseType: !1380, size: 16, offset: 128)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1545, file: !1420, line: 100, baseType: !1380, size: 16, offset: 144)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1545, file: !1420, line: 102, baseType: !1380, size: 16, offset: 160)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1545, file: !1420, line: 105, baseType: !1380, size: 16, offset: 176)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1545, file: !1420, line: 108, baseType: !1380, size: 16, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1545, file: !1420, line: 109, baseType: !1380, size: 16, offset: 208)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1545, file: !1420, line: 111, baseType: !1380, size: 16, offset: 224)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1545, file: !1420, line: 112, baseType: !1380, size: 16, offset: 240)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1545, file: !1420, line: 114, baseType: !1333, size: 32, offset: 256)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1545, file: !1420, line: 114, baseType: !1333, size: 32, offset: 288)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1545, file: !1420, line: 115, baseType: !1333, size: 32, offset: 320)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1545, file: !1420, line: 115, baseType: !1333, size: 32, offset: 352)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1523, file: !1420, line: 355, baseType: !1338, size: 512, offset: 1216)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1485, file: !68, line: 134, baseType: !1320, size: 64, offset: 2368)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1485, file: !68, line: 136, baseType: !1566, size: 64, offset: 2432)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64)
!1567 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1345, line: 61, flags: DIFlagFwdDecl)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1485, file: !68, line: 138, baseType: !1544, size: 384, offset: 2496)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1485, file: !68, line: 139, baseType: !1570, size: 64, offset: 2880)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64)
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1420, line: 80, baseType: !1572)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1420, line: 72, size: 192, elements: !1573)
!1573 = !{!1574, !1581, !1582, !1583, !1584}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1572, file: !1420, line: 73, baseType: !1575, size: 64)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64)
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1420, line: 59, baseType: !1577)
!1577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1420, line: 56, size: 128, elements: !1578)
!1578 = !{!1579, !1580}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1577, file: !1420, line: 57, baseType: !1535, size: 96)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1577, file: !1420, line: 58, baseType: !1333, size: 32, offset: 96)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1572, file: !1420, line: 74, baseType: !1333, size: 32, offset: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1572, file: !1420, line: 76, baseType: !1333, size: 32, offset: 96)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1572, file: !1420, line: 77, baseType: !1333, size: 32, offset: 128)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1572, file: !1420, line: 79, baseType: !1333, size: 32, offset: 160)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1485, file: !68, line: 141, baseType: !1403, size: 128, offset: 2944)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1485, file: !68, line: 142, baseType: !1403, size: 128, offset: 3072)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1485, file: !68, line: 143, baseType: !1403, size: 128, offset: 3200)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1485, file: !68, line: 144, baseType: !1403, size: 128, offset: 3328)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1485, file: !68, line: 146, baseType: !1333, size: 32, offset: 3456)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1485, file: !68, line: 147, baseType: !1333, size: 32, offset: 3488)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1485, file: !68, line: 150, baseType: !1592, size: 64, offset: 3520)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1595, line: 93, size: 7552, elements: !1596)
!1595 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1596 = !{!1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1645, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1714, !1715, !1716, !1717, !1718, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !2189, !2190, !2191, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2237}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1594, file: !1595, line: 94, baseType: !1348, size: 960)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1594, file: !1595, line: 95, baseType: !1414, size: 64, offset: 960)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !1594, file: !1595, line: 97, baseType: !1380, size: 16, offset: 1024)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1594, file: !1595, line: 97, baseType: !1380, size: 16, offset: 1040)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1594, file: !1595, line: 99, baseType: !1459, size: 32, offset: 1056)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1594, file: !1595, line: 99, baseType: !1459, size: 32, offset: 1088)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1594, file: !1595, line: 99, baseType: !1459, size: 32, offset: 1120)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !1594, file: !1595, line: 100, baseType: !1459, size: 32, offset: 1152)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !1594, file: !1595, line: 100, baseType: !1459, size: 32, offset: 1184)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !1594, file: !1595, line: 100, baseType: !1459, size: 32, offset: 1216)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !1594, file: !1595, line: 101, baseType: !1459, size: 32, offset: 1248)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !1594, file: !1595, line: 101, baseType: !1459, size: 32, offset: 1280)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !1594, file: !1595, line: 101, baseType: !1459, size: 32, offset: 1312)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1594, file: !1595, line: 102, baseType: !1459, size: 32, offset: 1344)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1594, file: !1595, line: 102, baseType: !1459, size: 32, offset: 1376)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1594, file: !1595, line: 102, baseType: !1459, size: 32, offset: 1408)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !1594, file: !1595, line: 103, baseType: !1459, size: 32, offset: 1440)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !1594, file: !1595, line: 103, baseType: !1459, size: 32, offset: 1472)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !1594, file: !1595, line: 103, baseType: !1459, size: 32, offset: 1504)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !1594, file: !1595, line: 103, baseType: !1459, size: 32, offset: 1536)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !1594, file: !1595, line: 103, baseType: !1459, size: 32, offset: 1568)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1594, file: !1595, line: 104, baseType: !1459, size: 32, offset: 1600)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1594, file: !1595, line: 104, baseType: !1459, size: 32, offset: 1632)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !1594, file: !1595, line: 104, baseType: !1459, size: 32, offset: 1664)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !1594, file: !1595, line: 104, baseType: !1459, size: 32, offset: 1696)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !1594, file: !1595, line: 104, baseType: !1459, size: 32, offset: 1728)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !1594, file: !1595, line: 105, baseType: !1459, size: 32, offset: 1760)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !1594, file: !1595, line: 108, baseType: !1625, size: 704, offset: 1792)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !1595, line: 53, size: 704, elements: !1626)
!1626 = !{!1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1625, file: !1595, line: 54, baseType: !1459, size: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !1625, file: !1595, line: 55, baseType: !1459, size: 32, offset: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !1625, file: !1595, line: 56, baseType: !1459, size: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !1625, file: !1595, line: 57, baseType: !1459, size: 32, offset: 96)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !1625, file: !1595, line: 59, baseType: !1535, size: 96, offset: 128)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !1625, file: !1595, line: 60, baseType: !1535, size: 96, offset: 224)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !1625, file: !1595, line: 61, baseType: !1535, size: 96, offset: 320)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !1625, file: !1595, line: 63, baseType: !1459, size: 32, offset: 416)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !1625, file: !1595, line: 64, baseType: !1459, size: 32, offset: 448)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !1625, file: !1595, line: 65, baseType: !1459, size: 32, offset: 480)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !1625, file: !1595, line: 67, baseType: !1380, size: 16, offset: 512)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !1625, file: !1595, line: 68, baseType: !1380, size: 16, offset: 528)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !1625, file: !1595, line: 69, baseType: !1380, size: 16, offset: 544)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !1625, file: !1595, line: 70, baseType: !1380, size: 16, offset: 560)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !1625, file: !1595, line: 72, baseType: !1459, size: 32, offset: 576)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !1625, file: !1595, line: 73, baseType: !1459, size: 32, offset: 608)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !1625, file: !1595, line: 74, baseType: !1459, size: 32, offset: 640)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !1625, file: !1595, line: 75, baseType: !1459, size: 32, offset: 672)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !1594, file: !1595, line: 109, baseType: !1646, size: 128, offset: 2496)
!1646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !1595, line: 79, size: 128, elements: !1647)
!1647 = !{!1648, !1649, !1650, !1651}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1646, file: !1595, line: 80, baseType: !1333, size: 32)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !1646, file: !1595, line: 81, baseType: !1333, size: 32, offset: 32)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !1646, file: !1595, line: 82, baseType: !1333, size: 32, offset: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1646, file: !1595, line: 83, baseType: !1333, size: 32, offset: 96)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !1594, file: !1595, line: 111, baseType: !1459, size: 32, offset: 2624)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !1594, file: !1595, line: 111, baseType: !1459, size: 32, offset: 2656)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !1594, file: !1595, line: 112, baseType: !1459, size: 32, offset: 2688)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !1594, file: !1595, line: 112, baseType: !1459, size: 32, offset: 2720)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1594, file: !1595, line: 113, baseType: !1459, size: 32, offset: 2752)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !1594, file: !1595, line: 114, baseType: !1459, size: 32, offset: 2784)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !1594, file: !1595, line: 114, baseType: !1459, size: 32, offset: 2816)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !1594, file: !1595, line: 115, baseType: !1380, size: 16, offset: 2848)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !1594, file: !1595, line: 115, baseType: !1380, size: 16, offset: 2864)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !1594, file: !1595, line: 116, baseType: !1380, size: 16, offset: 2880)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !1594, file: !1595, line: 117, baseType: !1339, size: 8, offset: 2896)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !1594, file: !1595, line: 117, baseType: !1339, size: 8, offset: 2904)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !1594, file: !1595, line: 119, baseType: !1459, size: 32, offset: 2912)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !1594, file: !1595, line: 119, baseType: !1459, size: 32, offset: 2944)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !1594, file: !1595, line: 120, baseType: !1380, size: 16, offset: 2976)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !1594, file: !1595, line: 120, baseType: !1380, size: 16, offset: 2992)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !1594, file: !1595, line: 121, baseType: !1459, size: 32, offset: 3008)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !1594, file: !1595, line: 121, baseType: !1459, size: 32, offset: 3040)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !1594, file: !1595, line: 122, baseType: !1459, size: 32, offset: 3072)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !1594, file: !1595, line: 123, baseType: !1459, size: 32, offset: 3104)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !1594, file: !1595, line: 124, baseType: !1380, size: 16, offset: 3136)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !1594, file: !1595, line: 125, baseType: !1380, size: 16, offset: 3152)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1594, file: !1595, line: 127, baseType: !1333, size: 32, offset: 3168)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !1594, file: !1595, line: 127, baseType: !1333, size: 32, offset: 3200)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !1594, file: !1595, line: 128, baseType: !1333, size: 32, offset: 3232)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !1594, file: !1595, line: 128, baseType: !1333, size: 32, offset: 3264)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !1594, file: !1595, line: 129, baseType: !1380, size: 16, offset: 3296)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !1594, file: !1595, line: 129, baseType: !1380, size: 16, offset: 3312)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !1594, file: !1595, line: 129, baseType: !1380, size: 16, offset: 3328)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !1594, file: !1595, line: 129, baseType: !1380, size: 16, offset: 3344)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !1594, file: !1595, line: 130, baseType: !1459, size: 32, offset: 3360)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !1594, file: !1595, line: 130, baseType: !1459, size: 32, offset: 3392)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !1594, file: !1595, line: 130, baseType: !1459, size: 32, offset: 3424)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !1594, file: !1595, line: 130, baseType: !1459, size: 32, offset: 3456)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !1594, file: !1595, line: 131, baseType: !1459, size: 32, offset: 3488)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !1594, file: !1595, line: 131, baseType: !1459, size: 32, offset: 3520)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !1594, file: !1595, line: 131, baseType: !1459, size: 32, offset: 3552)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !1594, file: !1595, line: 131, baseType: !1459, size: 32, offset: 3584)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !1594, file: !1595, line: 132, baseType: !1459, size: 32, offset: 3616)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !1594, file: !1595, line: 132, baseType: !1459, size: 32, offset: 3648)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !1594, file: !1595, line: 133, baseType: !1338, size: 512, offset: 3680)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !1594, file: !1595, line: 135, baseType: !1459, size: 32, offset: 4192)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !1594, file: !1595, line: 136, baseType: !1459, size: 32, offset: 4224)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !1594, file: !1595, line: 137, baseType: !1459, size: 32, offset: 4256)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !1594, file: !1595, line: 138, baseType: !1333, size: 32, offset: 4288)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !1594, file: !1595, line: 141, baseType: !1339, size: 8, offset: 4320)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1594, file: !1595, line: 141, baseType: !1339, size: 8, offset: 4328)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !1594, file: !1595, line: 141, baseType: !1339, size: 8, offset: 4336)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1594, file: !1595, line: 141, baseType: !1339, size: 8, offset: 4344)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !1594, file: !1595, line: 142, baseType: !1380, size: 16, offset: 4352)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !1594, file: !1595, line: 142, baseType: !1380, size: 16, offset: 4368)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !1594, file: !1595, line: 142, baseType: !1380, size: 16, offset: 4384)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !1594, file: !1595, line: 145, baseType: !1339, size: 8, offset: 4400)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1594, file: !1595, line: 145, baseType: !1339, size: 8, offset: 4408)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !1594, file: !1595, line: 148, baseType: !1380, size: 16, offset: 4416)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !1594, file: !1595, line: 148, baseType: !1380, size: 16, offset: 4432)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !1594, file: !1595, line: 149, baseType: !1459, size: 32, offset: 4448)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !1594, file: !1595, line: 149, baseType: !1459, size: 32, offset: 4480)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1594, file: !1595, line: 152, baseType: !1711, size: 128, offset: 4512)
!1711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1459, size: 128, elements: !1712)
!1712 = !{!1713}
!1713 = !DISubrange(count: 4)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !1594, file: !1595, line: 153, baseType: !1459, size: 32, offset: 4640)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !1594, file: !1595, line: 154, baseType: !1459, size: 32, offset: 4672)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1594, file: !1595, line: 157, baseType: !1380, size: 16, offset: 4704)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1594, file: !1595, line: 157, baseType: !1380, size: 16, offset: 4720)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !1594, file: !1595, line: 160, baseType: !1719, size: 64, offset: 4736)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64)
!1720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !1506, line: 113, size: 6208, elements: !1721)
!1721 = !{!1722, !1723, !1724, !1725, !1726, !1727, !1731}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1720, file: !1506, line: 114, baseType: !1380, size: 16)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1720, file: !1506, line: 114, baseType: !1380, size: 16, offset: 16)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1720, file: !1506, line: 115, baseType: !1339, size: 8, offset: 32)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1720, file: !1506, line: 115, baseType: !1339, size: 8, offset: 40)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1720, file: !1506, line: 116, baseType: !1339, size: 8, offset: 48)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1720, file: !1506, line: 117, baseType: !1728, size: 8, offset: 56)
!1728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1339, size: 8, elements: !1729)
!1729 = !{!1730}
!1730 = !DISubrange(count: 1)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1720, file: !1506, line: 119, baseType: !1732, size: 6144, offset: 64)
!1732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1733, size: 6144, elements: !1742)
!1733 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !1506, line: 109, baseType: !1734)
!1734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !1506, line: 106, size: 192, elements: !1735)
!1735 = !{!1736, !1737, !1738, !1739, !1740, !1741}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1734, file: !1506, line: 107, baseType: !1459, size: 32)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1734, file: !1506, line: 107, baseType: !1459, size: 32, offset: 32)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1734, file: !1506, line: 107, baseType: !1459, size: 32, offset: 64)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1734, file: !1506, line: 107, baseType: !1459, size: 32, offset: 96)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1734, file: !1506, line: 107, baseType: !1459, size: 32, offset: 128)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1734, file: !1506, line: 108, baseType: !1333, size: 32, offset: 160)
!1742 = !{!1743}
!1743 = !DISubrange(count: 32)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !1594, file: !1595, line: 161, baseType: !1719, size: 64, offset: 4800)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !1594, file: !1595, line: 162, baseType: !1339, size: 8, offset: 4864)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !1594, file: !1595, line: 162, baseType: !1339, size: 8, offset: 4872)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !1594, file: !1595, line: 163, baseType: !1339, size: 8, offset: 4880)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !1594, file: !1595, line: 163, baseType: !1339, size: 8, offset: 4888)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !1594, file: !1595, line: 164, baseType: !1380, size: 16, offset: 4896)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1594, file: !1595, line: 164, baseType: !1380, size: 16, offset: 4912)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !1594, file: !1595, line: 165, baseType: !1459, size: 32, offset: 4928)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !1594, file: !1595, line: 165, baseType: !1459, size: 32, offset: 4960)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1594, file: !1595, line: 167, baseType: !1754, size: 1152, offset: 4992)
!1754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1755, size: 1152, elements: !2187)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1506, line: 57, size: 2496, elements: !1757)
!1757 = !{!1758, !1759, !1760, !1761, !1762, !1763, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1756, file: !1506, line: 59, baseType: !1380, size: 16)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1756, file: !1506, line: 59, baseType: !1380, size: 16, offset: 16)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1756, file: !1506, line: 59, baseType: !1380, size: 16, offset: 32)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1756, file: !1506, line: 59, baseType: !1380, size: 16, offset: 48)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1756, file: !1506, line: 60, baseType: !1484, size: 64, offset: 64)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1756, file: !1506, line: 61, baseType: !1764, size: 64, offset: 128)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64)
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1506, line: 202, size: 3328, elements: !1766)
!1766 = !{!1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1836, !1914, !1915, !1996, !1997, !2027, !2028, !2097, !2118, !2126, !2127}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1765, file: !1506, line: 203, baseType: !1348, size: 960)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1765, file: !1506, line: 204, baseType: !1414, size: 64, offset: 960)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1765, file: !1506, line: 206, baseType: !1459, size: 32, offset: 1024)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1765, file: !1506, line: 206, baseType: !1459, size: 32, offset: 1056)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1765, file: !1506, line: 207, baseType: !1459, size: 32, offset: 1088)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1765, file: !1506, line: 207, baseType: !1459, size: 32, offset: 1120)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1765, file: !1506, line: 207, baseType: !1459, size: 32, offset: 1152)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1765, file: !1506, line: 207, baseType: !1459, size: 32, offset: 1184)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1765, file: !1506, line: 207, baseType: !1459, size: 32, offset: 1216)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1765, file: !1506, line: 207, baseType: !1459, size: 32, offset: 1248)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1765, file: !1506, line: 208, baseType: !1459, size: 32, offset: 1280)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1765, file: !1506, line: 208, baseType: !1459, size: 32, offset: 1312)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1765, file: !1506, line: 211, baseType: !1459, size: 32, offset: 1344)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1765, file: !1506, line: 211, baseType: !1459, size: 32, offset: 1376)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1765, file: !1506, line: 211, baseType: !1459, size: 32, offset: 1408)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1765, file: !1506, line: 211, baseType: !1459, size: 32, offset: 1440)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1765, file: !1506, line: 211, baseType: !1459, size: 32, offset: 1472)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1765, file: !1506, line: 214, baseType: !1459, size: 32, offset: 1504)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1765, file: !1506, line: 214, baseType: !1459, size: 32, offset: 1536)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1765, file: !1506, line: 217, baseType: !1459, size: 32, offset: 1568)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1765, file: !1506, line: 218, baseType: !1459, size: 32, offset: 1600)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1765, file: !1506, line: 219, baseType: !1459, size: 32, offset: 1632)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1765, file: !1506, line: 220, baseType: !1459, size: 32, offset: 1664)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1765, file: !1506, line: 221, baseType: !1459, size: 32, offset: 1696)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1765, file: !1506, line: 222, baseType: !1380, size: 16, offset: 1728)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1765, file: !1506, line: 222, baseType: !1380, size: 16, offset: 1744)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1765, file: !1506, line: 224, baseType: !1380, size: 16, offset: 1760)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1765, file: !1506, line: 224, baseType: !1380, size: 16, offset: 1776)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1765, file: !1506, line: 227, baseType: !1380, size: 16, offset: 1792)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1765, file: !1506, line: 227, baseType: !1380, size: 16, offset: 1808)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1765, file: !1506, line: 229, baseType: !1380, size: 16, offset: 1824)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1765, file: !1506, line: 229, baseType: !1380, size: 16, offset: 1840)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1765, file: !1506, line: 230, baseType: !1380, size: 16, offset: 1856)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1765, file: !1506, line: 230, baseType: !1380, size: 16, offset: 1872)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1765, file: !1506, line: 232, baseType: !1459, size: 32, offset: 1888)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1765, file: !1506, line: 232, baseType: !1459, size: 32, offset: 1920)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1765, file: !1506, line: 232, baseType: !1459, size: 32, offset: 1952)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1765, file: !1506, line: 232, baseType: !1459, size: 32, offset: 1984)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1765, file: !1506, line: 233, baseType: !1333, size: 32, offset: 2016)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1765, file: !1506, line: 234, baseType: !1333, size: 32, offset: 2048)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1765, file: !1506, line: 235, baseType: !1380, size: 16, offset: 2080)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1765, file: !1506, line: 235, baseType: !1380, size: 16, offset: 2096)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1765, file: !1506, line: 236, baseType: !1380, size: 16, offset: 2112)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1765, file: !1506, line: 239, baseType: !1380, size: 16, offset: 2128)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1765, file: !1506, line: 240, baseType: !1333, size: 32, offset: 2144)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1765, file: !1506, line: 241, baseType: !1333, size: 32, offset: 2176)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1765, file: !1506, line: 241, baseType: !1333, size: 32, offset: 2208)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1765, file: !1506, line: 241, baseType: !1333, size: 32, offset: 2240)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1765, file: !1506, line: 243, baseType: !1459, size: 32, offset: 2272)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1765, file: !1506, line: 243, baseType: !1459, size: 32, offset: 2304)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1765, file: !1506, line: 244, baseType: !1459, size: 32, offset: 2336)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1765, file: !1506, line: 246, baseType: !1819, size: 320, offset: 2368)
!1819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1820, line: 50, size: 320, elements: !1821)
!1820 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1821 = !{!1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835}
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1819, file: !1820, line: 51, baseType: !1343, size: 64)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1819, file: !1820, line: 53, baseType: !1333, size: 32, offset: 64)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1819, file: !1820, line: 54, baseType: !1333, size: 32, offset: 96)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1819, file: !1820, line: 55, baseType: !1333, size: 32, offset: 128)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1819, file: !1820, line: 55, baseType: !1333, size: 32, offset: 160)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1819, file: !1820, line: 56, baseType: !1339, size: 8, offset: 192)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1819, file: !1820, line: 56, baseType: !1339, size: 8, offset: 200)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1819, file: !1820, line: 57, baseType: !1339, size: 8, offset: 208)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1819, file: !1820, line: 57, baseType: !1339, size: 8, offset: 216)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1819, file: !1820, line: 59, baseType: !1380, size: 16, offset: 224)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1819, file: !1820, line: 59, baseType: !1380, size: 16, offset: 240)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1819, file: !1820, line: 59, baseType: !1380, size: 16, offset: 256)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1819, file: !1820, line: 61, baseType: !1380, size: 16, offset: 272)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1819, file: !1820, line: 63, baseType: !1333, size: 32, offset: 288)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1765, file: !1506, line: 248, baseType: !1837, size: 64, offset: 2688)
!1837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1838, size: 64)
!1838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1839, line: 328, size: 3456, elements: !1840)
!1839 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1840 = !{!1841, !1842, !1843, !1847, !1848, !1851, !1852, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1879, !1880, !1881, !1884, !1889, !1890, !1893, !1897, !1902, !1906, !1910, !1911, !1912, !1913}
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1838, file: !1839, line: 329, baseType: !1348, size: 960)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1838, file: !1839, line: 330, baseType: !1414, size: 64, offset: 960)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1838, file: !1839, line: 332, baseType: !1844, size: 64, offset: 1024)
!1844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1845, size: 64)
!1845 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1846, line: 32, flags: DIFlagFwdDecl)
!1846 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1838, file: !1839, line: 333, baseType: !1338, size: 512, offset: 1088)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1838, file: !1839, line: 335, baseType: !1849, size: 64, offset: 1600)
!1849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1850, size: 64)
!1850 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !34, line: 41, flags: DIFlagFwdDecl)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1838, file: !1839, line: 337, baseType: !1566, size: 64, offset: 1664)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1838, file: !1839, line: 338, baseType: !1853, size: 64, offset: 1728)
!1853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1459, size: 64, elements: !1854)
!1854 = !{!1855}
!1855 = !DISubrange(count: 2)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1838, file: !1839, line: 340, baseType: !1403, size: 128, offset: 1792)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1838, file: !1839, line: 340, baseType: !1403, size: 128, offset: 1920)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1838, file: !1839, line: 342, baseType: !1333, size: 32, offset: 2048)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1838, file: !1839, line: 342, baseType: !1333, size: 32, offset: 2080)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1838, file: !1839, line: 343, baseType: !1333, size: 32, offset: 2112)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1838, file: !1839, line: 345, baseType: !1333, size: 32, offset: 2144)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1838, file: !1839, line: 346, baseType: !1333, size: 32, offset: 2176)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1838, file: !1839, line: 347, baseType: !1380, size: 16, offset: 2208)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1838, file: !1839, line: 348, baseType: !1380, size: 16, offset: 2224)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1838, file: !1839, line: 349, baseType: !1333, size: 32, offset: 2240)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1838, file: !1839, line: 351, baseType: !1333, size: 32, offset: 2272)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1838, file: !1839, line: 353, baseType: !1380, size: 16, offset: 2304)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1838, file: !1839, line: 354, baseType: !1380, size: 16, offset: 2320)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1838, file: !1839, line: 355, baseType: !1333, size: 32, offset: 2336)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1838, file: !1839, line: 357, baseType: !1871, size: 128, offset: 2368)
!1871 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1872, line: 95, baseType: !1873)
!1872 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1872, line: 92, size: 128, elements: !1874)
!1874 = !{!1875, !1876, !1877, !1878}
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1873, file: !1872, line: 93, baseType: !1459, size: 32)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1873, file: !1872, line: 93, baseType: !1459, size: 32, offset: 32)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1873, file: !1872, line: 94, baseType: !1459, size: 32, offset: 64)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1873, file: !1872, line: 94, baseType: !1459, size: 32, offset: 96)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1838, file: !1839, line: 363, baseType: !1403, size: 128, offset: 2496)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1838, file: !1839, line: 363, baseType: !1403, size: 128, offset: 2624)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1838, file: !1839, line: 368, baseType: !1882, size: 64, offset: 2752)
!1882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1883, size: 64)
!1883 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1839, line: 48, flags: DIFlagFwdDecl)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1838, file: !1839, line: 372, baseType: !1885, size: 32, offset: 2816)
!1885 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1839, line: 274, baseType: !1886)
!1886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1839, line: 271, size: 32, elements: !1887)
!1887 = !{!1888}
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1886, file: !1839, line: 273, baseType: !7, size: 32)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1838, file: !1839, line: 373, baseType: !1333, size: 32, offset: 2848)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1838, file: !1839, line: 382, baseType: !1891, size: 64, offset: 2880)
!1891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1892, size: 64)
!1892 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1839, line: 46, flags: DIFlagFwdDecl)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1838, file: !1839, line: 385, baseType: !1894, size: 64, offset: 2944)
!1894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1895, size: 64)
!1895 = !DISubroutineType(types: !1896)
!1896 = !{null, !1320, !1459}
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1838, file: !1839, line: 386, baseType: !1898, size: 64, offset: 3008)
!1898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1899, size: 64)
!1899 = !DISubroutineType(types: !1900)
!1900 = !{null, !1320, !1901}
!1901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1838, file: !1839, line: 387, baseType: !1903, size: 64, offset: 3072)
!1903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1904, size: 64)
!1904 = !DISubroutineType(types: !1905)
!1905 = !{!1333, !1320}
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1838, file: !1839, line: 388, baseType: !1907, size: 64, offset: 3136)
!1907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1908, size: 64)
!1908 = !DISubroutineType(types: !1909)
!1909 = !{null, !1320}
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1838, file: !1839, line: 389, baseType: !1320, size: 64, offset: 3200)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1838, file: !1839, line: 389, baseType: !1320, size: 64, offset: 3264)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1838, file: !1839, line: 389, baseType: !1320, size: 64, offset: 3328)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1838, file: !1839, line: 389, baseType: !1320, size: 64, offset: 3392)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1765, file: !1506, line: 249, baseType: !1504, size: 64, offset: 2752)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !1765, file: !1506, line: 250, baseType: !1916, size: 64, offset: 2816)
!1916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1917, size: 64)
!1917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1820, line: 77, size: 15424, elements: !1918)
!1918 = !{!1919, !1920, !1921, !1924, !1927, !1930, !1933, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1952, !1953, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1985, !1986, !1990}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1917, file: !1820, line: 78, baseType: !1348, size: 960)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1917, file: !1820, line: 80, baseType: !1367, size: 8192, offset: 960)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1917, file: !1820, line: 82, baseType: !1922, size: 64, offset: 9152)
!1922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1923, size: 64)
!1923 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1820, line: 43, flags: DIFlagFwdDecl)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1917, file: !1820, line: 83, baseType: !1925, size: 64, offset: 9216)
!1925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1926, size: 64)
!1926 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1349, line: 46, flags: DIFlagFwdDecl)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1917, file: !1820, line: 86, baseType: !1928, size: 64, offset: 9280)
!1928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1929, size: 64)
!1929 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1820, line: 41, flags: DIFlagFwdDecl)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1917, file: !1820, line: 87, baseType: !1931, size: 64, offset: 9344)
!1931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1932, size: 64)
!1932 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1820, line: 44, flags: DIFlagFwdDecl)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1917, file: !1820, line: 89, baseType: !1934, size: 512, offset: 9408)
!1934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1931, size: 512, elements: !1935)
!1935 = !{!1514}
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1917, file: !1820, line: 90, baseType: !1380, size: 16, offset: 9920)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1917, file: !1820, line: 90, baseType: !1380, size: 16, offset: 9936)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1917, file: !1820, line: 92, baseType: !1380, size: 16, offset: 9952)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1917, file: !1820, line: 92, baseType: !1380, size: 16, offset: 9968)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1917, file: !1820, line: 93, baseType: !1380, size: 16, offset: 9984)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1917, file: !1820, line: 93, baseType: !1380, size: 16, offset: 10000)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1917, file: !1820, line: 94, baseType: !1333, size: 32, offset: 10016)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1917, file: !1820, line: 97, baseType: !1380, size: 16, offset: 10048)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1917, file: !1820, line: 97, baseType: !1380, size: 16, offset: 10064)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1917, file: !1820, line: 98, baseType: !1380, size: 16, offset: 10080)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1917, file: !1820, line: 98, baseType: !1380, size: 16, offset: 10096)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1917, file: !1820, line: 99, baseType: !1380, size: 16, offset: 10112)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1917, file: !1820, line: 99, baseType: !1380, size: 16, offset: 10128)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1917, file: !1820, line: 100, baseType: !7, size: 32, offset: 10144)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1917, file: !1820, line: 101, baseType: !1951, size: 64, offset: 10176)
!1951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1917, file: !1820, line: 103, baseType: !1373, size: 64, offset: 10240)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1917, file: !1820, line: 104, baseType: !1954, size: 64, offset: 10304)
!1954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1955, size: 64)
!1955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1349, line: 159, size: 448, elements: !1956)
!1956 = !{!1957, !1959, !1960, !1962, !1963, !1965}
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1955, file: !1349, line: 161, baseType: !1958, size: 64)
!1958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1854)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1955, file: !1349, line: 162, baseType: !1958, size: 64, offset: 64)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1955, file: !1349, line: 163, baseType: !1961, size: 32, offset: 128)
!1961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1380, size: 32, elements: !1854)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1955, file: !1349, line: 164, baseType: !1961, size: 32, offset: 160)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1955, file: !1349, line: 165, baseType: !1964, size: 128, offset: 192)
!1964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1951, size: 128, elements: !1854)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1955, file: !1349, line: 166, baseType: !1966, size: 128, offset: 320)
!1966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1925, size: 128, elements: !1854)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1917, file: !1820, line: 107, baseType: !1459, size: 32, offset: 10368)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1917, file: !1820, line: 108, baseType: !1333, size: 32, offset: 10400)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1917, file: !1820, line: 109, baseType: !1380, size: 16, offset: 10432)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1917, file: !1820, line: 110, baseType: !1380, size: 16, offset: 10448)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1917, file: !1820, line: 113, baseType: !1333, size: 32, offset: 10464)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1917, file: !1820, line: 113, baseType: !1333, size: 32, offset: 10496)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1917, file: !1820, line: 114, baseType: !1339, size: 8, offset: 10528)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1917, file: !1820, line: 114, baseType: !1339, size: 8, offset: 10536)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1917, file: !1820, line: 115, baseType: !1380, size: 16, offset: 10544)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1917, file: !1820, line: 116, baseType: !1711, size: 128, offset: 10560)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1917, file: !1820, line: 119, baseType: !1459, size: 32, offset: 10688)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1917, file: !1820, line: 119, baseType: !1459, size: 32, offset: 10720)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1917, file: !1820, line: 122, baseType: !1980, size: 512, offset: 10752)
!1980 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1981, line: 182, baseType: !1982)
!1981 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1981, line: 180, size: 512, elements: !1983)
!1983 = !{!1984}
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1982, file: !1981, line: 181, baseType: !1338, size: 512)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1917, file: !1820, line: 123, baseType: !1339, size: 8, offset: 11264)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1917, file: !1820, line: 125, baseType: !1987, size: 56, offset: 11272)
!1987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1339, size: 56, elements: !1988)
!1988 = !{!1989}
!1989 = !DISubrange(count: 7)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1917, file: !1820, line: 126, baseType: !1991, size: 4096, offset: 11328)
!1991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1992, size: 4096, elements: !1935)
!1992 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1820, line: 69, baseType: !1993)
!1993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1820, line: 67, size: 512, elements: !1994)
!1994 = !{!1995}
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1993, file: !1820, line: 68, baseType: !1338, size: 512)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !1765, file: !1506, line: 251, baseType: !1719, size: 64, offset: 2880)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !1765, file: !1506, line: 252, baseType: !1998, size: 64, offset: 2944)
!1998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1999, size: 64)
!1999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !1506, line: 122, size: 1600, elements: !2000)
!2000 = !{!2001, !2002, !2003, !2009, !2012, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026}
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1999, file: !1506, line: 123, baseType: !1484, size: 64)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !1999, file: !1506, line: 124, baseType: !1916, size: 64, offset: 64)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !1999, file: !1506, line: 125, baseType: !2004, size: 384, offset: 128)
!2004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2005, size: 384, elements: !2007)
!2005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2006, size: 64)
!2006 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !1981, line: 136, flags: DIFlagFwdDecl)
!2007 = !{!2008}
!2008 = !DISubrange(count: 6)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1999, file: !1506, line: 126, baseType: !2010, size: 512, offset: 512)
!2010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1459, size: 512, elements: !2011)
!2011 = !{!1713, !1713}
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !1999, file: !1506, line: 127, baseType: !2013, size: 288, offset: 1024)
!2013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1459, size: 288, elements: !2014)
!2014 = !{!1515, !1515}
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1999, file: !1506, line: 128, baseType: !1380, size: 16, offset: 1312)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1999, file: !1506, line: 128, baseType: !1380, size: 16, offset: 1328)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !1999, file: !1506, line: 129, baseType: !1459, size: 32, offset: 1344)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !1999, file: !1506, line: 129, baseType: !1459, size: 32, offset: 1376)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !1999, file: !1506, line: 130, baseType: !1459, size: 32, offset: 1408)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !1999, file: !1506, line: 131, baseType: !7, size: 32, offset: 1440)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !1999, file: !1506, line: 132, baseType: !1380, size: 16, offset: 1472)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1999, file: !1506, line: 132, baseType: !1380, size: 16, offset: 1488)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1999, file: !1506, line: 133, baseType: !1333, size: 32, offset: 1504)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1999, file: !1506, line: 133, baseType: !1333, size: 32, offset: 1536)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1999, file: !1506, line: 134, baseType: !1380, size: 16, offset: 1568)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1999, file: !1506, line: 134, baseType: !1380, size: 16, offset: 1584)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1765, file: !1506, line: 253, baseType: !1954, size: 64, offset: 3008)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1765, file: !1506, line: 254, baseType: !2029, size: 64, offset: 3072)
!2029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2030, size: 64)
!2030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !1506, line: 137, size: 832, elements: !2031)
!2031 = !{!2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2047, !2048, !2049, !2050, !2051, !2053, !2054, !2055, !2056, !2057, !2058}
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2030, file: !1506, line: 138, baseType: !1380, size: 16)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !2030, file: !1506, line: 140, baseType: !1380, size: 16, offset: 16)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !2030, file: !1506, line: 141, baseType: !1459, size: 32, offset: 32)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !2030, file: !1506, line: 142, baseType: !1459, size: 32, offset: 64)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !2030, file: !1506, line: 143, baseType: !1380, size: 16, offset: 96)
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !2030, file: !1506, line: 144, baseType: !1380, size: 16, offset: 112)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !2030, file: !1506, line: 145, baseType: !1333, size: 32, offset: 128)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !2030, file: !1506, line: 147, baseType: !1333, size: 32, offset: 160)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !2030, file: !1506, line: 149, baseType: !1484, size: 64, offset: 192)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !2030, file: !1506, line: 150, baseType: !1333, size: 32, offset: 256)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !2030, file: !1506, line: 151, baseType: !1380, size: 16, offset: 288)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !2030, file: !1506, line: 152, baseType: !1380, size: 16, offset: 304)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !2030, file: !1506, line: 154, baseType: !1320, size: 64, offset: 320)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !2030, file: !1506, line: 155, baseType: !2046, size: 64, offset: 384)
!2046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !2030, file: !1506, line: 157, baseType: !1459, size: 32, offset: 448)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !2030, file: !1506, line: 158, baseType: !1380, size: 16, offset: 480)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !2030, file: !1506, line: 159, baseType: !1380, size: 16, offset: 496)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !2030, file: !1506, line: 160, baseType: !1380, size: 16, offset: 512)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !2030, file: !1506, line: 161, baseType: !2052, size: 48, offset: 528)
!2052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1380, size: 48, elements: !1536)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !2030, file: !1506, line: 162, baseType: !1459, size: 32, offset: 576)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !2030, file: !1506, line: 164, baseType: !1459, size: 32, offset: 608)
