; ModuleID = 'blender/source/blender/makesrna/intern/rna_access.c'
source_filename = "blender/source/blender/makesrna/intern/rna_access.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }

!928 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!929 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!930 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!931 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!932 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!933 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!934 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!935 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!936 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!937 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!938 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!939 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "StructFlag", file: !6, line: 394, baseType: !7, size: 32, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947}
!941 = !DIEnumerator(name: "STRUCT_ID", value: 1, isUnsigned: true)
!942 = !DIEnumerator(name: "STRUCT_ID_REFCOUNT", value: 2, isUnsigned: true)
!943 = !DIEnumerator(name: "STRUCT_UNDO", value: 4, isUnsigned: true)
!944 = !DIEnumerator(name: "STRUCT_RUNTIME", value: 8, isUnsigned: true)
!945 = !DIEnumerator(name: "STRUCT_GENERATED", value: 16, isUnsigned: true)
!946 = !DIEnumerator(name: "STRUCT_FREE_POINTERS", value: 32, isUnsigned: true)
!947 = !DIEnumerator(name: "STRUCT_NO_IDPROPERTIES", value: 64, isUnsigned: true)
!948 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyUnit", file: !6, line: 82, baseType: !7, size: 32, elements: !949)
!949 = !{!950, !951, !952, !953, !954, !955, !956, !957, !958, !959}
!950 = !DIEnumerator(name: "PROP_UNIT_NONE", value: 0, isUnsigned: true)
!951 = !DIEnumerator(name: "PROP_UNIT_LENGTH", value: 65536, isUnsigned: true)
!952 = !DIEnumerator(name: "PROP_UNIT_AREA", value: 131072, isUnsigned: true)
!953 = !DIEnumerator(name: "PROP_UNIT_VOLUME", value: 196608, isUnsigned: true)
!954 = !DIEnumerator(name: "PROP_UNIT_MASS", value: 262144, isUnsigned: true)
!955 = !DIEnumerator(name: "PROP_UNIT_ROTATION", value: 327680, isUnsigned: true)
!956 = !DIEnumerator(name: "PROP_UNIT_TIME", value: 393216, isUnsigned: true)
!957 = !DIEnumerator(name: "PROP_UNIT_VELOCITY", value: 458752, isUnsigned: true)
!958 = !DIEnumerator(name: "PROP_UNIT_ACCELERATION", value: 524288, isUnsigned: true)
!959 = !DIEnumerator(name: "PROP_UNIT_CAMERA", value: 589824, isUnsigned: true)
!960 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRNAEqualsMode", file: !961, line: 1156, baseType: !7, size: 32, elements: !962)
!961 = !DIFile(filename: "blender/source/blender/makesrna/RNA_access.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!962 = !{!963, !964, !965}
!963 = !DIEnumerator(name: "RNA_EQ_STRICT", value: 0, isUnsigned: true)
!964 = !DIEnumerator(name: "RNA_EQ_UNSET_MATCH_ANY", value: 1, isUnsigned: true)
!965 = !DIEnumerator(name: "RNA_EQ_UNSET_MATCH_NONE", value: 2, isUnsigned: true)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !967, line: 519, baseType: !7, size: 32, elements: !968)
!967 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!968 = !{!969, !970, !971, !972}
!969 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!970 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!971 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!972 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !974, line: 67, baseType: !7, size: 32, elements: !975)
!974 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!975 = !{!976, !977, !978, !979, !980, !981, !982, !983, !984}
!976 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!977 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!978 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!979 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!980 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!981 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!982 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!983 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!984 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!985 = !{!986, !48, !987, !1021, !2457, !2459, !2520, !1285, !2586, !2587, !2618, !2647, !2728, !1391, !2760, !2540, !1091, !1375, !2783, !1642, !2784, !2789, !2793, !2797, !1330, !996, !999, !1269, !2801, !1349}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !989, line: 75, baseType: !990)
!989 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !989, line: 62, size: 1024, elements: !991)
!991 = !{!992, !994, !995, !997, !998, !1000, !1004, !1005, !1019, !1020}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !990, file: !989, line: 63, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !990, file: !989, line: 63, baseType: !993, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !990, file: !989, line: 64, baseType: !996, size: 8, offset: 128)
!996 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !990, file: !989, line: 64, baseType: !996, size: 8, offset: 136)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !990, file: !989, line: 65, baseType: !999, size: 16, offset: 144)
!999 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !990, file: !989, line: 66, baseType: !1001, size: 512, offset: 160)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 512, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !990, file: !989, line: 67, baseType: !48, size: 32, offset: 672)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !990, file: !989, line: 69, baseType: !1006, size: 256, offset: 704)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !989, line: 60, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !989, line: 48, size: 256, elements: !1008)
!1008 = !{!1009, !1010, !1017, !1018}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1007, file: !989, line: 49, baseType: !986, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1007, file: !989, line: 58, baseType: !1011, size: 128, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1012, line: 71, baseType: !1013)
!1012 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1012, line: 69, size: 128, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1013, file: !1012, line: 70, baseType: !986, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1013, file: !1012, line: 70, baseType: !986, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1007, file: !989, line: 59, baseType: !48, size: 32, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1007, file: !989, line: 59, baseType: !48, size: 32, offset: 224)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !990, file: !989, line: 70, baseType: !48, size: 32, offset: 960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !990, file: !989, line: 74, baseType: !48, size: 32, offset: 992)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !1024, line: 157, size: 1344, elements: !1025)
!1024 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1025 = !{!1026, !1028, !1029, !1030, !1033, !1034, !1035, !1036, !1037, !1038, !1040, !1042, !1384, !1385, !1389, !1390, !2441, !2442, !2447, !2452, !2453, !2455, !2456}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1023, file: !1024, line: 158, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1023, file: !1024, line: 158, baseType: !1027, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1023, file: !1024, line: 161, baseType: !48, size: 32, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1023, file: !1024, line: 164, baseType: !1031, size: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1023, file: !1024, line: 166, baseType: !48, size: 32, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !1024, line: 169, baseType: !1031, size: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1023, file: !1024, line: 171, baseType: !1031, size: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !1023, file: !1024, line: 173, baseType: !48, size: 32, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1023, file: !1024, line: 175, baseType: !1031, size: 64, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1023, file: !1024, line: 178, baseType: !1039, size: 32, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1023, file: !1024, line: 180, baseType: !1041, size: 32, offset: 608)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !1023, file: !1024, line: 182, baseType: !1043, size: 64, offset: 640)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !1024, line: 73, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!48, !1047, !1330}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !1049)
!1049 = !{!1050, !1054, !1383}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1048, file: !6, line: 58, baseType: !1051, size: 64)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1048, file: !6, line: 56, size: 64, elements: !1052)
!1052 = !{!1053}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1051, file: !6, line: 57, baseType: !986, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1048, file: !6, line: 60, baseType: !1055, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1024, line: 339, size: 1600, elements: !1057)
!1057 = !{!1058, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1086, !1092, !1365, !1370, !1376, !1382}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !1056, file: !1024, line: 341, baseType: !1059, size: 320)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !1024, line: 135, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !1024, line: 130, size: 320, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1068}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1060, file: !1024, line: 131, baseType: !986, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1060, file: !1024, line: 131, baseType: !986, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !1060, file: !1024, line: 133, baseType: !1065, size: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1067, line: 48, flags: DIFlagFwdDecl)
!1067 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1060, file: !1024, line: 134, baseType: !1011, size: 128, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1056, file: !1024, line: 344, baseType: !1031, size: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !1056, file: !1024, line: 348, baseType: !986, size: 64, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !1056, file: !1024, line: 349, baseType: !986, size: 64, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1056, file: !1024, line: 352, baseType: !48, size: 32, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1056, file: !1024, line: 355, baseType: !1031, size: 64, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1056, file: !1024, line: 357, baseType: !1031, size: 64, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1056, file: !1024, line: 359, baseType: !1031, size: 64, offset: 704)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !1056, file: !1024, line: 361, baseType: !48, size: 32, offset: 768)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !1056, file: !1024, line: 364, baseType: !1021, size: 64, offset: 832)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !1056, file: !1024, line: 367, baseType: !1021, size: 64, offset: 896)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1056, file: !1024, line: 370, baseType: !1055, size: 64, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !1056, file: !1024, line: 376, baseType: !1055, size: 64, offset: 1024)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !1056, file: !1024, line: 379, baseType: !1082, size: 64, offset: 1088)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !1024, line: 70, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!1055, !1047}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1056, file: !1024, line: 382, baseType: !1087, size: 64, offset: 1152)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !1024, line: 71, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!1091, !1047}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1056, file: !1024, line: 385, baseType: !1093, size: 64, offset: 1216)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !1094)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!1055, !1097, !1202, !986, !1031, !1326, !1331, !1361}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !1099, line: 53, size: 15232, elements: !1100)
!1099 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1100 = !{!1101, !1102, !1103, !1107, !1108, !1109, !1110, !1111, !1117, !1121, !1122, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1193, !1199}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1098, file: !1099, line: 54, baseType: !1097, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1098, file: !1099, line: 54, baseType: !1097, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1098, file: !1099, line: 55, baseType: !1104, size: 8192, offset: 128)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 8192, elements: !1105)
!1105 = !{!1106}
!1106 = !DISubrange(count: 1024)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !1098, file: !1099, line: 56, baseType: !999, size: 16, offset: 8320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !1098, file: !1099, line: 56, baseType: !999, size: 16, offset: 8336)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !1098, file: !1099, line: 57, baseType: !999, size: 16, offset: 8352)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !1098, file: !1099, line: 57, baseType: !999, size: 16, offset: 8368)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !1098, file: !1099, line: 58, baseType: !1112, size: 64, offset: 8384)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1113, line: 27, baseType: !1114)
!1113 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1115, line: 45, baseType: !1116)
!1115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1116 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !1098, file: !1099, line: 59, baseType: !1118, size: 128, offset: 8448)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 128, elements: !1119)
!1119 = !{!1120}
!1120 = !DISubrange(count: 16)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !1098, file: !1099, line: 60, baseType: !999, size: 16, offset: 8576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !1098, file: !1099, line: 62, baseType: !1123, size: 64, offset: 8640)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !989, line: 136, size: 17600, elements: !1125)
!1125 = !{!1126, !1144, !1146, !1149, !1150, !1151, !1152}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1124, file: !989, line: 137, baseType: !1127, size: 960)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !989, line: 130, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !989, line: 117, size: 960, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1134, !1135, !1139, !1140, !1141, !1142, !1143}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1128, file: !989, line: 118, baseType: !986, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1128, file: !989, line: 118, baseType: !986, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1128, file: !989, line: 119, baseType: !1133, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1128, file: !989, line: 120, baseType: !1123, size: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1128, file: !989, line: 121, baseType: !1136, size: 528, offset: 256)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 528, elements: !1137)
!1137 = !{!1138}
!1138 = !DISubrange(count: 66)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1128, file: !989, line: 126, baseType: !999, size: 16, offset: 784)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1128, file: !989, line: 127, baseType: !48, size: 32, offset: 800)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1128, file: !989, line: 128, baseType: !48, size: 32, offset: 832)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1128, file: !989, line: 128, baseType: !48, size: 32, offset: 864)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1128, file: !989, line: 129, baseType: !987, size: 64, offset: 896)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1124, file: !989, line: 138, baseType: !1145, size: 64, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1124, file: !989, line: 139, baseType: !1147, size: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !989, line: 43, flags: DIFlagFwdDecl)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1124, file: !989, line: 140, baseType: !1104, size: 8192, offset: 1088)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1124, file: !989, line: 141, baseType: !1104, size: 8192, offset: 9280)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1124, file: !989, line: 148, baseType: !1123, size: 64, offset: 17472)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1124, file: !989, line: 150, baseType: !1153, size: 64, offset: 17536)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !989, line: 45, flags: DIFlagFwdDecl)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1098, file: !1099, line: 63, baseType: !1011, size: 128, offset: 8704)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !1098, file: !1099, line: 64, baseType: !1011, size: 128, offset: 8832)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1098, file: !1099, line: 65, baseType: !1011, size: 128, offset: 8960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !1098, file: !1099, line: 66, baseType: !1011, size: 128, offset: 9088)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !1098, file: !1099, line: 67, baseType: !1011, size: 128, offset: 9216)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !1098, file: !1099, line: 68, baseType: !1011, size: 128, offset: 9344)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1098, file: !1099, line: 69, baseType: !1011, size: 128, offset: 9472)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1098, file: !1099, line: 70, baseType: !1011, size: 128, offset: 9600)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1098, file: !1099, line: 71, baseType: !1011, size: 128, offset: 9728)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !1098, file: !1099, line: 72, baseType: !1011, size: 128, offset: 9856)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !1098, file: !1099, line: 73, baseType: !1011, size: 128, offset: 9984)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1098, file: !1099, line: 74, baseType: !1011, size: 128, offset: 10112)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1098, file: !1099, line: 75, baseType: !1011, size: 128, offset: 10240)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1098, file: !1099, line: 76, baseType: !1011, size: 128, offset: 10368)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1098, file: !1099, line: 77, baseType: !1011, size: 128, offset: 10496)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1098, file: !1099, line: 78, baseType: !1011, size: 128, offset: 10624)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !1098, file: !1099, line: 79, baseType: !1011, size: 128, offset: 10752)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !1098, file: !1099, line: 80, baseType: !1011, size: 128, offset: 10880)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1098, file: !1099, line: 81, baseType: !1011, size: 128, offset: 11008)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !1098, file: !1099, line: 82, baseType: !1011, size: 128, offset: 11136)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1098, file: !1099, line: 83, baseType: !1011, size: 128, offset: 11264)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1098, file: !1099, line: 84, baseType: !1011, size: 128, offset: 11392)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !1098, file: !1099, line: 85, baseType: !1011, size: 128, offset: 11520)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1098, file: !1099, line: 86, baseType: !1011, size: 128, offset: 11648)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1098, file: !1099, line: 87, baseType: !1011, size: 128, offset: 11776)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1098, file: !1099, line: 88, baseType: !1011, size: 128, offset: 11904)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !1098, file: !1099, line: 89, baseType: !1011, size: 128, offset: 12032)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !1098, file: !1099, line: 90, baseType: !1011, size: 128, offset: 12160)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !1098, file: !1099, line: 91, baseType: !1011, size: 128, offset: 12288)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !1098, file: !1099, line: 92, baseType: !1011, size: 128, offset: 12416)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !1098, file: !1099, line: 93, baseType: !1011, size: 128, offset: 12544)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !1098, file: !1099, line: 94, baseType: !1011, size: 128, offset: 12672)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1098, file: !1099, line: 95, baseType: !1011, size: 128, offset: 12800)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !1098, file: !1099, line: 96, baseType: !1011, size: 128, offset: 12928)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !1098, file: !1099, line: 98, baseType: !1190, size: 2048, offset: 13056)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 2048, elements: !1191)
!1191 = !{!1192}
!1192 = !DISubrange(count: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !1098, file: !1099, line: 101, baseType: !1194, size: 64, offset: 15104)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !1196, line: 58, size: 32, elements: !1197)
!1196 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1197 = !{!1198}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1195, file: !1196, line: 59, baseType: !48, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1098, file: !1099, line: 103, baseType: !1200, size: 64, offset: 15168)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !1099, line: 51, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !974, line: 106, size: 320, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209, !1210}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1203, file: !974, line: 107, baseType: !1011, size: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !1203, file: !974, line: 108, baseType: !48, size: 32, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !1203, file: !974, line: 109, baseType: !48, size: 32, offset: 160)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1203, file: !974, line: 110, baseType: !48, size: 32, offset: 192)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1203, file: !974, line: 110, baseType: !48, size: 32, offset: 224)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !1203, file: !974, line: 111, baseType: !1211, size: 64, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1213, line: 490, size: 768, elements: !1214)
!1213 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1214 = !{!1215, !1216, !1217, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1212, file: !1213, line: 491, baseType: !1211, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1212, file: !1213, line: 491, baseType: !1211, size: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1212, file: !1213, line: 493, baseType: !1218, size: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !974, line: 169, size: 2048, elements: !1220)
!1220 = !{!1221, !1222, !1223, !1224, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1292, !1295, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1219, file: !974, line: 170, baseType: !1218, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1219, file: !974, line: 170, baseType: !1218, size: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1219, file: !974, line: 172, baseType: !986, size: 64, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1219, file: !974, line: 174, baseType: !1225, size: 64, offset: 192)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !974, line: 53, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !1219, file: !974, line: 175, baseType: !1225, size: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !1219, file: !974, line: 176, baseType: !1001, size: 512, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !1219, file: !974, line: 178, baseType: !999, size: 16, offset: 832)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !1219, file: !974, line: 178, baseType: !999, size: 16, offset: 848)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1219, file: !974, line: 178, baseType: !999, size: 16, offset: 864)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1219, file: !974, line: 178, baseType: !999, size: 16, offset: 880)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !1219, file: !974, line: 179, baseType: !999, size: 16, offset: 896)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !1219, file: !974, line: 180, baseType: !999, size: 16, offset: 912)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1219, file: !974, line: 181, baseType: !999, size: 16, offset: 928)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1219, file: !974, line: 182, baseType: !999, size: 16, offset: 944)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !1219, file: !974, line: 183, baseType: !999, size: 16, offset: 960)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !1219, file: !974, line: 184, baseType: !999, size: 16, offset: 976)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !1219, file: !974, line: 185, baseType: !999, size: 16, offset: 992)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !1219, file: !974, line: 186, baseType: !999, size: 16, offset: 1008)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !1219, file: !974, line: 188, baseType: !48, size: 32, offset: 1024)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !1219, file: !974, line: 190, baseType: !999, size: 16, offset: 1056)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !1219, file: !974, line: 191, baseType: !999, size: 16, offset: 1072)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !1219, file: !974, line: 194, baseType: !1245, size: 64, offset: 1088)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !1213, line: 421, size: 960, elements: !1247)
!1247 = !{!1248, !1249, !1250, !1251, !1252, !1253, !1254, !1258, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1288, !1289, !1290, !1291}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1246, file: !1213, line: 422, baseType: !1245, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1246, file: !1213, line: 422, baseType: !1245, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1246, file: !1213, line: 424, baseType: !999, size: 16, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1246, file: !1213, line: 425, baseType: !999, size: 16, offset: 144)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1246, file: !1213, line: 426, baseType: !48, size: 32, offset: 160)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1246, file: !1213, line: 426, baseType: !48, size: 32, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !1246, file: !1213, line: 427, baseType: !1255, size: 64, offset: 224)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !1256)
!1256 = !{!1257}
!1257 = !DISubrange(count: 2)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !1246, file: !1213, line: 428, baseType: !1259, size: 48, offset: 288)
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 48, elements: !1260)
!1260 = !{!1261}
!1261 = !DISubrange(count: 6)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !1246, file: !1213, line: 431, baseType: !996, size: 8, offset: 336)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1246, file: !1213, line: 432, baseType: !996, size: 8, offset: 344)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !1246, file: !1213, line: 435, baseType: !999, size: 16, offset: 352)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !1246, file: !1213, line: 436, baseType: !999, size: 16, offset: 368)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !1246, file: !1213, line: 437, baseType: !48, size: 32, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !1246, file: !1213, line: 437, baseType: !48, size: 32, offset: 416)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !1246, file: !1213, line: 438, baseType: !1269, size: 64, offset: 448)
!1269 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !1246, file: !1213, line: 439, baseType: !48, size: 32, offset: 512)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !1246, file: !1213, line: 439, baseType: !48, size: 32, offset: 544)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1246, file: !1213, line: 442, baseType: !999, size: 16, offset: 576)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !1246, file: !1213, line: 442, baseType: !999, size: 16, offset: 592)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1246, file: !1213, line: 442, baseType: !999, size: 16, offset: 608)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !1246, file: !1213, line: 442, baseType: !999, size: 16, offset: 624)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !1246, file: !1213, line: 443, baseType: !999, size: 16, offset: 640)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !1246, file: !1213, line: 446, baseType: !999, size: 16, offset: 656)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !1246, file: !1213, line: 449, baseType: !1031, size: 64, offset: 704)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !1246, file: !1213, line: 452, baseType: !1280, size: 64, offset: 768)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !1213, line: 463, size: 128, elements: !1282)
!1282 = !{!1283, !1284, !1286, !1287}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1281, file: !1213, line: 464, baseType: !48, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1281, file: !1213, line: 465, baseType: !1285, size: 32, offset: 32)
!1285 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1281, file: !1213, line: 466, baseType: !1285, size: 32, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1281, file: !1213, line: 467, baseType: !1285, size: 32, offset: 96)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !1246, file: !1213, line: 455, baseType: !999, size: 16, offset: 832)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !1246, file: !1213, line: 456, baseType: !999, size: 16, offset: 848)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1246, file: !1213, line: 457, baseType: !48, size: 32, offset: 864)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1246, file: !1213, line: 458, baseType: !986, size: 64, offset: 896)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !1219, file: !974, line: 196, baseType: !1293, size: 64, offset: 1152)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !974, line: 55, flags: DIFlagFwdDecl)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !1219, file: !974, line: 198, baseType: !1296, size: 64, offset: 1216)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !1213, line: 398, size: 448, elements: !1298)
!1298 = !{!1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1297, file: !1213, line: 399, baseType: !1296, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1297, file: !1213, line: 399, baseType: !1296, size: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !1297, file: !1213, line: 400, baseType: !48, size: 32, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1297, file: !1213, line: 401, baseType: !48, size: 32, offset: 160)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1297, file: !1213, line: 402, baseType: !48, size: 32, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1297, file: !1213, line: 403, baseType: !48, size: 32, offset: 224)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1297, file: !1213, line: 404, baseType: !48, size: 32, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1297, file: !1213, line: 405, baseType: !48, size: 32, offset: 288)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1297, file: !1213, line: 407, baseType: !986, size: 64, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !1297, file: !1213, line: 414, baseType: !986, size: 64, offset: 384)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !1219, file: !974, line: 200, baseType: !48, size: 32, offset: 1280)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !1219, file: !974, line: 200, baseType: !48, size: 32, offset: 1312)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !1219, file: !974, line: 201, baseType: !986, size: 64, offset: 1344)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !1219, file: !974, line: 203, baseType: !1011, size: 128, offset: 1408)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !1219, file: !974, line: 204, baseType: !1011, size: 128, offset: 1536)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !1219, file: !974, line: 205, baseType: !1011, size: 128, offset: 1664)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !1219, file: !974, line: 207, baseType: !1011, size: 128, offset: 1792)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !1219, file: !974, line: 208, baseType: !1011, size: 128, offset: 1920)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !1212, file: !1213, line: 495, baseType: !1269, size: 64, offset: 192)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !1212, file: !1213, line: 496, baseType: !48, size: 32, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1212, file: !1213, line: 497, baseType: !986, size: 64, offset: 320)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1212, file: !1213, line: 499, baseType: !1269, size: 64, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !1212, file: !1213, line: 500, baseType: !1269, size: 64, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !1212, file: !1213, line: 502, baseType: !1269, size: 64, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !1212, file: !1213, line: 503, baseType: !1269, size: 64, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !1212, file: !1213, line: 504, baseType: !1269, size: 64, offset: 640)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !1212, file: !1213, line: 505, baseType: !48, size: 32, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !1327)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!48, !1047, !986, !1330}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !1332)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!48, !1335, !1047, !1337, !1351}
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !974, line: 51, flags: DIFlagFwdDecl)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !1024, line: 137, size: 640, elements: !1339)
!1339 = !{!1340, !1341, !1342, !1343, !1344, !1360}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !1338, file: !1024, line: 139, baseType: !1059, size: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1338, file: !1024, line: 142, baseType: !1031, size: 64, offset: 320)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1338, file: !1024, line: 144, baseType: !48, size: 32, offset: 384)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1338, file: !1024, line: 147, baseType: !1031, size: 64, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1338, file: !1024, line: 150, baseType: !1345, size: 64, offset: 512)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !1346)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{null, !1335, !1202, !1349, !1351}
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !1048)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !1354)
!1354 = !{!1355, !1356, !1357, !1358, !1359}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1353, file: !6, line: 339, baseType: !986, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1353, file: !6, line: 342, baseType: !1337, size: 64, offset: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1353, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1353, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1353, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !1338, file: !1024, line: 154, baseType: !1021, size: 64, offset: 576)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{null, !986}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !1056, file: !1024, line: 386, baseType: !1366, size: 64, offset: 1280)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !1367)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{null, !1097, !1055}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !1056, file: !1024, line: 387, baseType: !1371, size: 64, offset: 1344)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{!1375, !1349}
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !1056, file: !1024, line: 390, baseType: !1377, size: 64, offset: 1408)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !1024, line: 69, baseType: !1378)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!993, !1047, !1381}
!1381 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !1056, file: !1024, line: 393, baseType: !1011, size: 128, offset: 1472)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1048, file: !6, line: 61, baseType: !986, size: 64, offset: 128)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !1023, file: !1024, line: 184, baseType: !7, size: 32, offset: 704)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !1023, file: !1024, line: 186, baseType: !1386, size: 96, offset: 736)
!1386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !1387)
!1387 = !{!1388}
!1388 = !DISubrange(count: 3)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !1023, file: !1024, line: 187, baseType: !7, size: 32, offset: 832)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1023, file: !1024, line: 190, baseType: !1391, size: 64, offset: 896)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !1024, line: 64, baseType: !1392)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{null, !1097, !1395, !1047}
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1397, line: 1216, size: 39680, elements: !1398)
!1397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1398 = !{!1399, !1400, !1403, !1683, !1686, !1687, !1688, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1714, !1717, !1720, !2015, !2018, !2314, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2336, !2337, !2338, !2339, !2340, !2348, !2415, !2422, !2423, !2430, !2433, !2434, !2435, !2436, !2437, !2438}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1396, file: !1397, line: 1217, baseType: !1127, size: 960)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1396, file: !1397, line: 1218, baseType: !1401, size: 64, offset: 960)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1397, line: 58, flags: DIFlagFwdDecl)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1396, file: !1397, line: 1220, baseType: !1404, size: 64, offset: 1024)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !967, line: 115, size: 11392, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1427, !1437, !1451, !1452, !1492, !1493, !1496, !1497, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1538, !1539, !1540, !1541, !1542, !1543, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1614, !1617, !1621, !1622, !1623, !1624, !1625, !1628, !1631, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1643, !1646, !1649, !1651, !1671, !1672}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1405, file: !967, line: 116, baseType: !1127, size: 960)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1405, file: !967, line: 117, baseType: !1401, size: 64, offset: 960)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1405, file: !967, line: 119, baseType: !1410, size: 64, offset: 1024)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !967, line: 57, flags: DIFlagFwdDecl)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1405, file: !967, line: 121, baseType: !999, size: 16, offset: 1088)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1405, file: !967, line: 121, baseType: !999, size: 16, offset: 1104)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1405, file: !967, line: 122, baseType: !48, size: 32, offset: 1120)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1405, file: !967, line: 122, baseType: !48, size: 32, offset: 1152)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1405, file: !967, line: 122, baseType: !48, size: 32, offset: 1184)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1405, file: !967, line: 123, baseType: !1001, size: 512, offset: 1216)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1405, file: !967, line: 124, baseType: !1404, size: 64, offset: 1728)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1405, file: !967, line: 124, baseType: !1404, size: 64, offset: 1792)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1405, file: !967, line: 127, baseType: !1404, size: 64, offset: 1856)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1405, file: !967, line: 127, baseType: !1404, size: 64, offset: 1920)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1405, file: !967, line: 127, baseType: !1404, size: 64, offset: 1984)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1405, file: !967, line: 128, baseType: !1424, size: 64, offset: 2048)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1426, line: 44, flags: DIFlagFwdDecl)
!1426 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1405, file: !967, line: 130, baseType: !1428, size: 64, offset: 2112)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !967, line: 97, size: 832, elements: !1430)
!1430 = !{!1431, !1435, !1436}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1429, file: !967, line: 98, baseType: !1432, size: 768)
!1432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1285, size: 768, elements: !1433)
!1433 = !{!1434, !1388}
!1434 = !DISubrange(count: 8)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1429, file: !967, line: 99, baseType: !48, size: 32, offset: 768)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1429, file: !967, line: 99, baseType: !48, size: 32, offset: 800)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1405, file: !967, line: 131, baseType: !1438, size: 64, offset: 2176)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1440, line: 486, size: 1600, elements: !1441)
!1440 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1439, file: !1440, line: 487, baseType: !1127, size: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1439, file: !1440, line: 489, baseType: !1011, size: 128, offset: 960)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1439, file: !1440, line: 490, baseType: !1011, size: 128, offset: 1088)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1439, file: !1440, line: 491, baseType: !1011, size: 128, offset: 1216)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1439, file: !1440, line: 492, baseType: !1011, size: 128, offset: 1344)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1439, file: !1440, line: 494, baseType: !48, size: 32, offset: 1472)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1439, file: !1440, line: 495, baseType: !48, size: 32, offset: 1504)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1439, file: !1440, line: 497, baseType: !48, size: 32, offset: 1536)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1439, file: !1440, line: 498, baseType: !48, size: 32, offset: 1568)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1405, file: !967, line: 132, baseType: !1438, size: 64, offset: 2240)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1405, file: !967, line: 133, baseType: !1453, size: 64, offset: 2304)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1440, line: 334, size: 1728, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1491}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1454, file: !1440, line: 335, baseType: !1011, size: 128)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1454, file: !1440, line: 336, baseType: !1065, size: 64, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1454, file: !1440, line: 338, baseType: !999, size: 16, offset: 192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1454, file: !1440, line: 338, baseType: !999, size: 16, offset: 208)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1454, file: !1440, line: 339, baseType: !7, size: 32, offset: 224)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1454, file: !1440, line: 340, baseType: !48, size: 32, offset: 256)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1454, file: !1440, line: 342, baseType: !1285, size: 32, offset: 288)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1454, file: !1440, line: 343, baseType: !1464, size: 96, offset: 320)
!1464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1285, size: 96, elements: !1387)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1454, file: !1440, line: 344, baseType: !1464, size: 96, offset: 416)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1454, file: !1440, line: 347, baseType: !1011, size: 128, offset: 512)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1454, file: !1440, line: 349, baseType: !48, size: 32, offset: 640)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1454, file: !1440, line: 350, baseType: !48, size: 32, offset: 672)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1454, file: !1440, line: 351, baseType: !986, size: 64, offset: 704)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1454, file: !1440, line: 352, baseType: !986, size: 64, offset: 768)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1454, file: !1440, line: 354, baseType: !1472, size: 384, offset: 832)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1440, line: 116, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1440, line: 94, size: 384, elements: !1474)
!1474 = !{!1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1473, file: !1440, line: 96, baseType: !48, size: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1473, file: !1440, line: 96, baseType: !48, size: 32, offset: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1473, file: !1440, line: 97, baseType: !48, size: 32, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1473, file: !1440, line: 97, baseType: !48, size: 32, offset: 96)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1473, file: !1440, line: 99, baseType: !999, size: 16, offset: 128)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1473, file: !1440, line: 100, baseType: !999, size: 16, offset: 144)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1473, file: !1440, line: 102, baseType: !999, size: 16, offset: 160)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1473, file: !1440, line: 105, baseType: !999, size: 16, offset: 176)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1473, file: !1440, line: 108, baseType: !999, size: 16, offset: 192)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1473, file: !1440, line: 109, baseType: !999, size: 16, offset: 208)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1473, file: !1440, line: 111, baseType: !999, size: 16, offset: 224)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1473, file: !1440, line: 112, baseType: !999, size: 16, offset: 240)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1473, file: !1440, line: 114, baseType: !48, size: 32, offset: 256)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1473, file: !1440, line: 114, baseType: !48, size: 32, offset: 288)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1473, file: !1440, line: 115, baseType: !48, size: 32, offset: 320)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1473, file: !1440, line: 115, baseType: !48, size: 32, offset: 352)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1454, file: !1440, line: 355, baseType: !1001, size: 512, offset: 1216)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1405, file: !967, line: 134, baseType: !986, size: 64, offset: 2368)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1405, file: !967, line: 136, baseType: !1494, size: 64, offset: 2432)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64)
!1495 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1397, line: 61, flags: DIFlagFwdDecl)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1405, file: !967, line: 138, baseType: !1472, size: 384, offset: 2496)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1405, file: !967, line: 139, baseType: !1498, size: 64, offset: 2880)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64)
!1499 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1440, line: 80, baseType: !1500)
!1500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1440, line: 72, size: 192, elements: !1501)
!1501 = !{!1502, !1509, !1510, !1511, !1512}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1500, file: !1440, line: 73, baseType: !1503, size: 64)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1440, line: 59, baseType: !1505)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1440, line: 56, size: 128, elements: !1506)
!1506 = !{!1507, !1508}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1505, file: !1440, line: 57, baseType: !1464, size: 96)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1505, file: !1440, line: 58, baseType: !48, size: 32, offset: 96)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1500, file: !1440, line: 74, baseType: !48, size: 32, offset: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1500, file: !1440, line: 76, baseType: !48, size: 32, offset: 96)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1500, file: !1440, line: 77, baseType: !48, size: 32, offset: 128)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1500, file: !1440, line: 79, baseType: !48, size: 32, offset: 160)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1405, file: !967, line: 141, baseType: !1011, size: 128, offset: 2944)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1405, file: !967, line: 142, baseType: !1011, size: 128, offset: 3072)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1405, file: !967, line: 143, baseType: !1011, size: 128, offset: 3200)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1405, file: !967, line: 144, baseType: !1011, size: 128, offset: 3328)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1405, file: !967, line: 146, baseType: !48, size: 32, offset: 3456)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1405, file: !967, line: 147, baseType: !48, size: 32, offset: 3488)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1405, file: !967, line: 150, baseType: !1520, size: 64, offset: 3520)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1397, line: 179, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1405, file: !967, line: 151, baseType: !1091, size: 64, offset: 3584)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1405, file: !967, line: 152, baseType: !48, size: 32, offset: 3648)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1405, file: !967, line: 153, baseType: !48, size: 32, offset: 3680)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1405, file: !967, line: 156, baseType: !1464, size: 96, offset: 3712)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1405, file: !967, line: 156, baseType: !1464, size: 96, offset: 3808)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1405, file: !967, line: 156, baseType: !1464, size: 96, offset: 3904)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1405, file: !967, line: 157, baseType: !1464, size: 96, offset: 4000)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1405, file: !967, line: 158, baseType: !1464, size: 96, offset: 4096)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1405, file: !967, line: 159, baseType: !1464, size: 96, offset: 4192)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1405, file: !967, line: 160, baseType: !1464, size: 96, offset: 4288)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1405, file: !967, line: 160, baseType: !1464, size: 96, offset: 4384)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1405, file: !967, line: 161, baseType: !1535, size: 128, offset: 4480)
!1535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1285, size: 128, elements: !1536)
!1536 = !{!1537}
!1537 = !DISubrange(count: 4)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1405, file: !967, line: 161, baseType: !1535, size: 128, offset: 4608)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1405, file: !967, line: 162, baseType: !1464, size: 96, offset: 4736)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1405, file: !967, line: 162, baseType: !1464, size: 96, offset: 4832)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1405, file: !967, line: 163, baseType: !1285, size: 32, offset: 4928)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1405, file: !967, line: 163, baseType: !1285, size: 32, offset: 4960)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1405, file: !967, line: 164, baseType: !1544, size: 512, offset: 4992)
!1544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1285, size: 512, elements: !1545)
!1545 = !{!1537, !1537}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1405, file: !967, line: 165, baseType: !1544, size: 512, offset: 5504)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1405, file: !967, line: 166, baseType: !1544, size: 512, offset: 6016)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1405, file: !967, line: 167, baseType: !1544, size: 512, offset: 6528)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1405, file: !967, line: 176, baseType: !1544, size: 512, offset: 7040)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1405, file: !967, line: 178, baseType: !7, size: 32, offset: 7552)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1405, file: !967, line: 180, baseType: !999, size: 16, offset: 7584)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1405, file: !967, line: 181, baseType: !999, size: 16, offset: 7600)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1405, file: !967, line: 183, baseType: !999, size: 16, offset: 7616)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1405, file: !967, line: 183, baseType: !999, size: 16, offset: 7632)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1405, file: !967, line: 184, baseType: !999, size: 16, offset: 7648)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1405, file: !967, line: 184, baseType: !999, size: 16, offset: 7664)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1405, file: !967, line: 185, baseType: !999, size: 16, offset: 7680)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1405, file: !967, line: 186, baseType: !999, size: 16, offset: 7696)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1405, file: !967, line: 187, baseType: !999, size: 16, offset: 7712)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1405, file: !967, line: 188, baseType: !996, size: 8, offset: 7728)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1405, file: !967, line: 189, baseType: !996, size: 8, offset: 7736)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1405, file: !967, line: 192, baseType: !48, size: 32, offset: 7744)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1405, file: !967, line: 192, baseType: !48, size: 32, offset: 7776)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1405, file: !967, line: 192, baseType: !48, size: 32, offset: 7808)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1405, file: !967, line: 192, baseType: !48, size: 32, offset: 7840)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1405, file: !967, line: 194, baseType: !48, size: 32, offset: 7872)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1405, file: !967, line: 202, baseType: !1285, size: 32, offset: 7904)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1405, file: !967, line: 202, baseType: !1285, size: 32, offset: 7936)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1405, file: !967, line: 202, baseType: !1285, size: 32, offset: 7968)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1405, file: !967, line: 211, baseType: !1285, size: 32, offset: 8000)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1405, file: !967, line: 212, baseType: !1285, size: 32, offset: 8032)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1405, file: !967, line: 213, baseType: !1285, size: 32, offset: 8064)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1405, file: !967, line: 214, baseType: !1285, size: 32, offset: 8096)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1405, file: !967, line: 215, baseType: !1285, size: 32, offset: 8128)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1405, file: !967, line: 216, baseType: !1285, size: 32, offset: 8160)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1405, file: !967, line: 219, baseType: !1285, size: 32, offset: 8192)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1405, file: !967, line: 220, baseType: !1285, size: 32, offset: 8224)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1405, file: !967, line: 221, baseType: !1285, size: 32, offset: 8256)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1405, file: !967, line: 224, baseType: !1580, size: 16, offset: 8288)
!1580 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1405, file: !967, line: 224, baseType: !1580, size: 16, offset: 8304)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1405, file: !967, line: 226, baseType: !999, size: 16, offset: 8320)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1405, file: !967, line: 228, baseType: !996, size: 8, offset: 8336)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1405, file: !967, line: 229, baseType: !996, size: 8, offset: 8344)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1405, file: !967, line: 231, baseType: !999, size: 16, offset: 8352)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1405, file: !967, line: 232, baseType: !996, size: 8, offset: 8368)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1405, file: !967, line: 233, baseType: !996, size: 8, offset: 8376)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1405, file: !967, line: 234, baseType: !1285, size: 32, offset: 8384)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1405, file: !967, line: 235, baseType: !1285, size: 32, offset: 8416)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1405, file: !967, line: 237, baseType: !1011, size: 128, offset: 8448)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1405, file: !967, line: 238, baseType: !1011, size: 128, offset: 8576)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1405, file: !967, line: 239, baseType: !1011, size: 128, offset: 8704)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1405, file: !967, line: 240, baseType: !1011, size: 128, offset: 8832)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1405, file: !967, line: 242, baseType: !1285, size: 32, offset: 8960)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1405, file: !967, line: 244, baseType: !999, size: 16, offset: 8992)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1405, file: !967, line: 245, baseType: !1580, size: 16, offset: 9008)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1405, file: !967, line: 246, baseType: !1535, size: 128, offset: 9024)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1405, file: !967, line: 248, baseType: !48, size: 32, offset: 9152)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1405, file: !967, line: 249, baseType: !48, size: 32, offset: 9184)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1405, file: !967, line: 251, baseType: !1601, size: 64, offset: 9216)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64)
!1602 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !967, line: 251, flags: DIFlagFwdDecl)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1405, file: !967, line: 253, baseType: !996, size: 8, offset: 9280)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1405, file: !967, line: 254, baseType: !996, size: 8, offset: 9288)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1405, file: !967, line: 255, baseType: !999, size: 16, offset: 9296)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1405, file: !967, line: 256, baseType: !1464, size: 96, offset: 9312)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1405, file: !967, line: 258, baseType: !1011, size: 128, offset: 9408)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1405, file: !967, line: 259, baseType: !1011, size: 128, offset: 9536)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1405, file: !967, line: 260, baseType: !1011, size: 128, offset: 9664)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1405, file: !967, line: 261, baseType: !1011, size: 128, offset: 9792)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1405, file: !967, line: 263, baseType: !1612, size: 64, offset: 9920)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64)
!1613 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !967, line: 52, flags: DIFlagFwdDecl)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1405, file: !967, line: 264, baseType: !1615, size: 64, offset: 9984)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64)
!1616 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !967, line: 53, flags: DIFlagFwdDecl)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1405, file: !967, line: 265, baseType: !1618, size: 64, offset: 10048)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64)
!1619 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1620, line: 43, flags: DIFlagFwdDecl)
!1620 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1405, file: !967, line: 267, baseType: !996, size: 8, offset: 10112)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1405, file: !967, line: 268, baseType: !996, size: 8, offset: 10120)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1405, file: !967, line: 269, baseType: !999, size: 16, offset: 10128)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1405, file: !967, line: 270, baseType: !1285, size: 32, offset: 10144)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1405, file: !967, line: 272, baseType: !1626, size: 64, offset: 10176)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64)
!1627 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !967, line: 54, flags: DIFlagFwdDecl)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1405, file: !967, line: 275, baseType: !1629, size: 64, offset: 10240)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64)
!1630 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !967, line: 275, flags: DIFlagFwdDecl)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1405, file: !967, line: 277, baseType: !1632, size: 64, offset: 10304)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64)
!1633 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !967, line: 56, flags: DIFlagFwdDecl)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1405, file: !967, line: 277, baseType: !1632, size: 64, offset: 10368)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1405, file: !967, line: 278, baseType: !1112, size: 64, offset: 10432)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1405, file: !967, line: 279, baseType: !1112, size: 64, offset: 10496)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1405, file: !967, line: 280, baseType: !7, size: 32, offset: 10560)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1405, file: !967, line: 281, baseType: !7, size: 32, offset: 10592)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1405, file: !967, line: 283, baseType: !1011, size: 128, offset: 10624)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1405, file: !967, line: 284, baseType: !1011, size: 128, offset: 10752)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1405, file: !967, line: 285, baseType: !1642, size: 64, offset: 10880)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1405, file: !967, line: 287, baseType: !1644, size: 64, offset: 10944)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64)
!1645 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !967, line: 59, flags: DIFlagFwdDecl)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1405, file: !967, line: 288, baseType: !1647, size: 64, offset: 11008)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64)
!1648 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !967, line: 288, flags: DIFlagFwdDecl)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1405, file: !967, line: 290, baseType: !1650, size: 64, offset: 11072)
!1650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1285, size: 64, elements: !1256)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1405, file: !967, line: 291, baseType: !1652, size: 64, offset: 11136)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64)
!1653 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1654, line: 65, baseType: !1655)
!1654 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1654, line: 50, size: 320, elements: !1656)
!1656 = !{!1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1655, file: !1654, line: 51, baseType: !1395, size: 64)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1655, file: !1654, line: 53, baseType: !48, size: 32, offset: 64)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1655, file: !1654, line: 54, baseType: !48, size: 32, offset: 96)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1655, file: !1654, line: 55, baseType: !48, size: 32, offset: 128)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1655, file: !1654, line: 55, baseType: !48, size: 32, offset: 160)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1655, file: !1654, line: 56, baseType: !996, size: 8, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1655, file: !1654, line: 56, baseType: !996, size: 8, offset: 200)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1655, file: !1654, line: 57, baseType: !996, size: 8, offset: 208)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1655, file: !1654, line: 57, baseType: !996, size: 8, offset: 216)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1655, file: !1654, line: 59, baseType: !999, size: 16, offset: 224)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1655, file: !1654, line: 59, baseType: !999, size: 16, offset: 240)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1655, file: !1654, line: 59, baseType: !999, size: 16, offset: 256)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1655, file: !1654, line: 61, baseType: !999, size: 16, offset: 272)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1655, file: !1654, line: 63, baseType: !48, size: 32, offset: 288)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !1405, file: !967, line: 293, baseType: !1011, size: 128, offset: 11200)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !1405, file: !967, line: 294, baseType: !1673, size: 64, offset: 11328)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64)
!1674 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !967, line: 113, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !967, line: 108, size: 256, elements: !1676)
!1676 = !{!1677, !1679, !1680, !1681, !1682}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1675, file: !967, line: 109, baseType: !1678, size: 64)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1675, file: !967, line: 109, baseType: !1678, size: 64, offset: 64)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1675, file: !967, line: 110, baseType: !1404, size: 64, offset: 128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1675, file: !967, line: 111, baseType: !48, size: 32, offset: 192)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1675, file: !967, line: 112, baseType: !1285, size: 32, offset: 224)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1396, file: !1397, line: 1221, baseType: !1684, size: 64, offset: 1088)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64)
!1685 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1397, line: 52, flags: DIFlagFwdDecl)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1396, file: !1397, line: 1223, baseType: !1395, size: 64, offset: 1152)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1396, file: !1397, line: 1225, baseType: !1011, size: 128, offset: 1216)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1396, file: !1397, line: 1226, baseType: !1689, size: 64, offset: 1344)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64)
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1397, line: 69, size: 320, elements: !1691)
!1691 = !{!1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1690, file: !1397, line: 70, baseType: !1689, size: 64)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1690, file: !1397, line: 70, baseType: !1689, size: 64, offset: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1690, file: !1397, line: 71, baseType: !7, size: 32, offset: 128)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1690, file: !1397, line: 71, baseType: !7, size: 32, offset: 160)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1690, file: !1397, line: 72, baseType: !48, size: 32, offset: 192)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1690, file: !1397, line: 73, baseType: !999, size: 16, offset: 224)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1690, file: !1397, line: 73, baseType: !999, size: 16, offset: 240)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1690, file: !1397, line: 74, baseType: !1404, size: 64, offset: 256)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1396, file: !1397, line: 1227, baseType: !1404, size: 64, offset: 1408)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1396, file: !1397, line: 1229, baseType: !1464, size: 96, offset: 1472)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1396, file: !1397, line: 1230, baseType: !1464, size: 96, offset: 1568)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1396, file: !1397, line: 1231, baseType: !1464, size: 96, offset: 1664)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1396, file: !1397, line: 1231, baseType: !1464, size: 96, offset: 1760)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1396, file: !1397, line: 1233, baseType: !7, size: 32, offset: 1856)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1396, file: !1397, line: 1234, baseType: !48, size: 32, offset: 1888)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1396, file: !1397, line: 1235, baseType: !7, size: 32, offset: 1920)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1396, file: !1397, line: 1237, baseType: !999, size: 16, offset: 1952)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1396, file: !1397, line: 1239, baseType: !996, size: 8, offset: 1968)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1396, file: !1397, line: 1240, baseType: !1711, size: 8, offset: 1976)
!1711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 8, elements: !1712)
!1712 = !{!1713}
!1713 = !DISubrange(count: 1)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1396, file: !1397, line: 1242, baseType: !1715, size: 64, offset: 1984)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64)
!1716 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1397, line: 57, flags: DIFlagFwdDecl)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1396, file: !1397, line: 1244, baseType: !1718, size: 64, offset: 2048)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64)
!1719 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1397, line: 59, flags: DIFlagFwdDecl)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !1396, file: !1397, line: 1246, baseType: !1721, size: 64, offset: 2112)
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64)
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !1397, line: 1067, size: 5184, elements: !1723)
!1723 = !{!1724, !1754, !1755, !1770, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1792, !1887, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1998}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1722, file: !1397, line: 1068, baseType: !1725, size: 64)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64)
!1726 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !1397, line: 934, baseType: !1727)
!1727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !1397, line: 925, size: 576, elements: !1728)
!1728 = !{!1729, !1745, !1746, !1747, !1748, !1750, !1753}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1727, file: !1397, line: 926, baseType: !1730, size: 320)
!1730 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !1397, line: 830, baseType: !1731)
!1731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !1397, line: 813, size: 320, elements: !1732)
!1732 = !{!1733, !1736, !1739, !1740, !1742, !1743, !1744}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1731, file: !1397, line: 814, baseType: !1734, size: 64)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64)
!1735 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !1397, line: 51, flags: DIFlagFwdDecl)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1731, file: !1397, line: 815, baseType: !1737, size: 64, offset: 64)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64)
!1738 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !1397, line: 815, flags: DIFlagFwdDecl)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1731, file: !1397, line: 818, baseType: !986, size: 64, offset: 128)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1731, file: !1397, line: 819, baseType: !1741, size: 32, offset: 192)
!1741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1381, size: 32, elements: !1536)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1731, file: !1397, line: 822, baseType: !48, size: 32, offset: 224)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1731, file: !1397, line: 826, baseType: !48, size: 32, offset: 256)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1731, file: !1397, line: 829, baseType: !48, size: 32, offset: 288)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1727, file: !1397, line: 928, baseType: !999, size: 16, offset: 320)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1727, file: !1397, line: 928, baseType: !999, size: 16, offset: 336)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1727, file: !1397, line: 929, baseType: !48, size: 32, offset: 352)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1727, file: !1397, line: 930, baseType: !1749, size: 64, offset: 384)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1727, file: !1397, line: 931, baseType: !1751, size: 64, offset: 448)
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64)
!1752 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !1397, line: 931, flags: DIFlagFwdDecl)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1727, file: !1397, line: 933, baseType: !986, size: 64, offset: 512)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1722, file: !1397, line: 1069, baseType: !1725, size: 64, offset: 64)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1722, file: !1397, line: 1070, baseType: !1756, size: 64, offset: 128)
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1757, size: 64)
!1757 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !1397, line: 916, baseType: !1758)
!1758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !1397, line: 891, size: 704, elements: !1759)
!1759 = !{!1760, !1761, !1762, !1764, !1765, !1766, !1767, !1768, !1769}
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1758, file: !1397, line: 892, baseType: !1730, size: 320)
