; ModuleID = 'blender/source/blender/editors/screen/screen_context.c'
source_filename = "blender/source/blender/editors/screen/screen_context.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.bContext = type opaque
%struct.bContextDataResult = type opaque
%struct.bScreen = type { %struct.ID, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.Scene*, %struct.Scene*, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, %struct.wmTimer*, i8* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }

!50 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!51 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!52 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!53 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!54 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!55 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eArmature_Flag", file: !31, line: 118, baseType: !7, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!58 = !DIEnumerator(name: "ARM_RESTPOS", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "ARM_DRAWXRAY", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "ARM_DRAWAXES", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "ARM_DRAWNAMES", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "ARM_POSEMODE", value: 16, isUnsigned: true)
!63 = !DIEnumerator(name: "ARM_EDITMODE", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "ARM_DELAYDEFORM", value: 64, isUnsigned: true)
!65 = !DIEnumerator(name: "ARM_DONT_USE", value: 128, isUnsigned: true)
!66 = !DIEnumerator(name: "ARM_MIRROR_EDIT", value: 256, isUnsigned: true)
!67 = !DIEnumerator(name: "ARM_AUTO_IK", value: 512, isUnsigned: true)
!68 = !DIEnumerator(name: "ARM_NO_CUSTOM", value: 1024, isUnsigned: true)
!69 = !DIEnumerator(name: "ARM_COL_CUSTOM", value: 2048, isUnsigned: true)
!70 = !DIEnumerator(name: "ARM_GHOST_ONLYSEL", value: 4096, isUnsigned: true)
!71 = !DIEnumerator(name: "ARM_DS_EXPAND", value: 8192, isUnsigned: true)
!72 = !DIEnumerator(name: "ARM_HAS_VIZ_DEPS", value: 16384, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !6, line: 666, baseType: !7, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82}
!75 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!80 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!81 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!82 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 335, baseType: !85, size: 32, elements: !86)
!84 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!87 = !DIEnumerator(name: "SEQ_LEFTSEL", value: 2)
!88 = !DIEnumerator(name: "SEQ_RIGHTSEL", value: 4)
!89 = !DIEnumerator(name: "SEQ_OVERLAP", value: 8)
!90 = !DIEnumerator(name: "SEQ_FILTERY", value: 16)
!91 = !DIEnumerator(name: "SEQ_MUTE", value: 32)
!92 = !DIEnumerator(name: "SEQ_MAKE_PREMUL", value: 64)
!93 = !DIEnumerator(name: "SEQ_REVERSE_FRAMES", value: 128)
!94 = !DIEnumerator(name: "SEQ_IPO_FRAME_LOCKED", value: 256)
!95 = !DIEnumerator(name: "SEQ_EFFECT_NOT_LOADED", value: 512)
!96 = !DIEnumerator(name: "SEQ_FLAG_DELETE", value: 1024)
!97 = !DIEnumerator(name: "SEQ_FLIPX", value: 2048)
!98 = !DIEnumerator(name: "SEQ_FLIPY", value: 4096)
!99 = !DIEnumerator(name: "SEQ_MAKE_FLOAT", value: 8192)
!100 = !DIEnumerator(name: "SEQ_LOCK", value: 16384)
!101 = !DIEnumerator(name: "SEQ_USE_PROXY", value: 32768)
!102 = !DIEnumerator(name: "SEQ_USE_TRANSFORM", value: 65536)
!103 = !DIEnumerator(name: "SEQ_USE_CROP", value: 131072)
!104 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_DIR", value: 524288)
!105 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_FILE", value: 2097152)
!106 = !DIEnumerator(name: "SEQ_USE_EFFECT_DEFAULT_FADE", value: 4194304)
!107 = !DIEnumerator(name: "SEQ_USE_LINEAR_MODIFIERS", value: 8388608)
!108 = !DIEnumerator(name: "SEQ_AUDIO_VOLUME_ANIMATED", value: 16777216)
!109 = !DIEnumerator(name: "SEQ_AUDIO_PITCH_ANIMATED", value: 33554432)
!110 = !DIEnumerator(name: "SEQ_AUDIO_PAN_ANIMATED", value: 67108864)
!111 = !DIEnumerator(name: "SEQ_AUDIO_DRAW_WAVEFORM", value: 134217728)
!112 = !DIEnumerator(name: "SEQ_INVALID_EFFECT", value: -2147483648)
!113 = !{!114, !115, !290, !198}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !31, line: 114, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !31, line: 78, size: 2048, elements: !118)
!118 = !{!119, !189, !193, !194, !195, !197, !243, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !117, file: !31, line: 79, baseType: !120, size: 960)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !121, line: 130, baseType: !122)
!121 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !121, line: 117, size: 960, elements: !123)
!123 = !{!124, !125, !126, !128, !148, !152, !154, !155, !156, !157}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !121, line: 118, baseType: !114, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !121, line: 118, baseType: !114, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !122, file: !121, line: 119, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !122, file: !121, line: 120, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !121, line: 136, size: 17600, elements: !131)
!131 = !{!132, !133, !135, !138, !143, !144, !145}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !130, file: !121, line: 137, baseType: !120, size: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !130, file: !121, line: 138, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !130, file: !121, line: 139, baseType: !136, size: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !121, line: 43, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !121, line: 140, baseType: !139, size: 8192, offset: 1088)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 8192, elements: !141)
!140 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !{!142}
!142 = !DISubrange(count: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !130, file: !121, line: 141, baseType: !139, size: 8192, offset: 9280)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !130, file: !121, line: 148, baseType: !129, size: 64, offset: 17472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !130, file: !121, line: 150, baseType: !146, size: 64, offset: 17536)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !121, line: 45, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !121, line: 121, baseType: !149, size: 528, offset: 256)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 528, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 66)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !122, file: !121, line: 126, baseType: !153, size: 16, offset: 784)
!153 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !122, file: !121, line: 127, baseType: !85, size: 32, offset: 800)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !122, file: !121, line: 128, baseType: !85, size: 32, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !122, file: !121, line: 128, baseType: !85, size: 32, offset: 864)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !122, file: !121, line: 129, baseType: !158, size: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !121, line: 75, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !121, line: 62, size: 1024, elements: !161)
!161 = !{!162, !164, !165, !166, !167, !168, !172, !173, !187, !188}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !121, line: 63, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !121, line: 63, baseType: !163, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !160, file: !121, line: 64, baseType: !140, size: 8, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !160, file: !121, line: 64, baseType: !140, size: 8, offset: 136)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !121, line: 65, baseType: !153, size: 16, offset: 144)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !121, line: 66, baseType: !169, size: 512, offset: 160)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 512, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !160, file: !121, line: 67, baseType: !85, size: 32, offset: 672)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !121, line: 69, baseType: !174, size: 256, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !121, line: 60, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !121, line: 48, size: 256, elements: !176)
!176 = !{!177, !178, !185, !186}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !175, file: !121, line: 49, baseType: !114, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !175, file: !121, line: 58, baseType: !179, size: 128, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !180, line: 71, baseType: !181)
!180 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !180, line: 69, size: 128, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !181, file: !180, line: 70, baseType: !114, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !181, file: !180, line: 70, baseType: !114, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !175, file: !121, line: 59, baseType: !85, size: 32, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !175, file: !121, line: 59, baseType: !85, size: 32, offset: 224)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !160, file: !121, line: 70, baseType: !85, size: 32, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !160, file: !121, line: 74, baseType: !85, size: 32, offset: 992)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !117, file: !31, line: 80, baseType: !190, size: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !192, line: 45, flags: DIFlagFwdDecl)
!192 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!193 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !117, file: !31, line: 82, baseType: !179, size: 128, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !117, file: !31, line: 83, baseType: !179, size: 128, offset: 1152)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !117, file: !31, line: 84, baseType: !196, size: 64, offset: 1280)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !117, file: !31, line: 92, baseType: !198, size: 64, offset: 1344)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !31, line: 76, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !31, line: 48, size: 2624, elements: !201)
!201 = !{!202, !204, !205, !206, !207, !208, !209, !211, !215, !216, !219, !220, !221, !222, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !31, line: 49, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !200, file: !31, line: 49, baseType: !203, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !200, file: !31, line: 50, baseType: !158, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !200, file: !31, line: 51, baseType: !203, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !200, file: !31, line: 52, baseType: !179, size: 128, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !31, line: 53, baseType: !169, size: 512, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !200, file: !31, line: 55, baseType: !210, size: 32, offset: 896)
!210 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !200, file: !31, line: 56, baseType: !212, size: 96, offset: 928)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 96, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !200, file: !31, line: 57, baseType: !212, size: 96, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !200, file: !31, line: 58, baseType: !217, size: 288, offset: 1120)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 288, elements: !218)
!218 = !{!214, !214}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !31, line: 60, baseType: !85, size: 32, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !200, file: !31, line: 62, baseType: !212, size: 96, offset: 1440)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !200, file: !31, line: 63, baseType: !212, size: 96, offset: 1536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !200, file: !31, line: 64, baseType: !223, size: 512, offset: 1632)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 512, elements: !224)
!224 = !{!225, !225}
!225 = !DISubrange(count: 4)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !200, file: !31, line: 65, baseType: !210, size: 32, offset: 2144)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !200, file: !31, line: 67, baseType: !210, size: 32, offset: 2176)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !200, file: !31, line: 67, baseType: !210, size: 32, offset: 2208)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !200, file: !31, line: 68, baseType: !210, size: 32, offset: 2240)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !200, file: !31, line: 68, baseType: !210, size: 32, offset: 2272)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !200, file: !31, line: 68, baseType: !210, size: 32, offset: 2304)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !200, file: !31, line: 69, baseType: !210, size: 32, offset: 2336)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !200, file: !31, line: 69, baseType: !210, size: 32, offset: 2368)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !200, file: !31, line: 70, baseType: !210, size: 32, offset: 2400)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !200, file: !31, line: 70, baseType: !210, size: 32, offset: 2432)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !31, line: 72, baseType: !212, size: 96, offset: 2464)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !200, file: !31, line: 73, baseType: !85, size: 32, offset: 2560)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !200, file: !31, line: 74, baseType: !153, size: 16, offset: 2592)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !200, file: !31, line: 75, baseType: !240, size: 16, offset: 2608)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 16, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 1)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !117, file: !31, line: 93, baseType: !244, size: 64, offset: 1408)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !246, line: 56, size: 1472, elements: !247)
!246 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !246, line: 57, baseType: !244, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !246, line: 57, baseType: !244, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !245, file: !246, line: 58, baseType: !163, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !245, file: !246, line: 59, baseType: !244, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !245, file: !246, line: 62, baseType: !114, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !246, line: 64, baseType: !169, size: 512, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !245, file: !246, line: 65, baseType: !210, size: 32, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !245, file: !246, line: 70, baseType: !212, size: 96, offset: 864)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !245, file: !246, line: 71, baseType: !212, size: 96, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !245, file: !246, line: 75, baseType: !85, size: 32, offset: 1056)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !245, file: !246, line: 76, baseType: !85, size: 32, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !245, file: !246, line: 78, baseType: !210, size: 32, offset: 1120)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !245, file: !246, line: 78, baseType: !210, size: 32, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !245, file: !246, line: 79, baseType: !210, size: 32, offset: 1184)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !245, file: !246, line: 79, baseType: !210, size: 32, offset: 1216)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !245, file: !246, line: 79, baseType: !210, size: 32, offset: 1248)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !245, file: !246, line: 80, baseType: !210, size: 32, offset: 1280)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !245, file: !246, line: 80, baseType: !210, size: 32, offset: 1312)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !245, file: !246, line: 81, baseType: !210, size: 32, offset: 1344)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !245, file: !246, line: 81, baseType: !210, size: 32, offset: 1376)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "oldlength", scope: !245, file: !246, line: 83, baseType: !210, size: 32, offset: 1408)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !245, file: !246, line: 85, baseType: !153, size: 16, offset: 1440)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !117, file: !31, line: 95, baseType: !114, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !117, file: !31, line: 97, baseType: !85, size: 32, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !117, file: !31, line: 98, baseType: !85, size: 32, offset: 1568)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !117, file: !31, line: 99, baseType: !85, size: 32, offset: 1600)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !117, file: !31, line: 100, baseType: !85, size: 32, offset: 1632)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !117, file: !31, line: 101, baseType: !153, size: 16, offset: 1664)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !117, file: !31, line: 102, baseType: !153, size: 16, offset: 1680)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !117, file: !31, line: 104, baseType: !7, size: 32, offset: 1696)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !117, file: !31, line: 105, baseType: !7, size: 32, offset: 1728)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !117, file: !31, line: 105, baseType: !7, size: 32, offset: 1760)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !117, file: !31, line: 108, baseType: !153, size: 16, offset: 1792)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !117, file: !31, line: 108, baseType: !153, size: 16, offset: 1808)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !117, file: !31, line: 109, baseType: !153, size: 16, offset: 1824)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !117, file: !31, line: 109, baseType: !153, size: 16, offset: 1840)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !117, file: !31, line: 110, baseType: !85, size: 32, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !117, file: !31, line: 110, baseType: !85, size: 32, offset: 1888)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !117, file: !31, line: 111, baseType: !85, size: 32, offset: 1920)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !117, file: !31, line: 111, baseType: !85, size: 32, offset: 1952)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !117, file: !31, line: 112, baseType: !85, size: 32, offset: 1984)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !117, file: !31, line: 112, baseType: !85, size: 32, offset: 2016)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditBone", file: !246, line: 86, baseType: !245)
!292 = !{!0}
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 1984, elements: !296)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!296 = !{!297}
!297 = !DISubrange(count: 31)
!298 = !{i32 7, !"Dwarf Version", i32 4}
!299 = !{i32 2, !"Debug Info Version", i32 3}
!300 = !{i32 1, !"wchar_size", i32 4}
!301 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!302 = distinct !DISubprogram(name: "ed_screen_context", scope: !3, file: !3, line: 72, type: !303, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !313)
!303 = !DISubroutineType(types: !304)
!304 = !{!85, !305, !294, !310}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !13, line: 69, baseType: !308)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !309, line: 51, flags: DIFlagFwdDecl)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContextDataResult", file: !13, line: 72, baseType: !312)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContextDataResult", file: !13, line: 71, flags: DIFlagFwdDecl)
!313 = !{}
!314 = !DILocalVariable(name: "C", arg: 1, scope: !302, file: !3, line: 72, type: !305)
!315 = !DILocation(line: 72, column: 39, scope: !302)
!316 = !DILocalVariable(name: "member", arg: 2, scope: !302, file: !3, line: 72, type: !294)
!317 = !DILocation(line: 72, column: 54, scope: !302)
!318 = !DILocalVariable(name: "result", arg: 3, scope: !302, file: !3, line: 72, type: !310)
!319 = !DILocation(line: 72, column: 82, scope: !302)
!320 = !DILocalVariable(name: "sc", scope: !302, file: !3, line: 74, type: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !323, line: 80, baseType: !324)
!323 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !323, line: 49, size: 1984, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1800}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !324, file: !323, line: 50, baseType: !120, size: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !324, file: !323, line: 52, baseType: !179, size: 128, offset: 960)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !324, file: !323, line: 53, baseType: !179, size: 128, offset: 1088)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !324, file: !323, line: 54, baseType: !179, size: 128, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !324, file: !323, line: 55, baseType: !179, size: 128, offset: 1344)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !324, file: !323, line: 57, baseType: !332, size: 64, offset: 1472)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !334, line: 1216, size: 39680, elements: !335)
!334 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!335 = !{!336, !337, !338, !621, !624, !625, !626, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !650, !723, !1149, !1364, !1367, !1656, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1678, !1679, !1680, !1681, !1682, !1690, !1757, !1764, !1765, !1772, !1773, !1774, !1775, !1776, !1777, !1778}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !333, file: !334, line: 1217, baseType: !120, size: 960)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !333, file: !334, line: 1218, baseType: !190, size: 64, offset: 960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !333, file: !334, line: 1220, baseType: !339, size: 64, offset: 1024)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 115, size: 11392, elements: !341)
!341 = !{!342, !343, !344, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !361, !371, !385, !386, !427, !428, !431, !432, !448, !449, !450, !451, !452, !453, !454, !458, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !536, !537, !538, !539, !540, !541, !542, !543, !544, !547, !550, !553, !554, !555, !556, !557, !560, !563, !566, !567, !573, !574, !575, !576, !577, !578, !579, !582, !585, !589, !609, !610}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !340, file: !6, line: 116, baseType: !120, size: 960)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !340, file: !6, line: 117, baseType: !190, size: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !340, file: !6, line: 119, baseType: !345, size: 64, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !6, line: 57, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !340, file: !6, line: 121, baseType: !153, size: 16, offset: 1088)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !340, file: !6, line: 121, baseType: !153, size: 16, offset: 1104)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !340, file: !6, line: 122, baseType: !85, size: 32, offset: 1120)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !340, file: !6, line: 122, baseType: !85, size: 32, offset: 1152)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !340, file: !6, line: 122, baseType: !85, size: 32, offset: 1184)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !340, file: !6, line: 123, baseType: !169, size: 512, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !340, file: !6, line: 124, baseType: !339, size: 64, offset: 1728)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !340, file: !6, line: 124, baseType: !339, size: 64, offset: 1792)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !340, file: !6, line: 127, baseType: !339, size: 64, offset: 1856)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !340, file: !6, line: 127, baseType: !339, size: 64, offset: 1920)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !340, file: !6, line: 127, baseType: !339, size: 64, offset: 1984)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !340, file: !6, line: 128, baseType: !359, size: 64, offset: 2048)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !192, line: 46, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !340, file: !6, line: 130, baseType: !362, size: 64, offset: 2112)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !6, line: 97, size: 832, elements: !364)
!364 = !{!365, !369, !370}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !363, file: !6, line: 98, baseType: !366, size: 768)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 768, elements: !367)
!367 = !{!368, !214}
!368 = !DISubrange(count: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !363, file: !6, line: 99, baseType: !85, size: 32, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !363, file: !6, line: 99, baseType: !85, size: 32, offset: 800)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !340, file: !6, line: 131, baseType: !372, size: 64, offset: 2176)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !374, line: 486, size: 1600, elements: !375)
!374 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !373, file: !374, line: 487, baseType: !120, size: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !373, file: !374, line: 489, baseType: !179, size: 128, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !373, file: !374, line: 490, baseType: !179, size: 128, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !373, file: !374, line: 491, baseType: !179, size: 128, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !373, file: !374, line: 492, baseType: !179, size: 128, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !373, file: !374, line: 494, baseType: !85, size: 32, offset: 1472)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !373, file: !374, line: 495, baseType: !85, size: 32, offset: 1504)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !373, file: !374, line: 497, baseType: !85, size: 32, offset: 1536)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !373, file: !374, line: 498, baseType: !85, size: 32, offset: 1568)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !340, file: !6, line: 132, baseType: !372, size: 64, offset: 2240)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !340, file: !6, line: 133, baseType: !387, size: 64, offset: 2304)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !374, line: 334, size: 1728, elements: !389)
!389 = !{!390, !391, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !426}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !388, file: !374, line: 335, baseType: !179, size: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !388, file: !374, line: 336, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !374, line: 47, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !388, file: !374, line: 338, baseType: !153, size: 16, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !388, file: !374, line: 338, baseType: !153, size: 16, offset: 208)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !388, file: !374, line: 339, baseType: !7, size: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !388, file: !374, line: 340, baseType: !85, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !388, file: !374, line: 342, baseType: !210, size: 32, offset: 288)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !388, file: !374, line: 343, baseType: !212, size: 96, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !388, file: !374, line: 344, baseType: !212, size: 96, offset: 416)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !388, file: !374, line: 347, baseType: !179, size: 128, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !388, file: !374, line: 349, baseType: !85, size: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !388, file: !374, line: 350, baseType: !85, size: 32, offset: 672)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !388, file: !374, line: 351, baseType: !114, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !388, file: !374, line: 352, baseType: !114, size: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !388, file: !374, line: 354, baseType: !407, size: 384, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !374, line: 116, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !374, line: 94, size: 384, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !408, file: !374, line: 96, baseType: !85, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !408, file: !374, line: 96, baseType: !85, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !408, file: !374, line: 97, baseType: !85, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !408, file: !374, line: 97, baseType: !85, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !408, file: !374, line: 99, baseType: !153, size: 16, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !408, file: !374, line: 100, baseType: !153, size: 16, offset: 144)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !408, file: !374, line: 102, baseType: !153, size: 16, offset: 160)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !408, file: !374, line: 105, baseType: !153, size: 16, offset: 176)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !408, file: !374, line: 108, baseType: !153, size: 16, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !408, file: !374, line: 109, baseType: !153, size: 16, offset: 208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !408, file: !374, line: 111, baseType: !153, size: 16, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !408, file: !374, line: 112, baseType: !153, size: 16, offset: 240)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !408, file: !374, line: 114, baseType: !85, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !408, file: !374, line: 114, baseType: !85, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !408, file: !374, line: 115, baseType: !85, size: 32, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !408, file: !374, line: 115, baseType: !85, size: 32, offset: 352)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !388, file: !374, line: 355, baseType: !169, size: 512, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !340, file: !6, line: 134, baseType: !114, size: 64, offset: 2368)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !340, file: !6, line: 136, baseType: !429, size: 64, offset: 2432)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !6, line: 58, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !340, file: !6, line: 138, baseType: !407, size: 384, offset: 2496)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !340, file: !6, line: 139, baseType: !433, size: 64, offset: 2880)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !374, line: 80, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !374, line: 72, size: 192, elements: !436)
!436 = !{!437, !444, !445, !446, !447}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !435, file: !374, line: 73, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !374, line: 59, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !374, line: 56, size: 128, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !440, file: !374, line: 57, baseType: !212, size: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !440, file: !374, line: 58, baseType: !85, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !435, file: !374, line: 74, baseType: !85, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !435, file: !374, line: 76, baseType: !85, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !435, file: !374, line: 77, baseType: !85, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !374, line: 79, baseType: !85, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !340, file: !6, line: 141, baseType: !179, size: 128, offset: 2944)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !340, file: !6, line: 142, baseType: !179, size: 128, offset: 3072)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !340, file: !6, line: 143, baseType: !179, size: 128, offset: 3200)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !340, file: !6, line: 144, baseType: !179, size: 128, offset: 3328)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !340, file: !6, line: 146, baseType: !85, size: 32, offset: 3456)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !340, file: !6, line: 147, baseType: !85, size: 32, offset: 3488)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !340, file: !6, line: 150, baseType: !455, size: 64, offset: 3520)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !6, line: 50, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !340, file: !6, line: 151, baseType: !459, size: 64, offset: 3584)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !340, file: !6, line: 152, baseType: !85, size: 32, offset: 3648)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !340, file: !6, line: 153, baseType: !85, size: 32, offset: 3680)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !340, file: !6, line: 156, baseType: !212, size: 96, offset: 3712)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !340, file: !6, line: 156, baseType: !212, size: 96, offset: 3808)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !340, file: !6, line: 156, baseType: !212, size: 96, offset: 3904)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !340, file: !6, line: 157, baseType: !212, size: 96, offset: 4000)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !340, file: !6, line: 158, baseType: !212, size: 96, offset: 4096)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !340, file: !6, line: 159, baseType: !212, size: 96, offset: 4192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !340, file: !6, line: 160, baseType: !212, size: 96, offset: 4288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !340, file: !6, line: 160, baseType: !212, size: 96, offset: 4384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !340, file: !6, line: 161, baseType: !471, size: 128, offset: 4480)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 128, elements: !472)
!472 = !{!225}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !340, file: !6, line: 161, baseType: !471, size: 128, offset: 4608)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !340, file: !6, line: 162, baseType: !212, size: 96, offset: 4736)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !340, file: !6, line: 162, baseType: !212, size: 96, offset: 4832)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !340, file: !6, line: 163, baseType: !210, size: 32, offset: 4928)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !340, file: !6, line: 163, baseType: !210, size: 32, offset: 4960)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !340, file: !6, line: 164, baseType: !223, size: 512, offset: 4992)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !340, file: !6, line: 165, baseType: !223, size: 512, offset: 5504)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !340, file: !6, line: 166, baseType: !223, size: 512, offset: 6016)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !340, file: !6, line: 167, baseType: !223, size: 512, offset: 6528)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !340, file: !6, line: 176, baseType: !223, size: 512, offset: 7040)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !340, file: !6, line: 178, baseType: !7, size: 32, offset: 7552)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !340, file: !6, line: 180, baseType: !153, size: 16, offset: 7584)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !340, file: !6, line: 181, baseType: !153, size: 16, offset: 7600)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !340, file: !6, line: 183, baseType: !153, size: 16, offset: 7616)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !340, file: !6, line: 183, baseType: !153, size: 16, offset: 7632)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !340, file: !6, line: 184, baseType: !153, size: 16, offset: 7648)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !340, file: !6, line: 184, baseType: !153, size: 16, offset: 7664)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !340, file: !6, line: 185, baseType: !153, size: 16, offset: 7680)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !340, file: !6, line: 186, baseType: !153, size: 16, offset: 7696)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !340, file: !6, line: 187, baseType: !153, size: 16, offset: 7712)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !340, file: !6, line: 188, baseType: !140, size: 8, offset: 7728)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !340, file: !6, line: 189, baseType: !140, size: 8, offset: 7736)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !340, file: !6, line: 192, baseType: !85, size: 32, offset: 7744)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !340, file: !6, line: 192, baseType: !85, size: 32, offset: 7776)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !340, file: !6, line: 192, baseType: !85, size: 32, offset: 7808)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !340, file: !6, line: 192, baseType: !85, size: 32, offset: 7840)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !340, file: !6, line: 194, baseType: !85, size: 32, offset: 7872)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !340, file: !6, line: 202, baseType: !210, size: 32, offset: 7904)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !340, file: !6, line: 202, baseType: !210, size: 32, offset: 7936)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !340, file: !6, line: 202, baseType: !210, size: 32, offset: 7968)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !340, file: !6, line: 211, baseType: !210, size: 32, offset: 8000)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !340, file: !6, line: 212, baseType: !210, size: 32, offset: 8032)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !340, file: !6, line: 213, baseType: !210, size: 32, offset: 8064)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !340, file: !6, line: 214, baseType: !210, size: 32, offset: 8096)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !340, file: !6, line: 215, baseType: !210, size: 32, offset: 8128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !340, file: !6, line: 216, baseType: !210, size: 32, offset: 8160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !340, file: !6, line: 219, baseType: !210, size: 32, offset: 8192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !340, file: !6, line: 220, baseType: !210, size: 32, offset: 8224)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !340, file: !6, line: 221, baseType: !210, size: 32, offset: 8256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !340, file: !6, line: 224, baseType: !513, size: 16, offset: 8288)
!513 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !340, file: !6, line: 224, baseType: !513, size: 16, offset: 8304)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !340, file: !6, line: 226, baseType: !153, size: 16, offset: 8320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !340, file: !6, line: 228, baseType: !140, size: 8, offset: 8336)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !340, file: !6, line: 229, baseType: !140, size: 8, offset: 8344)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !340, file: !6, line: 231, baseType: !153, size: 16, offset: 8352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !340, file: !6, line: 232, baseType: !140, size: 8, offset: 8368)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !340, file: !6, line: 233, baseType: !140, size: 8, offset: 8376)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !340, file: !6, line: 234, baseType: !210, size: 32, offset: 8384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !340, file: !6, line: 235, baseType: !210, size: 32, offset: 8416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !340, file: !6, line: 237, baseType: !179, size: 128, offset: 8448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !340, file: !6, line: 238, baseType: !179, size: 128, offset: 8576)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !340, file: !6, line: 239, baseType: !179, size: 128, offset: 8704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !340, file: !6, line: 240, baseType: !179, size: 128, offset: 8832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !340, file: !6, line: 242, baseType: !210, size: 32, offset: 8960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !340, file: !6, line: 244, baseType: !153, size: 16, offset: 8992)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !340, file: !6, line: 245, baseType: !513, size: 16, offset: 9008)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !340, file: !6, line: 246, baseType: !471, size: 128, offset: 9024)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !340, file: !6, line: 248, baseType: !85, size: 32, offset: 9152)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !340, file: !6, line: 249, baseType: !85, size: 32, offset: 9184)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !340, file: !6, line: 251, baseType: !534, size: 64, offset: 9216)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !6, line: 251, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !340, file: !6, line: 253, baseType: !140, size: 8, offset: 9280)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !340, file: !6, line: 254, baseType: !140, size: 8, offset: 9288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !340, file: !6, line: 255, baseType: !153, size: 16, offset: 9296)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !340, file: !6, line: 256, baseType: !212, size: 96, offset: 9312)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !340, file: !6, line: 258, baseType: !179, size: 128, offset: 9408)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !340, file: !6, line: 259, baseType: !179, size: 128, offset: 9536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !340, file: !6, line: 260, baseType: !179, size: 128, offset: 9664)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !340, file: !6, line: 261, baseType: !179, size: 128, offset: 9792)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !340, file: !6, line: 263, baseType: !545, size: 64, offset: 9920)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !6, line: 52, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !340, file: !6, line: 264, baseType: !548, size: 64, offset: 9984)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !6, line: 53, flags: DIFlagFwdDecl)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !340, file: !6, line: 265, baseType: !551, size: 64, offset: 10048)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !374, line: 46, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !340, file: !6, line: 267, baseType: !140, size: 8, offset: 10112)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !340, file: !6, line: 268, baseType: !140, size: 8, offset: 10120)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !340, file: !6, line: 269, baseType: !153, size: 16, offset: 10128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !340, file: !6, line: 270, baseType: !210, size: 32, offset: 10144)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !340, file: !6, line: 272, baseType: !558, size: 64, offset: 10176)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !6, line: 54, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !340, file: !6, line: 275, baseType: !561, size: 64, offset: 10240)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !6, line: 275, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !340, file: !6, line: 277, baseType: !564, size: 64, offset: 10304)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 56, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !340, file: !6, line: 277, baseType: !564, size: 64, offset: 10368)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !340, file: !6, line: 278, baseType: !568, size: 64, offset: 10432)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !569, line: 27, baseType: !570)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !571, line: 45, baseType: !572)
!571 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!572 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !340, file: !6, line: 279, baseType: !568, size: 64, offset: 10496)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !340, file: !6, line: 280, baseType: !7, size: 32, offset: 10560)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !340, file: !6, line: 281, baseType: !7, size: 32, offset: 10592)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !340, file: !6, line: 283, baseType: !179, size: 128, offset: 10624)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !340, file: !6, line: 284, baseType: !179, size: 128, offset: 10752)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !340, file: !6, line: 285, baseType: !196, size: 64, offset: 10880)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !340, file: !6, line: 287, baseType: !580, size: 64, offset: 10944)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !6, line: 59, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !340, file: !6, line: 288, baseType: !583, size: 64, offset: 11008)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !6, line: 288, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !340, file: !6, line: 290, baseType: !586, size: 64, offset: 11072)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 64, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 2)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !340, file: !6, line: 291, baseType: !590, size: 64, offset: 11136)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !592, line: 65, baseType: !593)
!592 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !592, line: 50, size: 320, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !593, file: !592, line: 51, baseType: !332, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !593, file: !592, line: 53, baseType: !85, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !593, file: !592, line: 54, baseType: !85, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !593, file: !592, line: 55, baseType: !85, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !593, file: !592, line: 55, baseType: !85, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !593, file: !592, line: 56, baseType: !140, size: 8, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !593, file: !592, line: 56, baseType: !140, size: 8, offset: 200)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !593, file: !592, line: 57, baseType: !140, size: 8, offset: 208)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !593, file: !592, line: 57, baseType: !140, size: 8, offset: 216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !593, file: !592, line: 59, baseType: !153, size: 16, offset: 224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !593, file: !592, line: 59, baseType: !153, size: 16, offset: 240)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !593, file: !592, line: 59, baseType: !153, size: 16, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !593, file: !592, line: 61, baseType: !153, size: 16, offset: 272)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !593, file: !592, line: 63, baseType: !85, size: 32, offset: 288)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !340, file: !6, line: 293, baseType: !179, size: 128, offset: 11200)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !340, file: !6, line: 294, baseType: !611, size: 64, offset: 11328)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !6, line: 113, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !6, line: 108, size: 256, elements: !614)
!614 = !{!615, !617, !618, !619, !620}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !613, file: !6, line: 109, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !613, file: !6, line: 109, baseType: !616, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !613, file: !6, line: 110, baseType: !339, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !613, file: !6, line: 111, baseType: !85, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !613, file: !6, line: 112, baseType: !210, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !333, file: !334, line: 1221, baseType: !622, size: 64, offset: 1088)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !334, line: 52, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !333, file: !334, line: 1223, baseType: !332, size: 64, offset: 1152)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !333, file: !334, line: 1225, baseType: !179, size: 128, offset: 1216)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !333, file: !334, line: 1226, baseType: !627, size: 64, offset: 1344)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !334, line: 69, size: 320, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !628, file: !334, line: 70, baseType: !627, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !628, file: !334, line: 70, baseType: !627, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !628, file: !334, line: 71, baseType: !7, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !628, file: !334, line: 71, baseType: !7, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !628, file: !334, line: 72, baseType: !85, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !628, file: !334, line: 73, baseType: !153, size: 16, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !628, file: !334, line: 73, baseType: !153, size: 16, offset: 240)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !628, file: !334, line: 74, baseType: !339, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !333, file: !334, line: 1227, baseType: !339, size: 64, offset: 1408)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !333, file: !334, line: 1229, baseType: !212, size: 96, offset: 1472)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !333, file: !334, line: 1230, baseType: !212, size: 96, offset: 1568)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !333, file: !334, line: 1231, baseType: !212, size: 96, offset: 1664)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !333, file: !334, line: 1231, baseType: !212, size: 96, offset: 1760)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !333, file: !334, line: 1233, baseType: !7, size: 32, offset: 1856)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !333, file: !334, line: 1234, baseType: !85, size: 32, offset: 1888)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !333, file: !334, line: 1235, baseType: !7, size: 32, offset: 1920)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !334, line: 1237, baseType: !153, size: 16, offset: 1952)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !333, file: !334, line: 1239, baseType: !140, size: 8, offset: 1968)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !333, file: !334, line: 1240, baseType: !649, size: 8, offset: 1976)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 8, elements: !241)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !333, file: !334, line: 1242, baseType: !651, size: 64, offset: 1984)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !653, line: 328, size: 3456, elements: !654)
!653 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!654 = !{!655, !656, !657, !660, !661, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !689, !690, !691, !694, !699, !700, !703, !707, !711, !715, !719, !720, !721, !722}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !652, file: !653, line: 329, baseType: !120, size: 960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !652, file: !653, line: 330, baseType: !190, size: 64, offset: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !652, file: !653, line: 332, baseType: !658, size: 64, offset: 1024)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !653, line: 332, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !652, file: !653, line: 333, baseType: !169, size: 512, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !652, file: !653, line: 335, baseType: !662, size: 64, offset: 1600)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !653, line: 335, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !652, file: !653, line: 337, baseType: !429, size: 64, offset: 1664)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !652, file: !653, line: 338, baseType: !586, size: 64, offset: 1728)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !652, file: !653, line: 340, baseType: !179, size: 128, offset: 1792)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !652, file: !653, line: 340, baseType: !179, size: 128, offset: 1920)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !653, line: 342, baseType: !85, size: 32, offset: 2048)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !652, file: !653, line: 342, baseType: !85, size: 32, offset: 2080)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !652, file: !653, line: 343, baseType: !85, size: 32, offset: 2112)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !652, file: !653, line: 345, baseType: !85, size: 32, offset: 2144)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !652, file: !653, line: 346, baseType: !85, size: 32, offset: 2176)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !652, file: !653, line: 347, baseType: !153, size: 16, offset: 2208)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !652, file: !653, line: 348, baseType: !153, size: 16, offset: 2224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !652, file: !653, line: 349, baseType: !85, size: 32, offset: 2240)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !652, file: !653, line: 351, baseType: !85, size: 32, offset: 2272)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !652, file: !653, line: 353, baseType: !153, size: 16, offset: 2304)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !652, file: !653, line: 354, baseType: !153, size: 16, offset: 2320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !652, file: !653, line: 355, baseType: !85, size: 32, offset: 2336)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !652, file: !653, line: 357, baseType: !681, size: 128, offset: 2368)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !682, line: 95, baseType: !683)
!682 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !682, line: 92, size: 128, elements: !684)
!684 = !{!685, !686, !687, !688}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !683, file: !682, line: 93, baseType: !210, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !683, file: !682, line: 93, baseType: !210, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !683, file: !682, line: 94, baseType: !210, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !683, file: !682, line: 94, baseType: !210, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !652, file: !653, line: 363, baseType: !179, size: 128, offset: 2496)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !652, file: !653, line: 363, baseType: !179, size: 128, offset: 2624)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !652, file: !653, line: 368, baseType: !692, size: 64, offset: 2752)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !653, line: 48, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !652, file: !653, line: 372, baseType: !695, size: 32, offset: 2816)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !653, line: 274, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !653, line: 271, size: 32, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !696, file: !653, line: 273, baseType: !7, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !652, file: !653, line: 373, baseType: !85, size: 32, offset: 2848)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !652, file: !653, line: 382, baseType: !701, size: 64, offset: 2880)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !653, line: 46, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !652, file: !653, line: 385, baseType: !704, size: 64, offset: 2944)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !114, !210}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !652, file: !653, line: 386, baseType: !708, size: 64, offset: 3008)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !114, !459}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !652, file: !653, line: 387, baseType: !712, size: 64, offset: 3072)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!85, !114}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !652, file: !653, line: 388, baseType: !716, size: 64, offset: 3136)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !114}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !652, file: !653, line: 389, baseType: !114, size: 64, offset: 3200)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !652, file: !653, line: 389, baseType: !114, size: 64, offset: 3264)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !652, file: !653, line: 389, baseType: !114, size: 64, offset: 3328)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !652, file: !653, line: 389, baseType: !114, size: 64, offset: 3392)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !333, file: !334, line: 1244, baseType: !724, size: 64, offset: 2048)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !84, line: 200, size: 17024, elements: !726)
!726 = !{!727, !728, !729, !730, !1142, !1143, !1144, !1145, !1146, !1147, !1148}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !725, file: !84, line: 201, baseType: !196, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !725, file: !84, line: 202, baseType: !179, size: 128, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !725, file: !84, line: 203, baseType: !179, size: 128, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !725, file: !84, line: 206, baseType: !731, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !84, line: 190, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !84, line: 126, size: 2816, elements: !734)
!734 = !{!735, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !833, !834, !835, !836, !1114, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1141}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !733, file: !84, line: 127, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !733, file: !84, line: 127, baseType: !736, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !733, file: !84, line: 128, baseType: !114, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !733, file: !84, line: 129, baseType: !114, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !733, file: !84, line: 130, baseType: !169, size: 512, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !733, file: !84, line: 132, baseType: !85, size: 32, offset: 768)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !733, file: !84, line: 132, baseType: !85, size: 32, offset: 800)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !733, file: !84, line: 133, baseType: !85, size: 32, offset: 832)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !733, file: !84, line: 134, baseType: !85, size: 32, offset: 864)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !733, file: !84, line: 134, baseType: !85, size: 32, offset: 896)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !733, file: !84, line: 134, baseType: !85, size: 32, offset: 928)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !733, file: !84, line: 135, baseType: !85, size: 32, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !733, file: !84, line: 135, baseType: !85, size: 32, offset: 992)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !733, file: !84, line: 136, baseType: !85, size: 32, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !733, file: !84, line: 136, baseType: !85, size: 32, offset: 1056)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !733, file: !84, line: 137, baseType: !85, size: 32, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !733, file: !84, line: 137, baseType: !85, size: 32, offset: 1120)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !733, file: !84, line: 138, baseType: !210, size: 32, offset: 1152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !733, file: !84, line: 139, baseType: !210, size: 32, offset: 1184)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !733, file: !84, line: 139, baseType: !210, size: 32, offset: 1216)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !733, file: !84, line: 141, baseType: !153, size: 16, offset: 1248)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !733, file: !84, line: 142, baseType: !153, size: 16, offset: 1264)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !733, file: !84, line: 143, baseType: !85, size: 32, offset: 1280)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !733, file: !84, line: 144, baseType: !85, size: 32, offset: 1312)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !733, file: !84, line: 146, baseType: !761, size: 64, offset: 1344)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !84, line: 114, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !84, line: 99, size: 7232, elements: !764)
!764 = !{!765, !767, !768, !769, !770, !771, !772, !783, !787, !801, !810, !817, !827}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !763, file: !84, line: 100, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !763, file: !84, line: 100, baseType: !766, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !763, file: !84, line: 101, baseType: !85, size: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !763, file: !84, line: 101, baseType: !85, size: 32, offset: 160)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !763, file: !84, line: 102, baseType: !85, size: 32, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !763, file: !84, line: 102, baseType: !85, size: 32, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !763, file: !84, line: 103, baseType: !773, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !84, line: 59, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !84, line: 56, size: 2112, elements: !776)
!776 = !{!777, !781, !782}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !775, file: !84, line: 57, baseType: !778, size: 2048)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 2048, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !775, file: !84, line: 58, baseType: !85, size: 32, offset: 2048)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !775, file: !84, line: 58, baseType: !85, size: 32, offset: 2080)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !763, file: !84, line: 106, baseType: !784, size: 6144, offset: 320)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 6144, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !763, file: !84, line: 107, baseType: !788, size: 64, offset: 6464)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !84, line: 97, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !84, line: 83, size: 8320, elements: !791)
!791 = !{!792, !793, !794, !797, !798, !799, !800}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !790, file: !84, line: 84, baseType: !784, size: 6144)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !790, file: !84, line: 87, baseType: !778, size: 2048, offset: 6144)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !790, file: !84, line: 88, baseType: !795, size: 64, offset: 8192)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !592, line: 41, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !790, file: !84, line: 90, baseType: !153, size: 16, offset: 8256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !790, file: !84, line: 92, baseType: !153, size: 16, offset: 8272)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !790, file: !84, line: 93, baseType: !153, size: 16, offset: 8288)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !790, file: !84, line: 95, baseType: !153, size: 16, offset: 8304)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !763, file: !84, line: 108, baseType: !802, size: 64, offset: 6528)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !84, line: 66, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !84, line: 61, size: 128, elements: !805)
!805 = !{!806, !807, !808, !809}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !804, file: !84, line: 62, baseType: !85, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !804, file: !84, line: 63, baseType: !85, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !804, file: !84, line: 64, baseType: !85, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !804, file: !84, line: 65, baseType: !85, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !763, file: !84, line: 109, baseType: !811, size: 64, offset: 6592)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !84, line: 71, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !84, line: 68, size: 64, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !813, file: !84, line: 69, baseType: !85, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !813, file: !84, line: 70, baseType: !85, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !763, file: !84, line: 110, baseType: !818, size: 64, offset: 6656)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !84, line: 81, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !84, line: 73, size: 352, elements: !821)
!821 = !{!822, !823, !824, !825, !826}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !820, file: !84, line: 74, baseType: !212, size: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !820, file: !84, line: 75, baseType: !212, size: 96, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !820, file: !84, line: 76, baseType: !212, size: 96, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !820, file: !84, line: 77, baseType: !85, size: 32, offset: 288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !820, file: !84, line: 78, baseType: !85, size: 32, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !763, file: !84, line: 113, baseType: !828, size: 512, offset: 6720)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !829, line: 182, baseType: !830)
!829 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !829, line: 180, size: 512, elements: !831)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !829, line: 181, baseType: !169, size: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !733, file: !84, line: 148, baseType: !359, size: 64, offset: 1408)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !733, file: !84, line: 151, baseType: !332, size: 64, offset: 1472)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !733, file: !84, line: 152, baseType: !339, size: 64, offset: 1536)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !733, file: !84, line: 153, baseType: !837, size: 64, offset: 1600)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !839, line: 64, size: 19136, elements: !840)
!839 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!840 = !{!841, !842, !843, !844, !845, !846, !848, !849, !850, !851, !854, !855, !1100, !1101, !1109, !1110, !1111, !1112, !1113}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !838, file: !839, line: 65, baseType: !120, size: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !838, file: !839, line: 66, baseType: !190, size: 64, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !838, file: !839, line: 68, baseType: !139, size: 8192, offset: 1024)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !838, file: !839, line: 70, baseType: !85, size: 32, offset: 9216)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !838, file: !839, line: 71, baseType: !85, size: 32, offset: 9248)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !838, file: !839, line: 72, baseType: !847, size: 64, offset: 9280)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 64, elements: !587)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !838, file: !839, line: 74, baseType: !210, size: 32, offset: 9344)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !838, file: !839, line: 74, baseType: !210, size: 32, offset: 9376)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !838, file: !839, line: 76, baseType: !795, size: 64, offset: 9408)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !838, file: !839, line: 77, baseType: !852, size: 64, offset: 9472)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !839, line: 77, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !838, file: !839, line: 78, baseType: !429, size: 64, offset: 9536)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !838, file: !839, line: 80, baseType: !856, size: 2624, offset: 9600)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !857, line: 340, size: 2624, elements: !858)
!857 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!858 = !{!859, !887, !905, !906, !907, !922, !980, !981, !1080, !1081, !1082, !1083, !1089}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !856, file: !857, line: 341, baseType: !860, size: 576)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !857, line: 251, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !857, line: 207, size: 576, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !861, file: !857, line: 208, baseType: !85, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !861, file: !857, line: 211, baseType: !153, size: 16, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !861, file: !857, line: 212, baseType: !153, size: 16, offset: 48)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !861, file: !857, line: 213, baseType: !210, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !861, file: !857, line: 214, baseType: !153, size: 16, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !861, file: !857, line: 215, baseType: !153, size: 16, offset: 112)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !861, file: !857, line: 216, baseType: !153, size: 16, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !861, file: !857, line: 217, baseType: !153, size: 16, offset: 144)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !861, file: !857, line: 218, baseType: !153, size: 16, offset: 160)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !861, file: !857, line: 219, baseType: !153, size: 16, offset: 176)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !861, file: !857, line: 220, baseType: !210, size: 32, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !861, file: !857, line: 222, baseType: !153, size: 16, offset: 224)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !861, file: !857, line: 225, baseType: !153, size: 16, offset: 240)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !861, file: !857, line: 228, baseType: !85, size: 32, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !861, file: !857, line: 229, baseType: !85, size: 32, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !861, file: !857, line: 233, baseType: !85, size: 32, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !861, file: !857, line: 236, baseType: !153, size: 16, offset: 352)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !861, file: !857, line: 236, baseType: !153, size: 16, offset: 368)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !861, file: !857, line: 241, baseType: !210, size: 32, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !861, file: !857, line: 244, baseType: !85, size: 32, offset: 416)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !861, file: !857, line: 244, baseType: !85, size: 32, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !861, file: !857, line: 245, baseType: !210, size: 32, offset: 480)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !861, file: !857, line: 248, baseType: !210, size: 32, offset: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !861, file: !857, line: 250, baseType: !85, size: 32, offset: 544)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !856, file: !857, line: 342, baseType: !888, size: 448, offset: 576)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !857, line: 79, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !857, line: 61, size: 448, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !889, file: !857, line: 62, baseType: !114, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !889, file: !857, line: 64, baseType: !153, size: 16, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !889, file: !857, line: 65, baseType: !153, size: 16, offset: 80)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !889, file: !857, line: 67, baseType: !210, size: 32, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !889, file: !857, line: 68, baseType: !210, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !889, file: !857, line: 69, baseType: !210, size: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !889, file: !857, line: 70, baseType: !153, size: 16, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !889, file: !857, line: 71, baseType: !153, size: 16, offset: 208)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !889, file: !857, line: 72, baseType: !586, size: 64, offset: 224)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !889, file: !857, line: 75, baseType: !210, size: 32, offset: 288)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !889, file: !857, line: 75, baseType: !210, size: 32, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !889, file: !857, line: 75, baseType: !210, size: 32, offset: 352)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !889, file: !857, line: 78, baseType: !210, size: 32, offset: 384)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !889, file: !857, line: 78, baseType: !210, size: 32, offset: 416)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !856, file: !857, line: 343, baseType: !179, size: 128, offset: 1024)
