; ModuleID = 'blender/source/blender/blenlib/intern/storage.c'
source_filename = "blender/source/blender/blenlib/intern/storage.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.direntry = type { i32, i8*, i8*, %struct.stat, i32, [16 x i8], [4 x i8], [4 x i8], [4 x i8], [16 x i8], [8 x i8], [16 x i8], [16 x i8], i8*, i32, %struct.ImBuf*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.ImBuf = type opaque
%struct.BuildDirCtx = type { %struct.direntry*, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.dirlink = type { %struct.dirlink*, %struct.dirlink*, i8* }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.LinkNode = type { %struct.LinkNode*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenlib/intern/storage.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !7, !8, !17, !91, !96, !44}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 46, baseType: !6)
!5 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!6 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirlink", file: !10, line: 79, size: 192, elements: !11)
!10 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!11 = !{!12, !13, !14}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !10, line: 80, baseType: !8, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !9, file: !10, line: 80, baseType: !8, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !10, line: 81, baseType: !15, size: 64, offset: 128)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "direntry", file: !10, line: 49, size: 2304, elements: !19)
!19 = !{!20, !26, !27, !28, !67, !68, !72, !76, !77, !78, !79, !83, !84, !85, !86, !87, !90}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !10, line: 50, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !22, line: 69, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !24, line: 150, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!25 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "relname", scope: !18, file: !10, line: 51, baseType: !15, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !18, file: !10, line: 52, baseType: !15, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !18, file: !10, line: 62, baseType: !29, size: 1152, offset: 192)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !30, line: 46, size: 1152, elements: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!31 = !{!32, !34, !36, !38, !39, !41, !43, !45, !46, !49, !51, !53, !61, !62, !63}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !29, file: !30, line: 48, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !24, line: 145, baseType: !6)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !29, file: !30, line: 53, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !24, line: 148, baseType: !6)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !29, file: !30, line: 61, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !24, line: 151, baseType: !6)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !29, file: !30, line: 62, baseType: !23, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !29, file: !30, line: 64, baseType: !40, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !24, line: 146, baseType: !25)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !29, file: !30, line: 65, baseType: !42, size: 32, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !24, line: 147, baseType: !25)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !29, file: !30, line: 67, baseType: !44, size: 32, offset: 288)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !29, file: !30, line: 69, baseType: !33, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !29, file: !30, line: 74, baseType: !47, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !24, line: 152, baseType: !48)
!48 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !29, file: !30, line: 78, baseType: !50, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !24, line: 174, baseType: !48)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !29, file: !30, line: 80, baseType: !52, size: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !24, line: 179, baseType: !48)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !29, file: !30, line: 91, baseType: !54, size: 128, offset: 576)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !55, line: 10, size: 128, elements: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !54, file: !55, line: 12, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !24, line: 160, baseType: !48)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !54, file: !55, line: 16, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !24, line: 196, baseType: !48)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !29, file: !30, line: 92, baseType: !54, size: 128, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !29, file: !30, line: 93, baseType: !54, size: 128, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !29, file: !30, line: 106, baseType: !64, size: 192, offset: 960)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 192, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 3)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !18, file: !10, line: 64, baseType: !25, size: 32, offset: 1344)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !18, file: !10, line: 65, baseType: !69, size: 128, offset: 1376)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 16)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mode1", scope: !18, file: !10, line: 66, baseType: !73, size: 32, offset: 1504)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !18, file: !10, line: 67, baseType: !73, size: 32, offset: 1536)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mode3", scope: !18, file: !10, line: 68, baseType: !73, size: 32, offset: 1568)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !18, file: !10, line: 69, baseType: !69, size: 128, offset: 1600)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !18, file: !10, line: 70, baseType: !80, size: 64, offset: 1728)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 8)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !18, file: !10, line: 71, baseType: !69, size: 128, offset: 1792)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !18, file: !10, line: 72, baseType: !69, size: 128, offset: 1920)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !18, file: !10, line: 73, baseType: !7, size: 64, offset: 2048)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !18, file: !10, line: 74, baseType: !44, size: 32, offset: 2112)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !18, file: !10, line: 75, baseType: !88, size: 64, offset: 2176)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !10, line: 47, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "selflag", scope: !18, file: !10, line: 76, baseType: !25, size: 32, offset: 2240)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!44, !94, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!96 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!97 = !{i32 7, !"Dwarf Version", i32 4}
!98 = !{i32 2, !"Debug Info Version", i32 3}
!99 = !{i32 1, !"wchar_size", i32 4}
!100 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!101 = distinct !DISubprogram(name: "BLI_current_working_dir", scope: !1, file: !1, line: 99, type: !102, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!102 = !DISubroutineType(types: !103)
!103 = !{!15, !15, !104}
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!105 = !DILocalVariable(name: "dir", arg: 1, scope: !101, file: !1, line: 99, type: !15)
!106 = !DILocation(line: 99, column: 37, scope: !101)
!107 = !DILocalVariable(name: "maxncpy", arg: 2, scope: !101, file: !1, line: 99, type: !104)
!108 = !DILocation(line: 99, column: 55, scope: !101)
!109 = !DILocation(line: 102, column: 3, scope: !101)
!110 = distinct !DISubprogram(name: "BLI_dir_contents", scope: !1, file: !1, line: 400, type: !111, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!111 = !DISubroutineType(types: !112)
!112 = !{!25, !113, !115}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!116 = !DILocalVariable(name: "dirname", arg: 1, scope: !110, file: !1, line: 400, type: !113)
!117 = !DILocation(line: 400, column: 43, scope: !110)
!118 = !DILocalVariable(name: "filelist", arg: 2, scope: !110, file: !1, line: 400, type: !115)
!119 = !DILocation(line: 400, column: 71, scope: !110)
!120 = !DILocalVariable(name: "dir_ctx", scope: !110, file: !1, line: 402, type: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BuildDirCtx", file: !1, line: 215, size: 128, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !121, file: !1, line: 216, baseType: !17, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "nrfiles", scope: !121, file: !1, line: 217, baseType: !44, size: 32, offset: 64)
!125 = !DILocation(line: 402, column: 21, scope: !110)
!126 = !DILocation(line: 404, column: 10, scope: !110)
!127 = !DILocation(line: 404, column: 18, scope: !110)
!128 = !DILocation(line: 405, column: 10, scope: !110)
!129 = !DILocation(line: 405, column: 16, scope: !110)
!130 = !DILocation(line: 407, column: 25, scope: !110)
!131 = !DILocation(line: 407, column: 2, scope: !110)
!132 = !DILocation(line: 408, column: 2, scope: !110)
!133 = !DILocation(line: 410, column: 14, scope: !134)
!134 = distinct !DILexicalBlock(scope: !110, file: !1, line: 410, column: 6)
!135 = !DILocation(line: 410, column: 6, scope: !134)
!136 = !DILocation(line: 410, column: 6, scope: !110)
!137 = !DILocation(line: 411, column: 23, scope: !138)
!138 = distinct !DILexicalBlock(scope: !134, file: !1, line: 410, column: 21)
!139 = !DILocation(line: 411, column: 4, scope: !138)
!140 = !DILocation(line: 411, column: 13, scope: !138)
!141 = !DILocation(line: 412, column: 2, scope: !138)
!142 = !DILocation(line: 416, column: 15, scope: !143)
!143 = distinct !DILexicalBlock(scope: !134, file: !1, line: 413, column: 7)
!144 = !DILocation(line: 416, column: 4, scope: !143)
!145 = !DILocation(line: 416, column: 13, scope: !143)
!146 = !DILocation(line: 419, column: 17, scope: !110)
!147 = !DILocation(line: 419, column: 2, scope: !110)
!148 = distinct !DISubprogram(name: "bli_builddir", scope: !1, file: !1, line: 223, type: !149, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !151, !113}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!152 = !DILocalVariable(name: "dir_ctx", arg: 1, scope: !148, file: !1, line: 223, type: !151)
!153 = !DILocation(line: 223, column: 46, scope: !148)
!154 = !DILocalVariable(name: "dirname", arg: 2, scope: !148, file: !1, line: 223, type: !113)
!155 = !DILocation(line: 223, column: 67, scope: !148)
!156 = !DILocalVariable(name: "dirbase", scope: !148, file: !1, line: 225, type: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !158, line: 69, size: 128, elements: !159)
!158 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !157, file: !158, line: 70, baseType: !7, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !157, file: !158, line: 70, baseType: !7, size: 64, offset: 64)
!162 = !DILocation(line: 225, column: 18, scope: !148)
!163 = !DILocalVariable(name: "newnum", scope: !148, file: !1, line: 226, type: !44)
!164 = !DILocation(line: 226, column: 6, scope: !148)
!165 = !DILocalVariable(name: "dir", scope: !148, file: !1, line: 227, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !168, line: 127, baseType: !169)
!168 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !168, line: 127, flags: DIFlagFwdDecl)
!170 = !DILocation(line: 227, column: 7, scope: !148)
!171 = !DILocation(line: 229, column: 21, scope: !172)
!172 = distinct !DILexicalBlock(scope: !148, file: !1, line: 229, column: 6)
!173 = !DILocation(line: 229, column: 13, scope: !172)
!174 = !DILocation(line: 229, column: 11, scope: !172)
!175 = !DILocation(line: 229, column: 31, scope: !172)
!176 = !DILocation(line: 229, column: 6, scope: !148)
!177 = !DILocalVariable(name: "fname", scope: !178, file: !1, line: 231, type: !179)
!178 = distinct !DILexicalBlock(scope: !172, file: !1, line: 229, column: 40)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !182, line: 22, size: 2240, elements: !183)
!182 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!183 = !{!184, !185, !186, !188, !190}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !181, file: !182, line: 25, baseType: !35, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !181, file: !182, line: 26, baseType: !47, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !181, file: !182, line: 31, baseType: !187, size: 16, offset: 128)
!187 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !181, file: !182, line: 32, baseType: !189, size: 8, offset: 144)
!189 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !181, file: !182, line: 33, baseType: !191, size: 2048, offset: 152)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 256)
!194 = !DILocation(line: 231, column: 24, scope: !178)
!195 = !DILocation(line: 232, column: 3, scope: !178)
!196 = !DILocation(line: 232, column: 27, scope: !178)
!197 = !DILocation(line: 232, column: 19, scope: !178)
!198 = !DILocation(line: 232, column: 17, scope: !178)
!199 = !DILocation(line: 232, column: 33, scope: !178)
!200 = !DILocalVariable(name: "dlink", scope: !201, file: !1, line: 233, type: !202)
!201 = distinct !DILexicalBlock(scope: !178, file: !1, line: 232, column: 42)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!203 = !DILocation(line: 233, column: 27, scope: !201)
!204 = !DILocation(line: 233, column: 53, scope: !201)
!205 = !DILocation(line: 233, column: 35, scope: !201)
!206 = !DILocation(line: 234, column: 8, scope: !207)
!207 = distinct !DILexicalBlock(scope: !201, file: !1, line: 234, column: 8)
!208 = !DILocation(line: 234, column: 14, scope: !207)
!209 = !DILocation(line: 234, column: 8, scope: !201)
!210 = !DILocation(line: 235, column: 30, scope: !211)
!211 = distinct !DILexicalBlock(scope: !207, file: !1, line: 234, column: 23)
!212 = !DILocation(line: 235, column: 37, scope: !211)
!213 = !DILocation(line: 235, column: 19, scope: !211)
!214 = !DILocation(line: 235, column: 5, scope: !211)
!215 = !DILocation(line: 235, column: 12, scope: !211)
!216 = !DILocation(line: 235, column: 17, scope: !211)
!217 = !DILocation(line: 236, column: 27, scope: !211)
!218 = !DILocation(line: 236, column: 5, scope: !211)
!219 = !DILocation(line: 237, column: 11, scope: !211)
!220 = !DILocation(line: 238, column: 4, scope: !211)
!221 = distinct !{!221, !195, !222}
!222 = !DILocation(line: 239, column: 3, scope: !178)
!223 = !DILocation(line: 241, column: 7, scope: !224)
!224 = distinct !DILexicalBlock(scope: !178, file: !1, line: 241, column: 7)
!225 = !DILocation(line: 241, column: 7, scope: !178)
!226 = !DILocation(line: 243, column: 8, scope: !227)
!227 = distinct !DILexicalBlock(scope: !228, file: !1, line: 243, column: 8)
!228 = distinct !DILexicalBlock(scope: !224, file: !1, line: 241, column: 15)
!229 = !DILocation(line: 243, column: 17, scope: !227)
!230 = !DILocation(line: 243, column: 8, scope: !228)
!231 = !DILocalVariable(name: "tmp", scope: !232, file: !1, line: 244, type: !233)
!232 = distinct !DILexicalBlock(scope: !227, file: !1, line: 243, column: 24)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!234 = !DILocation(line: 244, column: 18, scope: !232)
!235 = !DILocation(line: 244, column: 32, scope: !232)
!236 = !DILocation(line: 244, column: 41, scope: !232)
!237 = !DILocation(line: 244, column: 49, scope: !232)
!238 = !DILocation(line: 244, column: 58, scope: !232)
!239 = !DILocation(line: 244, column: 68, scope: !232)
!240 = !DILocation(line: 244, column: 66, scope: !232)
!241 = !DILocation(line: 244, column: 48, scope: !232)
!242 = !DILocation(line: 244, column: 76, scope: !232)
!243 = !DILocation(line: 244, column: 24, scope: !232)
!244 = !DILocation(line: 245, column: 9, scope: !245)
!245 = distinct !DILexicalBlock(scope: !232, file: !1, line: 245, column: 9)
!246 = !DILocation(line: 245, column: 9, scope: !232)
!247 = !DILocation(line: 246, column: 42, scope: !248)
!248 = distinct !DILexicalBlock(scope: !245, file: !1, line: 245, column: 14)
!249 = !DILocation(line: 246, column: 23, scope: !248)
!250 = !DILocation(line: 246, column: 6, scope: !248)
!251 = !DILocation(line: 246, column: 15, scope: !248)
!252 = !DILocation(line: 246, column: 21, scope: !248)
!253 = !DILocation(line: 247, column: 5, scope: !248)
!254 = !DILocation(line: 249, column: 11, scope: !255)
!255 = distinct !DILexicalBlock(scope: !245, file: !1, line: 248, column: 10)
!256 = !DILocation(line: 249, column: 20, scope: !255)
!257 = !DILocation(line: 249, column: 6, scope: !255)
!258 = !DILocation(line: 250, column: 6, scope: !255)
!259 = !DILocation(line: 250, column: 15, scope: !255)
!260 = !DILocation(line: 250, column: 21, scope: !255)
!261 = !DILocation(line: 252, column: 4, scope: !232)
!262 = !DILocation(line: 254, column: 8, scope: !263)
!263 = distinct !DILexicalBlock(scope: !228, file: !1, line: 254, column: 8)
!264 = !DILocation(line: 254, column: 17, scope: !263)
!265 = !DILocation(line: 254, column: 23, scope: !263)
!266 = !DILocation(line: 254, column: 8, scope: !228)
!267 = !DILocation(line: 255, column: 48, scope: !263)
!268 = !DILocation(line: 255, column: 55, scope: !263)
!269 = !DILocation(line: 255, column: 41, scope: !263)
!270 = !DILocation(line: 255, column: 22, scope: !263)
!271 = !DILocation(line: 255, column: 5, scope: !263)
!272 = !DILocation(line: 255, column: 14, scope: !263)
!273 = !DILocation(line: 255, column: 20, scope: !263)
!274 = !DILocation(line: 257, column: 8, scope: !275)
!275 = distinct !DILexicalBlock(scope: !228, file: !1, line: 257, column: 8)
!276 = !DILocation(line: 257, column: 17, scope: !275)
!277 = !DILocation(line: 257, column: 8, scope: !228)
!278 = !DILocalVariable(name: "dlink", scope: !279, file: !1, line: 258, type: !8)
!279 = distinct !DILexicalBlock(scope: !275, file: !1, line: 257, column: 24)
!280 = !DILocation(line: 258, column: 22, scope: !279)
!281 = !DILocation(line: 258, column: 57, scope: !279)
!282 = !DILocation(line: 258, column: 30, scope: !279)
!283 = !DILocalVariable(name: "file", scope: !279, file: !1, line: 259, type: !17)
!284 = !DILocation(line: 259, column: 22, scope: !279)
!285 = !DILocation(line: 259, column: 30, scope: !279)
!286 = !DILocation(line: 259, column: 39, scope: !279)
!287 = !DILocation(line: 259, column: 45, scope: !279)
!288 = !DILocation(line: 259, column: 54, scope: !279)
!289 = !DILocation(line: 260, column: 5, scope: !279)
!290 = !DILocation(line: 260, column: 12, scope: !279)
!291 = !DILocalVariable(name: "fullname", scope: !292, file: !1, line: 261, type: !293)
!292 = distinct !DILexicalBlock(scope: !279, file: !1, line: 260, column: 19)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32768, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 4096)
!296 = !DILocation(line: 261, column: 11, scope: !292)
!297 = !DILocation(line: 262, column: 13, scope: !292)
!298 = !DILocation(line: 262, column: 6, scope: !292)
!299 = !DILocation(line: 263, column: 22, scope: !292)
!300 = !DILocation(line: 263, column: 29, scope: !292)
!301 = !DILocation(line: 263, column: 6, scope: !292)
!302 = !DILocation(line: 263, column: 12, scope: !292)
!303 = !DILocation(line: 263, column: 20, scope: !292)
!304 = !DILocation(line: 264, column: 33, scope: !292)
!305 = !DILocation(line: 264, column: 42, scope: !292)
!306 = !DILocation(line: 264, column: 49, scope: !292)
!307 = !DILocation(line: 264, column: 19, scope: !292)
!308 = !DILocation(line: 264, column: 6, scope: !292)
!309 = !DILocation(line: 264, column: 12, scope: !292)
!310 = !DILocation(line: 264, column: 17, scope: !292)
!311 = !DILocation(line: 265, column: 23, scope: !292)
!312 = !DILocation(line: 265, column: 51, scope: !292)
!313 = !DILocation(line: 265, column: 60, scope: !292)
!314 = !DILocation(line: 265, column: 67, scope: !292)
!315 = !DILocation(line: 265, column: 6, scope: !292)
!316 = !DILocation(line: 266, column: 15, scope: !292)
!317 = !DILocation(line: 266, column: 26, scope: !292)
!318 = !DILocation(line: 266, column: 32, scope: !292)
!319 = !DILocation(line: 266, column: 6, scope: !292)
!320 = !DILocation(line: 267, column: 19, scope: !292)
!321 = !DILocation(line: 267, column: 25, scope: !292)
!322 = !DILocation(line: 267, column: 27, scope: !292)
!323 = !DILocation(line: 267, column: 6, scope: !292)
!324 = !DILocation(line: 267, column: 12, scope: !292)
!325 = !DILocation(line: 267, column: 17, scope: !292)
!326 = !DILocation(line: 268, column: 6, scope: !292)
!327 = !DILocation(line: 268, column: 12, scope: !292)
!328 = !DILocation(line: 268, column: 18, scope: !292)
!329 = !DILocation(line: 269, column: 6, scope: !292)
!330 = !DILocation(line: 269, column: 15, scope: !292)
!331 = !DILocation(line: 269, column: 22, scope: !292)
!332 = !DILocation(line: 270, column: 10, scope: !292)
!333 = !DILocation(line: 271, column: 14, scope: !292)
!334 = !DILocation(line: 271, column: 21, scope: !292)
!335 = !DILocation(line: 271, column: 12, scope: !292)
!336 = distinct !{!336, !289, !337}
!337 = !DILocation(line: 272, column: 5, scope: !279)
!338 = !DILocation(line: 273, column: 4, scope: !279)
!339 = !DILocation(line: 275, column: 5, scope: !340)
!340 = distinct !DILexicalBlock(scope: !275, file: !1, line: 274, column: 9)
!341 = !DILocation(line: 276, column: 5, scope: !340)
!342 = !DILocation(line: 279, column: 4, scope: !228)
!343 = !DILocation(line: 280, column: 8, scope: !344)
!344 = distinct !DILexicalBlock(scope: !228, file: !1, line: 280, column: 8)
!345 = !DILocation(line: 280, column: 17, scope: !344)
!346 = !DILocation(line: 280, column: 8, scope: !228)
!347 = !DILocation(line: 281, column: 11, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !1, line: 280, column: 24)
!349 = !DILocation(line: 281, column: 20, scope: !348)
!350 = !DILocation(line: 281, column: 27, scope: !348)
!351 = !DILocation(line: 281, column: 36, scope: !348)
!352 = !DILocation(line: 281, column: 5, scope: !348)
!353 = !DILocation(line: 282, column: 4, scope: !348)
!354 = !DILocation(line: 283, column: 3, scope: !228)
!355 = !DILocation(line: 285, column: 35, scope: !356)
!356 = distinct !DILexicalBlock(scope: !224, file: !1, line: 284, column: 8)
!357 = !DILocation(line: 285, column: 4, scope: !356)
!358 = !DILocation(line: 288, column: 12, scope: !178)
!359 = !DILocation(line: 288, column: 3, scope: !178)
!360 = !DILocation(line: 289, column: 2, scope: !178)
!361 = !DILocation(line: 291, column: 41, scope: !362)
!362 = distinct !DILexicalBlock(scope: !172, file: !1, line: 290, column: 7)
!363 = !DILocation(line: 291, column: 3, scope: !362)
!364 = !DILocation(line: 293, column: 1, scope: !148)
!365 = distinct !DISubprogram(name: "bli_adddirstrings", scope: !1, file: !1, line: 299, type: !366, scopeLine: 300, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !151}
!368 = !DILocalVariable(name: "dir_ctx", arg: 1, scope: !365, file: !1, line: 299, type: !151)
!369 = !DILocation(line: 299, column: 51, scope: !365)
!370 = !DILocalVariable(name: "types", scope: !365, file: !1, line: 301, type: !371)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 512, elements: !81)
!372 = !DILocation(line: 301, column: 14, scope: !365)
!373 = !DILocalVariable(name: "num", scope: !365, file: !1, line: 303, type: !44)
!374 = !DILocation(line: 303, column: 6, scope: !365)
!375 = !DILocalVariable(name: "st_size", scope: !365, file: !1, line: 307, type: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !22, line: 85, baseType: !47)
!377 = !DILocation(line: 307, column: 8, scope: !365)
!378 = !DILocalVariable(name: "mode", scope: !365, file: !1, line: 308, type: !44)
!379 = !DILocation(line: 308, column: 6, scope: !365)
!380 = !DILocalVariable(name: "file", scope: !365, file: !1, line: 311, type: !17)
!381 = !DILocation(line: 311, column: 19, scope: !365)
!382 = !DILocalVariable(name: "tm", scope: !365, file: !1, line: 312, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !385, line: 7, size: 448, elements: !386)
!385 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !384, file: !385, line: 9, baseType: !44, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !384, file: !385, line: 10, baseType: !44, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !384, file: !385, line: 11, baseType: !44, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !384, file: !385, line: 12, baseType: !44, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !384, file: !385, line: 13, baseType: !44, size: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !384, file: !385, line: 14, baseType: !44, size: 32, offset: 160)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !384, file: !385, line: 15, baseType: !44, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !384, file: !385, line: 16, baseType: !44, size: 32, offset: 224)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !384, file: !385, line: 17, baseType: !44, size: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !384, file: !385, line: 20, baseType: !48, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !384, file: !385, line: 21, baseType: !113, size: 64, offset: 384)
!398 = !DILocation(line: 312, column: 13, scope: !365)
!399 = !DILocalVariable(name: "zero", scope: !365, file: !1, line: 313, type: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !401, line: 7, baseType: !58)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!402 = !DILocation(line: 313, column: 9, scope: !365)
!403 = !DILocation(line: 315, column: 11, scope: !404)
!404 = distinct !DILexicalBlock(scope: !365, file: !1, line: 315, column: 2)
!405 = !DILocation(line: 315, column: 23, scope: !404)
!406 = !DILocation(line: 315, column: 32, scope: !404)
!407 = !DILocation(line: 315, column: 21, scope: !404)
!408 = !DILocation(line: 315, column: 7, scope: !404)
!409 = !DILocation(line: 315, column: 39, scope: !410)
!410 = distinct !DILexicalBlock(scope: !404, file: !1, line: 315, column: 2)
!411 = !DILocation(line: 315, column: 45, scope: !410)
!412 = !DILocation(line: 315, column: 54, scope: !410)
!413 = !DILocation(line: 315, column: 43, scope: !410)
!414 = !DILocation(line: 315, column: 2, scope: !404)
!415 = !DILocation(line: 324, column: 10, scope: !416)
!416 = distinct !DILexicalBlock(scope: !410, file: !1, line: 315, column: 78)
!417 = !DILocation(line: 324, column: 16, scope: !416)
!418 = !DILocation(line: 324, column: 18, scope: !416)
!419 = !DILocation(line: 324, column: 8, scope: !416)
!420 = !DILocation(line: 326, column: 15, scope: !416)
!421 = !DILocation(line: 326, column: 21, scope: !416)
!422 = !DILocation(line: 326, column: 35, scope: !416)
!423 = !DILocation(line: 326, column: 40, scope: !416)
!424 = !DILocation(line: 326, column: 48, scope: !416)
!425 = !DILocation(line: 326, column: 28, scope: !416)
!426 = !DILocation(line: 326, column: 3, scope: !416)
!427 = !DILocation(line: 327, column: 15, scope: !416)
!428 = !DILocation(line: 327, column: 21, scope: !416)
!429 = !DILocation(line: 327, column: 35, scope: !416)
!430 = !DILocation(line: 327, column: 40, scope: !416)
!431 = !DILocation(line: 327, column: 48, scope: !416)
!432 = !DILocation(line: 327, column: 28, scope: !416)
!433 = !DILocation(line: 327, column: 3, scope: !416)
!434 = !DILocation(line: 328, column: 15, scope: !416)
!435 = !DILocation(line: 328, column: 21, scope: !416)
!436 = !DILocation(line: 328, column: 35, scope: !416)
!437 = !DILocation(line: 328, column: 40, scope: !416)
!438 = !DILocation(line: 328, column: 28, scope: !416)
!439 = !DILocation(line: 328, column: 3, scope: !416)
!440 = !DILocation(line: 330, column: 9, scope: !441)
!441 = distinct !DILexicalBlock(scope: !416, file: !1, line: 330, column: 7)
!442 = !DILocation(line: 330, column: 14, scope: !441)
!443 = !DILocation(line: 330, column: 25, scope: !441)
!444 = !DILocation(line: 330, column: 37, scope: !441)
!445 = !DILocation(line: 330, column: 41, scope: !441)
!446 = !DILocation(line: 330, column: 47, scope: !441)
!447 = !DILocation(line: 330, column: 56, scope: !441)
!448 = !DILocation(line: 330, column: 7, scope: !416)
!449 = !DILocation(line: 330, column: 65, scope: !441)
!450 = !DILocation(line: 330, column: 71, scope: !441)
!451 = !DILocation(line: 330, column: 80, scope: !441)
!452 = !DILocation(line: 332, column: 7, scope: !453)
!453 = distinct !DILexicalBlock(scope: !416, file: !1, line: 332, column: 7)
!454 = !DILocation(line: 332, column: 12, scope: !453)
!455 = !DILocation(line: 332, column: 7, scope: !416)
!456 = !DILocation(line: 333, column: 8, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !1, line: 333, column: 8)
!458 = distinct !DILexicalBlock(scope: !453, file: !1, line: 332, column: 35)
!459 = !DILocation(line: 333, column: 14, scope: !457)
!460 = !DILocation(line: 333, column: 23, scope: !457)
!461 = !DILocation(line: 333, column: 8, scope: !458)
!462 = !DILocation(line: 333, column: 31, scope: !457)
!463 = !DILocation(line: 333, column: 37, scope: !457)
!464 = !DILocation(line: 333, column: 46, scope: !457)
!465 = !DILocation(line: 334, column: 9, scope: !457)
!466 = !DILocation(line: 334, column: 15, scope: !457)
!467 = !DILocation(line: 334, column: 24, scope: !457)
!468 = !DILocation(line: 336, column: 8, scope: !469)
!469 = distinct !DILexicalBlock(scope: !458, file: !1, line: 336, column: 8)
!470 = !DILocation(line: 336, column: 14, scope: !469)
!471 = !DILocation(line: 336, column: 23, scope: !469)
!472 = !DILocation(line: 336, column: 8, scope: !458)
!473 = !DILocation(line: 336, column: 31, scope: !469)
!474 = !DILocation(line: 336, column: 37, scope: !469)
!475 = !DILocation(line: 336, column: 46, scope: !469)
!476 = !DILocation(line: 337, column: 3, scope: !458)
!477 = !DILocalVariable(name: "pwuser", scope: !478, file: !1, line: 353, type: !479)
!478 = distinct !DILexicalBlock(scope: !416, file: !1, line: 352, column: 3)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !481, line: 49, size: 384, elements: !482)
!481 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!482 = !{!483, !484, !485, !486, !487, !488, !489}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !480, file: !481, line: 51, baseType: !15, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !480, file: !481, line: 52, baseType: !15, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !480, file: !481, line: 54, baseType: !40, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !480, file: !481, line: 55, baseType: !42, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !480, file: !481, line: 56, baseType: !15, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !480, file: !481, line: 57, baseType: !15, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !480, file: !481, line: 58, baseType: !15, size: 64, offset: 320)
!490 = !DILocation(line: 353, column: 19, scope: !478)
!491 = !DILocation(line: 354, column: 22, scope: !478)
!492 = !DILocation(line: 354, column: 28, scope: !478)
!493 = !DILocation(line: 354, column: 30, scope: !478)
!494 = !DILocation(line: 354, column: 13, scope: !478)
!495 = !DILocation(line: 354, column: 11, scope: !478)
!496 = !DILocation(line: 355, column: 8, scope: !497)
!497 = distinct !DILexicalBlock(scope: !478, file: !1, line: 355, column: 8)
!498 = !DILocation(line: 355, column: 8, scope: !478)
!499 = !DILocation(line: 356, column: 17, scope: !500)
!500 = distinct !DILexicalBlock(scope: !497, file: !1, line: 355, column: 16)
!501 = !DILocation(line: 356, column: 23, scope: !500)
!502 = !DILocation(line: 356, column: 30, scope: !500)
!503 = !DILocation(line: 356, column: 38, scope: !500)
!504 = !DILocation(line: 356, column: 5, scope: !500)
!505 = !DILocation(line: 357, column: 4, scope: !500)
!506 = !DILocation(line: 359, column: 18, scope: !507)
!507 = distinct !DILexicalBlock(scope: !497, file: !1, line: 358, column: 9)
!508 = !DILocation(line: 359, column: 24, scope: !507)
!509 = !DILocation(line: 359, column: 58, scope: !507)
!510 = !DILocation(line: 359, column: 64, scope: !507)
!511 = !DILocation(line: 359, column: 66, scope: !507)
!512 = !DILocation(line: 359, column: 5, scope: !507)
!513 = !DILocation(line: 366, column: 19, scope: !416)
!514 = !DILocation(line: 366, column: 25, scope: !416)
!515 = !DILocation(line: 366, column: 27, scope: !416)
!516 = !DILocation(line: 366, column: 8, scope: !416)
!517 = !DILocation(line: 366, column: 6, scope: !416)
!518 = !DILocation(line: 368, column: 7, scope: !519)
!519 = distinct !DILexicalBlock(scope: !416, file: !1, line: 368, column: 7)
!520 = !DILocation(line: 368, column: 10, scope: !519)
!521 = !DILocation(line: 368, column: 7, scope: !416)
!522 = !DILocation(line: 368, column: 24, scope: !519)
!523 = !DILocation(line: 368, column: 22, scope: !519)
!524 = !DILocation(line: 368, column: 19, scope: !519)
!525 = !DILocation(line: 369, column: 12, scope: !416)
!526 = !DILocation(line: 369, column: 18, scope: !416)
!527 = !DILocation(line: 369, column: 53, scope: !416)
!528 = !DILocation(line: 369, column: 3, scope: !416)
!529 = !DILocation(line: 370, column: 12, scope: !416)
!530 = !DILocation(line: 370, column: 18, scope: !416)
!531 = !DILocation(line: 370, column: 56, scope: !416)
!532 = !DILocation(line: 370, column: 3, scope: !416)
!533 = !DILocation(line: 379, column: 13, scope: !416)
!534 = !DILocation(line: 379, column: 19, scope: !416)
!535 = !DILocation(line: 379, column: 21, scope: !416)
!536 = !DILocation(line: 379, column: 11, scope: !416)
!537 = !DILocation(line: 381, column: 7, scope: !538)
!538 = distinct !DILexicalBlock(scope: !416, file: !1, line: 381, column: 7)
!539 = !DILocation(line: 381, column: 15, scope: !538)
!540 = !DILocation(line: 381, column: 7, scope: !416)
!541 = !DILocation(line: 382, column: 17, scope: !542)
!542 = distinct !DILexicalBlock(scope: !538, file: !1, line: 381, column: 37)
!543 = !DILocation(line: 382, column: 23, scope: !542)
!544 = !DILocation(line: 382, column: 70, scope: !542)
!545 = !DILocation(line: 382, column: 62, scope: !542)
!546 = !DILocation(line: 382, column: 79, scope: !542)
!547 = !DILocation(line: 382, column: 4, scope: !542)
!548 = !DILocation(line: 383, column: 3, scope: !542)
!549 = !DILocation(line: 384, column: 12, scope: !550)
!550 = distinct !DILexicalBlock(scope: !538, file: !1, line: 384, column: 12)
!551 = !DILocation(line: 384, column: 20, scope: !550)
!552 = !DILocation(line: 384, column: 12, scope: !538)
!553 = !DILocation(line: 385, column: 17, scope: !554)
!554 = distinct !DILexicalBlock(scope: !550, file: !1, line: 384, column: 35)
!555 = !DILocation(line: 385, column: 23, scope: !554)
!556 = !DILocation(line: 385, column: 70, scope: !554)
!557 = !DILocation(line: 385, column: 62, scope: !554)
!558 = !DILocation(line: 385, column: 79, scope: !554)
!559 = !DILocation(line: 385, column: 4, scope: !554)
!560 = !DILocation(line: 386, column: 3, scope: !554)
!561 = !DILocation(line: 387, column: 12, scope: !562)
!562 = distinct !DILexicalBlock(scope: !550, file: !1, line: 387, column: 12)
!563 = !DILocation(line: 387, column: 20, scope: !562)
!564 = !DILocation(line: 387, column: 12, scope: !550)
!565 = !DILocation(line: 388, column: 17, scope: !566)
!566 = distinct !DILexicalBlock(scope: !562, file: !1, line: 387, column: 28)
!567 = !DILocation(line: 388, column: 23, scope: !566)
!568 = !DILocation(line: 388, column: 65, scope: !566)
!569 = !DILocation(line: 388, column: 73, scope: !566)
!570 = !DILocation(line: 388, column: 59, scope: !566)
!571 = !DILocation(line: 388, column: 4, scope: !566)
!572 = !DILocation(line: 389, column: 3, scope: !566)
!573 = !DILocation(line: 391, column: 17, scope: !574)
!574 = distinct !DILexicalBlock(scope: !562, file: !1, line: 390, column: 8)
!575 = !DILocation(line: 391, column: 23, scope: !574)
!576 = !DILocation(line: 391, column: 62, scope: !574)
!577 = !DILocation(line: 391, column: 57, scope: !574)
!578 = !DILocation(line: 391, column: 4, scope: !574)
!579 = !DILocation(line: 393, column: 2, scope: !416)
!580 = !DILocation(line: 315, column: 66, scope: !410)
!581 = !DILocation(line: 315, column: 74, scope: !410)
!582 = !DILocation(line: 315, column: 2, scope: !410)
!583 = distinct !{!583, !414, !584}
!584 = !DILocation(line: 393, column: 2, scope: !404)
!585 = !DILocation(line: 394, column: 1, scope: !365)
!586 = distinct !DISubprogram(name: "BLI_free_filelist", scope: !1, file: !1, line: 423, type: !587, scopeLine: 424, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !17, !25}
!589 = !DILocalVariable(name: "filelist", arg: 1, scope: !586, file: !1, line: 423, type: !17)
!590 = !DILocation(line: 423, column: 41, scope: !586)
!591 = !DILocalVariable(name: "nrentries", arg: 2, scope: !586, file: !1, line: 423, type: !25)
!592 = !DILocation(line: 423, column: 64, scope: !586)
!593 = !DILocalVariable(name: "i", scope: !586, file: !1, line: 425, type: !25)
!594 = !DILocation(line: 425, column: 15, scope: !586)
!595 = !DILocation(line: 426, column: 9, scope: !596)
!596 = distinct !DILexicalBlock(scope: !586, file: !1, line: 426, column: 2)
!597 = !DILocation(line: 426, column: 7, scope: !596)
!598 = !DILocation(line: 426, column: 14, scope: !599)
!599 = distinct !DILexicalBlock(scope: !596, file: !1, line: 426, column: 2)
!600 = !DILocation(line: 426, column: 18, scope: !599)
!601 = !DILocation(line: 426, column: 16, scope: !599)
!602 = !DILocation(line: 426, column: 2, scope: !596)
!603 = !DILocalVariable(name: "entry", scope: !604, file: !1, line: 427, type: !605)
!604 = distinct !DILexicalBlock(scope: !599, file: !1, line: 426, column: 34)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!606 = !DILocation(line: 427, column: 27, scope: !604)
!607 = !DILocation(line: 427, column: 35, scope: !604)
!608 = !DILocation(line: 427, column: 46, scope: !604)
!609 = !DILocation(line: 427, column: 44, scope: !604)
!610 = !DILocation(line: 428, column: 7, scope: !611)
!611 = distinct !DILexicalBlock(scope: !604, file: !1, line: 428, column: 7)
!612 = !DILocation(line: 428, column: 14, scope: !611)
!613 = !DILocation(line: 428, column: 7, scope: !604)
!614 = !DILocation(line: 429, column: 18, scope: !615)
!615 = distinct !DILexicalBlock(scope: !611, file: !1, line: 428, column: 21)
!616 = !DILocation(line: 429, column: 25, scope: !615)
!617 = !DILocation(line: 429, column: 4, scope: !615)
!618 = !DILocation(line: 430, column: 3, scope: !615)
!619 = !DILocation(line: 431, column: 7, scope: !620)
!620 = distinct !DILexicalBlock(scope: !604, file: !1, line: 431, column: 7)
!621 = !DILocation(line: 431, column: 14, scope: !620)
!622 = !DILocation(line: 431, column: 7, scope: !604)
!623 = !DILocation(line: 432, column: 4, scope: !620)
!624 = !DILocation(line: 432, column: 14, scope: !620)
!625 = !DILocation(line: 432, column: 21, scope: !620)
!626 = !DILocation(line: 433, column: 7, scope: !627)
!627 = distinct !DILexicalBlock(scope: !604, file: !1, line: 433, column: 7)
!628 = !DILocation(line: 433, column: 14, scope: !627)
!629 = !DILocation(line: 433, column: 7, scope: !604)
!630 = !DILocation(line: 434, column: 4, scope: !627)
!631 = !DILocation(line: 434, column: 14, scope: !627)
!632 = !DILocation(line: 434, column: 21, scope: !627)
!633 = !DILocation(line: 436, column: 2, scope: !604)
!634 = !DILocation(line: 426, column: 29, scope: !599)
!635 = !DILocation(line: 426, column: 2, scope: !599)
!636 = distinct !{!636, !602, !637}
!637 = !DILocation(line: 436, column: 2, scope: !596)
!638 = !DILocation(line: 438, column: 7, scope: !586)
!639 = !DILocation(line: 438, column: 2, scope: !586)
!640 = !DILocation(line: 439, column: 1, scope: !586)
!641 = distinct !DISubprogram(name: "BLI_file_descriptor_size", scope: !1, file: !1, line: 445, type: !642, scopeLine: 446, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!642 = !DISubroutineType(types: !643)
!643 = !{!4, !44}
!644 = !DILocalVariable(name: "file", arg: 1, scope: !641, file: !1, line: 445, type: !44)
!645 = !DILocation(line: 445, column: 37, scope: !641)
!646 = !DILocalVariable(name: "st", scope: !641, file: !1, line: 447, type: !29)
!647 = !DILocation(line: 447, column: 14, scope: !641)
!648 = !DILocation(line: 448, column: 7, scope: !649)
!649 = distinct !DILexicalBlock(scope: !641, file: !1, line: 448, column: 6)
!650 = !DILocation(line: 448, column: 12, scope: !649)
!651 = !DILocation(line: 448, column: 17, scope: !649)
!652 = !DILocation(line: 448, column: 27, scope: !649)
!653 = !DILocation(line: 448, column: 21, scope: !649)
!654 = !DILocation(line: 448, column: 38, scope: !649)
!655 = !DILocation(line: 448, column: 6, scope: !641)
!656 = !DILocation(line: 449, column: 3, scope: !649)
!657 = !DILocation(line: 450, column: 12, scope: !641)
!658 = !DILocation(line: 450, column: 2, scope: !641)
!659 = !DILocation(line: 451, column: 1, scope: !641)
!660 = distinct !DISubprogram(name: "BLI_file_size", scope: !1, file: !1, line: 456, type: !661, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!661 = !DISubroutineType(types: !662)
!662 = !{!4, !113}
!663 = !DILocalVariable(name: "path", arg: 1, scope: !660, file: !1, line: 456, type: !113)
!664 = !DILocation(line: 456, column: 34, scope: !660)
!665 = !DILocalVariable(name: "stats", scope: !660, file: !1, line: 458, type: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_stat_t", file: !667, line: 73, baseType: !29)
!667 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!668 = !DILocation(line: 458, column: 13, scope: !660)
!669 = !DILocation(line: 459, column: 15, scope: !670)
!670 = distinct !DILexicalBlock(scope: !660, file: !1, line: 459, column: 6)
!671 = !DILocation(line: 459, column: 6, scope: !670)
!672 = !DILocation(line: 459, column: 29, scope: !670)
!673 = !DILocation(line: 459, column: 6, scope: !660)
!674 = !DILocation(line: 460, column: 3, scope: !670)
!675 = !DILocation(line: 461, column: 15, scope: !660)
!676 = !DILocation(line: 461, column: 2, scope: !660)
!677 = !DILocation(line: 462, column: 1, scope: !660)
!678 = distinct !DISubprogram(name: "BLI_stat", scope: !1, file: !1, line: 537, type: !679, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!679 = !DISubroutineType(types: !680)
!680 = !{!44, !113, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!682 = !DILocalVariable(name: "path", arg: 1, scope: !678, file: !1, line: 537, type: !113)
!683 = !DILocation(line: 537, column: 26, scope: !678)
!684 = !DILocalVariable(name: "buffer", arg: 2, scope: !678, file: !1, line: 537, type: !681)
!685 = !DILocation(line: 537, column: 45, scope: !678)
!686 = !DILocation(line: 539, column: 14, scope: !678)
!687 = !DILocation(line: 539, column: 20, scope: !678)
!688 = !DILocation(line: 539, column: 9, scope: !678)
!689 = !DILocation(line: 539, column: 2, scope: !678)
!690 = distinct !DISubprogram(name: "BLI_exists", scope: !1, file: !1, line: 468, type: !691, scopeLine: 469, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!691 = !DISubroutineType(types: !692)
!692 = !{!44, !113}
!693 = !DILocalVariable(name: "name", arg: 1, scope: !690, file: !1, line: 468, type: !113)
!694 = !DILocation(line: 468, column: 28, scope: !690)
!695 = !DILocalVariable(name: "st", scope: !690, file: !1, line: 507, type: !29)
!696 = !DILocation(line: 507, column: 14, scope: !690)
!697 = !DILocation(line: 508, column: 11, scope: !698)
!698 = distinct !DILexicalBlock(scope: !690, file: !1, line: 508, column: 6)
!699 = !DILocation(line: 508, column: 6, scope: !698)
!700 = !DILocation(line: 508, column: 6, scope: !690)
!701 = !DILocation(line: 508, column: 23, scope: !698)
!702 = !DILocation(line: 510, column: 12, scope: !690)
!703 = !DILocation(line: 510, column: 2, scope: !690)
!704 = !DILocation(line: 511, column: 1, scope: !690)
!705 = distinct !DISubprogram(name: "BLI_is_dir", scope: !1, file: !1, line: 547, type: !706, scopeLine: 548, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!706 = !DISubroutineType(types: !707)
!707 = !{!189, !113}
!708 = !DILocalVariable(name: "file", arg: 1, scope: !705, file: !1, line: 547, type: !113)
!709 = !DILocation(line: 547, column: 29, scope: !705)
!710 = !DILocation(line: 549, column: 9, scope: !705)
!711 = !DILocation(line: 549, column: 2, scope: !705)
!712 = distinct !DISubprogram(name: "BLI_is_file", scope: !1, file: !1, line: 555, type: !706, scopeLine: 556, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!713 = !DILocalVariable(name: "path", arg: 1, scope: !712, file: !1, line: 555, type: !113)
!714 = !DILocation(line: 555, column: 30, scope: !712)
!715 = !DILocalVariable(name: "mode", scope: !712, file: !1, line: 557, type: !716)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!717 = !DILocation(line: 557, column: 12, scope: !712)
!718 = !DILocation(line: 557, column: 30, scope: !712)
!719 = !DILocation(line: 557, column: 19, scope: !712)
!720 = !DILocation(line: 558, column: 10, scope: !712)
!721 = !DILocation(line: 558, column: 15, scope: !712)
!722 = !DILocation(line: 558, column: 19, scope: !712)
!723 = !DILocation(line: 558, column: 18, scope: !712)
!724 = !DILocation(line: 0, scope: !712)
!725 = !DILocation(line: 558, column: 9, scope: !712)
!726 = !DILocation(line: 558, column: 2, scope: !712)
!727 = distinct !DISubprogram(name: "BLI_file_read_as_lines", scope: !1, file: !1, line: 564, type: !728, scopeLine: 565, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!728 = !DISubroutineType(types: !729)
!729 = !{!730, !113}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !732, line: 45, size: 128, elements: !733)
!732 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !731, file: !732, line: 46, baseType: !730, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !731, file: !732, line: 47, baseType: !7, size: 64, offset: 64)
!736 = !DILocalVariable(name: "name", arg: 1, scope: !727, file: !1, line: 564, type: !113)
!737 = !DILocation(line: 564, column: 46, scope: !727)
!738 = !DILocalVariable(name: "fp", scope: !727, file: !1, line: 566, type: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !741, line: 7, baseType: !742)
!741 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !743, line: 49, size: 1728, elements: !744)
!743 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!744 = !{!745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !760, !762, !763, !764, !765, !766, !768, !772, !775, !777, !780, !783, !784, !785, !786, !787}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !742, file: !743, line: 51, baseType: !44, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !742, file: !743, line: 54, baseType: !15, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !742, file: !743, line: 55, baseType: !15, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !742, file: !743, line: 56, baseType: !15, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !742, file: !743, line: 57, baseType: !15, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !742, file: !743, line: 58, baseType: !15, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !742, file: !743, line: 59, baseType: !15, size: 64, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !742, file: !743, line: 60, baseType: !15, size: 64, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !742, file: !743, line: 61, baseType: !15, size: 64, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !742, file: !743, line: 64, baseType: !15, size: 64, offset: 576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !742, file: !743, line: 65, baseType: !15, size: 64, offset: 640)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !742, file: !743, line: 66, baseType: !15, size: 64, offset: 704)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !742, file: !743, line: 68, baseType: !758, size: 64, offset: 768)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !743, line: 36, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !742, file: !743, line: 70, baseType: !761, size: 64, offset: 832)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !742, file: !743, line: 72, baseType: !44, size: 32, offset: 896)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !742, file: !743, line: 73, baseType: !44, size: 32, offset: 928)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !742, file: !743, line: 74, baseType: !47, size: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !742, file: !743, line: 77, baseType: !187, size: 16, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !742, file: !743, line: 78, baseType: !767, size: 8, offset: 1040)
!767 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !742, file: !743, line: 79, baseType: !769, size: 8, offset: 1048)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 1)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !742, file: !743, line: 81, baseType: !773, size: 64, offset: 1088)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !743, line: 43, baseType: null)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !742, file: !743, line: 89, baseType: !776, size: 64, offset: 1152)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !24, line: 153, baseType: !48)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !742, file: !743, line: 91, baseType: !778, size: 64, offset: 1216)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !743, line: 37, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !742, file: !743, line: 92, baseType: !781, size: 64, offset: 1280)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !743, line: 38, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !742, file: !743, line: 93, baseType: !761, size: 64, offset: 1344)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !742, file: !743, line: 94, baseType: !7, size: 64, offset: 1408)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !742, file: !743, line: 95, baseType: !4, size: 64, offset: 1472)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !742, file: !743, line: 96, baseType: !44, size: 32, offset: 1536)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !742, file: !743, line: 98, baseType: !788, size: 160, offset: 1568)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 20)
!791 = !DILocation(line: 566, column: 8, scope: !727)
!792 = !DILocation(line: 566, column: 23, scope: !727)
!793 = !DILocation(line: 566, column: 13, scope: !727)
!794 = !DILocalVariable(name: "lines", scope: !727, file: !1, line: 567, type: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !732, line: 48, baseType: !731)
!797 = !DILocation(line: 567, column: 12, scope: !727)
!798 = !DILocalVariable(name: "buf", scope: !727, file: !1, line: 568, type: !15)
!799 = !DILocation(line: 568, column: 8, scope: !727)
!800 = !DILocalVariable(name: "size", scope: !727, file: !1, line: 569, type: !4)
!801 = !DILocation(line: 569, column: 9, scope: !727)
!802 = !DILocation(line: 571, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !727, file: !1, line: 571, column: 6)
!804 = !DILocation(line: 571, column: 6, scope: !727)
!805 = !DILocation(line: 571, column: 11, scope: !803)
!806 = !DILocation(line: 573, column: 8, scope: !727)
!807 = !DILocation(line: 573, column: 2, scope: !727)
!808 = !DILocation(line: 574, column: 23, scope: !727)
!809 = !DILocation(line: 574, column: 17, scope: !727)
!810 = !DILocation(line: 574, column: 7, scope: !727)
!811 = !DILocation(line: 575, column: 8, scope: !727)
!812 = !DILocation(line: 575, column: 2, scope: !727)
!813 = !DILocation(line: 577, column: 8, scope: !727)
!814 = !DILocation(line: 577, column: 20, scope: !727)
!815 = !DILocation(line: 577, column: 6, scope: !727)
!816 = !DILocation(line: 578, column: 6, scope: !817)
!817 = distinct !DILexicalBlock(scope: !727, file: !1, line: 578, column: 6)
!818 = !DILocation(line: 578, column: 6, scope: !727)
!819 = !DILocalVariable(name: "i", scope: !820, file: !1, line: 579, type: !4)
!820 = distinct !DILexicalBlock(scope: !817, file: !1, line: 578, column: 11)
!821 = !DILocation(line: 579, column: 10, scope: !820)
!822 = !DILocalVariable(name: "last", scope: !820, file: !1, line: 579, type: !4)
!823 = !DILocation(line: 579, column: 13, scope: !820)
!824 = !DILocation(line: 586, column: 16, scope: !820)
!825 = !DILocation(line: 586, column: 24, scope: !820)
!826 = !DILocation(line: 586, column: 30, scope: !820)
!827 = !DILocation(line: 586, column: 10, scope: !820)
!828 = !DILocation(line: 586, column: 8, scope: !820)
!829 = !DILocation(line: 587, column: 10, scope: !830)
!830 = distinct !DILexicalBlock(scope: !820, file: !1, line: 587, column: 3)
!831 = !DILocation(line: 587, column: 8, scope: !830)
!832 = !DILocation(line: 587, column: 15, scope: !833)
!833 = distinct !DILexicalBlock(scope: !830, file: !1, line: 587, column: 3)
!834 = !DILocation(line: 587, column: 20, scope: !833)
!835 = !DILocation(line: 587, column: 17, scope: !833)
!836 = !DILocation(line: 587, column: 3, scope: !830)
!837 = !DILocation(line: 588, column: 8, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !1, line: 588, column: 8)
!839 = distinct !DILexicalBlock(scope: !833, file: !1, line: 587, column: 31)
!840 = !DILocation(line: 588, column: 13, scope: !838)
!841 = !DILocation(line: 588, column: 10, scope: !838)
!842 = !DILocation(line: 588, column: 18, scope: !838)
!843 = !DILocation(line: 588, column: 21, scope: !838)
!844 = !DILocation(line: 588, column: 25, scope: !838)
!845 = !DILocation(line: 588, column: 28, scope: !838)
!846 = !DILocation(line: 588, column: 8, scope: !839)
!847 = !DILocalVariable(name: "line", scope: !848, file: !1, line: 589, type: !15)
!848 = distinct !DILexicalBlock(scope: !838, file: !1, line: 588, column: 37)
!849 = !DILocation(line: 589, column: 11, scope: !848)
!850 = !DILocation(line: 589, column: 31, scope: !848)
!851 = !DILocation(line: 589, column: 35, scope: !848)
