; ModuleID = 'blender/source/blender/editors/armature/reeb.c'
source_filename = "blender/source/blender/editors/armature/reeb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BArc = type { i8*, i8*, %struct.BNode*, %struct.BNode*, i32, float, i32, i32, i32 }
%struct.BNode = type { i8*, i8*, [3 x float], i32, i32, %struct.BArc**, i32, i32, i32, [3 x float] }
%struct.ReebArc = type { i8*, i8*, %struct.ReebNode*, %struct.ReebNode*, i32, float, i32, i32, i32, %struct.ListBase, i32, %struct.EmbedBucket*, %struct.GHash*, float, %struct.ReebArc* }
%struct.ReebNode = type { i8*, i8*, [3 x float], i32, i32, %struct.ReebArc**, i32, i32, i32, [3 x float], [3 x float], i32, float, i32, %struct.ReebNode*, %struct.ReebNode* }
%struct.ListBase = type { i8*, i8* }
%struct.EmbedBucket = type { float, i32, [3 x float], [3 x float] }
%struct.GHash = type opaque
%struct.ReebGraph = type { %struct.ListBase, %struct.ListBase, float, void (%struct.BArc*)*, void (%struct.BNode*)*, void (%struct.BNode*, %struct.RadialArc*, i32)*, void (%struct.BNode*, %struct.BNode*, %struct.BNode*, %struct.BArc*, %struct.BArc*)*, i32, i32, %struct.EdgeHash*, i32, %struct.ReebGraph* }
%struct.RadialArc = type { %struct.BArc*, [3 x float] }
%struct.EdgeHash = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/armature/reeb.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !67, !126, !128, !130, !132, !20, !165}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReebArc", file: !6, line: 120, baseType: !7)
!6 = !DIFile(filename: "blender/source/blender/editors/armature/reeb.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReebArc", file: !6, line: 101, size: 896, elements: !8)
!8 = !{!9, !11, !12, !39, !40, !41, !42, !43, !44, !45, !52, !53, !61, !65, !66}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !6, line: 102, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !6, line: 102, baseType: !10, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !7, file: !6, line: 103, baseType: !13, size: 64, offset: 128)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReebNode", file: !6, line: 69, size: 896, elements: !15)
!15 = !{!16, !17, !18, !23, !25, !26, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !6, line: 70, baseType: !10, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !14, file: !6, line: 70, baseType: !10, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !14, file: !6, line: 71, baseType: !19, size: 96, offset: 128)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !21)
!20 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!21 = !{!22}
!22 = !DISubrange(count: 3)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !14, file: !6, line: 72, baseType: !24, size: 32, offset: 224)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !14, file: !6, line: 74, baseType: !24, size: 32, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !14, file: !6, line: 75, baseType: !27, size: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "subgraph_index", scope: !14, file: !6, line: 77, baseType: !24, size: 32, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_level", scope: !14, file: !6, line: 79, baseType: !24, size: 32, offset: 416)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flag", scope: !14, file: !6, line: 80, baseType: !24, size: 32, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_axis", scope: !14, file: !6, line: 81, baseType: !19, size: 96, offset: 480)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !14, file: !6, line: 84, baseType: !19, size: 96, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !14, file: !6, line: 86, baseType: !24, size: 32, offset: 672)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !14, file: !6, line: 87, baseType: !20, size: 32, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "multi_level", scope: !14, file: !6, line: 88, baseType: !24, size: 32, offset: 736)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "link_down", scope: !14, file: !6, line: 89, baseType: !13, size: 64, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "link_up", scope: !14, file: !6, line: 90, baseType: !13, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !7, file: !6, line: 103, baseType: !13, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !7, file: !6, line: 104, baseType: !24, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !7, file: !6, line: 106, baseType: !20, size: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_level", scope: !7, file: !6, line: 108, baseType: !24, size: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_group", scope: !7, file: !6, line: 109, baseType: !24, size: 32, offset: 352)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flag", scope: !7, file: !6, line: 110, baseType: !24, size: 32, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !7, file: !6, line: 113, baseType: !46, size: 128, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !47, line: 71, baseType: !48)
!47 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !47, line: 69, size: 128, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !48, file: !47, line: 70, baseType: !10, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !48, file: !47, line: 70, baseType: !10, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "bcount", scope: !7, file: !6, line: 114, baseType: !24, size: 32, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !7, file: !6, line: 115, baseType: !54, size: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EmbedBucket", file: !6, line: 62, size: 256, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !55, file: !6, line: 63, baseType: !20, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nv", scope: !55, file: !6, line: 64, baseType: !24, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !55, file: !6, line: 65, baseType: !19, size: 96, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !55, file: !6, line: 66, baseType: !19, size: 96, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "faces", scope: !7, file: !6, line: 117, baseType: !62, size: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !64, line: 48, flags: DIFlagFwdDecl)
!64 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !7, file: !6, line: 118, baseType: !20, size: 32, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "link_up", scope: !7, file: !6, line: 119, baseType: !28, size: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "BGraph", file: !69, line: 62, baseType: !70)
!69 = !DIFile(filename: "blender/source/blender/blenlib/BLI_graph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BGraph", file: !69, line: 51, size: 576, elements: !71)
!71 = !{!72, !73, !74, !75, !106, !111, !121}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !70, file: !69, line: 52, baseType: !46, size: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !70, file: !69, line: 53, baseType: !46, size: 128, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !70, file: !69, line: 55, baseType: !20, size: 32, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "free_arc", scope: !70, file: !69, line: 58, baseType: !76, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FreeArc", file: !69, line: 40, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BArc", file: !69, line: 79, size: 448, elements: !82)
!82 = !{!83, !84, !85, !100, !101, !102, !103, !104, !105}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !69, line: 80, baseType: !10, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !81, file: !69, line: 80, baseType: !10, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !81, file: !69, line: 81, baseType: !86, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BNode", file: !69, line: 64, size: 576, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !96, !97, !98, !99}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !69, line: 65, baseType: !10, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !69, line: 65, baseType: !10, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !87, file: !69, line: 66, baseType: !19, size: 96, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !69, line: 67, baseType: !24, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !87, file: !69, line: 69, baseType: !24, size: 32, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !87, file: !69, line: 70, baseType: !95, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "subgraph_index", scope: !87, file: !69, line: 72, baseType: !24, size: 32, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_level", scope: !87, file: !69, line: 74, baseType: !24, size: 32, offset: 416)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flag", scope: !87, file: !69, line: 75, baseType: !24, size: 32, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_axis", scope: !87, file: !69, line: 76, baseType: !19, size: 96, offset: 480)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !81, file: !69, line: 81, baseType: !86, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !81, file: !69, line: 82, baseType: !24, size: 32, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !81, file: !69, line: 84, baseType: !20, size: 32, offset: 288)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_level", scope: !81, file: !69, line: 86, baseType: !24, size: 32, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_group", scope: !81, file: !69, line: 87, baseType: !24, size: 32, offset: 352)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flag", scope: !81, file: !69, line: 88, baseType: !24, size: 32, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !70, file: !69, line: 59, baseType: !107, size: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "FreeNode", file: !69, line: 41, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !86}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symmetry", scope: !70, file: !69, line: 60, baseType: !112, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "RadialSymmetry", file: !69, line: 42, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !86, !116, !24}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RadialArc", file: !69, line: 126, size: 192, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "arc", scope: !117, file: !69, line: 127, baseType: !80, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !117, file: !69, line: 128, baseType: !19, size: 96, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "axial_symmetry", scope: !70, file: !69, line: 61, baseType: !122, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AxialSymmetry", file: !69, line: 43, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !86, !86, !86, !80, !80}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "BNode", file: !69, line: 77, baseType: !87)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "BArc", file: !69, line: 89, baseType: !81)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReebNode", file: !6, line: 91, baseType: !14)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "BArcIterator", file: !69, line: 123, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BArcIterator", file: !69, line: 109, size: 704, elements: !135)
!135 = !{!136, !141, !143, !148, !150, !152, !154, !159, !161, !162, !163, !164}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !134, file: !69, line: 110, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "HeadFct", file: !69, line: 101, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!10, !10}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !134, file: !69, line: 111, baseType: !142, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "TailFct", file: !69, line: 102, baseType: !138)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "peek", scope: !134, file: !69, line: 112, baseType: !144, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PeekFct", file: !69, line: 103, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!10, !10, !24}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !69, line: 113, baseType: !149, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "NextFct", file: !69, line: 104, baseType: !138)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nextN", scope: !134, file: !69, line: 114, baseType: !151, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "NextNFct", file: !69, line: 105, baseType: !145)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !134, file: !69, line: 115, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviousFct", file: !69, line: 106, baseType: !138)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !134, file: !69, line: 116, baseType: !155, size: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "StoppedFct", file: !69, line: 107, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!24, !10}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !134, file: !69, line: 118, baseType: !160, size: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !134, file: !69, line: 118, baseType: !160, size: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !134, file: !69, line: 119, baseType: !20, size: 32, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !134, file: !69, line: 121, baseType: !24, size: 32, offset: 608)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !134, file: !69, line: 122, baseType: !24, size: 32, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReebArcIterator", file: !6, line: 141, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReebArcIterator", file: !6, line: 122, size: 896, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !167, file: !6, line: 123, baseType: !137, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !167, file: !6, line: 124, baseType: !142, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "peek", scope: !167, file: !6, line: 125, baseType: !144, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !6, line: 126, baseType: !149, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nextN", scope: !167, file: !6, line: 127, baseType: !151, size: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !167, file: !6, line: 128, baseType: !153, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !167, file: !6, line: 129, baseType: !155, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !167, file: !6, line: 131, baseType: !160, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !167, file: !6, line: 131, baseType: !160, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !167, file: !6, line: 132, baseType: !20, size: 32, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !167, file: !6, line: 134, baseType: !24, size: 32, offset: 608)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !167, file: !6, line: 135, baseType: !24, size: 32, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "arc", scope: !167, file: !6, line: 137, baseType: !28, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !167, file: !6, line: 138, baseType: !24, size: 32, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !167, file: !6, line: 139, baseType: !24, size: 32, offset: 800)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !167, file: !6, line: 140, baseType: !24, size: 32, offset: 832)
!185 = !{i32 7, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{i32 1, !"wchar_size", i32 4}
!188 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!189 = distinct !DISubprogram(name: "REEB_freeArc", scope: !1, file: !1, line: 151, type: !190, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !128}
!192 = !DILocalVariable(name: "barc", arg: 1, scope: !189, file: !1, line: 151, type: !128)
!193 = !DILocation(line: 151, column: 25, scope: !189)
!194 = !DILocalVariable(name: "arc", scope: !189, file: !1, line: 153, type: !4)
!195 = !DILocation(line: 153, column: 11, scope: !189)
!196 = !DILocation(line: 153, column: 28, scope: !189)
!197 = !DILocation(line: 153, column: 17, scope: !189)
!198 = !DILocation(line: 154, column: 17, scope: !189)
!199 = !DILocation(line: 154, column: 22, scope: !189)
!200 = !DILocation(line: 154, column: 2, scope: !189)
!201 = !DILocation(line: 156, column: 6, scope: !202)
!202 = distinct !DILexicalBlock(scope: !189, file: !1, line: 156, column: 6)
!203 = !DILocation(line: 156, column: 11, scope: !202)
!204 = !DILocation(line: 156, column: 6, scope: !189)
!205 = !DILocation(line: 157, column: 3, scope: !202)
!206 = !DILocation(line: 157, column: 13, scope: !202)
!207 = !DILocation(line: 157, column: 18, scope: !202)
!208 = !DILocation(line: 159, column: 6, scope: !209)
!209 = distinct !DILexicalBlock(scope: !189, file: !1, line: 159, column: 6)
!210 = !DILocation(line: 159, column: 11, scope: !209)
!211 = !DILocation(line: 159, column: 6, scope: !189)
!212 = !DILocation(line: 160, column: 18, scope: !209)
!213 = !DILocation(line: 160, column: 23, scope: !209)
!214 = !DILocation(line: 160, column: 3, scope: !209)
!215 = !DILocation(line: 162, column: 2, scope: !189)
!216 = !DILocation(line: 162, column: 12, scope: !189)
!217 = !DILocation(line: 163, column: 1, scope: !189)
!218 = distinct !DISubprogram(name: "REEB_freeGraph", scope: !1, file: !1, line: 165, type: !219, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReebGraph", file: !6, line: 60, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReebGraph", file: !6, line: 43, size: 832, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !238, !239}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !223, file: !6, line: 44, baseType: !46, size: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !223, file: !6, line: 45, baseType: !46, size: 128, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !223, file: !6, line: 47, baseType: !20, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "free_arc", scope: !223, file: !6, line: 49, baseType: !76, size: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !223, file: !6, line: 50, baseType: !107, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symmetry", scope: !223, file: !6, line: 51, baseType: !112, size: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "axial_symmetry", scope: !223, file: !6, line: 52, baseType: !122, size: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !223, file: !6, line: 55, baseType: !24, size: 32, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "totnodes", scope: !223, file: !6, line: 56, baseType: !24, size: 32, offset: 608)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "emap", scope: !223, file: !6, line: 57, baseType: !235, size: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "EdgeHash", file: !237, line: 34, flags: DIFlagFwdDecl)
!237 = !DIFile(filename: "blender/source/blender/blenlib/BLI_edgehash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "multi_level", scope: !223, file: !6, line: 58, baseType: !24, size: 32, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "link_up", scope: !223, file: !6, line: 59, baseType: !240, size: 64, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!241 = !DILocalVariable(name: "rg", arg: 1, scope: !218, file: !1, line: 165, type: !221)
!242 = !DILocation(line: 165, column: 32, scope: !218)
!243 = !DILocalVariable(name: "arc", scope: !218, file: !1, line: 167, type: !4)
!244 = !DILocation(line: 167, column: 11, scope: !218)
!245 = !DILocalVariable(name: "node", scope: !218, file: !1, line: 168, type: !130)
!246 = !DILocation(line: 168, column: 12, scope: !218)
!247 = !DILocation(line: 171, column: 14, scope: !248)
!248 = distinct !DILexicalBlock(scope: !218, file: !1, line: 171, column: 2)
!249 = !DILocation(line: 171, column: 18, scope: !248)
!250 = !DILocation(line: 171, column: 24, scope: !248)
!251 = !DILocation(line: 171, column: 12, scope: !248)
!252 = !DILocation(line: 171, column: 7, scope: !248)
!253 = !DILocation(line: 171, column: 31, scope: !254)
!254 = distinct !DILexicalBlock(scope: !248, file: !1, line: 171, column: 2)
!255 = !DILocation(line: 171, column: 2, scope: !248)
!256 = !DILocation(line: 172, column: 26, scope: !257)
!257 = distinct !DILexicalBlock(scope: !254, file: !1, line: 171, column: 56)
!258 = !DILocation(line: 172, column: 16, scope: !257)
!259 = !DILocation(line: 172, column: 39, scope: !257)
!260 = !DILocation(line: 172, column: 30, scope: !257)
!261 = !DILocation(line: 172, column: 3, scope: !257)
!262 = !DILocation(line: 173, column: 2, scope: !257)
!263 = !DILocation(line: 171, column: 44, scope: !254)
!264 = !DILocation(line: 171, column: 50, scope: !254)
!265 = !DILocation(line: 171, column: 42, scope: !254)
!266 = !DILocation(line: 171, column: 2, scope: !254)
!267 = distinct !{!267, !255, !268}
!268 = !DILocation(line: 173, column: 2, scope: !248)
!269 = !DILocation(line: 174, column: 17, scope: !218)
!270 = !DILocation(line: 174, column: 21, scope: !218)
!271 = !DILocation(line: 174, column: 2, scope: !218)
!272 = !DILocation(line: 177, column: 8, scope: !218)
!273 = !DILocation(line: 177, column: 12, scope: !218)
!274 = !DILocation(line: 177, column: 17, scope: !218)
!275 = !DILocation(line: 177, column: 6, scope: !218)
!276 = !DILocation(line: 178, column: 2, scope: !218)
!277 = !DILocation(line: 178, column: 9, scope: !218)
!278 = !DILocalVariable(name: "next", scope: !279, file: !1, line: 179, type: !4)
!279 = distinct !DILexicalBlock(scope: !218, file: !1, line: 178, column: 14)
!280 = !DILocation(line: 179, column: 12, scope: !279)
!281 = !DILocation(line: 179, column: 19, scope: !279)
!282 = !DILocation(line: 179, column: 24, scope: !279)
!283 = !DILocation(line: 180, column: 24, scope: !279)
!284 = !DILocation(line: 180, column: 16, scope: !279)
!285 = !DILocation(line: 180, column: 3, scope: !279)
!286 = !DILocation(line: 181, column: 9, scope: !279)
!287 = !DILocation(line: 181, column: 7, scope: !279)
!288 = distinct !{!288, !276, !289}
!289 = !DILocation(line: 182, column: 2, scope: !218)
!290 = !DILocation(line: 185, column: 20, scope: !218)
!291 = !DILocation(line: 185, column: 24, scope: !218)
!292 = !DILocation(line: 185, column: 2, scope: !218)
!293 = !DILocation(line: 188, column: 6, scope: !294)
!294 = distinct !DILexicalBlock(scope: !218, file: !1, line: 188, column: 6)
!295 = !DILocation(line: 188, column: 10, scope: !294)
!296 = !DILocation(line: 188, column: 6, scope: !218)
!297 = !DILocation(line: 189, column: 18, scope: !298)
!298 = distinct !DILexicalBlock(scope: !294, file: !1, line: 188, column: 19)
!299 = !DILocation(line: 189, column: 22, scope: !298)
!300 = !DILocation(line: 189, column: 3, scope: !298)
!301 = !DILocation(line: 190, column: 2, scope: !298)
!302 = !DILocation(line: 192, column: 2, scope: !218)
!303 = !DILocation(line: 192, column: 12, scope: !218)
!304 = !DILocation(line: 193, column: 1, scope: !218)
