; ModuleID = 'blender/source/blender/bmesh/operators/bmo_normals.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_normals.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !54, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/bmesh/operators/bmo_normals.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !15, !21, !27, !35, !42, !49}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !4, line: 94, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!12 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!14 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !4, line: 116, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 83, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!54 = !{!55, !56, !85, !122, !76}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !59)
!59 = !{!60, !71, !77, !91, !92, !115, !121}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !58, file: !43, line: 111, baseType: !61, size: 128)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !63)
!63 = !{!64, !65, !67, !69, !70}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !62, file: !43, line: 65, baseType: !55, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !62, file: !43, line: 66, baseType: !66, size: 32, offset: 64)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !62, file: !43, line: 73, baseType: !68, size: 8, offset: 96)
!68 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !62, file: !43, line: 74, baseType: !68, size: 8, offset: 104)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !62, file: !43, line: 80, baseType: !68, size: 8, offset: 112)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !58, file: !43, line: 112, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !74)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !73, file: !43, line: 181, baseType: !76, size: 16)
!76 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !58, file: !43, line: 114, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !80)
!80 = !{!81, !82, !83, !88, !89}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !79, file: !43, line: 91, baseType: !61, size: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !79, file: !43, line: 92, baseType: !72, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !79, file: !43, line: 94, baseType: !84, size: 96, offset: 192)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 96, elements: !86)
!85 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!86 = !{!87}
!87 = !DISubrange(count: 3)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !79, file: !43, line: 95, baseType: !84, size: 96, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !79, file: !43, line: 102, baseType: !90, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !58, file: !43, line: 114, baseType: !78, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !58, file: !43, line: 118, baseType: !93, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !95)
!95 = !{!96, !97, !98, !99, !111, !112, !113, !114}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !94, file: !43, line: 126, baseType: !61, size: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !94, file: !43, line: 129, baseType: !78, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !94, file: !43, line: 130, baseType: !90, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !94, file: !43, line: 131, baseType: !100, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !102)
!102 = !{!103, !104, !105, !108, !109, !110}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !101, file: !43, line: 165, baseType: !61, size: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !101, file: !43, line: 166, baseType: !72, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !101, file: !43, line: 172, baseType: !106, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !94)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !101, file: !43, line: 174, baseType: !66, size: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !101, file: !43, line: 175, baseType: !84, size: 96, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !101, file: !43, line: 176, baseType: !76, size: 16, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !94, file: !43, line: 135, baseType: !93, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !94, file: !43, line: 135, baseType: !93, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !43, line: 139, baseType: !93, size: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !94, file: !43, line: 139, baseType: !93, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !58, file: !43, line: 122, baseType: !116, size: 128, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !43, line: 107, baseType: !90, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !117, file: !43, line: 107, baseType: !90, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !58, file: !43, line: 122, baseType: !116, size: 128, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !43, line: 154, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !43, line: 152, size: 128, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !124, file: !43, line: 153, baseType: !61, size: 128)
!127 = !{i32 7, !"Dwarf Version", i32 4}
!128 = !{i32 2, !"Debug Info Version", i32 3}
!129 = !{i32 1, !"wchar_size", i32 4}
!130 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!131 = distinct !DISubprogram(name: "bmo_recalc_face_normals_exec", scope: !1, file: !1, line: 150, type: !132, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !282)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !134, !280}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !151, !152, !153, !154, !158, !160, !164, !165, !166, !167, !168, !169, !170, !171, !223, !263, !264, !265, !266, !267, !268, !269, !270, !277, !278, !279}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !136, file: !43, line: 187, baseType: !66, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !136, file: !43, line: 187, baseType: !66, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !136, file: !43, line: 187, baseType: !66, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !136, file: !43, line: 187, baseType: !66, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !136, file: !43, line: 188, baseType: !66, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !136, file: !43, line: 188, baseType: !66, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !136, file: !43, line: 188, baseType: !66, size: 32, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !136, file: !43, line: 193, baseType: !68, size: 8, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !136, file: !43, line: 197, baseType: !68, size: 8, offset: 232)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !136, file: !43, line: 201, baseType: !148, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !150, line: 39, flags: DIFlagFwdDecl)
!150 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !136, file: !43, line: 201, baseType: !148, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !136, file: !43, line: 201, baseType: !148, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !136, file: !43, line: 201, baseType: !148, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !136, file: !43, line: 208, baseType: !155, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !79)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !136, file: !43, line: 209, baseType: !159, size: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !136, file: !43, line: 210, baseType: !161, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !101)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !136, file: !43, line: 213, baseType: !66, size: 32, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !136, file: !43, line: 214, baseType: !66, size: 32, offset: 736)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !136, file: !43, line: 215, baseType: !66, size: 32, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !136, file: !43, line: 218, baseType: !148, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !136, file: !43, line: 218, baseType: !148, size: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !136, file: !43, line: 218, baseType: !148, size: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !136, file: !43, line: 220, baseType: !66, size: 32, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !136, file: !43, line: 221, baseType: !172, size: 64, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !174)
!174 = !{!175, !211, !212, !216, !219, !220, !222}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !173, file: !4, line: 191, baseType: !176, size: 5120)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 5120, elements: !209)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !178)
!178 = !{!179, !182, !184, !194, !195}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !177, file: !4, line: 148, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !177, file: !4, line: 149, baseType: !183, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !177, file: !4, line: 150, baseType: !185, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !187)
!187 = !{!188, !190, !192}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !186, file: !4, line: 139, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !186, file: !4, line: 140, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !186, file: !4, line: 141, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !177, file: !4, line: 152, baseType: !66, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !177, file: !4, line: 162, baseType: !196, size: 128, offset: 192)
!196 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !177, file: !4, line: 155, size: 128, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !204}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !196, file: !4, line: 156, baseType: !66, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !196, file: !4, line: 157, baseType: !85, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !196, file: !4, line: 158, baseType: !55, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !196, file: !4, line: 159, baseType: !84, size: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !196, file: !4, line: 160, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !196, file: !4, line: 161, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !207, line: 48, baseType: !208)
!207 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !207, line: 48, flags: DIFlagFwdDecl)
!209 = !{!210}
!210 = !DISubrange(count: 16)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !173, file: !4, line: 192, baseType: !176, size: 5120, offset: 5120)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !173, file: !4, line: 193, baseType: !213, size: 64, offset: 10240)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !134, !172}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !173, file: !4, line: 194, baseType: !217, size: 64, offset: 10304)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !150, line: 38, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !173, file: !4, line: 195, baseType: !66, size: 32, offset: 10368)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !173, file: !4, line: 196, baseType: !221, size: 32, offset: 10400)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !4, line: 197, baseType: !66, size: 32, offset: 10432)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !136, file: !43, line: 223, baseType: !224, size: 1600, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !225, line: 73, baseType: !226)
!225 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !225, line: 64, size: 1600, elements: !227)
!227 = !{!228, !246, !250, !251, !252, !253, !254}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !226, file: !225, line: 65, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !225, line: 53, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !225, line: 42, size: 832, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !245}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !225, line: 43, baseType: !66, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !231, file: !225, line: 44, baseType: !66, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !231, file: !225, line: 45, baseType: !66, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !231, file: !225, line: 46, baseType: !66, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !231, file: !225, line: 47, baseType: !66, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !231, file: !225, line: 48, baseType: !66, size: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !231, file: !225, line: 49, baseType: !66, size: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !231, file: !225, line: 50, baseType: !66, size: 32, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !231, file: !225, line: 51, baseType: !242, size: 512, offset: 256)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 512, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !231, file: !225, line: 52, baseType: !55, size: 64, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !226, file: !225, line: 66, baseType: !247, size: 1312, offset: 64)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 1312, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 41)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !226, file: !225, line: 69, baseType: !66, size: 32, offset: 1376)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !226, file: !225, line: 69, baseType: !66, size: 32, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !226, file: !225, line: 70, baseType: !66, size: 32, offset: 1440)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !226, file: !225, line: 71, baseType: !148, size: 64, offset: 1472)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !226, file: !225, line: 72, baseType: !255, size: 64, offset: 1536)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !225, line: 59, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !225, line: 57, size: 8192, elements: !258)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !257, file: !225, line: 58, baseType: !260, size: 8192)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8192, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !136, file: !43, line: 223, baseType: !224, size: 1600, offset: 2752)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !136, file: !43, line: 223, baseType: !224, size: 1600, offset: 4352)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !136, file: !43, line: 223, baseType: !224, size: 1600, offset: 5952)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !136, file: !43, line: 233, baseType: !76, size: 16, offset: 7552)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !136, file: !43, line: 236, baseType: !66, size: 32, offset: 7584)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !136, file: !43, line: 238, baseType: !66, size: 32, offset: 7616)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !136, file: !43, line: 238, baseType: !66, size: 32, offset: 7648)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !136, file: !43, line: 239, baseType: !271, size: 128, offset: 7680)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !272, line: 71, baseType: !273)
!272 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !272, line: 69, size: 128, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !273, file: !272, line: 70, baseType: !55, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !273, file: !272, line: 70, baseType: !55, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !136, file: !43, line: 241, baseType: !162, size: 64, offset: 7808)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !136, file: !43, line: 243, baseType: !271, size: 128, offset: 7872)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !136, file: !43, line: 245, baseType: !55, size: 64, offset: 8000)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !173)
!282 = !{}
!283 = !DILocalVariable(name: "bm", arg: 1, scope: !131, file: !1, line: 150, type: !134)
!284 = !DILocation(line: 150, column: 42, scope: !131)
!285 = !DILocalVariable(name: "op", arg: 2, scope: !131, file: !1, line: 150, type: !280)
!286 = !DILocation(line: 150, column: 58, scope: !131)
!287 = !DILocalVariable(name: "groups_array", scope: !131, file: !1, line: 152, type: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!289 = !DILocation(line: 152, column: 7, scope: !131)
!290 = !DILocation(line: 152, column: 22, scope: !131)
!291 = !DILocation(line: 152, column: 58, scope: !131)
!292 = !DILocation(line: 152, column: 62, scope: !131)
!293 = !DILocation(line: 152, column: 56, scope: !131)
!294 = !DILocalVariable(name: "faces_grp", scope: !131, file: !1, line: 153, type: !161)
!295 = !DILocation(line: 153, column: 11, scope: !131)
!296 = !DILocation(line: 153, column: 23, scope: !131)
!297 = !DILocation(line: 153, column: 56, scope: !131)
!298 = !DILocation(line: 153, column: 60, scope: !131)
!299 = !DILocation(line: 153, column: 54, scope: !131)
!300 = !DILocalVariable(name: "group_index", scope: !131, file: !1, line: 155, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 2)
!305 = !DILocation(line: 155, column: 8, scope: !131)
!306 = !DILocalVariable(name: "group_tot", scope: !131, file: !1, line: 156, type: !307)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!308 = !DILocation(line: 156, column: 12, scope: !131)
!309 = !DILocation(line: 156, column: 49, scope: !131)
!310 = !DILocation(line: 156, column: 53, scope: !131)
!311 = !DILocation(line: 156, column: 24, scope: !131)
!312 = !DILocalVariable(name: "i", scope: !131, file: !1, line: 159, type: !66)
!313 = !DILocation(line: 159, column: 6, scope: !131)
!314 = !DILocation(line: 161, column: 30, scope: !131)
!315 = !DILocation(line: 161, column: 34, scope: !131)
!316 = !DILocation(line: 161, column: 38, scope: !131)
!317 = !DILocation(line: 161, column: 2, scope: !131)
!318 = !DILocation(line: 163, column: 28, scope: !131)
!319 = !DILocation(line: 163, column: 2, scope: !131)
!320 = !DILocation(line: 165, column: 9, scope: !321)
!321 = distinct !DILexicalBlock(scope: !131, file: !1, line: 165, column: 2)
!322 = !DILocation(line: 165, column: 7, scope: !321)
!323 = !DILocation(line: 165, column: 14, scope: !324)
!324 = distinct !DILexicalBlock(scope: !321, file: !1, line: 165, column: 2)
!325 = !DILocation(line: 165, column: 18, scope: !324)
!326 = !DILocation(line: 165, column: 16, scope: !324)
!327 = !DILocation(line: 165, column: 2, scope: !321)
!328 = !DILocalVariable(name: "fg_sta", scope: !329, file: !1, line: 166, type: !307)
!329 = distinct !DILexicalBlock(scope: !324, file: !1, line: 165, column: 34)
!330 = !DILocation(line: 166, column: 13, scope: !329)
!331 = !DILocation(line: 166, column: 22, scope: !329)
!332 = !DILocation(line: 166, column: 34, scope: !329)
!333 = !DILocalVariable(name: "fg_len", scope: !329, file: !1, line: 167, type: !307)
!334 = !DILocation(line: 167, column: 13, scope: !329)
!335 = !DILocation(line: 167, column: 22, scope: !329)
!336 = !DILocation(line: 167, column: 34, scope: !329)
!337 = !DILocalVariable(name: "j", scope: !329, file: !1, line: 168, type: !66)
!338 = !DILocation(line: 168, column: 7, scope: !329)
!339 = !DILocalVariable(name: "is_calc", scope: !329, file: !1, line: 169, type: !340)
!340 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!341 = !DILocation(line: 169, column: 8, scope: !329)
!342 = !DILocation(line: 171, column: 10, scope: !343)
!343 = distinct !DILexicalBlock(scope: !329, file: !1, line: 171, column: 3)
!344 = !DILocation(line: 171, column: 8, scope: !343)
!345 = !DILocation(line: 171, column: 15, scope: !346)
!346 = distinct !DILexicalBlock(scope: !343, file: !1, line: 171, column: 3)
!347 = !DILocation(line: 171, column: 19, scope: !346)
!348 = !DILocation(line: 171, column: 17, scope: !346)
!349 = !DILocation(line: 171, column: 3, scope: !343)
!350 = !DILocation(line: 172, column: 36, scope: !351)
!351 = distinct !DILexicalBlock(scope: !346, file: !1, line: 171, column: 32)
!352 = !DILocation(line: 172, column: 40, scope: !351)
!353 = !DILocation(line: 172, column: 53, scope: !351)
!354 = !DILocation(line: 172, column: 62, scope: !351)
!355 = !DILocation(line: 172, column: 60, scope: !351)
!356 = !DILocation(line: 172, column: 19, scope: !351)
!357 = !DILocation(line: 172, column: 4, scope: !351)
!358 = !DILocation(line: 172, column: 14, scope: !351)
!359 = !DILocation(line: 172, column: 17, scope: !351)
!360 = !DILocation(line: 174, column: 8, scope: !361)
!361 = distinct !DILexicalBlock(scope: !351, file: !1, line: 174, column: 8)
!362 = !DILocation(line: 174, column: 16, scope: !361)
!363 = !DILocation(line: 174, column: 8, scope: !351)
!364 = !DILocation(line: 175, column: 15, scope: !365)
!365 = distinct !DILexicalBlock(scope: !361, file: !1, line: 174, column: 26)
!366 = !DILocation(line: 175, column: 13, scope: !365)
!367 = !DILocation(line: 176, column: 4, scope: !365)
!368 = !DILocation(line: 177, column: 3, scope: !351)
!369 = !DILocation(line: 171, column: 28, scope: !346)
!370 = !DILocation(line: 171, column: 3, scope: !346)
!371 = distinct !{!371, !349, !372}
!372 = !DILocation(line: 177, column: 3, scope: !343)
!373 = !DILocation(line: 179, column: 7, scope: !374)
!374 = distinct !DILexicalBlock(scope: !329, file: !1, line: 179, column: 7)
!375 = !DILocation(line: 179, column: 7, scope: !329)
!376 = !DILocation(line: 180, column: 34, scope: !377)
!377 = distinct !DILexicalBlock(scope: !374, file: !1, line: 179, column: 16)
!378 = !DILocation(line: 180, column: 38, scope: !377)
!379 = !DILocation(line: 180, column: 49, scope: !377)
!380 = !DILocation(line: 180, column: 4, scope: !377)
!381 = !DILocation(line: 181, column: 3, scope: !377)
!382 = !DILocation(line: 182, column: 2, scope: !329)
!383 = !DILocation(line: 165, column: 30, scope: !324)
!384 = !DILocation(line: 165, column: 2, scope: !324)
!385 = distinct !{!385, !327, !386}
!386 = !DILocation(line: 182, column: 2, scope: !321)
!387 = !DILocation(line: 184, column: 2, scope: !131)
!388 = !DILocation(line: 184, column: 12, scope: !131)
!389 = !DILocation(line: 186, column: 2, scope: !131)
!390 = !DILocation(line: 186, column: 12, scope: !131)
!391 = !DILocation(line: 187, column: 2, scope: !131)
!392 = !DILocation(line: 187, column: 12, scope: !131)
!393 = !DILocation(line: 188, column: 1, scope: !131)
!394 = distinct !DISubprogram(name: "bmo_recalc_normal_edge_filter_cb", scope: !1, file: !1, line: 44, type: !395, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !282)
!395 = !DISubroutineType(types: !396)
!396 = !{!340, !122, !55}
!397 = !DILocalVariable(name: "ele", arg: 1, scope: !394, file: !1, line: 44, type: !122)
!398 = !DILocation(line: 44, column: 54, scope: !394)
!399 = !DILocalVariable(name: "UNUSED_user_data", arg: 2, scope: !394, file: !1, line: 44, type: !55)
!400 = !DILocation(line: 44, column: 65, scope: !394)
!401 = !DILocation(line: 46, column: 39, scope: !394)
!402 = !DILocation(line: 46, column: 29, scope: !394)
!403 = !DILocation(line: 46, column: 9, scope: !394)
!404 = !DILocation(line: 46, column: 2, scope: !394)
!405 = distinct !DISubprogram(name: "_bmo_elem_flag_test_bool", scope: !406, file: !406, line: 46, type: !407, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !282)
!406 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!407 = !DISubroutineType(types: !408)
!408 = !{!340, !134, !409, !411}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFlagLayer", file: !43, line: 182, baseType: !73)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!412 = !DILocalVariable(name: "bm", arg: 1, scope: !405, file: !406, line: 46, type: !134)
!413 = !DILocation(line: 46, column: 49, scope: !405)
!414 = !DILocalVariable(name: "oflags", arg: 2, scope: !405, file: !406, line: 46, type: !409)
!415 = !DILocation(line: 46, column: 66, scope: !405)
!416 = !DILocalVariable(name: "oflag", arg: 3, scope: !405, file: !406, line: 46, type: !411)
!417 = !DILocation(line: 46, column: 86, scope: !405)
!418 = !DILocation(line: 48, column: 10, scope: !405)
!419 = !DILocation(line: 48, column: 17, scope: !405)
!420 = !DILocation(line: 48, column: 21, scope: !405)
!421 = !DILocation(line: 48, column: 32, scope: !405)
!422 = !DILocation(line: 48, column: 37, scope: !405)
!423 = !DILocation(line: 48, column: 41, scope: !405)
!424 = !DILocation(line: 48, column: 39, scope: !405)
!425 = !DILocation(line: 48, column: 48, scope: !405)
!426 = !DILocation(line: 48, column: 9, scope: !405)
!427 = !DILocation(line: 48, column: 2, scope: !405)
!428 = distinct !DISubprogram(name: "bmo_recalc_face_normals_array", scope: !1, file: !1, line: 58, type: !429, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !282)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !134, !161, !307, !411}
!431 = !DILocalVariable(name: "bm", arg: 1, scope: !428, file: !1, line: 58, type: !134)
!432 = !DILocation(line: 58, column: 50, scope: !428)
!433 = !DILocalVariable(name: "faces", arg: 2, scope: !428, file: !1, line: 58, type: !161)
!434 = !DILocation(line: 58, column: 63, scope: !428)
!435 = !DILocalVariable(name: "faces_len", arg: 3, scope: !428, file: !1, line: 58, type: !307)
!436 = !DILocation(line: 58, column: 80, scope: !428)
!437 = !DILocalVariable(name: "oflag", arg: 4, scope: !428, file: !1, line: 58, type: !411)
!438 = !DILocation(line: 58, column: 103, scope: !428)
!439 = !DILocalVariable(name: "cent", scope: !428, file: !1, line: 60, type: !84)
!440 = !DILocation(line: 60, column: 8, scope: !428)
!441 = !DILocalVariable(name: "tvec", scope: !428, file: !1, line: 60, type: !84)
!442 = !DILocation(line: 60, column: 17, scope: !428)
!443 = !DILocalVariable(name: "faces_center", scope: !428, file: !1, line: 61, type: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!445 = !DILocation(line: 61, column: 10, scope: !428)
!446 = !DILocation(line: 61, column: 29, scope: !428)
!447 = !DILocation(line: 61, column: 65, scope: !428)
!448 = !DILocation(line: 61, column: 63, scope: !428)
!449 = !DILocalVariable(name: "cent_fac", scope: !428, file: !1, line: 62, type: !450)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!451 = !DILocation(line: 62, column: 14, scope: !428)
!452 = !DILocation(line: 62, column: 39, scope: !428)
!453 = !DILocation(line: 62, column: 32, scope: !428)
!454 = !DILocation(line: 62, column: 30, scope: !428)
!455 = !DILocalVariable(name: "i", scope: !428, file: !1, line: 63, type: !66)
!456 = !DILocation(line: 63, column: 6, scope: !428)
!457 = !DILocalVariable(name: "f_start_index", scope: !428, file: !1, line: 63, type: !66)
!458 = !DILocation(line: 63, column: 9, scope: !428)
!459 = !DILocalVariable(name: "oflag_flip", scope: !428, file: !1, line: 64, type: !411)
!460 = !DILocation(line: 64, column: 14, scope: !428)
!461 = !DILocation(line: 64, column: 27, scope: !428)
!462 = !DILocation(line: 64, column: 33, scope: !428)
!463 = !DILocalVariable(name: "f_len_best_sq", scope: !428, file: !1, line: 66, type: !85)
!464 = !DILocation(line: 66, column: 8, scope: !428)
!465 = !DILocalVariable(name: "f", scope: !428, file: !1, line: 67, type: !162)
!466 = !DILocation(line: 67, column: 10, scope: !428)
!467 = !DILocalVariable(name: "fstack", scope: !428, file: !1, line: 69, type: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !150, line: 48, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !150, line: 45, size: 128, elements: !471)
!471 = !{!472, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !470, file: !150, line: 46, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !470, file: !150, line: 47, baseType: !55, size: 64, offset: 64)
!475 = !DILocation(line: 69, column: 2, scope: !428)
!476 = !DILocalVariable(name: "_fstack_pool", scope: !428, file: !1, line: 69, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !50, line: 47, baseType: !149)
!479 = !DILocalVariable(name: "_fstack_type", scope: !428, file: !1, line: 69, type: !162)
!480 = !DILocation(line: 71, column: 10, scope: !428)
!481 = !DILocation(line: 71, column: 2, scope: !428)
!482 = !DILocation(line: 74, column: 9, scope: !483)
!483 = distinct !DILexicalBlock(scope: !428, file: !1, line: 74, column: 2)
!484 = !DILocation(line: 74, column: 7, scope: !483)
!485 = !DILocation(line: 74, column: 14, scope: !486)
!486 = distinct !DILexicalBlock(scope: !483, file: !1, line: 74, column: 2)
!487 = !DILocation(line: 74, column: 18, scope: !486)
!488 = !DILocation(line: 74, column: 16, scope: !486)
!489 = !DILocation(line: 74, column: 2, scope: !483)
!490 = !DILocalVariable(name: "f_cent", scope: !491, file: !1, line: 75, type: !492)
!491 = distinct !DILexicalBlock(scope: !486, file: !1, line: 74, column: 34)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!493 = !DILocation(line: 75, column: 10, scope: !491)
!494 = !DILocation(line: 75, column: 19, scope: !491)
!495 = !DILocation(line: 75, column: 32, scope: !491)
!496 = !DILocation(line: 76, column: 37, scope: !491)
!497 = !DILocation(line: 76, column: 43, scope: !491)
!498 = !DILocation(line: 76, column: 47, scope: !491)
!499 = !DILocation(line: 76, column: 3, scope: !491)
!500 = !DILocation(line: 77, column: 16, scope: !491)
!501 = !DILocation(line: 77, column: 22, scope: !491)
!502 = !DILocation(line: 77, column: 30, scope: !491)
!503 = !DILocation(line: 77, column: 3, scope: !491)
!504 = !DILocation(line: 81, column: 2, scope: !491)
!505 = !DILocation(line: 74, column: 30, scope: !486)
!506 = !DILocation(line: 74, column: 2, scope: !486)
!507 = distinct !{!507, !489, !508}
!508 = !DILocation(line: 81, column: 2, scope: !483)
!509 = !DILocation(line: 83, column: 16, scope: !428)
!510 = !DILocation(line: 85, column: 16, scope: !428)
!511 = !DILocation(line: 87, column: 9, scope: !512)
!512 = distinct !DILexicalBlock(scope: !428, file: !1, line: 87, column: 2)
!513 = !DILocation(line: 87, column: 7, scope: !512)
!514 = !DILocation(line: 87, column: 14, scope: !515)
!515 = distinct !DILexicalBlock(scope: !512, file: !1, line: 87, column: 2)
!516 = !DILocation(line: 87, column: 18, scope: !515)
!517 = !DILocation(line: 87, column: 16, scope: !515)
!518 = !DILocation(line: 87, column: 2, scope: !512)
!519 = !DILocalVariable(name: "f_len_test_sq", scope: !520, file: !1, line: 88, type: !85)
!520 = distinct !DILexicalBlock(scope: !515, file: !1, line: 87, column: 34)
!521 = !DILocation(line: 88, column: 9, scope: !520)
!522 = !DILocation(line: 90, column: 41, scope: !523)
!523 = distinct !DILexicalBlock(scope: !520, file: !1, line: 90, column: 7)
!524 = !DILocation(line: 90, column: 54, scope: !523)
!525 = !DILocation(line: 90, column: 58, scope: !523)
!526 = !DILocation(line: 90, column: 24, scope: !523)
!527 = !DILocation(line: 90, column: 22, scope: !523)
!528 = !DILocation(line: 90, column: 67, scope: !523)
!529 = !DILocation(line: 90, column: 65, scope: !523)
!530 = !DILocation(line: 90, column: 7, scope: !520)
!531 = !DILocation(line: 91, column: 20, scope: !532)
!532 = distinct !DILexicalBlock(scope: !523, file: !1, line: 90, column: 82)
!533 = !DILocation(line: 91, column: 18, scope: !532)
!534 = !DILocation(line: 92, column: 20, scope: !532)
!535 = !DILocation(line: 92, column: 18, scope: !532)
!536 = !DILocation(line: 93, column: 3, scope: !532)
!537 = !DILocation(line: 94, column: 2, scope: !520)
!538 = !DILocation(line: 87, column: 30, scope: !515)
!539 = !DILocation(line: 87, column: 2, scope: !515)
