; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_walkers_impl.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_walkers_impl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMWalker = type { i8, void (%struct.BMWalker*, i8*)*, i8* (%struct.BMWalker*)*, i8* (%struct.BMWalker*)*, i32, i32, i32, i32, %struct.BMesh*, %struct.BLI_mempool*, %struct.ListBase, i16, i16, i16, i32, %struct.GSet*, %struct.GSet*, i32 }
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }

!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !12, line: 123, baseType: !7, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41}
!36 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!37 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 182, baseType: !7, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48}
!44 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 39, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "BMW_FLAG_NOP", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BMW_FLAG_TEST_HIDDEN", value: 1, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !54, line: 57, baseType: !7, size: 32, elements: !55)
!54 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!56 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 260, baseType: !7, size: 32, elements: !72)
!71 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = !{!73, !74, !75, !76, !77, !78, !79}
!73 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 62, baseType: !7, size: 32, elements: !82)
!81 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_error.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!83 = !DIEnumerator(name: "BMERR_SELF_INTERSECTING", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "BMERR_DISSOLVEDISK_FAILED", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "BMERR_CONNECTVERT_FAILED", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "BMERR_WALKER_FAILED", value: 4, isUnsigned: true)
!87 = !DIEnumerator(name: "BMERR_DISSOLVEFACES_FAILED", value: 5, isUnsigned: true)
!88 = !DIEnumerator(name: "BMERR_TESSELLATION", value: 6, isUnsigned: true)
!89 = !DIEnumerator(name: "BMERR_NONMANIFOLD", value: 7, isUnsigned: true)
!90 = !DIEnumerator(name: "BMERR_INVALID_SELECTION", value: 8, isUnsigned: true)
!91 = !DIEnumerator(name: "BMERR_MESH_ERROR", value: 9, isUnsigned: true)
!92 = !DIEnumerator(name: "BMERR_CONVEX_HULL_FAILED", value: 10, isUnsigned: true)
!93 = !DIEnumerator(name: "BMERR_TOTAL", value: 11, isUnsigned: true)
!94 = !{!95, !96, !162, !164, !165, !169, !173, !146, !175, !201, !208}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !71, line: 103, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !71, line: 90, size: 448, elements: !99)
!99 = !{!100, !111, !117, !122, !123}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !98, file: !71, line: 91, baseType: !101, size: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !71, line: 82, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !71, line: 64, size: 128, elements: !103)
!103 = !{!104, !105, !107, !109, !110}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !71, line: 65, baseType: !95, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !102, file: !71, line: 66, baseType: !106, size: 32, offset: 64)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !102, file: !71, line: 73, baseType: !108, size: 8, offset: 96)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !102, file: !71, line: 74, baseType: !108, size: 8, offset: 104)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !102, file: !71, line: 80, baseType: !108, size: 8, offset: 112)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !98, file: !71, line: 92, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !71, line: 180, size: 16, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !113, file: !71, line: 181, baseType: !116, size: 16)
!116 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !98, file: !71, line: 94, baseType: !118, size: 96, offset: 192)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 96, elements: !120)
!119 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!120 = !{!121}
!121 = !DISubrange(count: 3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !98, file: !71, line: 95, baseType: !118, size: 96, offset: 288)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !98, file: !71, line: 102, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !71, line: 110, size: 640, elements: !126)
!126 = !{!127, !128, !129, !131, !132, !155, !161}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !125, file: !71, line: 111, baseType: !101, size: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !125, file: !71, line: 112, baseType: !112, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !125, file: !71, line: 114, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !125, file: !71, line: 114, baseType: !130, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !125, file: !71, line: 118, baseType: !133, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !71, line: 125, size: 576, elements: !135)
!135 = !{!136, !137, !138, !139, !151, !152, !153, !154}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !134, file: !71, line: 126, baseType: !101, size: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !134, file: !71, line: 129, baseType: !130, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !134, file: !71, line: 130, baseType: !124, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !134, file: !71, line: 131, baseType: !140, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !71, line: 164, size: 448, elements: !142)
!142 = !{!143, !144, !145, !148, !149, !150}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !71, line: 165, baseType: !101, size: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !141, file: !71, line: 166, baseType: !112, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !141, file: !71, line: 172, baseType: !146, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !71, line: 140, baseType: !134)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !141, file: !71, line: 174, baseType: !106, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !141, file: !71, line: 175, baseType: !118, size: 96, offset: 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !141, file: !71, line: 176, baseType: !116, size: 16, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !134, file: !71, line: 135, baseType: !133, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !134, file: !71, line: 135, baseType: !133, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !71, line: 139, baseType: !133, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !71, line: 139, baseType: !133, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !125, file: !71, line: 122, baseType: !156, size: 128, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !71, line: 108, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !71, line: 106, size: 128, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !71, line: 107, baseType: !124, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !157, file: !71, line: 107, baseType: !124, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !125, file: !71, line: 122, baseType: !156, size: 128, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !71, line: 123, baseType: !125)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !54, line: 79, baseType: !53)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !54, line: 158, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !95}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !54, line: 159, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!95, !95}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !71, line: 178, baseType: !141)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMwLoopWalker", file: !177, line: 67, baseType: !178)
!177 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_walkers_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMwLoopWalker", file: !177, line: 60, size: 576, elements: !179)
!179 = !{!180, !193, !194, !195, !196, !197, !198, !200}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !178, file: !177, line: 61, baseType: !181, size: 192)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMwGenericWalker", file: !177, line: 40, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMwGenericWalker", file: !177, line: 37, size: 192, elements: !183)
!183 = !{!184, !192}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !182, file: !177, line: 38, baseType: !185, size: 128)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "Link", file: !186, line: 59, baseType: !187)
!186 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Link", file: !186, line: 57, size: 128, elements: !188)
!188 = !{!189, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !186, line: 58, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !187, file: !186, line: 58, baseType: !190, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !182, file: !177, line: 39, baseType: !106, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !178, file: !177, line: 62, baseType: !162, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !178, file: !177, line: 62, baseType: !162, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "lastv", scope: !178, file: !177, line: 63, baseType: !96, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "startv", scope: !178, file: !177, line: 63, baseType: !96, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "f_hub", scope: !178, file: !177, line: 64, baseType: !173, size: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "is_boundary", scope: !178, file: !177, line: 65, baseType: !199, size: 8, offset: 512)
!199 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "is_single", scope: !178, file: !177, line: 66, baseType: !199, size: 8, offset: 520)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMwFaceLoopWalker", file: !177, line: 73, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMwFaceLoopWalker", file: !177, line: 69, size: 320, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !203, file: !177, line: 70, baseType: !181, size: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !203, file: !177, line: 71, baseType: !146, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "no_calc", scope: !203, file: !177, line: 72, baseType: !199, size: 8, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMwEdgeringWalker", file: !177, line: 79, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMwEdgeringWalker", file: !177, line: 75, size: 320, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !210, file: !177, line: 76, baseType: !181, size: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !210, file: !177, line: 77, baseType: !146, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "wireedge", scope: !210, file: !177, line: 78, baseType: !162, size: 64, offset: 256)
!215 = !{!216, !397, !0, !400, !402, !404, !406, !408, !410, !412, !414, !416}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "bm_walker_types", scope: !2, file: !3, line: 1342, type: !218, isLocal: false, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 640, elements: !395)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMWalker", file: !6, line: 72, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMWalker", file: !6, line: 45, size: 960, elements: !222)
!222 = !{!223, !224, !229, !233, !234, !235, !237, !238, !239, !380, !384, !385, !386, !387, !388, !390, !393, !394}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "begin_htype", scope: !221, file: !6, line: 46, baseType: !108, size: 8)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !221, file: !6, line: 47, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228, !95}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !221, file: !6, line: 48, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!95, !228}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !221, file: !6, line: 49, baseType: !230, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "structsize", scope: !221, file: !6, line: 50, baseType: !106, size: 32, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !221, file: !6, line: 51, baseType: !236, size: 32, offset: 288)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMWOrder", file: !6, line: 37, baseType: !5)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "valid_mask", scope: !221, file: !6, line: 52, baseType: !106, size: 32, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !221, file: !6, line: 55, baseType: !106, size: 32, offset: 352)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !221, file: !6, line: 57, baseType: !240, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !71, line: 246, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !71, line: 186, size: 8064, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !257, !258, !259, !260, !262, !264, !266, !267, !268, !269, !270, !271, !272, !273, !325, !364, !365, !366, !367, !368, !369, !370, !371, !377, !378, !379}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !242, file: !71, line: 187, baseType: !106, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !242, file: !71, line: 187, baseType: !106, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !242, file: !71, line: 187, baseType: !106, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !242, file: !71, line: 187, baseType: !106, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !242, file: !71, line: 188, baseType: !106, size: 32, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !242, file: !71, line: 188, baseType: !106, size: 32, offset: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !242, file: !71, line: 188, baseType: !106, size: 32, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !242, file: !71, line: 193, baseType: !108, size: 8, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !242, file: !71, line: 197, baseType: !108, size: 8, offset: 232)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !242, file: !71, line: 201, baseType: !254, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !256, line: 71, flags: DIFlagFwdDecl)
!256 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !242, file: !71, line: 201, baseType: !254, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !242, file: !71, line: 201, baseType: !254, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !242, file: !71, line: 201, baseType: !254, size: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !242, file: !71, line: 208, baseType: !261, size: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !242, file: !71, line: 209, baseType: !263, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !242, file: !71, line: 210, baseType: !265, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !242, file: !71, line: 213, baseType: !106, size: 32, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !242, file: !71, line: 214, baseType: !106, size: 32, offset: 736)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !242, file: !71, line: 215, baseType: !106, size: 32, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !242, file: !71, line: 218, baseType: !254, size: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !242, file: !71, line: 218, baseType: !254, size: 64, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !242, file: !71, line: 218, baseType: !254, size: 64, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !242, file: !71, line: 220, baseType: !106, size: 32, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !242, file: !71, line: 221, baseType: !274, size: 64, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !12, line: 190, size: 10496, elements: !276)
!276 = !{!277, !313, !314, !318, !321, !322, !324}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !275, file: !12, line: 191, baseType: !278, size: 5120)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 5120, elements: !311)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !12, line: 147, size: 320, elements: !280)
!280 = !{!281, !284, !286, !296, !297}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !279, file: !12, line: 148, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !279, file: !12, line: 149, baseType: !285, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !12, line: 112, baseType: !11)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !279, file: !12, line: 150, baseType: !287, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !12, line: 142, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !12, line: 138, size: 32, elements: !289)
!289 = !{!290, !292, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !288, file: !12, line: 139, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !12, line: 122, baseType: !22)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !288, file: !12, line: 140, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !12, line: 136, baseType: !28)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !288, file: !12, line: 141, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !12, line: 130, baseType: !34)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !279, file: !12, line: 152, baseType: !106, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !279, file: !12, line: 162, baseType: !298, size: 128, offset: 192)
!298 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !279, file: !12, line: 155, size: 128, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !306}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !298, file: !12, line: 156, baseType: !106, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !298, file: !12, line: 157, baseType: !119, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !298, file: !12, line: 158, baseType: !95, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !298, file: !12, line: 159, baseType: !118, size: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !298, file: !12, line: 160, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !298, file: !12, line: 161, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !309, line: 48, baseType: !310)
!309 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !309, line: 48, flags: DIFlagFwdDecl)
!311 = !{!312}
!312 = !DISubrange(count: 16)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !275, file: !12, line: 192, baseType: !278, size: 5120, offset: 5120)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !275, file: !12, line: 193, baseType: !315, size: 64, offset: 10240)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !240, !274}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !275, file: !12, line: 194, baseType: !319, size: 64, offset: 10304)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !12, line: 194, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !12, line: 195, baseType: !106, size: 32, offset: 10368)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !275, file: !12, line: 196, baseType: !323, size: 32, offset: 10400)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !12, line: 188, baseType: !42)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !12, line: 197, baseType: !106, size: 32, offset: 10432)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !242, file: !71, line: 223, baseType: !326, size: 1600, offset: 1152)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !256, line: 73, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !256, line: 64, size: 1600, elements: !328)
!328 = !{!329, !347, !351, !352, !353, !354, !355}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !327, file: !256, line: 65, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !256, line: 53, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !256, line: 42, size: 832, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !346}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !256, line: 43, baseType: !106, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !332, file: !256, line: 44, baseType: !106, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !256, line: 45, baseType: !106, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !332, file: !256, line: 46, baseType: !106, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !332, file: !256, line: 47, baseType: !106, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !332, file: !256, line: 48, baseType: !106, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !332, file: !256, line: 49, baseType: !106, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !332, file: !256, line: 50, baseType: !106, size: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !256, line: 51, baseType: !343, size: 512, offset: 256)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 512, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !332, file: !256, line: 52, baseType: !95, size: 64, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !327, file: !256, line: 66, baseType: !348, size: 1312, offset: 64)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 1312, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 41)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !327, file: !256, line: 69, baseType: !106, size: 32, offset: 1376)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !327, file: !256, line: 69, baseType: !106, size: 32, offset: 1408)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !327, file: !256, line: 70, baseType: !106, size: 32, offset: 1440)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !327, file: !256, line: 71, baseType: !254, size: 64, offset: 1472)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !327, file: !256, line: 72, baseType: !356, size: 64, offset: 1536)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !256, line: 59, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !256, line: 57, size: 8192, elements: !359)
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !358, file: !256, line: 58, baseType: !361, size: 8192)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 8192, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 1024)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !242, file: !71, line: 223, baseType: !326, size: 1600, offset: 2752)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !242, file: !71, line: 223, baseType: !326, size: 1600, offset: 4352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !242, file: !71, line: 223, baseType: !326, size: 1600, offset: 5952)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !242, file: !71, line: 233, baseType: !116, size: 16, offset: 7552)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !242, file: !71, line: 236, baseType: !106, size: 32, offset: 7584)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !242, file: !71, line: 238, baseType: !106, size: 32, offset: 7616)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !242, file: !71, line: 238, baseType: !106, size: 32, offset: 7648)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !242, file: !71, line: 239, baseType: !372, size: 128, offset: 7680)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !186, line: 71, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !186, line: 69, size: 128, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !373, file: !186, line: 70, baseType: !95, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !373, file: !186, line: 70, baseType: !95, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !242, file: !71, line: 241, baseType: !173, size: 64, offset: 7808)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !242, file: !71, line: 243, baseType: !372, size: 128, offset: 7872)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !242, file: !71, line: 245, baseType: !95, size: 64, offset: 8000)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "worklist", scope: !221, file: !6, line: 58, baseType: !381, size: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !383, line: 47, baseType: !255)
!383 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!384 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !221, file: !6, line: 59, baseType: !372, size: 128, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mask_vert", scope: !221, file: !6, line: 63, baseType: !116, size: 16, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mask_edge", scope: !221, file: !6, line: 64, baseType: !116, size: 16, offset: 656)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mask_face", scope: !221, file: !6, line: 65, baseType: !116, size: 16, offset: 672)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !6, line: 67, baseType: !389, size: 32, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMWFlag", file: !6, line: 42, baseType: !49)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "visit_set", scope: !221, file: !6, line: 69, baseType: !391, size: 64, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSet", file: !309, line: 176, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "visit_set_alt", scope: !221, file: !6, line: 70, baseType: !391, size: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !221, file: !6, line: 71, baseType: !106, size: 32, offset: 896)
!395 = !{!396}
!396 = !DISubrange(count: 10)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "bm_totwalkers", scope: !2, file: !3, line: 1355, type: !399, isLocal: false, isDefinition: true)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "bmw_FaceShellWalker_Type", scope: !2, file: !3, line: 1252, type: !220, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "bmw_LoopWalker_Type", scope: !2, file: !3, line: 1282, type: !220, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "bmw_FaceLoopWalker_Type", scope: !2, file: !3, line: 1292, type: !220, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "bmw_EdgeringWalker_Type", scope: !2, file: !3, line: 1302, type: !220, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "bmw_EdgeboundaryWalker_Type", scope: !2, file: !3, line: 1312, type: !220, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "bmw_UVEdgeWalker_Type", scope: !2, file: !3, line: 1322, type: !220, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "bmw_IslandboundWalker_Type", scope: !2, file: !3, line: 1262, type: !220, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "bmw_IslandWalker_Type", scope: !2, file: !3, line: 1272, type: !220, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "bmw_ConnectedVertexWalker_Type", scope: !2, file: !3, line: 1332, type: !220, isLocal: true, isDefinition: true)
!418 = !{i32 7, !"Dwarf Version", i32 4}
!419 = !{i32 2, !"Debug Info Version", i32 3}
!420 = !{i32 1, !"wchar_size", i32 4}
!421 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!422 = distinct !DISubprogram(name: "bmw_VertShellWalker_begin", scope: !3, file: !3, line: 118, type: !423, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !219, !95}
!425 = !{}
!426 = !DILocalVariable(name: "walker", arg: 1, scope: !422, file: !3, line: 118, type: !219)
!427 = !DILocation(line: 118, column: 49, scope: !422)
!428 = !DILocalVariable(name: "data", arg: 2, scope: !422, file: !3, line: 118, type: !95)
!429 = !DILocation(line: 118, column: 63, scope: !422)
!430 = !DILocalVariable(name: "eiter", scope: !422, file: !3, line: 120, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !54, line: 186, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !54, line: 164, size: 512, elements: !433)
!433 = !{!434, !511, !512, !513, !514}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !432, file: !54, line: 179, baseType: !435, size: 320)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !54, line: 166, size: 320, elements: !436)
!436 = !{!437, !449, !455, !463, !471, !477, !483, !489, !493, !499, !505}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !435, file: !54, line: 167, baseType: !438, size: 192)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !54, line: 113, size: 192, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !438, file: !54, line: 114, baseType: !441, size: 192)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !383, line: 80, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !383, line: 76, size: 192, elements: !443)
!443 = !{!444, !445, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !442, file: !383, line: 77, baseType: !381, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !442, file: !383, line: 78, baseType: !446, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !383, line: 45, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !442, file: !383, line: 79, baseType: !7, size: 32, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !435, file: !54, line: 169, baseType: !450, size: 192)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !54, line: 116, size: 192, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !450, file: !54, line: 117, baseType: !96, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !450, file: !54, line: 118, baseType: !162, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !450, file: !54, line: 118, baseType: !162, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !435, file: !54, line: 170, baseType: !456, size: 320)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !54, line: 120, size: 320, elements: !457)
!457 = !{!458, !459, !460, !461, !462}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !456, file: !54, line: 121, baseType: !96, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !456, file: !54, line: 122, baseType: !146, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !456, file: !54, line: 122, baseType: !146, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !456, file: !54, line: 123, baseType: !162, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !456, file: !54, line: 123, baseType: !162, size: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !435, file: !54, line: 171, baseType: !464, size: 320)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !54, line: 125, size: 320, elements: !465)
!465 = !{!466, !467, !468, !469, !470}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !464, file: !54, line: 126, baseType: !96, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !464, file: !54, line: 127, baseType: !146, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !464, file: !54, line: 127, baseType: !146, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !464, file: !54, line: 128, baseType: !162, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !464, file: !54, line: 128, baseType: !162, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !435, file: !54, line: 172, baseType: !472, size: 192)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !54, line: 130, size: 192, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !472, file: !54, line: 131, baseType: !162, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !472, file: !54, line: 132, baseType: !146, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !472, file: !54, line: 132, baseType: !146, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !435, file: !54, line: 173, baseType: !478, size: 192)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !54, line: 134, size: 192, elements: !479)
!479 = !{!480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !478, file: !54, line: 135, baseType: !146, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !478, file: !54, line: 136, baseType: !146, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !478, file: !54, line: 136, baseType: !146, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !435, file: !54, line: 174, baseType: !484, size: 192)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !54, line: 138, size: 192, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !484, file: !54, line: 139, baseType: !162, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !484, file: !54, line: 140, baseType: !146, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !484, file: !54, line: 140, baseType: !146, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !435, file: !54, line: 175, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !54, line: 142, size: 64, elements: !491)
!491 = !{!492}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !490, file: !54, line: 143, baseType: !162, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !435, file: !54, line: 176, baseType: !494, size: 192)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !54, line: 145, size: 192, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !494, file: !54, line: 146, baseType: !173, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !494, file: !54, line: 147, baseType: !146, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !494, file: !54, line: 147, baseType: !146, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !435, file: !54, line: 177, baseType: !500, size: 192)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !54, line: 149, size: 192, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !500, file: !54, line: 150, baseType: !173, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !500, file: !54, line: 151, baseType: !146, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !500, file: !54, line: 151, baseType: !146, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !435, file: !54, line: 178, baseType: !506, size: 192)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !54, line: 153, size: 192, elements: !507)
!507 = !{!508, !509, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !506, file: !54, line: 154, baseType: !173, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !506, file: !54, line: 155, baseType: !146, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !506, file: !54, line: 155, baseType: !146, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !432, file: !54, line: 181, baseType: !165, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !432, file: !54, line: 182, baseType: !169, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !432, file: !54, line: 184, baseType: !106, size: 32, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !432, file: !54, line: 185, baseType: !108, size: 8, offset: 480)
!515 = !DILocation(line: 120, column: 9, scope: !422)
!516 = !DILocalVariable(name: "h", scope: !422, file: !3, line: 121, type: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!518 = !DILocation(line: 121, column: 12, scope: !422)
!519 = !DILocation(line: 121, column: 16, scope: !422)
!520 = !DILocalVariable(name: "e", scope: !422, file: !3, line: 122, type: !162)
!521 = !DILocation(line: 122, column: 10, scope: !422)
!522 = !DILocalVariable(name: "v", scope: !422, file: !3, line: 123, type: !96)
!523 = !DILocation(line: 123, column: 10, scope: !422)
!524 = !DILocation(line: 125, column: 6, scope: !525)
!525 = distinct !DILexicalBlock(scope: !422, file: !3, line: 125, column: 6)
!526 = !DILocation(line: 125, column: 6, scope: !422)
!527 = !DILocation(line: 126, column: 3, scope: !528)
!528 = distinct !DILexicalBlock(scope: !525, file: !3, line: 125, column: 27)
!529 = !DILocation(line: 129, column: 10, scope: !422)
!530 = !DILocation(line: 129, column: 13, scope: !422)
!531 = !DILocation(line: 129, column: 2, scope: !422)
!532 = !DILocation(line: 134, column: 18, scope: !533)
!533 = distinct !DILexicalBlock(scope: !534, file: !3, line: 131, column: 3)
!534 = distinct !DILexicalBlock(scope: !422, file: !3, line: 129, column: 20)
!535 = !DILocation(line: 134, column: 8, scope: !533)
!536 = !DILocation(line: 134, column: 6, scope: !533)
!537 = !DILocation(line: 135, column: 4, scope: !538)
!538 = distinct !DILexicalBlock(scope: !533, file: !3, line: 135, column: 4)
!539 = !DILocation(line: 135, column: 4, scope: !540)
!540 = distinct !DILexicalBlock(scope: !538, file: !3, line: 135, column: 4)
!541 = !DILocation(line: 136, column: 35, scope: !542)
!542 = distinct !DILexicalBlock(scope: !540, file: !3, line: 135, column: 50)
!543 = !DILocation(line: 136, column: 43, scope: !542)
!544 = !DILocation(line: 136, column: 5, scope: !542)
!545 = !DILocation(line: 137, column: 4, scope: !542)
!546 = distinct !{!546, !537, !547}
!547 = !DILocation(line: 137, column: 4, scope: !538)
!548 = !DILocation(line: 138, column: 4, scope: !533)
!549 = !DILocation(line: 145, column: 18, scope: !550)
!550 = distinct !DILexicalBlock(scope: !534, file: !3, line: 142, column: 3)
!551 = !DILocation(line: 145, column: 8, scope: !550)
!552 = !DILocation(line: 145, column: 6, scope: !550)
!553 = !DILocation(line: 146, column: 34, scope: !550)
!554 = !DILocation(line: 146, column: 42, scope: !550)
!555 = !DILocation(line: 146, column: 4, scope: !550)
!556 = !DILocation(line: 147, column: 4, scope: !550)
!557 = !DILocation(line: 151, column: 2, scope: !534)
!558 = !DILocation(line: 152, column: 1, scope: !422)
!559 = distinct !DISubprogram(name: "bmw_VertShellWalker_step", scope: !3, file: !3, line: 160, type: !560, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!560 = !DISubroutineType(types: !561)
!561 = !{!95, !219}
!562 = !DILocalVariable(name: "walker", arg: 1, scope: !559, file: !3, line: 160, type: !219)
!563 = !DILocation(line: 160, column: 49, scope: !559)
!564 = !DILocalVariable(name: "swalk", scope: !559, file: !3, line: 162, type: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMwShellWalker", file: !177, line: 46, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMwShellWalker", file: !177, line: 43, size: 256, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !567, file: !177, line: 44, baseType: !181, size: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "curedge", scope: !567, file: !177, line: 45, baseType: !162, size: 64, offset: 192)
!571 = !DILocation(line: 162, column: 18, scope: !559)
!572 = !DILocalVariable(name: "owalk", scope: !559, file: !3, line: 162, type: !566)
!573 = !DILocation(line: 162, column: 25, scope: !559)
!574 = !DILocalVariable(name: "e", scope: !559, file: !3, line: 163, type: !162)
!575 = !DILocation(line: 163, column: 10, scope: !559)
!576 = !DILocalVariable(name: "e2", scope: !559, file: !3, line: 163, type: !162)
!577 = !DILocation(line: 163, column: 14, scope: !559)
!578 = !DILocalVariable(name: "v", scope: !559, file: !3, line: 164, type: !96)
!579 = !DILocation(line: 164, column: 10, scope: !559)
!580 = !DILocalVariable(name: "iter", scope: !559, file: !3, line: 165, type: !431)
!581 = !DILocation(line: 165, column: 9, scope: !559)
!582 = !DILocalVariable(name: "i", scope: !559, file: !3, line: 166, type: !106)
!583 = !DILocation(line: 166, column: 6, scope: !559)
!584 = !DILocation(line: 168, column: 2, scope: !585)
!585 = distinct !DILexicalBlock(scope: !559, file: !3, line: 168, column: 2)
!586 = !DILocation(line: 169, column: 8, scope: !559)
!587 = !DILocation(line: 171, column: 6, scope: !559)
!588 = !DILocation(line: 171, column: 13, scope: !559)
!589 = !DILocation(line: 171, column: 4, scope: !559)
!590 = !DILocation(line: 173, column: 9, scope: !591)
!591 = distinct !DILexicalBlock(scope: !559, file: !3, line: 173, column: 2)
!592 = !DILocation(line: 173, column: 7, scope: !591)
!593 = !DILocation(line: 173, column: 14, scope: !594)
!594 = distinct !DILexicalBlock(scope: !591, file: !3, line: 173, column: 2)
!595 = !DILocation(line: 173, column: 16, scope: !594)
!596 = !DILocation(line: 173, column: 2, scope: !591)
!597 = !DILocation(line: 174, column: 7, scope: !598)
!598 = distinct !DILexicalBlock(scope: !594, file: !3, line: 173, column: 26)
!599 = !DILocation(line: 174, column: 11, scope: !598)
!600 = !DILocation(line: 174, column: 14, scope: !598)
!601 = !DILocation(line: 174, column: 19, scope: !598)
!602 = !DILocation(line: 174, column: 22, scope: !598)
!603 = !DILocation(line: 174, column: 5, scope: !598)
!604 = !DILocation(line: 175, column: 3, scope: !605)
!605 = distinct !DILexicalBlock(scope: !598, file: !3, line: 175, column: 3)
!606 = !DILocation(line: 175, column: 3, scope: !607)
!607 = distinct !DILexicalBlock(scope: !605, file: !3, line: 175, column: 3)
!608 = !DILocation(line: 176, column: 34, scope: !609)
!609 = distinct !DILexicalBlock(scope: !607, file: !3, line: 175, column: 49)
!610 = !DILocation(line: 176, column: 42, scope: !609)
!611 = !DILocation(line: 176, column: 4, scope: !609)
!612 = !DILocation(line: 177, column: 3, scope: !609)
!613 = distinct !{!613, !604, !614}
!614 = !DILocation(line: 177, column: 3, scope: !605)
!615 = !DILocation(line: 178, column: 2, scope: !598)
!616 = !DILocation(line: 173, column: 22, scope: !594)
!617 = !DILocation(line: 173, column: 2, scope: !594)
!618 = distinct !{!618, !596, !619}
!619 = !DILocation(line: 178, column: 2, scope: !591)
!620 = !DILocation(line: 180, column: 9, scope: !559)
!621 = !DILocation(line: 180, column: 2, scope: !559)
!622 = distinct !DISubprogram(name: "bmw_VertShellWalker_yield", scope: !3, file: !3, line: 154, type: !560, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!623 = !DILocalVariable(name: "walker", arg: 1, scope: !622, file: !3, line: 154, type: !219)
!624 = !DILocation(line: 154, column: 50, scope: !622)
!625 = !DILocalVariable(name: "shellWalk", scope: !622, file: !3, line: 156, type: !565)
!626 = !DILocation(line: 156, column: 18, scope: !622)
!627 = !DILocation(line: 156, column: 48, scope: !622)
!628 = !DILocation(line: 156, column: 30, scope: !622)
!629 = !DILocation(line: 157, column: 9, scope: !622)
!630 = !DILocation(line: 157, column: 20, scope: !622)
!631 = !DILocation(line: 157, column: 2, scope: !622)
!632 = distinct !DISubprogram(name: "BM_iter_new", scope: !633, file: !633, line: 172, type: !634, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!633 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!634 = !DISubroutineType(types: !635)
!635 = !{!95, !636, !240, !283, !95}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!637 = !DILocalVariable(name: "iter", arg: 1, scope: !632, file: !633, line: 172, type: !636)
!638 = !DILocation(line: 172, column: 38, scope: !632)
!639 = !DILocalVariable(name: "bm", arg: 2, scope: !632, file: !633, line: 172, type: !240)
!640 = !DILocation(line: 172, column: 51, scope: !632)
!641 = !DILocalVariable(name: "itype", arg: 3, scope: !632, file: !633, line: 172, type: !283)
!642 = !DILocation(line: 172, column: 66, scope: !632)
!643 = !DILocalVariable(name: "data", arg: 4, scope: !632, file: !633, line: 172, type: !95)
!644 = !DILocation(line: 172, column: 79, scope: !632)
!645 = !DILocation(line: 174, column: 6, scope: !646)
!646 = distinct !DILexicalBlock(scope: !632, file: !633, line: 174, column: 6)
!647 = !DILocation(line: 174, column: 6, scope: !632)
!648 = !DILocation(line: 175, column: 23, scope: !649)
!649 = distinct !DILexicalBlock(scope: !646, file: !633, line: 174, column: 51)
!650 = !DILocation(line: 175, column: 10, scope: !649)
!651 = !DILocation(line: 175, column: 3, scope: !649)
!652 = !DILocation(line: 178, column: 3, scope: !653)
!653 = distinct !DILexicalBlock(scope: !646, file: !633, line: 177, column: 7)
!654 = !DILocation(line: 180, column: 1, scope: !632)
!655 = distinct !DISubprogram(name: "bmw_VertShellWalker_visitEdge", scope: !3, file: !3, line: 101, type: !656, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !219, !162}
!658 = !DILocalVariable(name: "walker", arg: 1, scope: !655, file: !3, line: 101, type: !219)
!659 = !DILocation(line: 101, column: 53, scope: !655)
!660 = !DILocalVariable(name: "e", arg: 2, scope: !655, file: !3, line: 101, type: !162)
!661 = !DILocation(line: 101, column: 69, scope: !655)
!662 = !DILocalVariable(name: "shellWalk", scope: !655, file: !3, line: 103, type: !565)
!663 = !DILocation(line: 103, column: 18, scope: !655)
!664 = !DILocation(line: 105, column: 22, scope: !665)
!665 = distinct !DILexicalBlock(scope: !655, file: !3, line: 105, column: 6)
!666 = !DILocation(line: 105, column: 30, scope: !665)
!667 = !DILocation(line: 105, column: 41, scope: !665)
!668 = !DILocation(line: 105, column: 6, scope: !665)
!669 = !DILocation(line: 105, column: 6, scope: !655)
!670 = !DILocation(line: 106, column: 3, scope: !671)
!671 = distinct !DILexicalBlock(scope: !665, file: !3, line: 105, column: 45)
!672 = !DILocation(line: 109, column: 27, scope: !673)
!673 = distinct !DILexicalBlock(scope: !655, file: !3, line: 109, column: 6)
!674 = !DILocation(line: 109, column: 35, scope: !673)
!675 = !DILocation(line: 109, column: 7, scope: !673)
!676 = !DILocation(line: 109, column: 6, scope: !655)
!677 = !DILocation(line: 110, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !673, file: !3, line: 109, column: 39)
!679 = !DILocation(line: 113, column: 28, scope: !655)
!680 = !DILocation(line: 113, column: 14, scope: !655)
!681 = !DILocation(line: 113, column: 12, scope: !655)
!682 = !DILocation(line: 114, column: 23, scope: !655)
!683 = !DILocation(line: 114, column: 2, scope: !655)
!684 = !DILocation(line: 114, column: 13, scope: !655)
!685 = !DILocation(line: 114, column: 21, scope: !655)
!686 = !DILocation(line: 115, column: 18, scope: !655)
!687 = !DILocation(line: 115, column: 26, scope: !655)
!688 = !DILocation(line: 115, column: 37, scope: !655)
!689 = !DILocation(line: 115, column: 2, scope: !655)
!690 = !DILocation(line: 116, column: 1, scope: !655)
!691 = distinct !DISubprogram(name: "BM_iter_step", scope: !633, file: !633, line: 40, type: !692, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!692 = !DISubroutineType(types: !693)
!693 = !{!95, !636}
!694 = !DILocalVariable(name: "iter", arg: 1, scope: !691, file: !633, line: 40, type: !636)
!695 = !DILocation(line: 40, column: 39, scope: !691)
!696 = !DILocation(line: 42, column: 9, scope: !691)
!697 = !DILocation(line: 42, column: 15, scope: !691)
!698 = !DILocation(line: 42, column: 20, scope: !691)
!699 = !DILocation(line: 42, column: 2, scope: !691)
!700 = distinct !DISubprogram(name: "BM_iter_init", scope: !633, file: !633, line: 53, type: !701, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!701 = !DISubroutineType(types: !702)
!702 = !{!199, !636, !240, !283, !95}
!703 = !DILocalVariable(name: "iter", arg: 1, scope: !700, file: !633, line: 53, type: !636)
!704 = !DILocation(line: 53, column: 38, scope: !700)
!705 = !DILocalVariable(name: "bm", arg: 2, scope: !700, file: !633, line: 53, type: !240)
!706 = !DILocation(line: 53, column: 51, scope: !700)
!707 = !DILocalVariable(name: "itype", arg: 3, scope: !700, file: !633, line: 53, type: !283)
!708 = !DILocation(line: 53, column: 66, scope: !700)
!709 = !DILocalVariable(name: "data", arg: 4, scope: !700, file: !633, line: 53, type: !95)
!710 = !DILocation(line: 53, column: 79, scope: !700)
!711 = !DILocation(line: 56, column: 16, scope: !700)
!712 = !DILocation(line: 56, column: 2, scope: !700)
!713 = !DILocation(line: 56, column: 8, scope: !700)
!714 = !DILocation(line: 56, column: 14, scope: !700)
!715 = !DILocation(line: 59, column: 22, scope: !700)
!716 = !DILocation(line: 59, column: 10, scope: !700)
!717 = !DILocation(line: 59, column: 2, scope: !700)
!718 = !DILocation(line: 63, column: 4, scope: !719)
!719 = distinct !DILexicalBlock(scope: !700, file: !633, line: 59, column: 29)
!720 = !DILocation(line: 63, column: 10, scope: !719)
!721 = !DILocation(line: 63, column: 16, scope: !719)
!722 = !DILocation(line: 64, column: 4, scope: !719)
!723 = !DILocation(line: 64, column: 10, scope: !719)
!724 = !DILocation(line: 64, column: 16, scope: !719)
!725 = !DILocation(line: 65, column: 44, scope: !719)
!726 = !DILocation(line: 65, column: 48, scope: !719)
!727 = !DILocation(line: 65, column: 4, scope: !719)
!728 = !DILocation(line: 65, column: 10, scope: !719)
!729 = !DILocation(line: 65, column: 15, scope: !719)
!730 = !DILocation(line: 65, column: 28, scope: !719)
!731 = !DILocation(line: 65, column: 37, scope: !719)
!732 = !DILocation(line: 65, column: 42, scope: !719)
!733 = !DILocation(line: 66, column: 4, scope: !719)
!734 = !DILocation(line: 70, column: 4, scope: !719)
!735 = !DILocation(line: 70, column: 10, scope: !719)
!736 = !DILocation(line: 70, column: 16, scope: !719)
!737 = !DILocation(line: 71, column: 4, scope: !719)
!738 = !DILocation(line: 71, column: 10, scope: !719)
!739 = !DILocation(line: 71, column: 16, scope: !719)
!740 = !DILocation(line: 72, column: 44, scope: !719)
!741 = !DILocation(line: 72, column: 48, scope: !719)
!742 = !DILocation(line: 72, column: 4, scope: !719)
!743 = !DILocation(line: 72, column: 10, scope: !719)
!744 = !DILocation(line: 72, column: 15, scope: !719)
!745 = !DILocation(line: 72, column: 28, scope: !719)
!746 = !DILocation(line: 72, column: 37, scope: !719)
!747 = !DILocation(line: 72, column: 42, scope: !719)
!748 = !DILocation(line: 73, column: 4, scope: !719)
!749 = !DILocation(line: 77, column: 4, scope: !719)
!750 = !DILocation(line: 77, column: 10, scope: !719)
!751 = !DILocation(line: 77, column: 16, scope: !719)
!752 = !DILocation(line: 78, column: 4, scope: !719)
!753 = !DILocation(line: 78, column: 10, scope: !719)
!754 = !DILocation(line: 78, column: 16, scope: !719)
!755 = !DILocation(line: 79, column: 44, scope: !719)
!756 = !DILocation(line: 79, column: 48, scope: !719)
!757 = !DILocation(line: 79, column: 4, scope: !719)
!758 = !DILocation(line: 79, column: 10, scope: !719)
!759 = !DILocation(line: 79, column: 15, scope: !719)
!760 = !DILocation(line: 79, column: 28, scope: !719)
!761 = !DILocation(line: 79, column: 37, scope: !719)
!762 = !DILocation(line: 79, column: 42, scope: !719)
!763 = !DILocation(line: 80, column: 4, scope: !719)
!764 = !DILocation(line: 84, column: 4, scope: !719)
!765 = !DILocation(line: 84, column: 10, scope: !719)
!766 = !DILocation(line: 84, column: 16, scope: !719)
!767 = !DILocation(line: 85, column: 4, scope: !719)
!768 = !DILocation(line: 85, column: 10, scope: !719)
!769 = !DILocation(line: 85, column: 16, scope: !719)
!770 = !DILocation(line: 86, column: 46, scope: !719)
!771 = !DILocation(line: 86, column: 36, scope: !719)
!772 = !DILocation(line: 86, column: 4, scope: !719)
!773 = !DILocation(line: 86, column: 10, scope: !719)
!774 = !DILocation(line: 86, column: 15, scope: !719)
!775 = !DILocation(line: 86, column: 28, scope: !719)
!776 = !DILocation(line: 86, column: 34, scope: !719)
!777 = !DILocation(line: 87, column: 4, scope: !719)
!778 = !DILocation(line: 91, column: 4, scope: !719)
!779 = !DILocation(line: 91, column: 10, scope: !719)
!780 = !DILocation(line: 91, column: 16, scope: !719)
!781 = !DILocation(line: 92, column: 4, scope: !719)
!782 = !DILocation(line: 92, column: 10, scope: !719)
!783 = !DILocation(line: 92, column: 16, scope: !719)
!784 = !DILocation(line: 93, column: 46, scope: !719)
!785 = !DILocation(line: 93, column: 36, scope: !719)
!786 = !DILocation(line: 93, column: 4, scope: !719)
!787 = !DILocation(line: 93, column: 10, scope: !719)
!788 = !DILocation(line: 93, column: 15, scope: !719)
!789 = !DILocation(line: 93, column: 28, scope: !719)
!790 = !DILocation(line: 93, column: 34, scope: !719)
!791 = !DILocation(line: 94, column: 4, scope: !719)
!792 = !DILocation(line: 98, column: 4, scope: !719)
!793 = !DILocation(line: 98, column: 10, scope: !719)
!794 = !DILocation(line: 98, column: 16, scope: !719)
!795 = !DILocation(line: 99, column: 4, scope: !719)
!796 = !DILocation(line: 99, column: 10, scope: !719)
!797 = !DILocation(line: 99, column: 16, scope: !719)
!798 = !DILocation(line: 100, column: 46, scope: !719)
!799 = !DILocation(line: 100, column: 36, scope: !719)
!800 = !DILocation(line: 100, column: 4, scope: !719)
!801 = !DILocation(line: 100, column: 10, scope: !719)
!802 = !DILocation(line: 100, column: 15, scope: !719)
!803 = !DILocation(line: 100, column: 28, scope: !719)
!804 = !DILocation(line: 100, column: 34, scope: !719)
!805 = !DILocation(line: 101, column: 4, scope: !719)
!806 = !DILocation(line: 105, column: 4, scope: !719)
!807 = !DILocation(line: 105, column: 10, scope: !719)
!808 = !DILocation(line: 105, column: 16, scope: !719)
!809 = !DILocation(line: 106, column: 4, scope: !719)
!810 = !DILocation(line: 106, column: 10, scope: !719)
!811 = !DILocation(line: 106, column: 16, scope: !719)
!812 = !DILocation(line: 107, column: 46, scope: !719)
!813 = !DILocation(line: 107, column: 36, scope: !719)
!814 = !DILocation(line: 107, column: 4, scope: !719)
!815 = !DILocation(line: 107, column: 10, scope: !719)
!816 = !DILocation(line: 107, column: 15, scope: !719)
!817 = !DILocation(line: 107, column: 28, scope: !719)
!818 = !DILocation(line: 107, column: 34, scope: !719)
!819 = !DILocation(line: 108, column: 4, scope: !719)
!820 = !DILocation(line: 112, column: 4, scope: !719)
!821 = !DILocation(line: 112, column: 10, scope: !719)
!822 = !DILocation(line: 112, column: 16, scope: !719)
!823 = !DILocation(line: 113, column: 4, scope: !719)
!824 = !DILocation(line: 113, column: 10, scope: !719)
!825 = !DILocation(line: 113, column: 16, scope: !719)
!826 = !DILocation(line: 114, column: 46, scope: !719)
!827 = !DILocation(line: 114, column: 36, scope: !719)
!828 = !DILocation(line: 114, column: 4, scope: !719)
!829 = !DILocation(line: 114, column: 10, scope: !719)
!830 = !DILocation(line: 114, column: 15, scope: !719)
!831 = !DILocation(line: 114, column: 28, scope: !719)
!832 = !DILocation(line: 114, column: 34, scope: !719)
!833 = !DILocation(line: 115, column: 4, scope: !719)
!834 = !DILocation(line: 119, column: 4, scope: !719)
!835 = !DILocation(line: 119, column: 10, scope: !719)
!836 = !DILocation(line: 119, column: 16, scope: !719)
!837 = !DILocation(line: 120, column: 4, scope: !719)
!838 = !DILocation(line: 120, column: 10, scope: !719)
!839 = !DILocation(line: 120, column: 16, scope: !719)
!840 = !DILocation(line: 121, column: 46, scope: !719)
!841 = !DILocation(line: 121, column: 36, scope: !719)
!842 = !DILocation(line: 121, column: 4, scope: !719)
!843 = !DILocation(line: 121, column: 10, scope: !719)
!844 = !DILocation(line: 121, column: 15, scope: !719)
!845 = !DILocation(line: 121, column: 28, scope: !719)
!846 = !DILocation(line: 121, column: 34, scope: !719)
!847 = !DILocation(line: 122, column: 4, scope: !719)
!848 = !DILocation(line: 126, column: 4, scope: !719)
!849 = !DILocation(line: 126, column: 10, scope: !719)
!850 = !DILocation(line: 126, column: 16, scope: !719)
!851 = !DILocation(line: 127, column: 4, scope: !719)
!852 = !DILocation(line: 127, column: 10, scope: !719)
!853 = !DILocation(line: 127, column: 16, scope: !719)
!854 = !DILocation(line: 128, column: 46, scope: !719)
!855 = !DILocation(line: 128, column: 36, scope: !719)
!856 = !DILocation(line: 128, column: 4, scope: !719)
!857 = !DILocation(line: 128, column: 10, scope: !719)
!858 = !DILocation(line: 128, column: 15, scope: !719)
!859 = !DILocation(line: 128, column: 28, scope: !719)
!860 = !DILocation(line: 128, column: 34, scope: !719)
!861 = !DILocation(line: 129, column: 4, scope: !719)
!862 = !DILocation(line: 133, column: 4, scope: !719)
!863 = !DILocation(line: 133, column: 10, scope: !719)
!864 = !DILocation(line: 133, column: 16, scope: !719)
!865 = !DILocation(line: 134, column: 4, scope: !719)
!866 = !DILocation(line: 134, column: 10, scope: !719)
!867 = !DILocation(line: 134, column: 16, scope: !719)
!868 = !DILocation(line: 135, column: 46, scope: !719)
!869 = !DILocation(line: 135, column: 36, scope: !719)
!870 = !DILocation(line: 135, column: 4, scope: !719)
!871 = !DILocation(line: 135, column: 10, scope: !719)
!872 = !DILocation(line: 135, column: 15, scope: !719)
!873 = !DILocation(line: 135, column: 28, scope: !719)
!874 = !DILocation(line: 135, column: 34, scope: !719)
!875 = !DILocation(line: 136, column: 4, scope: !719)
!876 = !DILocation(line: 140, column: 4, scope: !719)
!877 = !DILocation(line: 140, column: 10, scope: !719)
!878 = !DILocation(line: 140, column: 16, scope: !719)
!879 = !DILocation(line: 141, column: 4, scope: !719)
!880 = !DILocation(line: 141, column: 10, scope: !719)
!881 = !DILocation(line: 141, column: 16, scope: !719)
!882 = !DILocation(line: 142, column: 46, scope: !719)
!883 = !DILocation(line: 142, column: 36, scope: !719)
!884 = !DILocation(line: 142, column: 4, scope: !719)
!885 = !DILocation(line: 142, column: 10, scope: !719)
!886 = !DILocation(line: 142, column: 15, scope: !719)
!887 = !DILocation(line: 142, column: 28, scope: !719)
!888 = !DILocation(line: 142, column: 34, scope: !719)
!889 = !DILocation(line: 143, column: 4, scope: !719)
!890 = !DILocation(line: 147, column: 4, scope: !719)
!891 = !DILocation(line: 147, column: 10, scope: !719)
!892 = !DILocation(line: 147, column: 16, scope: !719)
!893 = !DILocation(line: 148, column: 4, scope: !719)
!894 = !DILocation(line: 148, column: 10, scope: !719)
!895 = !DILocation(line: 148, column: 16, scope: !719)
!896 = !DILocation(line: 149, column: 46, scope: !719)
!897 = !DILocation(line: 149, column: 36, scope: !719)
!898 = !DILocation(line: 149, column: 4, scope: !719)
!899 = !DILocation(line: 149, column: 10, scope: !719)
!900 = !DILocation(line: 149, column: 15, scope: !719)
!901 = !DILocation(line: 149, column: 28, scope: !719)
!902 = !DILocation(line: 149, column: 34, scope: !719)
!903 = !DILocation(line: 150, column: 4, scope: !719)
!904 = !DILocation(line: 154, column: 4, scope: !719)
!905 = !DILocation(line: 158, column: 2, scope: !700)
!906 = !DILocation(line: 158, column: 8, scope: !700)
!907 = !DILocation(line: 158, column: 14, scope: !700)
!908 = !DILocation(line: 160, column: 2, scope: !700)
!909 = !DILocation(line: 161, column: 1, scope: !700)
!910 = distinct !DISubprogram(name: "bmw_mask_check_edge", scope: !3, file: !3, line: 61, type: !911, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!911 = !DISubroutineType(types: !912)
!912 = !{!199, !219, !162}
!913 = !DILocalVariable(name: "walker", arg: 1, scope: !910, file: !3, line: 61, type: !219)
!914 = !DILocation(line: 61, column: 43, scope: !910)
!915 = !DILocalVariable(name: "e", arg: 2, scope: !910, file: !3, line: 61, type: !162)
!916 = !DILocation(line: 61, column: 59, scope: !910)
!917 = !DILocation(line: 63, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !910, file: !3, line: 63, column: 6)
!919 = !DILocation(line: 63, column: 15, scope: !918)
!920 = !DILocation(line: 63, column: 20, scope: !918)
!921 = !DILocation(line: 63, column: 44, scope: !918)
!922 = !DILocation(line: 63, column: 47, scope: !918)
!923 = !DILocation(line: 63, column: 6, scope: !910)
!924 = !DILocation(line: 64, column: 3, scope: !925)
!925 = distinct !DILexicalBlock(scope: !918, file: !3, line: 63, column: 85)
!926 = !DILocation(line: 66, column: 11, scope: !927)
!927 = distinct !DILexicalBlock(scope: !918, file: !3, line: 66, column: 11)
!928 = !DILocation(line: 66, column: 19, scope: !927)
!929 = !DILocation(line: 66, column: 29, scope: !927)
!930 = !DILocation(line: 66, column: 33, scope: !927)
!931 = !DILocation(line: 66, column: 11, scope: !918)
!932 = !DILocation(line: 67, column: 3, scope: !933)
!933 = distinct !DILexicalBlock(scope: !927, file: !3, line: 66, column: 87)
!934 = !DILocation(line: 70, column: 3, scope: !935)
!935 = distinct !DILexicalBlock(scope: !927, file: !3, line: 69, column: 7)
!936 = !DILocation(line: 72, column: 1, scope: !910)
!937 = distinct !DISubprogram(name: "_bm_elem_flag_test", scope: !938, file: !938, line: 42, type: !939, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!938 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!939 = !DISubroutineType(types: !940)
!940 = !{!108, !941, !283}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!943 = !DILocalVariable(name: "head", arg: 1, scope: !937, file: !938, line: 42, type: !941)
!944 = !DILocation(line: 42, column: 52, scope: !937)
!945 = !DILocalVariable(name: "hflag", arg: 2, scope: !937, file: !938, line: 42, type: !283)
!946 = !DILocation(line: 42, column: 69, scope: !937)
!947 = !DILocation(line: 44, column: 9, scope: !937)
!948 = !DILocation(line: 44, column: 15, scope: !937)
!949 = !DILocation(line: 44, column: 23, scope: !937)
!950 = !DILocation(line: 44, column: 21, scope: !937)
!951 = !DILocation(line: 44, column: 2, scope: !937)
!952 = distinct !DISubprogram(name: "_bmo_elem_flag_test", scope: !953, file: !953, line: 41, type: !954, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!953 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!954 = !DISubroutineType(types: !955)
!955 = !{!116, !240, !956, !958}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFlagLayer", file: !71, line: 182, baseType: !113)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!959 = !DILocalVariable(name: "bm", arg: 1, scope: !952, file: !953, line: 41, type: !240)
!960 = !DILocation(line: 41, column: 45, scope: !952)
!961 = !DILocalVariable(name: "oflags", arg: 2, scope: !952, file: !953, line: 41, type: !956)
!962 = !DILocation(line: 41, column: 62, scope: !952)
!963 = !DILocalVariable(name: "oflag", arg: 3, scope: !952, file: !953, line: 41, type: !958)
!964 = !DILocation(line: 41, column: 82, scope: !952)
!965 = !DILocation(line: 43, column: 9, scope: !952)
!966 = !DILocation(line: 43, column: 16, scope: !952)
!967 = !DILocation(line: 43, column: 20, scope: !952)
!968 = !DILocation(line: 43, column: 31, scope: !952)
!969 = !DILocation(line: 43, column: 36, scope: !952)
!970 = !DILocation(line: 43, column: 40, scope: !952)
!971 = !DILocation(line: 43, column: 38, scope: !952)
!972 = !DILocation(line: 43, column: 2, scope: !952)
!973 = distinct !DISubprogram(name: "bmw_FaceShellWalker_begin", scope: !3, file: !3, line: 251, type: !423, scopeLine: 252, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!974 = !DILocalVariable(name: "walker", arg: 1, scope: !973, file: !3, line: 251, type: !219)
!975 = !DILocation(line: 251, column: 49, scope: !973)
!976 = !DILocalVariable(name: "data", arg: 2, scope: !973, file: !3, line: 251, type: !95)
!977 = !DILocation(line: 251, column: 63, scope: !973)
!978 = !DILocalVariable(name: "e", scope: !973, file: !3, line: 253, type: !162)
!979 = !DILocation(line: 253, column: 10, scope: !973)
!980 = !DILocation(line: 253, column: 14, scope: !973)
!981 = !DILocation(line: 254, column: 32, scope: !973)
!982 = !DILocation(line: 254, column: 40, scope: !973)
!983 = !DILocation(line: 254, column: 2, scope: !973)
!984 = !DILocation(line: 255, column: 1, scope: !973)
!985 = distinct !DISubprogram(name: "bmw_FaceShellWalker_step", scope: !3, file: !3, line: 263, type: !560, scopeLine: 264, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!986 = !DILocalVariable(name: "walker", arg: 1, scope: !985, file: !3, line: 263, type: !219)
!987 = !DILocation(line: 263, column: 49, scope: !985)
!988 = !DILocalVariable(name: "swalk", scope: !985, file: !3, line: 265, type: !565)
!989 = !DILocation(line: 265, column: 18, scope: !985)
!990 = !DILocalVariable(name: "owalk", scope: !985, file: !3, line: 265, type: !566)
!991 = !DILocation(line: 265, column: 25, scope: !985)
!992 = !DILocalVariable(name: "e", scope: !985, file: !3, line: 266, type: !162)
!993 = !DILocation(line: 266, column: 10, scope: !985)
!994 = !DILocalVariable(name: "e2", scope: !985, file: !3, line: 266, type: !162)
!995 = !DILocation(line: 266, column: 14, scope: !985)
!996 = !DILocalVariable(name: "iter", scope: !985, file: !3, line: 267, type: !431)
!997 = !DILocation(line: 267, column: 9, scope: !985)
!998 = !DILocation(line: 269, column: 2, scope: !999)
!999 = distinct !DILexicalBlock(scope: !985, file: !3, line: 269, column: 2)
!1000 = !DILocation(line: 270, column: 8, scope: !985)
!1001 = !DILocation(line: 272, column: 6, scope: !985)
!1002 = !DILocation(line: 272, column: 13, scope: !985)
!1003 = !DILocation(line: 272, column: 4, scope: !985)
!1004 = !DILocation(line: 274, column: 6, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !985, file: !3, line: 274, column: 6)
!1006 = !DILocation(line: 274, column: 9, scope: !1005)
!1007 = !DILocation(line: 274, column: 6, scope: !985)
!1008 = !DILocalVariable(name: "l_iter", scope: !1009, file: !3, line: 275, type: !146)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 274, column: 12)
!1010 = !DILocation(line: 275, column: 11, scope: !1009)
!1011 = !DILocalVariable(name: "l_first", scope: !1009, file: !3, line: 275, type: !146)
!1012 = !DILocation(line: 275, column: 20, scope: !1009)
!1013 = !DILocation(line: 277, column: 22, scope: !1009)
!1014 = !DILocation(line: 277, column: 25, scope: !1009)
!1015 = !DILocation(line: 277, column: 20, scope: !1009)
!1016 = !DILocation(line: 277, column: 10, scope: !1009)
!1017 = !DILocation(line: 278, column: 3, scope: !1009)
!1018 = !DILocation(line: 279, column: 4, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 279, column: 4)
!1020 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 278, column: 6)
!1021 = !DILocation(line: 279, column: 4, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 279, column: 4)
!1023 = !DILocation(line: 280, column: 9, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 280, column: 9)
!1025 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 279, column: 58)
!1026 = !DILocation(line: 280, column: 15, scope: !1024)
!1027 = !DILocation(line: 280, column: 12, scope: !1024)
!1028 = !DILocation(line: 280, column: 9, scope: !1025)
!1029 = !DILocation(line: 281, column: 36, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 280, column: 18)
!1031 = !DILocation(line: 281, column: 44, scope: !1030)
!1032 = !DILocation(line: 281, column: 6, scope: !1030)
!1033 = !DILocation(line: 282, column: 5, scope: !1030)
!1034 = !DILocation(line: 283, column: 4, scope: !1025)
!1035 = distinct !{!1035, !1018, !1036}
!1036 = !DILocation(line: 283, column: 4, scope: !1019)
!1037 = !DILocation(line: 284, column: 3, scope: !1020)
!1038 = !DILocation(line: 284, column: 22, scope: !1009)
!1039 = !DILocation(line: 284, column: 30, scope: !1009)
!1040 = !DILocation(line: 284, column: 20, scope: !1009)
!1041 = !DILocation(line: 284, column: 46, scope: !1009)
!1042 = !DILocation(line: 284, column: 43, scope: !1009)
!1043 = distinct !{!1043, !1017, !1044}
!1044 = !DILocation(line: 284, column: 53, scope: !1009)
!1045 = !DILocation(line: 285, column: 2, scope: !1009)
!1046 = !DILocation(line: 287, column: 9, scope: !985)
!1047 = !DILocation(line: 287, column: 2, scope: !985)
!1048 = distinct !DISubprogram(name: "bmw_FaceShellWalker_yield", scope: !3, file: !3, line: 257, type: !560, scopeLine: 258, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!1049 = !DILocalVariable(name: "walker", arg: 1, scope: !1048, file: !3, line: 257, type: !219)
!1050 = !DILocation(line: 257, column: 50, scope: !1048)
!1051 = !DILocalVariable(name: "shellWalk", scope: !1048, file: !3, line: 259, type: !565)
!1052 = !DILocation(line: 259, column: 18, scope: !1048)
!1053 = !DILocation(line: 259, column: 48, scope: !1048)
!1054 = !DILocation(line: 259, column: 30, scope: !1048)
!1055 = !DILocation(line: 260, column: 9, scope: !1048)
!1056 = !DILocation(line: 260, column: 20, scope: !1048)
!1057 = !DILocation(line: 260, column: 2, scope: !1048)
!1058 = distinct !DISubprogram(name: "bmw_FaceShellWalker_visitEdge", scope: !3, file: !3, line: 234, type: !656, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!1059 = !DILocalVariable(name: "walker", arg: 1, scope: !1058, file: !3, line: 234, type: !219)
!1060 = !DILocation(line: 234, column: 53, scope: !1058)
!1061 = !DILocalVariable(name: "e", arg: 2, scope: !1058, file: !3, line: 234, type: !162)
!1062 = !DILocation(line: 234, column: 69, scope: !1058)
!1063 = !DILocalVariable(name: "shellWalk", scope: !1058, file: !3, line: 236, type: !565)
!1064 = !DILocation(line: 236, column: 18, scope: !1058)
!1065 = !DILocation(line: 238, column: 22, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 238, column: 6)
!1067 = !DILocation(line: 238, column: 30, scope: !1066)
!1068 = !DILocation(line: 238, column: 41, scope: !1066)
!1069 = !DILocation(line: 238, column: 6, scope: !1066)
!1070 = !DILocation(line: 238, column: 6, scope: !1058)
!1071 = !DILocation(line: 239, column: 3, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 238, column: 45)
!1073 = !DILocation(line: 242, column: 27, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 242, column: 6)
!1075 = !DILocation(line: 242, column: 35, scope: !1074)
!1076 = !DILocation(line: 242, column: 7, scope: !1074)
!1077 = !DILocation(line: 242, column: 6, scope: !1058)
!1078 = !DILocation(line: 243, column: 3, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 242, column: 39)
!1080 = !DILocation(line: 246, column: 28, scope: !1058)
!1081 = !DILocation(line: 246, column: 14, scope: !1058)
!1082 = !DILocation(line: 246, column: 12, scope: !1058)
!1083 = !DILocation(line: 247, column: 23, scope: !1058)
!1084 = !DILocation(line: 247, column: 2, scope: !1058)
!1085 = !DILocation(line: 247, column: 13, scope: !1058)
!1086 = !DILocation(line: 247, column: 21, scope: !1058)
!1087 = !DILocation(line: 248, column: 18, scope: !1058)
!1088 = !DILocation(line: 248, column: 26, scope: !1058)
!1089 = !DILocation(line: 248, column: 37, scope: !1058)
!1090 = !DILocation(line: 248, column: 2, scope: !1058)
!1091 = !DILocation(line: 249, column: 1, scope: !1058)
!1092 = distinct !DISubprogram(name: "bmw_LoopWalker_begin", scope: !3, file: !3, line: 547, type: !423, scopeLine: 548, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!1093 = !DILocalVariable(name: "walker", arg: 1, scope: !1092, file: !3, line: 547, type: !219)
!1094 = !DILocation(line: 547, column: 44, scope: !1092)
!1095 = !DILocalVariable(name: "data", arg: 2, scope: !1092, file: !3, line: 547, type: !95)
!1096 = !DILocation(line: 547, column: 58, scope: !1092)
!1097 = !DILocalVariable(name: "lwalk", scope: !1092, file: !3, line: 549, type: !175)
!1098 = !DILocation(line: 549, column: 17, scope: !1092)
!1099 = !DILocalVariable(name: "owalk", scope: !1092, file: !3, line: 549, type: !176)
!1100 = !DILocation(line: 549, column: 31, scope: !1092)
!1101 = !DILocalVariable(name: "owalk_pt", scope: !1092, file: !3, line: 549, type: !175)
!1102 = !DILocation(line: 549, column: 39, scope: !1092)
!1103 = !DILocalVariable(name: "e", scope: !1092, file: !3, line: 550, type: !162)
!1104 = !DILocation(line: 550, column: 10, scope: !1092)
!1105 = !DILocation(line: 550, column: 14, scope: !1092)
!1106 = !DILocalVariable(name: "v", scope: !1092, file: !3, line: 551, type: !96)
!1107 = !DILocation(line: 551, column: 10, scope: !1092)
!1108 = !DILocalVariable(name: "vert_edge_count", scope: !1092, file: !3, line: 552, type: !1109)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 64, elements: !1110)
!1110 = !{!1111}
!1111 = !DISubrange(count: 2)
!1112 = !DILocation(line: 552, column: 12, scope: !1092)
!1113 = !DILocation(line: 552, column: 33, scope: !1092)
!1114 = !DILocation(line: 553, column: 33, scope: !1092)
!1115 = !DILocation(line: 553, column: 36, scope: !1092)
!1116 = !DILocation(line: 553, column: 6, scope: !1092)
!1117 = !DILocation(line: 554, column: 33, scope: !1092)
!1118 = !DILocation(line: 554, column: 36, scope: !1092)
!1119 = !DILocation(line: 554, column: 6, scope: !1092)
!1120 = !DILocation(line: 557, column: 6, scope: !1092)
!1121 = !DILocation(line: 557, column: 9, scope: !1092)
!1122 = !DILocation(line: 557, column: 4, scope: !1092)
!1123 = !DILocation(line: 559, column: 24, scope: !1092)
!1124 = !DILocation(line: 559, column: 10, scope: !1092)
!1125 = !DILocation(line: 559, column: 8, scope: !1092)
!1126 = !DILocation(line: 560, column: 18, scope: !1092)
!1127 = !DILocation(line: 560, column: 26, scope: !1092)
!1128 = !DILocation(line: 560, column: 37, scope: !1092)
!1129 = !DILocation(line: 560, column: 2, scope: !1092)
!1130 = !DILocation(line: 562, column: 30, scope: !1092)
!1131 = !DILocation(line: 562, column: 15, scope: !1092)
!1132 = !DILocation(line: 562, column: 22, scope: !1092)
!1133 = !DILocation(line: 562, column: 28, scope: !1092)
!1134 = !DILocation(line: 562, column: 2, scope: !1092)
!1135 = !DILocation(line: 562, column: 9, scope: !1092)
!1136 = !DILocation(line: 562, column: 13, scope: !1092)
!1137 = !DILocation(line: 563, column: 33, scope: !1092)
!1138 = !DILocation(line: 563, column: 17, scope: !1092)
!1139 = !DILocation(line: 563, column: 24, scope: !1092)
!1140 = !DILocation(line: 563, column: 31, scope: !1092)
!1141 = !DILocation(line: 563, column: 2, scope: !1092)
!1142 = !DILocation(line: 563, column: 9, scope: !1092)
!1143 = !DILocation(line: 563, column: 15, scope: !1092)
!1144 = !DILocation(line: 564, column: 43, scope: !1092)
!1145 = !DILocation(line: 564, column: 23, scope: !1092)
!1146 = !DILocation(line: 564, column: 2, scope: !1092)
!1147 = !DILocation(line: 564, column: 9, scope: !1092)
!1148 = !DILocation(line: 564, column: 21, scope: !1092)
!1149 = !DILocation(line: 565, column: 22, scope: !1092)
!1150 = !DILocation(line: 565, column: 29, scope: !1092)
!1151 = !DILocation(line: 565, column: 41, scope: !1092)
!1152 = !DILocation(line: 565, column: 62, scope: !1092)
!1153 = !DILocation(line: 565, column: 44, scope: !1092)
!1154 = !DILocation(line: 0, scope: !1092)
!1155 = !DILocation(line: 565, column: 21, scope: !1092)
!1156 = !DILocation(line: 565, column: 2, scope: !1092)
!1157 = !DILocation(line: 565, column: 9, scope: !1092)
!1158 = !DILocation(line: 565, column: 19, scope: !1092)
!1159 = !DILocation(line: 568, column: 7, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 568, column: 6)
!1161 = !DILocation(line: 568, column: 14, scope: !1160)
!1162 = !DILocation(line: 568, column: 26, scope: !1160)
!1163 = !DILocation(line: 568, column: 36, scope: !1160)
!1164 = !DILocation(line: 569, column: 7, scope: !1160)
!1165 = !DILocation(line: 569, column: 26, scope: !1160)
!1166 = !DILocation(line: 569, column: 31, scope: !1160)
!1167 = !DILocation(line: 569, column: 34, scope: !1160)
!1168 = !DILocation(line: 569, column: 53, scope: !1160)
!1169 = !DILocation(line: 568, column: 6, scope: !1092)
!1170 = !DILocalVariable(name: "iter", scope: !1171, file: !3, line: 571, type: !431)
!1171 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 570, column: 2)
!1172 = !DILocation(line: 571, column: 10, scope: !1171)
!1173 = !DILocalVariable(name: "f_iter", scope: !1171, file: !3, line: 572, type: !173)
!1174 = !DILocation(line: 572, column: 11, scope: !1171)
!1175 = !DILocalVariable(name: "f_best", scope: !1171, file: !3, line: 573, type: !173)
!1176 = !DILocation(line: 573, column: 11, scope: !1171)
!1177 = !DILocation(line: 575, column: 3, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1171, file: !3, line: 575, column: 3)
!1179 = !DILocation(line: 575, column: 3, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1178, file: !3, line: 575, column: 3)
!1181 = !DILocation(line: 576, column: 8, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !3, line: 576, column: 8)
!1183 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 575, column: 53)
!1184 = !DILocation(line: 576, column: 15, scope: !1182)
!1185 = !DILocation(line: 576, column: 23, scope: !1182)
!1186 = !DILocation(line: 576, column: 26, scope: !1182)
!1187 = !DILocation(line: 576, column: 34, scope: !1182)
!1188 = !DILocation(line: 576, column: 40, scope: !1182)
!1189 = !DILocation(line: 576, column: 48, scope: !1182)
!1190 = !DILocation(line: 576, column: 38, scope: !1182)
!1191 = !DILocation(line: 576, column: 8, scope: !1183)
!1192 = !DILocation(line: 577, column: 14, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1182, file: !3, line: 576, column: 53)
!1194 = !DILocation(line: 577, column: 12, scope: !1193)
!1195 = !DILocation(line: 578, column: 4, scope: !1193)
!1196 = !DILocation(line: 579, column: 3, scope: !1183)
!1197 = distinct !{!1197, !1177, !1198}
!1198 = !DILocation(line: 579, column: 3, scope: !1178)
!1199 = !DILocation(line: 581, column: 7, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1171, file: !3, line: 581, column: 7)
!1201 = !DILocation(line: 581, column: 7, scope: !1171)
!1202 = !DILocation(line: 584, column: 19, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1200, file: !3, line: 581, column: 15)
!1204 = !DILocation(line: 584, column: 27, scope: !1203)
!1205 = !DILocation(line: 584, column: 31, scope: !1203)
!1206 = !DILocation(line: 584, column: 37, scope: !1203)
!1207 = !DILocation(line: 584, column: 4, scope: !1203)
!1208 = !DILocation(line: 584, column: 11, scope: !1203)
!1209 = !DILocation(line: 584, column: 17, scope: !1203)
!1210 = !DILocation(line: 585, column: 3, scope: !1203)
!1211 = !DILocation(line: 588, column: 4, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1200, file: !3, line: 586, column: 8)
!1213 = !DILocation(line: 588, column: 11, scope: !1212)
!1214 = !DILocation(line: 588, column: 17, scope: !1212)
!1215 = !DILocation(line: 590, column: 2, scope: !1171)
!1216 = !DILocation(line: 592, column: 3, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 591, column: 7)
!1218 = !DILocation(line: 592, column: 10, scope: !1217)
!1219 = !DILocation(line: 592, column: 16, scope: !1217)
!1220 = !DILocation(line: 596, column: 2, scope: !1092)
!1221 = !DILocation(line: 596, column: 39, scope: !1092)
!1222 = !DILocation(line: 596, column: 21, scope: !1092)
!1223 = !DILocation(line: 596, column: 19, scope: !1092)
!1224 = !DILocation(line: 597, column: 30, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 596, column: 49)
!1226 = !DILocation(line: 597, column: 11, scope: !1225)
!1227 = !DILocation(line: 598, column: 12, scope: !1225)
!1228 = !DILocation(line: 598, column: 3, scope: !1225)
!1229 = distinct !{!1229, !1220, !1230}
!1230 = !DILocation(line: 599, column: 2, scope: !1092)
!1231 = !DILocation(line: 601, column: 24, scope: !1092)
!1232 = !DILocation(line: 601, column: 10, scope: !1092)
!1233 = !DILocation(line: 601, column: 8, scope: !1092)
!1234 = !DILocation(line: 602, column: 3, scope: !1092)
!1235 = !DILocation(line: 602, column: 11, scope: !1092)
!1236 = !DILocation(line: 604, column: 58, scope: !1092)
!1237 = !DILocation(line: 604, column: 63, scope: !1092)
!1238 = !DILocation(line: 604, column: 70, scope: !1092)
!1239 = !DILocation(line: 604, column: 33, scope: !1092)
!1240 = !DILocation(line: 604, column: 17, scope: !1092)
!1241 = !DILocation(line: 604, column: 24, scope: !1092)
!1242 = !DILocation(line: 604, column: 31, scope: !1092)
!1243 = !DILocation(line: 604, column: 2, scope: !1092)
!1244 = !DILocation(line: 604, column: 9, scope: !1092)
!1245 = !DILocation(line: 604, column: 15, scope: !1092)
!1246 = !DILocation(line: 606, column: 17, scope: !1092)
!1247 = !DILocation(line: 606, column: 25, scope: !1092)
!1248 = !DILocation(line: 606, column: 2, scope: !1092)
!1249 = !DILocation(line: 607, column: 18, scope: !1092)
!1250 = !DILocation(line: 607, column: 26, scope: !1092)
!1251 = !DILocation(line: 607, column: 43, scope: !1092)
!1252 = !DILocation(line: 607, column: 37, scope: !1092)
!1253 = !DILocation(line: 607, column: 2, scope: !1092)
!1254 = !DILocation(line: 608, column: 1, scope: !1092)
!1255 = distinct !DISubprogram(name: "bmw_LoopWalker_step", scope: !3, file: !3, line: 617, type: !560, scopeLine: 618, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !425)
!1256 = !DILocalVariable(name: "walker", arg: 1, scope: !1255, file: !3, line: 617, type: !219)
!1257 = !DILocation(line: 617, column: 44, scope: !1255)
!1258 = !DILocalVariable(name: "lwalk", scope: !1255, file: !3, line: 619, type: !175)
!1259 = !DILocation(line: 619, column: 17, scope: !1255)
!1260 = !DILocalVariable(name: "owalk", scope: !1255, file: !3, line: 619, type: !176)
!1261 = !DILocation(line: 619, column: 24, scope: !1255)
!1262 = !DILocalVariable(name: "e", scope: !1255, file: !3, line: 620, type: !162)
!1263 = !DILocation(line: 620, column: 10, scope: !1255)
!1264 = !DILocalVariable(name: "nexte", scope: !1255, file: !3, line: 620, type: !162)
!1265 = !DILocation(line: 620, column: 14, scope: !1255)
!1266 = !DILocalVariable(name: "l", scope: !1255, file: !3, line: 621, type: !146)
!1267 = !DILocation(line: 621, column: 10, scope: !1255)
!1268 = !DILocalVariable(name: "v", scope: !1255, file: !3, line: 622, type: !96)
!1269 = !DILocation(line: 622, column: 10, scope: !1255)
!1270 = !DILocalVariable(name: "i", scope: !1255, file: !3, line: 623, type: !106)
!1271 = !DILocation(line: 623, column: 6, scope: !1255)
!1272 = !DILocation(line: 625, column: 2, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 625, column: 2)
!1274 = !DILocation(line: 626, column: 8, scope: !1255)
!1275 = !DILocation(line: 628, column: 6, scope: !1255)
!1276 = !DILocation(line: 628, column: 13, scope: !1255)
!1277 = !DILocation(line: 628, column: 4, scope: !1255)
!1278 = !DILocation(line: 629, column: 6, scope: !1255)
!1279 = !DILocation(line: 629, column: 9, scope: !1255)
!1280 = !DILocation(line: 629, column: 4, scope: !1255)
!1281 = !DILocation(line: 631, column: 12, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 631, column: 6)
!1283 = !DILocation(line: 631, column: 6, scope: !1282)
!1284 = !DILocation(line: 631, column: 6, scope: !1255)
