; ModuleID = 'blender/source/blender/bmesh/operators/bmo_connect_pair.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_connect_pair.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!14 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !4, line: 116, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 83, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !55, line: 57, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!57 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!71 = !{!72, !140, !82, !145, !73, !147, !149, !150, !154, !124, !158}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !76)
!76 = !{!77, !89, !95, !100, !101}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !75, file: !43, line: 91, baseType: !78, size: 128)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !80)
!80 = !{!81, !83, !85, !87, !88}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !43, line: 65, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !79, file: !43, line: 66, baseType: !84, size: 32, offset: 64)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !79, file: !43, line: 73, baseType: !86, size: 8, offset: 96)
!86 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !79, file: !43, line: 74, baseType: !86, size: 8, offset: 104)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !79, file: !43, line: 80, baseType: !86, size: 8, offset: 112)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !75, file: !43, line: 92, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !91, file: !43, line: 181, baseType: !94, size: 16)
!94 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !75, file: !43, line: 94, baseType: !96, size: 96, offset: 192)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 96, elements: !98)
!97 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!98 = !{!99}
!99 = !DISubrange(count: 3)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !75, file: !43, line: 95, baseType: !96, size: 96, offset: 288)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !75, file: !43, line: 102, baseType: !102, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !104)
!104 = !{!105, !106, !107, !109, !110, !133, !139}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !103, file: !43, line: 111, baseType: !78, size: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !103, file: !43, line: 112, baseType: !90, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !103, file: !43, line: 114, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !103, file: !43, line: 114, baseType: !108, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !103, file: !43, line: 118, baseType: !111, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !113)
!113 = !{!114, !115, !116, !117, !129, !130, !131, !132}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !112, file: !43, line: 126, baseType: !78, size: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !112, file: !43, line: 129, baseType: !108, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !112, file: !43, line: 130, baseType: !102, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !112, file: !43, line: 131, baseType: !118, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !120)
!120 = !{!121, !122, !123, !126, !127, !128}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !119, file: !43, line: 165, baseType: !78, size: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !119, file: !43, line: 166, baseType: !90, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !119, file: !43, line: 172, baseType: !124, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !112)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !119, file: !43, line: 174, baseType: !84, size: 32, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !119, file: !43, line: 175, baseType: !96, size: 96, offset: 288)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !119, file: !43, line: 176, baseType: !94, size: 16, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !112, file: !43, line: 135, baseType: !111, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !112, file: !43, line: 135, baseType: !111, size: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !43, line: 139, baseType: !111, size: 64, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !112, file: !43, line: 139, baseType: !111, size: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !103, file: !43, line: 122, baseType: !134, size: 128, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !43, line: 107, baseType: !102, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !43, line: 107, baseType: !102, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !103, file: !43, line: 122, baseType: !134, size: 128, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !43, line: 154, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !43, line: 152, size: 128, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !142, file: !43, line: 153, baseType: !78, size: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !103)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !119)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !55, line: 79, baseType: !54)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !55, line: 158, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !82}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !55, line: 159, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!82, !82}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!159 = !{i32 7, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{i32 1, !"wchar_size", i32 4}
!162 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!163 = distinct !DISubprogram(name: "bmo_connect_vert_pair_exec", scope: !1, file: !1, line: 386, type: !164, scopeLine: 387, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !308)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166, !306}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !183, !184, !185, !186, !187, !189, !191, !192, !193, !194, !195, !196, !197, !198, !250, !289, !290, !291, !292, !293, !294, !295, !296, !303, !304, !305}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !168, file: !43, line: 187, baseType: !84, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !168, file: !43, line: 187, baseType: !84, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !168, file: !43, line: 187, baseType: !84, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !168, file: !43, line: 187, baseType: !84, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !168, file: !43, line: 188, baseType: !84, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !168, file: !43, line: 188, baseType: !84, size: 32, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !168, file: !43, line: 188, baseType: !84, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !168, file: !43, line: 193, baseType: !86, size: 8, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !168, file: !43, line: 197, baseType: !86, size: 8, offset: 232)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !168, file: !43, line: 201, baseType: !180, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !182, line: 71, flags: DIFlagFwdDecl)
!182 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !168, file: !43, line: 201, baseType: !180, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !168, file: !43, line: 201, baseType: !180, size: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !168, file: !43, line: 201, baseType: !180, size: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !168, file: !43, line: 208, baseType: !72, size: 64, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !168, file: !43, line: 209, baseType: !188, size: 64, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !168, file: !43, line: 210, baseType: !190, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !168, file: !43, line: 213, baseType: !84, size: 32, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !168, file: !43, line: 214, baseType: !84, size: 32, offset: 736)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !168, file: !43, line: 215, baseType: !84, size: 32, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !168, file: !43, line: 218, baseType: !180, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !168, file: !43, line: 218, baseType: !180, size: 64, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !168, file: !43, line: 218, baseType: !180, size: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !168, file: !43, line: 220, baseType: !84, size: 32, offset: 1024)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !168, file: !43, line: 221, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !201)
!201 = !{!202, !238, !239, !243, !246, !247, !249}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !200, file: !4, line: 191, baseType: !203, size: 5120)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 5120, elements: !236)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !205)
!205 = !{!206, !209, !211, !221, !222}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !204, file: !4, line: 148, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !204, file: !4, line: 149, baseType: !210, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !204, file: !4, line: 150, baseType: !212, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !214)
!214 = !{!215, !217, !219}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !213, file: !4, line: 139, baseType: !216, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !213, file: !4, line: 140, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !213, file: !4, line: 141, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !204, file: !4, line: 152, baseType: !84, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !204, file: !4, line: 162, baseType: !223, size: 128, offset: 192)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !4, line: 155, size: 128, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !231}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !223, file: !4, line: 156, baseType: !84, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !223, file: !4, line: 157, baseType: !97, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !223, file: !4, line: 158, baseType: !82, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !223, file: !4, line: 159, baseType: !96, size: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !223, file: !4, line: 160, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !223, file: !4, line: 161, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !234, line: 48, baseType: !235)
!234 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !234, line: 48, flags: DIFlagFwdDecl)
!236 = !{!237}
!237 = !DISubrange(count: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !200, file: !4, line: 192, baseType: !203, size: 5120, offset: 5120)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !200, file: !4, line: 193, baseType: !240, size: 64, offset: 10240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !166, !199}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !200, file: !4, line: 194, baseType: !244, size: 64, offset: 10304)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !4, line: 195, baseType: !84, size: 32, offset: 10368)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !200, file: !4, line: 196, baseType: !248, size: 32, offset: 10400)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !4, line: 197, baseType: !84, size: 32, offset: 10432)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !168, file: !43, line: 223, baseType: !251, size: 1600, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !182, line: 73, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !182, line: 64, size: 1600, elements: !253)
!253 = !{!254, !272, !276, !277, !278, !279, !280}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !252, file: !182, line: 65, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !182, line: 53, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !182, line: 42, size: 832, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !271}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !182, line: 43, baseType: !84, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !257, file: !182, line: 44, baseType: !84, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !257, file: !182, line: 45, baseType: !84, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !257, file: !182, line: 46, baseType: !84, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !257, file: !182, line: 47, baseType: !84, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !257, file: !182, line: 48, baseType: !84, size: 32, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !257, file: !182, line: 49, baseType: !84, size: 32, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !257, file: !182, line: 50, baseType: !84, size: 32, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !257, file: !182, line: 51, baseType: !268, size: 512, offset: 256)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 512, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !182, line: 52, baseType: !82, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !252, file: !182, line: 66, baseType: !273, size: 1312, offset: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1312, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 41)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !252, file: !182, line: 69, baseType: !84, size: 32, offset: 1376)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !252, file: !182, line: 69, baseType: !84, size: 32, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !252, file: !182, line: 70, baseType: !84, size: 32, offset: 1440)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !252, file: !182, line: 71, baseType: !180, size: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !252, file: !182, line: 72, baseType: !281, size: 64, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !182, line: 59, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !182, line: 57, size: 8192, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !283, file: !182, line: 58, baseType: !286, size: 8192)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8192, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !168, file: !43, line: 223, baseType: !251, size: 1600, offset: 2752)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !168, file: !43, line: 223, baseType: !251, size: 1600, offset: 4352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !168, file: !43, line: 223, baseType: !251, size: 1600, offset: 5952)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !168, file: !43, line: 233, baseType: !94, size: 16, offset: 7552)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !168, file: !43, line: 236, baseType: !84, size: 32, offset: 7584)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !168, file: !43, line: 238, baseType: !84, size: 32, offset: 7616)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !168, file: !43, line: 238, baseType: !84, size: 32, offset: 7648)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !168, file: !43, line: 239, baseType: !297, size: 128, offset: 7680)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !298, line: 71, baseType: !299)
!298 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !298, line: 69, size: 128, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !299, file: !298, line: 70, baseType: !82, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !299, file: !298, line: 70, baseType: !82, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !168, file: !43, line: 241, baseType: !147, size: 64, offset: 7808)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !168, file: !43, line: 243, baseType: !297, size: 128, offset: 7872)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !168, file: !43, line: 245, baseType: !82, size: 64, offset: 8000)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !200)
!308 = !{}
!309 = !DILocalVariable(name: "bm", arg: 1, scope: !163, file: !1, line: 386, type: !166)
!310 = !DILocation(line: 386, column: 40, scope: !163)
!311 = !DILocalVariable(name: "op", arg: 2, scope: !163, file: !1, line: 386, type: !306)
!312 = !DILocation(line: 386, column: 56, scope: !163)
!313 = !DILocalVariable(name: "op_verts_slot", scope: !163, file: !1, line: 388, type: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !204)
!316 = !DILocation(line: 388, column: 12, scope: !163)
!317 = !DILocation(line: 388, column: 41, scope: !163)
!318 = !DILocation(line: 388, column: 45, scope: !163)
!319 = !DILocation(line: 388, column: 28, scope: !163)
!320 = !DILocalVariable(name: "pc", scope: !163, file: !1, line: 390, type: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathContext", file: !1, line: 77, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathContext", file: !1, line: 66, size: 704, elements: !323)
!323 = !{!324, !325, !328, !329, !330, !331, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "state_lb", scope: !322, file: !1, line: 67, baseType: !297, size: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !322, file: !1, line: 68, baseType: !326, size: 288, offset: 128)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 288, elements: !327)
!327 = !{!99, !99}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "axis_sep", scope: !322, file: !1, line: 69, baseType: !97, size: 32, offset: 416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bm_bmoflag", scope: !322, file: !1, line: 72, baseType: !166, size: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "v_a", scope: !322, file: !1, line: 74, baseType: !73, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "v_b", scope: !322, file: !1, line: 74, baseType: !73, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "link_pool", scope: !322, file: !1, line: 76, baseType: !333, size: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !50, line: 47, baseType: !181)
!335 = !DILocation(line: 390, column: 14, scope: !163)
!336 = !DILocalVariable(name: "found_all", scope: !163, file: !1, line: 391, type: !337)
!337 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!338 = !DILocation(line: 391, column: 7, scope: !163)
!339 = !DILocalVariable(name: "found_dist_best", scope: !163, file: !1, line: 392, type: !97)
!340 = !DILocation(line: 392, column: 8, scope: !163)
!341 = !DILocation(line: 394, column: 6, scope: !342)
!342 = distinct !DILexicalBlock(scope: !163, file: !1, line: 394, column: 6)
!343 = !DILocation(line: 394, column: 21, scope: !342)
!344 = !DILocation(line: 394, column: 25, scope: !342)
!345 = !DILocation(line: 394, column: 6, scope: !163)
!346 = !DILocation(line: 396, column: 3, scope: !347)
!347 = distinct !DILexicalBlock(scope: !342, file: !1, line: 394, column: 31)
!348 = !DILocation(line: 399, column: 18, scope: !163)
!349 = !DILocation(line: 399, column: 5, scope: !163)
!350 = !DILocation(line: 399, column: 16, scope: !163)
!351 = !DILocation(line: 400, column: 23, scope: !163)
!352 = !DILocation(line: 400, column: 38, scope: !163)
!353 = !DILocation(line: 400, column: 43, scope: !163)
!354 = !DILocation(line: 400, column: 12, scope: !163)
!355 = !DILocation(line: 400, column: 11, scope: !163)
!356 = !DILocation(line: 400, column: 5, scope: !163)
!357 = !DILocation(line: 400, column: 9, scope: !163)
!358 = !DILocation(line: 401, column: 23, scope: !163)
!359 = !DILocation(line: 401, column: 38, scope: !163)
!360 = !DILocation(line: 401, column: 43, scope: !163)
!361 = !DILocation(line: 401, column: 12, scope: !163)
!362 = !DILocation(line: 401, column: 11, scope: !163)
!363 = !DILocation(line: 401, column: 5, scope: !163)
!364 = !DILocation(line: 401, column: 9, scope: !163)
!365 = !DILocation(line: 404, column: 11, scope: !366)
!366 = distinct !DILexicalBlock(scope: !163, file: !1, line: 404, column: 6)
!367 = !DILocation(line: 404, column: 8, scope: !366)
!368 = !DILocation(line: 404, column: 15, scope: !366)
!369 = !DILocation(line: 404, column: 21, scope: !366)
!370 = !DILocation(line: 404, column: 18, scope: !366)
!371 = !DILocation(line: 404, column: 6, scope: !163)
!372 = !DILocation(line: 405, column: 3, scope: !373)
!373 = distinct !DILexicalBlock(scope: !366, file: !1, line: 404, column: 27)
!374 = !DILocation(line: 414, column: 30, scope: !163)
!375 = !DILocation(line: 414, column: 34, scope: !163)
!376 = !DILocation(line: 414, column: 38, scope: !163)
!377 = !DILocation(line: 414, column: 2, scope: !163)
!378 = !DILocation(line: 415, column: 30, scope: !163)
!379 = !DILocation(line: 415, column: 34, scope: !163)
!380 = !DILocation(line: 415, column: 38, scope: !163)
!381 = !DILocation(line: 415, column: 2, scope: !163)
!382 = !DILocation(line: 419, column: 26, scope: !383)
!383 = distinct !DILexicalBlock(scope: !163, file: !1, line: 418, column: 2)
!384 = !DILocation(line: 419, column: 3, scope: !383)
!385 = !DILocation(line: 420, column: 18, scope: !383)
!386 = !DILocation(line: 420, column: 6, scope: !383)
!387 = !DILocation(line: 420, column: 16, scope: !383)
!388 = !DILocalVariable(name: "basis_dir", scope: !389, file: !1, line: 425, type: !96)
!389 = distinct !DILexicalBlock(scope: !163, file: !1, line: 424, column: 2)
!390 = !DILocation(line: 425, column: 9, scope: !389)
!391 = !DILocalVariable(name: "basis_tmp", scope: !389, file: !1, line: 426, type: !96)
!392 = !DILocation(line: 426, column: 9, scope: !389)
!393 = !DILocalVariable(name: "basis_nor", scope: !389, file: !1, line: 427, type: !96)
!394 = !DILocation(line: 427, column: 9, scope: !389)
!395 = !DILocation(line: 430, column: 15, scope: !389)
!396 = !DILocation(line: 430, column: 29, scope: !389)
!397 = !DILocation(line: 430, column: 34, scope: !389)
!398 = !DILocation(line: 430, column: 26, scope: !389)
!399 = !DILocation(line: 430, column: 41, scope: !389)
!400 = !DILocation(line: 430, column: 46, scope: !389)
!401 = !DILocation(line: 430, column: 38, scope: !389)
!402 = !DILocation(line: 430, column: 3, scope: !389)
!403 = !DILocalVariable(name: "basis_nor_a", scope: !404, file: !1, line: 439, type: !96)
!404 = distinct !DILexicalBlock(scope: !389, file: !1, line: 438, column: 3)
!405 = !DILocation(line: 439, column: 10, scope: !404)
!406 = !DILocalVariable(name: "basis_nor_b", scope: !404, file: !1, line: 440, type: !96)
!407 = !DILocation(line: 440, column: 10, scope: !404)
!408 = !DILocation(line: 443, column: 18, scope: !404)
!409 = !DILocation(line: 443, column: 34, scope: !404)
!410 = !DILocation(line: 443, column: 39, scope: !404)
!411 = !DILocation(line: 443, column: 31, scope: !404)
!412 = !DILocation(line: 443, column: 43, scope: !404)
!413 = !DILocation(line: 443, column: 4, scope: !404)
!414 = !DILocation(line: 444, column: 18, scope: !404)
!415 = !DILocation(line: 444, column: 31, scope: !404)
!416 = !DILocation(line: 444, column: 43, scope: !404)
!417 = !DILocation(line: 444, column: 4, scope: !404)
!418 = !DILocation(line: 446, column: 18, scope: !404)
!419 = !DILocation(line: 446, column: 34, scope: !404)
!420 = !DILocation(line: 446, column: 39, scope: !404)
!421 = !DILocation(line: 446, column: 31, scope: !404)
!422 = !DILocation(line: 446, column: 43, scope: !404)
!423 = !DILocation(line: 446, column: 4, scope: !404)
!424 = !DILocation(line: 447, column: 18, scope: !404)
!425 = !DILocation(line: 447, column: 31, scope: !404)
!426 = !DILocation(line: 447, column: 43, scope: !404)
!427 = !DILocation(line: 447, column: 4, scope: !404)
!428 = !DILocation(line: 450, column: 17, scope: !404)
!429 = !DILocation(line: 450, column: 4, scope: !404)
!430 = !DILocation(line: 451, column: 17, scope: !404)
!431 = !DILocation(line: 451, column: 4, scope: !404)
!432 = !DILocation(line: 454, column: 17, scope: !433)
!433 = distinct !DILexicalBlock(scope: !404, file: !1, line: 454, column: 8)
!434 = !DILocation(line: 454, column: 30, scope: !433)
!435 = !DILocation(line: 454, column: 8, scope: !433)
!436 = !DILocation(line: 454, column: 43, scope: !433)
!437 = !DILocation(line: 454, column: 8, scope: !404)
!438 = !DILocation(line: 455, column: 15, scope: !439)
!439 = distinct !DILexicalBlock(scope: !433, file: !1, line: 454, column: 51)
!440 = !DILocation(line: 455, column: 5, scope: !439)
!441 = !DILocation(line: 456, column: 4, scope: !439)
!442 = !DILocation(line: 457, column: 16, scope: !404)
!443 = !DILocation(line: 457, column: 27, scope: !404)
!444 = !DILocation(line: 457, column: 40, scope: !404)
!445 = !DILocation(line: 457, column: 4, scope: !404)
!446 = !DILocation(line: 462, column: 17, scope: !389)
!447 = !DILocation(line: 462, column: 28, scope: !389)
!448 = !DILocation(line: 462, column: 39, scope: !389)
!449 = !DILocation(line: 462, column: 3, scope: !389)
!450 = !DILocation(line: 464, column: 22, scope: !389)
!451 = !DILocation(line: 464, column: 19, scope: !389)
!452 = !DILocation(line: 464, column: 33, scope: !389)
!453 = !DILocation(line: 464, column: 3, scope: !389)
!454 = !DILocation(line: 465, column: 22, scope: !389)
!455 = !DILocation(line: 465, column: 19, scope: !389)
!456 = !DILocation(line: 465, column: 33, scope: !389)
!457 = !DILocation(line: 465, column: 3, scope: !389)
!458 = !DILocation(line: 466, column: 22, scope: !389)
!459 = !DILocation(line: 466, column: 19, scope: !389)
!460 = !DILocation(line: 466, column: 33, scope: !389)
!461 = !DILocation(line: 466, column: 3, scope: !389)
!462 = !DILocation(line: 467, column: 16, scope: !389)
!463 = !DILocation(line: 467, column: 13, scope: !389)
!464 = !DILocation(line: 467, column: 3, scope: !389)
!465 = !DILocation(line: 469, column: 36, scope: !389)
!466 = !DILocation(line: 469, column: 33, scope: !389)
!467 = !DILocation(line: 469, column: 47, scope: !389)
!468 = !DILocation(line: 469, column: 52, scope: !389)
!469 = !DILocation(line: 469, column: 44, scope: !389)
!470 = !DILocation(line: 469, column: 17, scope: !389)
!471 = !DILocation(line: 469, column: 6, scope: !389)
!472 = !DILocation(line: 469, column: 15, scope: !389)
!473 = !DILocalVariable(name: "state", scope: !474, file: !1, line: 474, type: !475)
!474 = distinct !DILexicalBlock(scope: !163, file: !1, line: 473, column: 2)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathLinkState", file: !1, line: 97, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathLinkState", file: !1, line: 88, size: 320, elements: !478)
!478 = !{!479, !481, !482, !489, !490}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !1, line: 89, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !477, file: !1, line: 89, baseType: !480, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "link_last", scope: !477, file: !1, line: 92, baseType: !483, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathLink", file: !1, line: 82, size: 192, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !1, line: 83, baseType: !483, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !484, file: !1, line: 84, baseType: !140, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ele_from", scope: !484, file: !1, line: 85, baseType: !140, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !477, file: !1, line: 95, baseType: !97, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "co_prev", scope: !477, file: !1, line: 96, baseType: !96, size: 96, offset: 224)
!491 = !DILocation(line: 474, column: 18, scope: !474)
!492 = !DILocation(line: 475, column: 11, scope: !474)
!493 = !DILocation(line: 475, column: 9, scope: !474)
!494 = !DILocation(line: 476, column: 19, scope: !474)
!495 = !DILocation(line: 476, column: 29, scope: !474)
!496 = !DILocation(line: 476, column: 3, scope: !474)
!497 = !DILocation(line: 477, column: 23, scope: !474)
!498 = !DILocation(line: 477, column: 43, scope: !474)
!499 = !DILocation(line: 477, column: 30, scope: !474)
!500 = !DILocation(line: 477, column: 3, scope: !474)
!501 = !DILocation(line: 481, column: 12, scope: !163)
!502 = !DILocation(line: 482, column: 2, scope: !163)
!503 = !DILocation(line: 482, column: 12, scope: !163)
!504 = !DILocation(line: 482, column: 21, scope: !163)
!505 = !DILocalVariable(name: "state", scope: !506, file: !1, line: 483, type: !475)
!506 = distinct !DILexicalBlock(scope: !163, file: !1, line: 482, column: 28)
!507 = !DILocation(line: 483, column: 18, scope: !506)
!508 = !DILocalVariable(name: "state_next", scope: !506, file: !1, line: 483, type: !475)
!509 = !DILocation(line: 483, column: 26, scope: !506)
!510 = !DILocation(line: 484, column: 13, scope: !506)
!511 = !DILocation(line: 485, column: 19, scope: !512)
!512 = distinct !DILexicalBlock(scope: !506, file: !1, line: 485, column: 3)
!513 = !DILocation(line: 485, column: 28, scope: !512)
!514 = !DILocation(line: 485, column: 16, scope: !512)
!515 = !DILocation(line: 485, column: 14, scope: !512)
!516 = !DILocation(line: 485, column: 8, scope: !512)
!517 = !DILocation(line: 485, column: 35, scope: !518)
!518 = distinct !DILexicalBlock(scope: !512, file: !1, line: 485, column: 3)
!519 = !DILocation(line: 485, column: 3, scope: !512)
!520 = !DILocation(line: 486, column: 17, scope: !521)
!521 = distinct !DILexicalBlock(scope: !518, file: !1, line: 485, column: 62)
!522 = !DILocation(line: 486, column: 24, scope: !521)
!523 = !DILocation(line: 486, column: 15, scope: !521)
!524 = !DILocation(line: 487, column: 8, scope: !525)
!525 = distinct !DILexicalBlock(scope: !521, file: !1, line: 487, column: 8)
!526 = !DILocation(line: 487, column: 15, scope: !525)
!527 = !DILocation(line: 487, column: 26, scope: !525)
!528 = !DILocation(line: 487, column: 46, scope: !525)
!529 = !DILocation(line: 487, column: 33, scope: !525)
!530 = !DILocation(line: 487, column: 30, scope: !525)
!531 = !DILocation(line: 487, column: 8, scope: !521)
!532 = !DILocation(line: 492, column: 10, scope: !533)
!533 = distinct !DILexicalBlock(scope: !534, file: !1, line: 492, column: 9)
!534 = distinct !DILexicalBlock(scope: !525, file: !1, line: 487, column: 51)
!535 = !DILocation(line: 492, column: 26, scope: !533)
!536 = !DILocation(line: 492, column: 36, scope: !533)
!537 = !DILocation(line: 492, column: 40, scope: !533)
!538 = !DILocation(line: 492, column: 58, scope: !533)
!539 = !DILocation(line: 492, column: 65, scope: !533)
!540 = !DILocation(line: 492, column: 56, scope: !533)
!541 = !DILocation(line: 492, column: 9, scope: !534)
!542 = !DILocation(line: 493, column: 24, scope: !543)
!543 = distinct !DILexicalBlock(scope: !533, file: !1, line: 492, column: 72)
!544 = !DILocation(line: 493, column: 31, scope: !543)
!545 = !DILocation(line: 493, column: 22, scope: !543)
!546 = !DILocation(line: 494, column: 5, scope: !543)
!547 = !DILocation(line: 495, column: 4, scope: !534)
!548 = !DILocation(line: 496, column: 29, scope: !549)
!549 = distinct !DILexicalBlock(scope: !525, file: !1, line: 496, column: 13)
!550 = !DILocation(line: 496, column: 13, scope: !549)
!551 = !DILocation(line: 496, column: 13, scope: !525)
!552 = !DILocation(line: 497, column: 10, scope: !553)
!553 = distinct !DILexicalBlock(scope: !554, file: !1, line: 497, column: 9)
!554 = distinct !DILexicalBlock(scope: !549, file: !1, line: 496, column: 37)
!555 = !DILocation(line: 497, column: 26, scope: !553)
!556 = !DILocation(line: 497, column: 36, scope: !553)
!557 = !DILocation(line: 497, column: 40, scope: !553)
!558 = !DILocation(line: 497, column: 59, scope: !553)
!559 = !DILocation(line: 497, column: 66, scope: !553)
!560 = !DILocation(line: 497, column: 56, scope: !553)
!561 = !DILocation(line: 497, column: 9, scope: !554)
!562 = !DILocation(line: 498, column: 22, scope: !563)
!563 = distinct !DILexicalBlock(scope: !553, file: !1, line: 497, column: 73)
!564 = !DILocation(line: 498, column: 32, scope: !563)
!565 = !DILocation(line: 498, column: 6, scope: !563)
!566 = !DILocation(line: 499, column: 6, scope: !563)
!567 = !DILocation(line: 499, column: 16, scope: !563)
!568 = !DILocation(line: 500, column: 5, scope: !563)
!569 = !DILocation(line: 501, column: 15, scope: !554)
!570 = !DILocation(line: 502, column: 4, scope: !554)
!571 = !DILocation(line: 506, column: 21, scope: !572)
!572 = distinct !DILexicalBlock(scope: !549, file: !1, line: 503, column: 9)
!573 = !DILocation(line: 506, column: 31, scope: !572)
!574 = !DILocation(line: 506, column: 5, scope: !572)
!575 = !DILocation(line: 507, column: 5, scope: !572)
!576 = !DILocation(line: 507, column: 15, scope: !572)
!577 = !DILocation(line: 509, column: 3, scope: !521)
!578 = !DILocation(line: 485, column: 50, scope: !518)
!579 = !DILocation(line: 485, column: 48, scope: !518)
!580 = !DILocation(line: 485, column: 3, scope: !518)
!581 = distinct !{!581, !519, !582}
!582 = !DILocation(line: 509, column: 3, scope: !512)
!583 = !DILocation(line: 511, column: 7, scope: !584)
!584 = distinct !DILexicalBlock(scope: !506, file: !1, line: 511, column: 7)
!585 = !DILocation(line: 511, column: 7, scope: !506)
!586 = !DILocation(line: 517, column: 4, scope: !587)
!587 = distinct !DILexicalBlock(scope: !584, file: !1, line: 511, column: 18)
!588 = distinct !{!588, !502, !589}
!589 = !DILocation(line: 519, column: 2, scope: !163)
!590 = !DILocation(line: 521, column: 32, scope: !591)
!591 = distinct !DILexicalBlock(scope: !163, file: !1, line: 521, column: 6)
!592 = !DILocation(line: 521, column: 6, scope: !591)
!593 = !DILocation(line: 521, column: 6, scope: !163)
!594 = !DILocation(line: 522, column: 13, scope: !595)
!595 = distinct !DILexicalBlock(scope: !591, file: !1, line: 521, column: 43)
!596 = !DILocation(line: 523, column: 2, scope: !595)
!597 = !DILocation(line: 525, column: 6, scope: !598)
!598 = distinct !DILexicalBlock(scope: !163, file: !1, line: 525, column: 6)
!599 = !DILocation(line: 525, column: 6, scope: !163)
!600 = !DILocalVariable(name: "state", scope: !601, file: !1, line: 526, type: !475)
!601 = distinct !DILexicalBlock(scope: !598, file: !1, line: 525, column: 17)
!602 = !DILocation(line: 526, column: 18, scope: !601)
!603 = !DILocalVariable(name: "state_best", scope: !601, file: !1, line: 526, type: !475)
!604 = !DILocation(line: 526, column: 26, scope: !601)
!605 = !DILocalVariable(name: "link", scope: !601, file: !1, line: 527, type: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathLink", file: !1, line: 86, baseType: !484)
!608 = !DILocation(line: 527, column: 13, scope: !601)
!609 = !DILocalVariable(name: "state_best_dist", scope: !601, file: !1, line: 528, type: !97)
!610 = !DILocation(line: 528, column: 9, scope: !601)
!611 = !DILocation(line: 531, column: 19, scope: !612)
!612 = distinct !DILexicalBlock(scope: !601, file: !1, line: 531, column: 3)
!613 = !DILocation(line: 531, column: 28, scope: !612)
!614 = !DILocation(line: 531, column: 16, scope: !612)
!615 = !DILocation(line: 531, column: 14, scope: !612)
!616 = !DILocation(line: 531, column: 8, scope: !612)
!617 = !DILocation(line: 531, column: 35, scope: !618)
!618 = distinct !DILexicalBlock(scope: !612, file: !1, line: 531, column: 3)
!619 = !DILocation(line: 531, column: 3, scope: !612)
!620 = !DILocation(line: 532, column: 9, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !1, line: 532, column: 8)
!622 = distinct !DILexicalBlock(scope: !618, file: !1, line: 531, column: 63)
!623 = !DILocation(line: 532, column: 20, scope: !621)
!624 = !DILocation(line: 532, column: 29, scope: !621)
!625 = !DILocation(line: 532, column: 33, scope: !621)
!626 = !DILocation(line: 532, column: 40, scope: !621)
!627 = !DILocation(line: 532, column: 47, scope: !621)
!628 = !DILocation(line: 532, column: 45, scope: !621)
!629 = !DILocation(line: 532, column: 8, scope: !622)
!630 = !DILocation(line: 533, column: 18, scope: !631)
!631 = distinct !DILexicalBlock(scope: !621, file: !1, line: 532, column: 65)
!632 = !DILocation(line: 533, column: 16, scope: !631)
!633 = !DILocation(line: 534, column: 23, scope: !631)
!634 = !DILocation(line: 534, column: 35, scope: !631)
!635 = !DILocation(line: 534, column: 21, scope: !631)
!636 = !DILocation(line: 535, column: 4, scope: !631)
!637 = !DILocation(line: 536, column: 3, scope: !622)
!638 = !DILocation(line: 531, column: 50, scope: !618)
!639 = !DILocation(line: 531, column: 57, scope: !618)
!640 = !DILocation(line: 531, column: 48, scope: !618)
!641 = !DILocation(line: 531, column: 3, scope: !618)
!642 = distinct !{!642, !619, !643}
!643 = !DILocation(line: 536, column: 3, scope: !612)
!644 = !DILocation(line: 538, column: 10, scope: !601)
!645 = !DILocation(line: 538, column: 22, scope: !601)
!646 = !DILocation(line: 538, column: 8, scope: !601)
!647 = !DILocation(line: 539, column: 3, scope: !601)
!648 = !DILocation(line: 540, column: 8, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !1, line: 540, column: 8)
!650 = distinct !DILexicalBlock(scope: !601, file: !1, line: 539, column: 6)
!651 = !DILocation(line: 540, column: 14, scope: !649)
!652 = !DILocation(line: 540, column: 19, scope: !649)
!653 = !DILocation(line: 540, column: 24, scope: !649)
!654 = !DILocation(line: 540, column: 30, scope: !649)
!655 = !DILocation(line: 540, column: 8, scope: !650)
!656 = !DILocalVariable(name: "e", scope: !657, file: !1, line: 541, type: !145)
!657 = distinct !DILexicalBlock(scope: !649, file: !1, line: 540, column: 42)
!658 = !DILocation(line: 541, column: 13, scope: !657)
!659 = !DILocation(line: 541, column: 27, scope: !657)
!660 = !DILocation(line: 541, column: 33, scope: !657)
!661 = !DILocation(line: 541, column: 17, scope: !657)
!662 = !DILocalVariable(name: "v_new", scope: !657, file: !1, line: 542, type: !73)
!663 = !DILocation(line: 542, column: 13, scope: !657)
!664 = !DILocalVariable(name: "e_fac", scope: !657, file: !1, line: 543, type: !97)
!665 = !DILocation(line: 543, column: 11, scope: !657)
!666 = !DILocation(line: 543, column: 47, scope: !657)
!667 = !DILocation(line: 543, column: 50, scope: !657)
!668 = !DILocation(line: 543, column: 54, scope: !657)
!669 = !DILocation(line: 543, column: 58, scope: !657)
!670 = !DILocation(line: 543, column: 61, scope: !657)
!671 = !DILocation(line: 543, column: 65, scope: !657)
!672 = !DILocation(line: 543, column: 19, scope: !657)
!673 = !DILocation(line: 544, column: 27, scope: !657)
!674 = !DILocation(line: 544, column: 31, scope: !657)
!675 = !DILocation(line: 544, column: 34, scope: !657)
!676 = !DILocation(line: 544, column: 37, scope: !657)
!677 = !DILocation(line: 544, column: 47, scope: !657)
!678 = !DILocation(line: 544, column: 13, scope: !657)
!679 = !DILocation(line: 544, column: 11, scope: !657)
!680 = !DILocation(line: 545, column: 5, scope: !657)
!681 = !DILocation(line: 546, column: 4, scope: !657)
!682 = !DILocation(line: 547, column: 13, scope: !683)
!683 = distinct !DILexicalBlock(scope: !649, file: !1, line: 547, column: 13)
!684 = !DILocation(line: 547, column: 19, scope: !683)
!685 = !DILocation(line: 547, column: 24, scope: !683)
!686 = !DILocation(line: 547, column: 29, scope: !683)
!687 = !DILocation(line: 547, column: 35, scope: !683)
!688 = !DILocation(line: 547, column: 13, scope: !649)
!689 = !DILocalVariable(name: "v", scope: !690, file: !1, line: 548, type: !73)
!690 = distinct !DILexicalBlock(scope: !683, file: !1, line: 547, column: 47)
!691 = !DILocation(line: 548, column: 13, scope: !690)
!692 = !DILocation(line: 548, column: 27, scope: !690)
!693 = !DILocation(line: 548, column: 33, scope: !690)
!694 = !DILocation(line: 548, column: 17, scope: !690)
!695 = !DILocation(line: 549, column: 5, scope: !690)
!696 = !DILocation(line: 550, column: 4, scope: !690)
!697 = !DILocation(line: 554, column: 3, scope: !650)
!698 = !DILocation(line: 554, column: 20, scope: !601)
!699 = !DILocation(line: 554, column: 26, scope: !601)
!700 = !DILocation(line: 554, column: 18, scope: !601)
!701 = distinct !{!701, !647, !702}
!702 = !DILocation(line: 554, column: 31, scope: !601)
!703 = !DILocation(line: 555, column: 2, scope: !601)
!704 = !DILocation(line: 557, column: 2, scope: !163)
!705 = !DILocation(line: 558, column: 2, scope: !163)
!706 = !DILocation(line: 560, column: 25, scope: !163)
!707 = !DILocation(line: 560, column: 2, scope: !163)
!708 = !DILocation(line: 561, column: 20, scope: !163)
!709 = !DILocation(line: 561, column: 2, scope: !163)
!710 = !DILocation(line: 564, column: 6, scope: !711)
!711 = distinct !DILexicalBlock(scope: !163, file: !1, line: 564, column: 6)
!712 = !DILocation(line: 564, column: 6, scope: !163)
!713 = !DILocalVariable(name: "op_sub", scope: !714, file: !1, line: 567, type: !307)
!714 = distinct !DILexicalBlock(scope: !711, file: !1, line: 564, column: 17)
!715 = !DILocation(line: 567, column: 14, scope: !714)
!716 = !DILocation(line: 568, column: 16, scope: !714)
!717 = !DILocation(line: 570, column: 26, scope: !714)
!718 = !DILocation(line: 568, column: 3, scope: !714)
!719 = !DILocation(line: 571, column: 15, scope: !714)
!720 = !DILocation(line: 571, column: 3, scope: !714)
!721 = !DILocation(line: 572, column: 3, scope: !714)
!722 = !DILocation(line: 574, column: 17, scope: !714)
!723 = !DILocation(line: 574, column: 3, scope: !714)
!724 = !DILocation(line: 575, column: 2, scope: !714)
!725 = !DILocation(line: 577, column: 1, scope: !163)
!726 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !727, file: !727, line: 89, type: !728, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!727 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!728 = !DISubroutineType(types: !729)
!729 = !{null, !730}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!731 = !DILocalVariable(name: "lb", arg: 1, scope: !726, file: !727, line: 89, type: !730)
!732 = !DILocation(line: 89, column: 53, scope: !726)
!733 = !DILocation(line: 89, column: 71, scope: !726)
!734 = !DILocation(line: 89, column: 75, scope: !726)
!735 = !DILocation(line: 89, column: 80, scope: !726)
!736 = !DILocation(line: 89, column: 59, scope: !726)
!737 = !DILocation(line: 89, column: 63, scope: !726)
!738 = !DILocation(line: 89, column: 69, scope: !726)
!739 = !DILocation(line: 89, column: 93, scope: !726)
!740 = distinct !DISubprogram(name: "sub_v3_v3v3", scope: !741, file: !741, line: 357, type: !742, scopeLine: 358, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!741 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!742 = !DISubroutineType(types: !743)
!743 = !{null, !744, !745, !745}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!747 = !DILocalVariable(name: "r", arg: 1, scope: !740, file: !741, line: 357, type: !744)
!748 = !DILocation(line: 357, column: 32, scope: !740)
!749 = !DILocalVariable(name: "a", arg: 2, scope: !740, file: !741, line: 357, type: !745)
!750 = !DILocation(line: 357, column: 50, scope: !740)
!751 = !DILocalVariable(name: "b", arg: 3, scope: !740, file: !741, line: 357, type: !745)
!752 = !DILocation(line: 357, column: 68, scope: !740)
!753 = !DILocation(line: 359, column: 9, scope: !740)
!754 = !DILocation(line: 359, column: 16, scope: !740)
!755 = !DILocation(line: 359, column: 14, scope: !740)
!756 = !DILocation(line: 359, column: 2, scope: !740)
!757 = !DILocation(line: 359, column: 7, scope: !740)
!758 = !DILocation(line: 360, column: 9, scope: !740)
!759 = !DILocation(line: 360, column: 16, scope: !740)
!760 = !DILocation(line: 360, column: 14, scope: !740)
!761 = !DILocation(line: 360, column: 2, scope: !740)
!762 = !DILocation(line: 360, column: 7, scope: !740)
!763 = !DILocation(line: 361, column: 9, scope: !740)
!764 = !DILocation(line: 361, column: 16, scope: !740)
!765 = !DILocation(line: 361, column: 14, scope: !740)
!766 = !DILocation(line: 361, column: 2, scope: !740)
!767 = !DILocation(line: 361, column: 7, scope: !740)
!768 = !DILocation(line: 362, column: 1, scope: !740)
!769 = distinct !DISubprogram(name: "cross_v3_v3v3", scope: !741, file: !741, line: 634, type: !742, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!770 = !DILocalVariable(name: "r", arg: 1, scope: !769, file: !741, line: 634, type: !744)
!771 = !DILocation(line: 634, column: 34, scope: !769)
!772 = !DILocalVariable(name: "a", arg: 2, scope: !769, file: !741, line: 634, type: !745)
!773 = !DILocation(line: 634, column: 52, scope: !769)
!774 = !DILocalVariable(name: "b", arg: 3, scope: !769, file: !741, line: 634, type: !745)
!775 = !DILocation(line: 634, column: 70, scope: !769)
!776 = !DILocation(line: 637, column: 9, scope: !769)
!777 = !DILocation(line: 637, column: 16, scope: !769)
!778 = !DILocation(line: 637, column: 14, scope: !769)
!779 = !DILocation(line: 637, column: 23, scope: !769)
!780 = !DILocation(line: 637, column: 30, scope: !769)
!781 = !DILocation(line: 637, column: 28, scope: !769)
!782 = !DILocation(line: 637, column: 21, scope: !769)
!783 = !DILocation(line: 637, column: 2, scope: !769)
!784 = !DILocation(line: 637, column: 7, scope: !769)
!785 = !DILocation(line: 638, column: 9, scope: !769)
!786 = !DILocation(line: 638, column: 16, scope: !769)
!787 = !DILocation(line: 638, column: 14, scope: !769)
!788 = !DILocation(line: 638, column: 23, scope: !769)
!789 = !DILocation(line: 638, column: 30, scope: !769)
!790 = !DILocation(line: 638, column: 28, scope: !769)
!791 = !DILocation(line: 638, column: 21, scope: !769)
!792 = !DILocation(line: 638, column: 2, scope: !769)
!793 = !DILocation(line: 638, column: 7, scope: !769)
!794 = !DILocation(line: 639, column: 9, scope: !769)
!795 = !DILocation(line: 639, column: 16, scope: !769)
!796 = !DILocation(line: 639, column: 14, scope: !769)
!797 = !DILocation(line: 639, column: 23, scope: !769)
!798 = !DILocation(line: 639, column: 30, scope: !769)
!799 = !DILocation(line: 639, column: 28, scope: !769)
!800 = !DILocation(line: 639, column: 21, scope: !769)
!801 = !DILocation(line: 639, column: 2, scope: !769)
!802 = !DILocation(line: 639, column: 7, scope: !769)
!803 = !DILocation(line: 640, column: 1, scope: !769)
!804 = distinct !DISubprogram(name: "normalize_v3", scope: !741, file: !741, line: 830, type: !805, scopeLine: 831, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!805 = !DISubroutineType(types: !806)
!806 = !{!97, !744}
!807 = !DILocalVariable(name: "n", arg: 1, scope: !804, file: !741, line: 830, type: !744)
!808 = !DILocation(line: 830, column: 34, scope: !804)
!809 = !DILocation(line: 832, column: 25, scope: !804)
!810 = !DILocation(line: 832, column: 28, scope: !804)
!811 = !DILocation(line: 832, column: 9, scope: !804)
!812 = !DILocation(line: 832, column: 2, scope: !804)
!813 = distinct !DISubprogram(name: "dot_v3v3", scope: !741, file: !741, line: 619, type: !814, scopeLine: 620, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!814 = !DISubroutineType(types: !815)
!815 = !{!97, !745, !745}
!816 = !DILocalVariable(name: "a", arg: 1, scope: !813, file: !741, line: 619, type: !745)
!817 = !DILocation(line: 619, column: 36, scope: !813)
!818 = !DILocalVariable(name: "b", arg: 2, scope: !813, file: !741, line: 619, type: !745)
!819 = !DILocation(line: 619, column: 54, scope: !813)
!820 = !DILocation(line: 621, column: 9, scope: !813)
!821 = !DILocation(line: 621, column: 16, scope: !813)
!822 = !DILocation(line: 621, column: 14, scope: !813)
!823 = !DILocation(line: 621, column: 23, scope: !813)
!824 = !DILocation(line: 621, column: 30, scope: !813)
!825 = !DILocation(line: 621, column: 28, scope: !813)
!826 = !DILocation(line: 621, column: 21, scope: !813)
!827 = !DILocation(line: 621, column: 37, scope: !813)
!828 = !DILocation(line: 621, column: 44, scope: !813)
!829 = !DILocation(line: 621, column: 42, scope: !813)
!830 = !DILocation(line: 621, column: 35, scope: !813)
!831 = !DILocation(line: 621, column: 2, scope: !813)
!832 = distinct !DISubprogram(name: "negate_v3", scope: !741, file: !741, line: 576, type: !833, scopeLine: 577, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !744}
!835 = !DILocalVariable(name: "r", arg: 1, scope: !832, file: !741, line: 576, type: !744)
!836 = !DILocation(line: 576, column: 30, scope: !832)
!837 = !DILocation(line: 578, column: 10, scope: !832)
!838 = !DILocation(line: 578, column: 9, scope: !832)
!839 = !DILocation(line: 578, column: 2, scope: !832)
!840 = !DILocation(line: 578, column: 7, scope: !832)
!841 = !DILocation(line: 579, column: 10, scope: !832)
!842 = !DILocation(line: 579, column: 9, scope: !832)
!843 = !DILocation(line: 579, column: 2, scope: !832)
!844 = !DILocation(line: 579, column: 7, scope: !832)
!845 = !DILocation(line: 580, column: 10, scope: !832)
!846 = !DILocation(line: 580, column: 9, scope: !832)
!847 = !DILocation(line: 580, column: 2, scope: !832)
!848 = !DILocation(line: 580, column: 7, scope: !832)
!849 = !DILocation(line: 581, column: 1, scope: !832)
!850 = distinct !DISubprogram(name: "add_v3_v3v3", scope: !741, file: !741, line: 309, type: !742, scopeLine: 310, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!851 = !DILocalVariable(name: "r", arg: 1, scope: !850, file: !741, line: 309, type: !744)
!852 = !DILocation(line: 309, column: 32, scope: !850)
!853 = !DILocalVariable(name: "a", arg: 2, scope: !850, file: !741, line: 309, type: !745)
!854 = !DILocation(line: 309, column: 50, scope: !850)
!855 = !DILocalVariable(name: "b", arg: 3, scope: !850, file: !741, line: 309, type: !745)
!856 = !DILocation(line: 309, column: 68, scope: !850)
!857 = !DILocation(line: 311, column: 9, scope: !850)
!858 = !DILocation(line: 311, column: 16, scope: !850)
!859 = !DILocation(line: 311, column: 14, scope: !850)
!860 = !DILocation(line: 311, column: 2, scope: !850)
!861 = !DILocation(line: 311, column: 7, scope: !850)
!862 = !DILocation(line: 312, column: 9, scope: !850)
!863 = !DILocation(line: 312, column: 16, scope: !850)
!864 = !DILocation(line: 312, column: 14, scope: !850)
!865 = !DILocation(line: 312, column: 2, scope: !850)
!866 = !DILocation(line: 312, column: 7, scope: !850)
!867 = !DILocation(line: 313, column: 9, scope: !850)
!868 = !DILocation(line: 313, column: 16, scope: !850)
!869 = !DILocation(line: 313, column: 14, scope: !850)
!870 = !DILocation(line: 313, column: 2, scope: !850)
!871 = !DILocation(line: 313, column: 7, scope: !850)
!872 = !DILocation(line: 314, column: 1, scope: !850)
!873 = distinct !DISubprogram(name: "normalize_v3_v3", scope: !741, file: !741, line: 788, type: !874, scopeLine: 789, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!874 = !DISubroutineType(types: !875)
!875 = !{!97, !744, !745}
!876 = !DILocalVariable(name: "r", arg: 1, scope: !873, file: !741, line: 788, type: !744)
!877 = !DILocation(line: 788, column: 37, scope: !873)
!878 = !DILocalVariable(name: "a", arg: 2, scope: !873, file: !741, line: 788, type: !745)
!879 = !DILocation(line: 788, column: 55, scope: !873)
!880 = !DILocalVariable(name: "d", scope: !873, file: !741, line: 790, type: !97)
!881 = !DILocation(line: 790, column: 8, scope: !873)
!882 = !DILocation(line: 790, column: 21, scope: !873)
!883 = !DILocation(line: 790, column: 24, scope: !873)
!884 = !DILocation(line: 790, column: 12, scope: !873)
!885 = !DILocation(line: 794, column: 6, scope: !886)
!886 = distinct !DILexicalBlock(scope: !873, file: !741, line: 794, column: 6)
!887 = !DILocation(line: 794, column: 8, scope: !886)
!888 = !DILocation(line: 794, column: 6, scope: !873)
!889 = !DILocation(line: 795, column: 13, scope: !890)
!890 = distinct !DILexicalBlock(scope: !886, file: !741, line: 794, column: 20)
!891 = !DILocation(line: 795, column: 7, scope: !890)
!892 = !DILocation(line: 795, column: 5, scope: !890)
!893 = !DILocation(line: 796, column: 15, scope: !890)
!894 = !DILocation(line: 796, column: 18, scope: !890)
!895 = !DILocation(line: 796, column: 28, scope: !890)
!896 = !DILocation(line: 796, column: 26, scope: !890)
!897 = !DILocation(line: 796, column: 3, scope: !890)
!898 = !DILocation(line: 797, column: 2, scope: !890)
!899 = !DILocation(line: 799, column: 11, scope: !900)
!900 = distinct !DILexicalBlock(scope: !886, file: !741, line: 798, column: 7)
!901 = !DILocation(line: 799, column: 3, scope: !900)
!902 = !DILocation(line: 800, column: 5, scope: !900)
!903 = !DILocation(line: 803, column: 9, scope: !873)
!904 = !DILocation(line: 803, column: 2, scope: !873)
!905 = distinct !DISubprogram(name: "dot_m3_v3_row_x", scope: !741, file: !741, line: 471, type: !906, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!906 = !DISubroutineType(types: !907)
!907 = !{!97, !158, !745}
!908 = !DILocalVariable(name: "M", arg: 1, scope: !905, file: !741, line: 471, type: !158)
!909 = !DILocation(line: 471, column: 37, scope: !905)
!910 = !DILocalVariable(name: "a", arg: 2, scope: !905, file: !741, line: 471, type: !745)
!911 = !DILocation(line: 471, column: 58, scope: !905)
!912 = !DILocation(line: 473, column: 9, scope: !905)
!913 = !DILocation(line: 473, column: 19, scope: !905)
!914 = !DILocation(line: 473, column: 17, scope: !905)
!915 = !DILocation(line: 473, column: 26, scope: !905)
!916 = !DILocation(line: 473, column: 36, scope: !905)
!917 = !DILocation(line: 473, column: 34, scope: !905)
!918 = !DILocation(line: 473, column: 24, scope: !905)
!919 = !DILocation(line: 473, column: 43, scope: !905)
!920 = !DILocation(line: 473, column: 53, scope: !905)
!921 = !DILocation(line: 473, column: 51, scope: !905)
!922 = !DILocation(line: 473, column: 41, scope: !905)
!923 = !DILocation(line: 473, column: 2, scope: !905)
!924 = distinct !DISubprogram(name: "state_link_add", scope: !1, file: !1, line: 160, type: !925, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !927, !475, !140, !140}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!928 = !DILocalVariable(name: "pc", arg: 1, scope: !924, file: !1, line: 160, type: !927)
!929 = !DILocation(line: 160, column: 41, scope: !924)
!930 = !DILocalVariable(name: "state", arg: 2, scope: !924, file: !1, line: 160, type: !475)
!931 = !DILocation(line: 160, column: 60, scope: !924)
!932 = !DILocalVariable(name: "ele", arg: 3, scope: !924, file: !1, line: 161, type: !140)
!933 = !DILocation(line: 161, column: 36, scope: !924)
!934 = !DILocalVariable(name: "ele_from", arg: 4, scope: !924, file: !1, line: 161, type: !140)
!935 = !DILocation(line: 161, column: 49, scope: !924)
!936 = !DILocalVariable(name: "step_new", scope: !924, file: !1, line: 163, type: !606)
!937 = !DILocation(line: 163, column: 12, scope: !924)
!938 = !DILocation(line: 163, column: 41, scope: !924)
!939 = !DILocation(line: 163, column: 45, scope: !924)
!940 = !DILocation(line: 163, column: 23, scope: !924)
!941 = !DILocalVariable(name: "co", scope: !942, file: !1, line: 195, type: !96)
!942 = distinct !DILexicalBlock(scope: !924, file: !1, line: 194, column: 2)
!943 = !DILocation(line: 195, column: 9, scope: !942)
!944 = !DILocation(line: 196, column: 7, scope: !945)
!945 = distinct !DILexicalBlock(scope: !942, file: !1, line: 196, column: 7)
!946 = !DILocation(line: 196, column: 12, scope: !945)
!947 = !DILocation(line: 196, column: 17, scope: !945)
!948 = !DILocation(line: 196, column: 23, scope: !945)
!949 = !DILocation(line: 196, column: 7, scope: !942)
!950 = !DILocation(line: 197, column: 15, scope: !951)
!951 = distinct !DILexicalBlock(scope: !945, file: !1, line: 196, column: 35)
!952 = !DILocation(line: 197, column: 30, scope: !951)
!953 = !DILocation(line: 197, column: 36, scope: !951)
!954 = !DILocation(line: 197, column: 19, scope: !951)
!955 = !DILocation(line: 197, column: 4, scope: !951)
!956 = !DILocation(line: 198, column: 3, scope: !951)
!957 = !DILocation(line: 199, column: 12, scope: !958)
!958 = distinct !DILexicalBlock(scope: !945, file: !1, line: 199, column: 12)
!959 = !DILocation(line: 199, column: 17, scope: !958)
!960 = !DILocation(line: 199, column: 22, scope: !958)
!961 = !DILocation(line: 199, column: 28, scope: !958)
!962 = !DILocation(line: 199, column: 12, scope: !945)
!963 = !DILocation(line: 200, column: 23, scope: !964)
!964 = distinct !DILexicalBlock(scope: !958, file: !1, line: 199, column: 40)
!965 = !DILocation(line: 200, column: 38, scope: !964)
!966 = !DILocation(line: 200, column: 44, scope: !964)
!967 = !DILocation(line: 200, column: 48, scope: !964)
!968 = !DILocation(line: 200, column: 27, scope: !964)
!969 = !DILocation(line: 200, column: 63, scope: !964)
!970 = !DILocation(line: 200, column: 69, scope: !964)
!971 = !DILocation(line: 200, column: 73, scope: !964)
!972 = !DILocation(line: 200, column: 52, scope: !964)
!973 = !DILocation(line: 200, column: 77, scope: !964)
!974 = !DILocation(line: 200, column: 4, scope: !964)
!975 = !DILocation(line: 201, column: 3, scope: !964)
!976 = !DILocation(line: 207, column: 7, scope: !977)
!977 = distinct !DILexicalBlock(scope: !942, file: !1, line: 207, column: 7)
!978 = !DILocation(line: 207, column: 7, scope: !942)
!979 = !DILocation(line: 208, column: 28, scope: !980)
!980 = distinct !DILexicalBlock(scope: !977, file: !1, line: 207, column: 17)
!981 = !DILocation(line: 208, column: 35, scope: !980)
!982 = !DILocation(line: 208, column: 44, scope: !980)
!983 = !DILocation(line: 208, column: 19, scope: !980)
!984 = !DILocation(line: 208, column: 4, scope: !980)
!985 = !DILocation(line: 208, column: 11, scope: !980)
!986 = !DILocation(line: 208, column: 16, scope: !980)
!987 = !DILocation(line: 209, column: 3, scope: !980)
!988 = !DILocation(line: 210, column: 14, scope: !942)
!989 = !DILocation(line: 210, column: 21, scope: !942)
!990 = !DILocation(line: 210, column: 30, scope: !942)
!991 = !DILocation(line: 210, column: 3, scope: !942)
!992 = !DILocation(line: 213, column: 18, scope: !924)
!993 = !DILocation(line: 213, column: 2, scope: !924)
!994 = !DILocation(line: 213, column: 12, scope: !924)
!995 = !DILocation(line: 213, column: 16, scope: !924)
!996 = !DILocation(line: 214, column: 23, scope: !924)
!997 = !DILocation(line: 214, column: 2, scope: !924)
!998 = !DILocation(line: 214, column: 12, scope: !924)
!999 = !DILocation(line: 214, column: 21, scope: !924)
!1000 = !DILocation(line: 215, column: 19, scope: !924)
!1001 = !DILocation(line: 215, column: 26, scope: !924)
!1002 = !DILocation(line: 215, column: 2, scope: !924)
!1003 = !DILocation(line: 215, column: 12, scope: !924)
!1004 = !DILocation(line: 215, column: 17, scope: !924)
!1005 = !DILocation(line: 216, column: 21, scope: !924)
!1006 = !DILocation(line: 216, column: 2, scope: !924)
!1007 = !DILocation(line: 216, column: 9, scope: !924)
!1008 = !DILocation(line: 216, column: 19, scope: !924)
!1009 = !DILocation(line: 217, column: 1, scope: !924)
!1010 = distinct !DISubprogram(name: "state_step", scope: !1, file: !1, line: 277, type: !1011, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !308)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!337, !927, !475}
!1013 = !DILocalVariable(name: "pc", arg: 1, scope: !1010, file: !1, line: 277, type: !927)
!1014 = !DILocation(line: 277, column: 37, scope: !1010)
!1015 = !DILocalVariable(name: "state", arg: 2, scope: !1010, file: !1, line: 277, type: !475)
!1016 = !DILocation(line: 277, column: 56, scope: !1010)
!1017 = !DILocalVariable(name: "state_orig", scope: !1010, file: !1, line: 279, type: !476)
!1018 = !DILocation(line: 279, column: 16, scope: !1010)
!1019 = !DILocation(line: 279, column: 30, scope: !1010)
!1020 = !DILocation(line: 279, column: 29, scope: !1010)
!1021 = !DILocalVariable(name: "ele", scope: !1010, file: !1, line: 280, type: !140)
!1022 = !DILocation(line: 280, column: 10, scope: !1010)
!1023 = !DILocation(line: 280, column: 16, scope: !1010)
!1024 = !DILocation(line: 280, column: 23, scope: !1010)
!1025 = !DILocation(line: 280, column: 34, scope: !1010)
!1026 = !DILocalVariable(name: "ele_from", scope: !1010, file: !1, line: 281, type: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1029 = !DILocation(line: 281, column: 14, scope: !1010)
!1030 = !DILocation(line: 281, column: 25, scope: !1010)
!1031 = !DILocation(line: 281, column: 32, scope: !1010)
!1032 = !DILocation(line: 281, column: 43, scope: !1010)
!1033 = !DILocation(line: 283, column: 6, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1010, file: !1, line: 283, column: 6)
!1035 = !DILocation(line: 283, column: 11, scope: !1034)
!1036 = !DILocation(line: 283, column: 16, scope: !1034)
!1037 = !DILocation(line: 283, column: 22, scope: !1034)
!1038 = !DILocation(line: 283, column: 6, scope: !1010)
!1039 = !DILocalVariable(name: "e", scope: !1040, file: !1, line: 284, type: !145)
!1040 = distinct !DILexicalBlock(scope: !1034, file: !1, line: 283, column: 34)
!1041 = !DILocation(line: 284, column: 11, scope: !1040)
!1042 = !DILocation(line: 284, column: 25, scope: !1040)
!1043 = !DILocation(line: 284, column: 15, scope: !1040)
!1044 = !DILocalVariable(name: "liter", scope: !1040, file: !1, line: 286, type: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !55, line: 186, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !55, line: 164, size: 512, elements: !1047)
!1047 = !{!1048, !1125, !1126, !1127, !1128}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1046, file: !55, line: 179, baseType: !1049, size: 320)
!1049 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1046, file: !55, line: 166, size: 320, elements: !1050)
!1050 = !{!1051, !1063, !1069, !1077, !1085, !1091, !1097, !1103, !1107, !1113, !1119}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !1049, file: !55, line: 167, baseType: !1052, size: 192)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !55, line: 113, size: 192, elements: !1053)
!1053 = !{!1054}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !1052, file: !55, line: 114, baseType: !1055, size: 192)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !50, line: 80, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !50, line: 76, size: 192, elements: !1057)
!1057 = !{!1058, !1059, !1062}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1056, file: !50, line: 77, baseType: !333, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !1056, file: !50, line: 78, baseType: !1060, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !50, line: 45, flags: DIFlagFwdDecl)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !1056, file: !50, line: 79, baseType: !5, size: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !1049, file: !55, line: 169, baseType: !1064, size: 192)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !55, line: 116, size: 192, elements: !1065)
!1065 = !{!1066, !1067, !1068}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1064, file: !55, line: 117, baseType: !73, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !1064, file: !55, line: 118, baseType: !145, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !1064, file: !55, line: 118, baseType: !145, size: 64, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !1049, file: !55, line: 170, baseType: !1070, size: 320)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !55, line: 120, size: 320, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1070, file: !55, line: 121, baseType: !73, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1070, file: !55, line: 122, baseType: !124, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1070, file: !55, line: 122, baseType: !124, size: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !1070, file: !55, line: 123, baseType: !145, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !1070, file: !55, line: 123, baseType: !145, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !1049, file: !55, line: 171, baseType: !1078, size: 320)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !55, line: 125, size: 320, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1078, file: !55, line: 126, baseType: !73, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1078, file: !55, line: 127, baseType: !124, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1078, file: !55, line: 127, baseType: !124, size: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !1078, file: !55, line: 128, baseType: !145, size: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !1078, file: !55, line: 128, baseType: !145, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !1049, file: !55, line: 172, baseType: !1086, size: 192)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !55, line: 130, size: 192, elements: !1087)
!1087 = !{!1088, !1089, !1090}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1086, file: !55, line: 131, baseType: !145, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1086, file: !55, line: 132, baseType: !124, size: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1086, file: !55, line: 132, baseType: !124, size: 64, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !1049, file: !55, line: 173, baseType: !1092, size: 192)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !55, line: 134, size: 192, elements: !1093)
!1093 = !{!1094, !1095, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !1092, file: !55, line: 135, baseType: !124, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1092, file: !55, line: 136, baseType: !124, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1092, file: !55, line: 136, baseType: !124, size: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !1049, file: !55, line: 174, baseType: !1098, size: 192)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !55, line: 138, size: 192, elements: !1099)
!1099 = !{!1100, !1101, !1102}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1098, file: !55, line: 139, baseType: !145, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1098, file: !55, line: 140, baseType: !124, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1098, file: !55, line: 140, baseType: !124, size: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !1049, file: !55, line: 175, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !55, line: 142, size: 64, elements: !1105)
!1105 = !{!1106}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1104, file: !55, line: 143, baseType: !145, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !1049, file: !55, line: 176, baseType: !1108, size: 192)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !55, line: 145, size: 192, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1108, file: !55, line: 146, baseType: !147, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1108, file: !55, line: 147, baseType: !124, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1108, file: !55, line: 147, baseType: !124, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !1049, file: !55, line: 177, baseType: !1114, size: 192)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !55, line: 149, size: 192, elements: !1115)
!1115 = !{!1116, !1117, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1114, file: !55, line: 150, baseType: !147, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1114, file: !55, line: 151, baseType: !124, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1114, file: !55, line: 151, baseType: !124, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !1049, file: !55, line: 178, baseType: !1120, size: 192)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !55, line: 153, size: 192, elements: !1121)
!1121 = !{!1122, !1123, !1124}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1120, file: !55, line: 154, baseType: !147, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1120, file: !55, line: 155, baseType: !124, size: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1120, file: !55, line: 155, baseType: !124, size: 64, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !1046, file: !55, line: 181, baseType: !150, size: 64, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1046, file: !55, line: 182, baseType: !154, size: 64, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1046, file: !55, line: 184, baseType: !84, size: 32, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !1046, file: !55, line: 185, baseType: !86, size: 8, offset: 480)
!1129 = !DILocation(line: 286, column: 10, scope: !1040)
!1130 = !DILocalVariable(name: "l_start", scope: !1040, file: !1, line: 287, type: !124)
!1131 = !DILocation(line: 287, column: 11, scope: !1040)
!1132 = !DILocation(line: 289, column: 3, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 289, column: 3)
!1134 = !DILocation(line: 289, column: 3, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1133, file: !1, line: 289, column: 3)
!1136 = !DILocation(line: 290, column: 9, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !1, line: 290, column: 8)
!1138 = distinct !DILexicalBlock(scope: !1135, file: !1, line: 289, column: 55)
!1139 = !DILocation(line: 290, column: 18, scope: !1137)
!1140 = !DILocation(line: 290, column: 23, scope: !1137)
!1141 = !DILocation(line: 290, column: 20, scope: !1137)
!1142 = !DILocation(line: 290, column: 33, scope: !1137)
!1143 = !DILocation(line: 291, column: 8, scope: !1137)
!1144 = !DILocation(line: 290, column: 8, scope: !1138)
!1145 = !DILocation(line: 294, column: 25, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !1, line: 294, column: 9)
!1147 = distinct !DILexicalBlock(scope: !1137, file: !1, line: 292, column: 4)
!1148 = !DILocation(line: 294, column: 34, scope: !1146)
!1149 = !DILocation(line: 294, column: 37, scope: !1146)
!1150 = !DILocation(line: 294, column: 41, scope: !1146)
!1151 = !DILocation(line: 294, column: 9, scope: !1146)
!1152 = !DILocation(line: 294, column: 9, scope: !1147)
!1153 = !DILocation(line: 295, column: 21, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !1, line: 295, column: 10)
!1155 = distinct !DILexicalBlock(scope: !1146, file: !1, line: 294, column: 47)
!1156 = !DILocation(line: 295, column: 34, scope: !1154)
!1157 = !DILocation(line: 295, column: 41, scope: !1154)
!1158 = !DILocation(line: 295, column: 31, scope: !1154)
!1159 = !DILocation(line: 295, column: 10, scope: !1155)
!1160 = !DILocation(line: 296, column: 30, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1154, file: !1, line: 295, column: 52)
!1162 = !DILocation(line: 296, column: 34, scope: !1161)
!1163 = !DILocation(line: 296, column: 15, scope: !1161)
!1164 = !DILocation(line: 296, column: 13, scope: !1161)
!1165 = !DILocation(line: 297, column: 6, scope: !1161)
!1166 = !DILocation(line: 299, column: 21, scope: !1155)
!1167 = !DILocation(line: 299, column: 25, scope: !1155)
!1168 = !DILocation(line: 299, column: 42, scope: !1155)
!1169 = !DILocation(line: 299, column: 46, scope: !1155)
!1170 = !DILocation(line: 299, column: 32, scope: !1155)
!1171 = !DILocation(line: 299, column: 61, scope: !1155)
!1172 = !DILocation(line: 299, column: 70, scope: !1155)
!1173 = !DILocation(line: 299, column: 51, scope: !1155)
!1174 = !DILocation(line: 299, column: 6, scope: !1155)
!1175 = !DILocation(line: 300, column: 5, scope: !1155)
!1176 = !DILocation(line: 302, column: 37, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1146, file: !1, line: 301, column: 10)
!1178 = !DILocation(line: 302, column: 41, scope: !1177)
!1179 = !DILocation(line: 303, column: 37, scope: !1177)
!1180 = !DILocation(line: 303, column: 46, scope: !1177)
!1181 = !DILocation(line: 303, column: 52, scope: !1177)
!1182 = !DILocation(line: 302, column: 14, scope: !1177)
!1183 = !DILocation(line: 302, column: 12, scope: !1177)
!1184 = !DILocation(line: 304, column: 37, scope: !1177)
!1185 = !DILocation(line: 304, column: 41, scope: !1177)
!1186 = !DILocation(line: 305, column: 37, scope: !1177)
!1187 = !DILocation(line: 305, column: 46, scope: !1177)
!1188 = !DILocation(line: 305, column: 52, scope: !1177)
!1189 = !DILocation(line: 305, column: 58, scope: !1177)
!1190 = !DILocation(line: 304, column: 14, scope: !1177)
!1191 = !DILocation(line: 304, column: 12, scope: !1177)
!1192 = !DILocation(line: 307, column: 4, scope: !1147)
