; ModuleID = 'blender/source/blender/modifiers/intern/MOD_none.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_none.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ModifierTypeInfo = type { [32 x i8], [32 x i8], i32, i32, i32, void (%struct.ModifierData*, %struct.ModifierData*)*, void (%struct.ModifierData*, %struct.Object*, %struct.DerivedMesh*, [3 x float]*, i32, i32)*, void (%struct.ModifierData*, %struct.Object*, %struct.DerivedMesh*, [3 x float]*, [3 x [3 x float]]*, i32)*, void (%struct.ModifierData*, %struct.Object*, %struct.BMEditMesh*, %struct.DerivedMesh*, [3 x float]*, i32)*, void (%struct.ModifierData*, %struct.Object*, %struct.BMEditMesh*, %struct.DerivedMesh*, [3 x float]*, [3 x [3 x float]]*, i32)*, %struct.DerivedMesh* (%struct.ModifierData*, %struct.Object*, %struct.DerivedMesh*, i32)*, %struct.DerivedMesh* (%struct.ModifierData*, %struct.Object*, %struct.BMEditMesh*, %struct.DerivedMesh*, i32)*, void (%struct.ModifierData*)*, i64 (%struct.Object*, %struct.ModifierData*)*, void (%struct.ModifierData*)*, i8 (%struct.ModifierData*, i32)*, void (%struct.ModifierData*, %struct.DagForest*, %struct.Scene*, %struct.Object*, %struct.DagNode*)*, i8 (%struct.ModifierData*)*, i8 (%struct.ModifierData*)*, void (%struct.ModifierData*, %struct.Object*, void (i8*, %struct.Object*, %struct.Object**)*, i8*)*, void (%struct.ModifierData*, %struct.Object*, void (i8*, %struct.Object*, %struct.ID**)*, i8*)*, void (%struct.ModifierData*, %struct.Object*, void (i8*, %struct.Object*, %struct.ModifierData*, i8*)*, i8*)* }
%struct.ModifierData = type { %struct.ModifierData*, %struct.ModifierData*, i32, i32, i32, i32, [64 x i8], %struct.Scene*, i8* }
%struct.Scene = type opaque
%struct.Object = type opaque
%struct.DerivedMesh = type opaque
%struct.BMEditMesh = type opaque
%struct.DagForest = type opaque
%struct.DagNode = type opaque
%struct.ID = type opaque

@modifierType_None = dso_local global %struct.ModifierTypeInfo { [32 x i8] c"None\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", [32 x i8] c"ModifierData\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", i32 112, i32 0, i32 3, void (%struct.ModifierData*, %struct.ModifierData*)* null, void (%struct.ModifierData*, %struct.Object*, %struct.DerivedMesh*, [3 x float]*, i32, i32)* null, void (%struct.ModifierData*, %struct.Object*, %struct.DerivedMesh*, [3 x float]*, [3 x [3 x float]]*, i32)* null, void (%struct.ModifierData*, %struct.Object*, %struct.BMEditMesh*, %struct.DerivedMesh*, [3 x float]*, i32)* null, void (%struct.ModifierData*, %struct.Object*, %struct.BMEditMesh*, %struct.DerivedMesh*, [3 x float]*, [3 x [3 x float]]*, i32)* null, %struct.DerivedMesh* (%struct.ModifierData*, %struct.Object*, %struct.DerivedMesh*, i32)* null, %struct.DerivedMesh* (%struct.ModifierData*, %struct.Object*, %struct.BMEditMesh*, %struct.DerivedMesh*, i32)* null, void (%struct.ModifierData*)* null, i64 (%struct.Object*, %struct.ModifierData*)* null, void (%struct.ModifierData*)* null, i8 (%struct.ModifierData*, i32)* @isDisabled, void (%struct.ModifierData*, %struct.DagForest*, %struct.Scene*, %struct.Object*, %struct.DagNode*)* null, i8 (%struct.ModifierData*)* null, i8 (%struct.ModifierData*)* null, void (%struct.ModifierData*, %struct.Object*, void (i8*, %struct.Object*, %struct.Object**)*, i8*)* null, void (%struct.ModifierData*, %struct.Object*, void (i8*, %struct.Object*, %struct.ID**)*, i8*)* null, void (%struct.ModifierData*, %struct.Object*, void (i8*, %struct.Object*, %struct.ModifierData*, i8*)*, i8*)* null }, align 8, !dbg !0

; Function Attrs: noinline nounwind uwtable
define internal zeroext i8 @isDisabled(%struct.ModifierData* %UNUSED_md, i32 %UNUSED_userRenderParams) #0 !dbg !180 {
entry:
  %UNUSED_md.addr = alloca %struct.ModifierData*, align 8
  %UNUSED_userRenderParams.addr = alloca i32, align 4
  store %struct.ModifierData* %UNUSED_md, %struct.ModifierData** %UNUSED_md.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.ModifierData** %UNUSED_md.addr, metadata !186, metadata !DIExpression()), !dbg !187
  store i32 %UNUSED_userRenderParams, i32* %UNUSED_userRenderParams.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %UNUSED_userRenderParams.addr, metadata !188, metadata !DIExpression()), !dbg !189
  ret i8 1, !dbg !190
}

; Function Attrs: nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

attributes #0 = { noinline nounwind uwtable "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "frame-pointer"="all" "less-precise-fpmad"="false" "min-legal-vector-width"="0" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { nounwind readnone speculatable willreturn }

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!176, !177, !178}
!llvm.ident = !{!179}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "modifierType_None", scope: !2, file: !3, line: 51, type: !34, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !33, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/modifiers/intern/MOD_none.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !15, !27}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 47, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_modifier.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "eModifierTypeType_None", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "eModifierTypeType_OnlyDeform", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "eModifierTypeType_Constructive", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "eModifierTypeType_Nonconstructive", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "eModifierTypeType_DeformOrConstruct", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "eModifierTypeType_NonGeometrical", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 73, baseType: !7, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!17 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsMesh", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsCVs", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "eModifierTypeFlag_SupportsMapping", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "eModifierTypeFlag_SupportsEditmode", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "eModifierTypeFlag_EnableInEditmode", value: 16, isUnsigned: true)
!22 = !DIEnumerator(name: "eModifierTypeFlag_RequiresOriginalData", value: 32, isUnsigned: true)
!23 = !DIEnumerator(name: "eModifierTypeFlag_UsesPointCache", value: 64, isUnsigned: true)
!24 = !DIEnumerator(name: "eModifierTypeFlag_Single", value: 128, isUnsigned: true)
!25 = !DIEnumerator(name: "eModifierTypeFlag_NoUserAdd", value: 256, isUnsigned: true)
!26 = !DIEnumerator(name: "eModifierTypeFlag_UsesPreview", value: 512, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !6, line: 110, baseType: !7, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32}
!29 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!33 = !{!0}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !36)
!36 = !{!37, !42, !43, !45, !47, !49, !72, !86, !93, !99, !103, !107, !111, !115, !126, !127, !132, !140, !144, !145, !155, !166}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !35, file: !6, line: 123, baseType: !38, size: 256)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !40)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!41}
!41 = !DISubrange(count: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !35, file: !6, line: 128, baseType: !38, size: 256, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !35, file: !6, line: 131, baseType: !44, size: 32, offset: 512)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !35, file: !6, line: 133, baseType: !46, size: 32, offset: 544)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !35, file: !6, line: 134, baseType: !48, size: 32, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !35, file: !6, line: 142, baseType: !50, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53, !53}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !55, line: 99, size: 896, elements: !56)
!55 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !67, !70}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !55, line: 100, baseType: !53, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !54, file: !55, line: 100, baseType: !53, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !55, line: 102, baseType: !44, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !54, file: !55, line: 102, baseType: !44, size: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !54, file: !55, line: 103, baseType: !44, size: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !54, file: !55, line: 103, baseType: !44, size: 32, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !55, line: 104, baseType: !64, size: 512, offset: 256)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 512, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !54, file: !55, line: 107, baseType: !68, size: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !55, line: 107, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !54, file: !55, line: 109, baseType: !71, size: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !35, file: !6, line: 151, baseType: !73, size: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !53, !76, !78, !80, !44, !85}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !55, line: 124, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !55, line: 592, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 96, elements: !83)
!82 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!83 = !{!84}
!84 = !DISubrange(count: 3)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierApplyFlag", file: !6, line: 118, baseType: !27)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "deformMatrices", scope: !35, file: !6, line: 157, baseType: !87, size: 64, offset: 768)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !53, !76, !78, !80, !90, !44}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 288, elements: !92)
!92 = !{!84, !84}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "deformVertsEM", scope: !35, file: !6, line: 163, baseType: !94, size: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !53, !76, !97, !78, !80, !44}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !6, line: 45, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "deformMatricesEM", scope: !35, file: !6, line: 168, baseType: !100, size: 64, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !53, !76, !97, !78, !80, !90, !44}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "applyModifier", scope: !35, file: !6, line: 193, baseType: !104, size: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!78, !53, !76, !78, !85}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "applyModifierEM", scope: !35, file: !6, line: 204, baseType: !108, size: 64, offset: 1024)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!78, !53, !76, !97, !78, !85}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "initData", scope: !35, file: !6, line: 217, baseType: !112, size: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !53}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "requiredDataMask", scope: !35, file: !6, line: 235, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !76, !53}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataMask", file: !120, line: 48, baseType: !121)
!120 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !122, line: 27, baseType: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !124, line: 45, baseType: !125)
!124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!125 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "freeData", scope: !35, file: !6, line: 242, baseType: !112, size: 64, offset: 1216)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "isDisabled", scope: !35, file: !6, line: 252, baseType: !128, size: 64, offset: 1280)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !53, !44}
!131 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "updateDepgraph", scope: !35, file: !6, line: 259, baseType: !133, size: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !53, !136, !68, !76, !138}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "DagForest", file: !6, line: 37, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "DagNode", file: !6, line: 38, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dependsOnTime", scope: !35, file: !6, line: 267, baseType: !141, size: 64, offset: 1408)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!131, !53}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dependsOnNormals", scope: !35, file: !6, line: 277, baseType: !141, size: 64, offset: 1472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "foreachObjectLink", scope: !35, file: !6, line: 286, baseType: !146, size: 64, offset: 1536)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !53, !76, !149, !153}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectWalkFunc", file: !6, line: 106, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !153, !76, !154}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "foreachIDLink", scope: !35, file: !6, line: 297, baseType: !156, size: 64, offset: 1600)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !53, !76, !159, !153}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDWalkFunc", file: !6, line: 107, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !153, !76, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !120, line: 45, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "foreachTexLink", scope: !35, file: !6, line: 307, baseType: !167, size: 64, offset: 1664)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !53, !76, !170, !153}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "TexWalkFunc", file: !6, line: 108, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !153, !76, !53, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!176 = !{i32 7, !"Dwarf Version", i32 4}
!177 = !{i32 2, !"Debug Info Version", i32 3}
!178 = !{i32 1, !"wchar_size", i32 4}
!179 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!180 = distinct !DISubprogram(name: "isDisabled", scope: !3, file: !3, line: 46, type: !181, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !185)
!181 = !DISubroutineType(types: !182)
!182 = !{!131, !183, !44}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !55, line: 110, baseType: !54)
!185 = !{}
!186 = !DILocalVariable(name: "UNUSED_md", arg: 1, scope: !180, file: !3, line: 46, type: !183)
!187 = !DILocation(line: 46, column: 38, scope: !180)
!188 = !DILocalVariable(name: "UNUSED_userRenderParams", arg: 2, scope: !180, file: !3, line: 46, type: !44)
!189 = !DILocation(line: 46, column: 54, scope: !180)
!190 = !DILocation(line: 48, column: 2, scope: !180)
