; ModuleID = 'blender/source/blender/windowmanager/intern/wm_init_exit.c'
source_filename = "blender/source/blender/windowmanager/intern/wm_init_exit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!368 = distinct !DILexicalBlock(scope: !349, file: !3, line: 142, column: 6)
!369 = !DILocation(line: 142, column: 7, scope: !368)
!370 = !DILocation(line: 142, column: 6, scope: !349)
!371 = !DILocation(line: 143, column: 17, scope: !372)
!372 = distinct !DILexicalBlock(scope: !368, file: !3, line: 142, column: 21)
!373 = !DILocation(line: 143, column: 3, scope: !372)
!374 = !DILocation(line: 144, column: 3, scope: !372)
!375 = !DILocation(line: 145, column: 2, scope: !372)
!376 = !DILocation(line: 146, column: 2, scope: !349)
!377 = !DILocation(line: 148, column: 2, scope: !349)
!378 = !DILocation(line: 150, column: 2, scope: !349)
!379 = !DILocation(line: 151, column: 2, scope: !349)
!380 = !DILocation(line: 152, column: 2, scope: !349)
!381 = !DILocation(line: 154, column: 2, scope: !349)
!382 = !DILocation(line: 155, column: 2, scope: !349)
!383 = !DILocation(line: 156, column: 2, scope: !349)
!384 = !DILocation(line: 157, column: 2, scope: !349)
!385 = !DILocation(line: 159, column: 2, scope: !349)
!386 = !DILocation(line: 161, column: 2, scope: !349)
!387 = !DILocation(line: 162, column: 2, scope: !349)
!388 = !DILocation(line: 169, column: 14, scope: !349)
!389 = !DILocation(line: 172, column: 19, scope: !349)
!390 = !DILocation(line: 172, column: 30, scope: !349)
!391 = !DILocation(line: 172, column: 2, scope: !349)
!392 = !DILocation(line: 190, column: 8, scope: !349)
!393 = !DILocation(line: 191, column: 8, scope: !349)
!394 = !DILocation(line: 194, column: 2, scope: !349)
!395 = !DILocation(line: 196, column: 9, scope: !396)
!396 = distinct !DILexicalBlock(scope: !349, file: !3, line: 196, column: 6)
!397 = !DILocation(line: 196, column: 7, scope: !396)
!398 = !DILocation(line: 196, column: 20, scope: !396)
!399 = !DILocation(line: 196, column: 24, scope: !396)
!400 = !DILocation(line: 196, column: 6, scope: !349)
!401 = !DILocation(line: 197, column: 3, scope: !396)
!402 = !DILocation(line: 199, column: 18, scope: !349)
!403 = !DILocation(line: 199, column: 2, scope: !349)
!404 = !DILocation(line: 201, column: 9, scope: !405)
!405 = distinct !DILexicalBlock(scope: !349, file: !3, line: 201, column: 6)
!406 = !DILocation(line: 201, column: 7, scope: !405)
!407 = !DILocation(line: 201, column: 6, scope: !349)
!408 = !DILocation(line: 202, column: 3, scope: !409)
!409 = distinct !DILexicalBlock(scope: !405, file: !3, line: 201, column: 21)
!410 = !DILocation(line: 204, column: 22, scope: !409)
!411 = !DILocation(line: 204, column: 20, scope: !409)
!412 = !DILocation(line: 204, column: 32, scope: !409)
!413 = !DILocation(line: 204, column: 18, scope: !409)
!414 = !DILocation(line: 204, column: 3, scope: !409)
!415 = !DILocation(line: 205, column: 25, scope: !409)
!416 = !DILocation(line: 205, column: 23, scope: !409)
!417 = !DILocation(line: 205, column: 3, scope: !409)
!418 = !DILocation(line: 206, column: 28, scope: !409)
!419 = !DILocation(line: 206, column: 26, scope: !409)
!420 = !DILocation(line: 206, column: 3, scope: !409)
!421 = !DILocation(line: 208, column: 3, scope: !409)
!422 = !DILocation(line: 209, column: 2, scope: !409)
!423 = !DILocation(line: 211, column: 2, scope: !349)
!424 = !DILocation(line: 212, column: 2, scope: !349)
!425 = !DILocation(line: 216, column: 2, scope: !349)
!426 = !DILocation(line: 218, column: 2, scope: !349)
!427 = !DILocation(line: 226, column: 23, scope: !349)
!428 = !DILocation(line: 226, column: 29, scope: !349)
!429 = !DILocation(line: 226, column: 21, scope: !349)
!430 = !DILocation(line: 226, column: 2, scope: !349)
!431 = !DILocation(line: 236, column: 8, scope: !432)
!432 = distinct !DILexicalBlock(scope: !349, file: !3, line: 236, column: 6)
!433 = !DILocation(line: 236, column: 16, scope: !432)
!434 = !DILocation(line: 236, column: 6, scope: !349)
!435 = !DILocation(line: 239, column: 2, scope: !436)
!436 = distinct !DILexicalBlock(scope: !432, file: !3, line: 236, column: 37)
!437 = !DILocation(line: 246, column: 35, scope: !438)
!438 = distinct !DILexicalBlock(scope: !432, file: !3, line: 240, column: 7)
!439 = !DILocation(line: 246, column: 21, scope: !438)
!440 = !DILocation(line: 246, column: 3, scope: !438)
!441 = !DILocation(line: 247, column: 35, scope: !438)
!442 = !DILocation(line: 247, column: 21, scope: !438)
!443 = !DILocation(line: 247, column: 3, scope: !438)
!444 = !DILocation(line: 249, column: 1, scope: !349)
!445 = distinct !DISubprogram(name: "wm_init_reports", scope: !3, file: !3, line: 121, type: !446, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !360)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !352}
!448 = !DILocalVariable(name: "C", arg: 1, scope: !445, file: !3, line: 121, type: !352)
!449 = !DILocation(line: 121, column: 39, scope: !445)
!450 = !DILocalVariable(name: "reports", scope: !445, file: !3, line: 123, type: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportList", file: !125, line: 112, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !125, line: 106, size: 320, elements: !454)
!454 = !{!455, !463, !464, !465, !466, !467}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !453, file: !125, line: 107, baseType: !456, size: 128)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !457, line: 71, baseType: !458)
!457 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !457, line: 69, size: 128, elements: !459)
!459 = !{!460, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !458, file: !457, line: 70, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !458, file: !457, line: 70, baseType: !461, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !453, file: !125, line: 108, baseType: !38, size: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !453, file: !125, line: 109, baseType: !38, size: 32, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !125, line: 110, baseType: !38, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !453, file: !125, line: 110, baseType: !38, size: 32, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !453, file: !125, line: 111, baseType: !468, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !69, line: 490, size: 768, elements: !470)
!470 = !{!471, !472, !473, !3148, !3149, !3150, !3151, !3152, !3153, !3154, !3155, !3156}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !69, line: 491, baseType: !468, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !469, file: !69, line: 491, baseType: !468, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !469, file: !69, line: 493, baseType: !474, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !125, line: 169, size: 2048, elements: !476)
!476 = !{!477, !478, !479, !480, !3066, !3067, !3068, !3069, !3070, !3071, !3072, !3073, !3074, !3075, !3076, !3077, !3078, !3079, !3080, !3081, !3082, !3083, !3123, !3126, !3140, !3141, !3142, !3143, !3144, !3145, !3146, !3147}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !475, file: !125, line: 170, baseType: !474, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !475, file: !125, line: 170, baseType: !474, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !475, file: !125, line: 172, baseType: !461, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !475, file: !125, line: 174, baseType: !481, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !109, line: 49, size: 1984, elements: !483)
!483 = !{!484, !547, !548, !549, !550, !551, !3049, !3050, !3051, !3052, !3053, !3054, !3055, !3056, !3057, !3058, !3059, !3060, !3061, !3062, !3063, !3064, !3065}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !482, file: !109, line: 50, baseType: !485, size: 960)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !486, line: 130, baseType: !487)
!486 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !486, line: 117, size: 960, elements: !488)
!488 = !{!489, !490, !491, !493, !512, !516, !518, !519, !520, !521}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !486, line: 118, baseType: !461, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !487, file: !486, line: 118, baseType: !461, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !487, file: !486, line: 119, baseType: !492, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !487, file: !486, line: 120, baseType: !494, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !486, line: 136, size: 17600, elements: !496)
!496 = !{!497, !498, !500, !503, !507, !508, !509}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !495, file: !486, line: 137, baseType: !485, size: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !495, file: !486, line: 138, baseType: !499, size: 64, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !495, file: !486, line: 139, baseType: !501, size: 64, offset: 1024)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !486, line: 43, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !486, line: 140, baseType: !504, size: 8192, offset: 1088)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 8192, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 1024)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !495, file: !486, line: 141, baseType: !504, size: 8192, offset: 9280)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !495, file: !486, line: 148, baseType: !494, size: 64, offset: 17472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !495, file: !486, line: 150, baseType: !510, size: 64, offset: 17536)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !486, line: 45, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !487, file: !486, line: 121, baseType: !513, size: 528, offset: 256)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 528, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 66)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !487, file: !486, line: 126, baseType: !517, size: 16, offset: 784)
!517 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !487, file: !486, line: 127, baseType: !38, size: 32, offset: 800)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !487, file: !486, line: 128, baseType: !38, size: 32, offset: 832)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !487, file: !486, line: 128, baseType: !38, size: 32, offset: 864)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !487, file: !486, line: 129, baseType: !522, size: 64, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !486, line: 75, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !486, line: 62, size: 1024, elements: !525)
!525 = !{!526, !528, !529, !530, !531, !532, !536, !537, !545, !546}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !524, file: !486, line: 63, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !524, file: !486, line: 63, baseType: !527, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !524, file: !486, line: 64, baseType: !359, size: 8, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !524, file: !486, line: 64, baseType: !359, size: 8, offset: 136)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !486, line: 65, baseType: !517, size: 16, offset: 144)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !524, file: !486, line: 66, baseType: !533, size: 512, offset: 160)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 512, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !524, file: !486, line: 67, baseType: !38, size: 32, offset: 672)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !524, file: !486, line: 69, baseType: !538, size: 256, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !486, line: 60, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !486, line: 48, size: 256, elements: !540)
!540 = !{!541, !542, !543, !544}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !539, file: !486, line: 49, baseType: !461, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !539, file: !486, line: 58, baseType: !456, size: 128, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !539, file: !486, line: 59, baseType: !38, size: 32, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !539, file: !486, line: 59, baseType: !38, size: 32, offset: 224)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !524, file: !486, line: 70, baseType: !38, size: 32, offset: 960)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !524, file: !486, line: 74, baseType: !38, size: 32, offset: 992)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !482, file: !109, line: 52, baseType: !456, size: 128, offset: 960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !482, file: !109, line: 53, baseType: !456, size: 128, offset: 1088)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !482, file: !109, line: 54, baseType: !456, size: 128, offset: 1216)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !482, file: !109, line: 55, baseType: !456, size: 128, offset: 1344)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !482, file: !109, line: 57, baseType: !552, size: 64, offset: 1472)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !554, line: 1216, size: 39680, elements: !555)
!554 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!555 = !{!556, !557, !560, !563, !2085, !2086, !2087, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2457, !2678, !2681, !2920, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2942, !2943, !2944, !2945, !2946, !2954, !3020, !3027, !3028, !3035, !3036, !3042, !3043, !3044, !3045, !3046}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !553, file: !554, line: 1217, baseType: !485, size: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !553, file: !554, line: 1218, baseType: !558, size: 64, offset: 960)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !554, line: 58, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !553, file: !554, line: 1220, baseType: !561, size: 64, offset: 1024)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !554, line: 50, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !553, file: !554, line: 1221, baseType: !564, size: 64, offset: 1088)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !566, line: 52, size: 4224, elements: !567)
!566 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!567 = !{!568, !569, !570, !571, !572, !573, !574, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !638, !639, !643, !2080, !2081, !2082, !2083, !2084}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !565, file: !566, line: 53, baseType: !485, size: 960)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !565, file: !566, line: 54, baseType: !558, size: 64, offset: 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !565, file: !566, line: 56, baseType: !517, size: 16, offset: 1024)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !565, file: !566, line: 56, baseType: !517, size: 16, offset: 1040)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !565, file: !566, line: 57, baseType: !517, size: 16, offset: 1056)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !565, file: !566, line: 57, baseType: !517, size: 16, offset: 1072)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !565, file: !566, line: 59, baseType: !575, size: 32, offset: 1088)
!575 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !565, file: !566, line: 59, baseType: !575, size: 32, offset: 1120)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !565, file: !566, line: 59, baseType: !575, size: 32, offset: 1152)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !565, file: !566, line: 60, baseType: !575, size: 32, offset: 1184)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !565, file: !566, line: 60, baseType: !575, size: 32, offset: 1216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !565, file: !566, line: 60, baseType: !575, size: 32, offset: 1248)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !565, file: !566, line: 61, baseType: !575, size: 32, offset: 1280)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !565, file: !566, line: 61, baseType: !575, size: 32, offset: 1312)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !565, file: !566, line: 61, baseType: !575, size: 32, offset: 1344)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !565, file: !566, line: 68, baseType: !575, size: 32, offset: 1376)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !565, file: !566, line: 68, baseType: !575, size: 32, offset: 1408)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !565, file: !566, line: 68, baseType: !575, size: 32, offset: 1440)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !565, file: !566, line: 69, baseType: !575, size: 32, offset: 1472)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !565, file: !566, line: 69, baseType: !575, size: 32, offset: 1504)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !565, file: !566, line: 74, baseType: !575, size: 32, offset: 1536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !565, file: !566, line: 79, baseType: !575, size: 32, offset: 1568)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !565, file: !566, line: 81, baseType: !517, size: 16, offset: 1600)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !565, file: !566, line: 91, baseType: !517, size: 16, offset: 1616)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !565, file: !566, line: 92, baseType: !517, size: 16, offset: 1632)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !565, file: !566, line: 93, baseType: !517, size: 16, offset: 1648)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !565, file: !566, line: 94, baseType: !517, size: 16, offset: 1664)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !565, file: !566, line: 94, baseType: !517, size: 16, offset: 1680)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !565, file: !566, line: 94, baseType: !517, size: 16, offset: 1696)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !565, file: !566, line: 94, baseType: !517, size: 16, offset: 1712)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !565, file: !566, line: 96, baseType: !575, size: 32, offset: 1728)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !565, file: !566, line: 96, baseType: !575, size: 32, offset: 1760)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !565, file: !566, line: 96, baseType: !575, size: 32, offset: 1792)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !565, file: !566, line: 96, baseType: !575, size: 32, offset: 1824)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !565, file: !566, line: 98, baseType: !575, size: 32, offset: 1856)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !565, file: !566, line: 98, baseType: !575, size: 32, offset: 1888)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !565, file: !566, line: 98, baseType: !575, size: 32, offset: 1920)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !565, file: !566, line: 98, baseType: !575, size: 32, offset: 1952)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !565, file: !566, line: 99, baseType: !575, size: 32, offset: 1984)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !565, file: !566, line: 99, baseType: !575, size: 32, offset: 2016)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !565, file: !566, line: 100, baseType: !575, size: 32, offset: 2048)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !565, file: !566, line: 100, baseType: !575, size: 32, offset: 2080)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !565, file: !566, line: 103, baseType: !517, size: 16, offset: 2112)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !565, file: !566, line: 103, baseType: !517, size: 16, offset: 2128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !565, file: !566, line: 103, baseType: !517, size: 16, offset: 2144)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !565, file: !566, line: 103, baseType: !517, size: 16, offset: 2160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !565, file: !566, line: 106, baseType: !575, size: 32, offset: 2176)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !565, file: !566, line: 106, baseType: !575, size: 32, offset: 2208)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !565, file: !566, line: 106, baseType: !575, size: 32, offset: 2240)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !565, file: !566, line: 106, baseType: !575, size: 32, offset: 2272)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !565, file: !566, line: 107, baseType: !517, size: 16, offset: 2304)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !565, file: !566, line: 107, baseType: !517, size: 16, offset: 2320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !565, file: !566, line: 107, baseType: !517, size: 16, offset: 2336)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !565, file: !566, line: 107, baseType: !517, size: 16, offset: 2352)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !565, file: !566, line: 108, baseType: !575, size: 32, offset: 2368)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !565, file: !566, line: 108, baseType: !575, size: 32, offset: 2400)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !565, file: !566, line: 109, baseType: !575, size: 32, offset: 2432)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !565, file: !566, line: 109, baseType: !575, size: 32, offset: 2464)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !565, file: !566, line: 110, baseType: !575, size: 32, offset: 2496)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !565, file: !566, line: 110, baseType: !575, size: 32, offset: 2528)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !565, file: !566, line: 110, baseType: !575, size: 32, offset: 2560)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !565, file: !566, line: 111, baseType: !517, size: 16, offset: 2592)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !565, file: !566, line: 111, baseType: !517, size: 16, offset: 2608)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !565, file: !566, line: 112, baseType: !517, size: 16, offset: 2624)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !565, file: !566, line: 112, baseType: !517, size: 16, offset: 2640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !565, file: !566, line: 112, baseType: !517, size: 16, offset: 2656)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !565, file: !566, line: 115, baseType: !517, size: 16, offset: 2672)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !565, file: !566, line: 118, baseType: !637, size: 64, offset: 2688)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !565, file: !566, line: 118, baseType: !637, size: 64, offset: 2752)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !565, file: !566, line: 121, baseType: !640, size: 64, offset: 2816)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !642, line: 46, flags: DIFlagFwdDecl)
!642 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !565, file: !566, line: 122, baseType: !644, size: 1152, offset: 2880)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 1152, elements: !2078)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !642, line: 57, size: 2496, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !646, file: !642, line: 59, baseType: !517, size: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !646, file: !642, line: 59, baseType: !517, size: 16, offset: 16)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !646, file: !642, line: 59, baseType: !517, size: 16, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !646, file: !642, line: 59, baseType: !517, size: 16, offset: 48)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !646, file: !642, line: 60, baseType: !561, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !646, file: !642, line: 61, baseType: !654, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !642, line: 202, size: 3328, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !726, !1561, !1562, !1891, !1892, !1920, !1921, !1988, !2009, !2017, !2018}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !655, file: !642, line: 203, baseType: !485, size: 960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !655, file: !642, line: 204, baseType: !558, size: 64, offset: 960)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !655, file: !642, line: 206, baseType: !575, size: 32, offset: 1024)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !655, file: !642, line: 206, baseType: !575, size: 32, offset: 1056)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !655, file: !642, line: 207, baseType: !575, size: 32, offset: 1088)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !655, file: !642, line: 207, baseType: !575, size: 32, offset: 1120)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !655, file: !642, line: 207, baseType: !575, size: 32, offset: 1152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !655, file: !642, line: 207, baseType: !575, size: 32, offset: 1184)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !655, file: !642, line: 207, baseType: !575, size: 32, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !655, file: !642, line: 207, baseType: !575, size: 32, offset: 1248)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !655, file: !642, line: 208, baseType: !575, size: 32, offset: 1280)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !655, file: !642, line: 208, baseType: !575, size: 32, offset: 1312)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !655, file: !642, line: 211, baseType: !575, size: 32, offset: 1344)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !655, file: !642, line: 211, baseType: !575, size: 32, offset: 1376)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !655, file: !642, line: 211, baseType: !575, size: 32, offset: 1408)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !655, file: !642, line: 211, baseType: !575, size: 32, offset: 1440)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !655, file: !642, line: 211, baseType: !575, size: 32, offset: 1472)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !655, file: !642, line: 214, baseType: !575, size: 32, offset: 1504)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !655, file: !642, line: 214, baseType: !575, size: 32, offset: 1536)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !655, file: !642, line: 217, baseType: !575, size: 32, offset: 1568)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !655, file: !642, line: 218, baseType: !575, size: 32, offset: 1600)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !655, file: !642, line: 219, baseType: !575, size: 32, offset: 1632)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !655, file: !642, line: 220, baseType: !575, size: 32, offset: 1664)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !655, file: !642, line: 221, baseType: !575, size: 32, offset: 1696)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !655, file: !642, line: 222, baseType: !517, size: 16, offset: 1728)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !655, file: !642, line: 222, baseType: !517, size: 16, offset: 1744)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !655, file: !642, line: 224, baseType: !517, size: 16, offset: 1760)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !655, file: !642, line: 224, baseType: !517, size: 16, offset: 1776)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !655, file: !642, line: 227, baseType: !517, size: 16, offset: 1792)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !655, file: !642, line: 227, baseType: !517, size: 16, offset: 1808)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !655, file: !642, line: 229, baseType: !517, size: 16, offset: 1824)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !655, file: !642, line: 229, baseType: !517, size: 16, offset: 1840)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !655, file: !642, line: 230, baseType: !517, size: 16, offset: 1856)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !655, file: !642, line: 230, baseType: !517, size: 16, offset: 1872)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !655, file: !642, line: 232, baseType: !575, size: 32, offset: 1888)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !655, file: !642, line: 232, baseType: !575, size: 32, offset: 1920)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !655, file: !642, line: 232, baseType: !575, size: 32, offset: 1952)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !655, file: !642, line: 232, baseType: !575, size: 32, offset: 1984)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !655, file: !642, line: 233, baseType: !38, size: 32, offset: 2016)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !655, file: !642, line: 234, baseType: !38, size: 32, offset: 2048)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !655, file: !642, line: 235, baseType: !517, size: 16, offset: 2080)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !655, file: !642, line: 235, baseType: !517, size: 16, offset: 2096)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !655, file: !642, line: 236, baseType: !517, size: 16, offset: 2112)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !655, file: !642, line: 239, baseType: !517, size: 16, offset: 2128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !655, file: !642, line: 240, baseType: !38, size: 32, offset: 2144)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !655, file: !642, line: 241, baseType: !38, size: 32, offset: 2176)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !655, file: !642, line: 241, baseType: !38, size: 32, offset: 2208)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !655, file: !642, line: 241, baseType: !38, size: 32, offset: 2240)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !655, file: !642, line: 243, baseType: !575, size: 32, offset: 2272)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !655, file: !642, line: 243, baseType: !575, size: 32, offset: 2304)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !655, file: !642, line: 244, baseType: !575, size: 32, offset: 2336)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !655, file: !642, line: 246, baseType: !709, size: 320, offset: 2368)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !710, line: 50, size: 320, elements: !711)
!710 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !709, file: !710, line: 51, baseType: !552, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !709, file: !710, line: 53, baseType: !38, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !709, file: !710, line: 54, baseType: !38, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !709, file: !710, line: 55, baseType: !38, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !709, file: !710, line: 55, baseType: !38, size: 32, offset: 160)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !709, file: !710, line: 56, baseType: !359, size: 8, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !709, file: !710, line: 56, baseType: !359, size: 8, offset: 200)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !709, file: !710, line: 57, baseType: !359, size: 8, offset: 208)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !709, file: !710, line: 57, baseType: !359, size: 8, offset: 216)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !709, file: !710, line: 59, baseType: !517, size: 16, offset: 224)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !709, file: !710, line: 59, baseType: !517, size: 16, offset: 240)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !709, file: !710, line: 59, baseType: !517, size: 16, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !709, file: !710, line: 61, baseType: !517, size: 16, offset: 272)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !709, file: !710, line: 63, baseType: !38, size: 32, offset: 288)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !655, file: !642, line: 248, baseType: !727, size: 64, offset: 2688)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !729, line: 328, size: 3456, elements: !730)
!729 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!730 = !{!731, !732, !733, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1539, !1540, !1541, !1544, !1548, !1552, !1556, !1557, !1558, !1559, !1560}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !728, file: !729, line: 329, baseType: !485, size: 960)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !728, file: !729, line: 330, baseType: !558, size: 64, offset: 960)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !728, file: !729, line: 332, baseType: !734, size: 64, offset: 1024)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !736, line: 283, size: 4096, elements: !737)
!736 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!737 = !{!738, !739, !740, !741, !745, !746, !750, !1478, !1486, !1490, !1496, !1500, !1501, !1502, !1503, !1507, !1508}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !735, file: !736, line: 284, baseType: !38, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !735, file: !736, line: 285, baseType: !533, size: 512, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !735, file: !736, line: 287, baseType: !533, size: 512, offset: 544)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !735, file: !736, line: 288, baseType: !742, size: 2048, offset: 1056)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 2048, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !735, file: !736, line: 289, baseType: !38, size: 32, offset: 3104)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !735, file: !736, line: 292, baseType: !747, size: 64, offset: 3136)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !727}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !735, file: !736, line: 293, baseType: !751, size: 64, offset: 3200)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !727, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !729, line: 167, size: 3712, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !729, line: 168, baseType: !754, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !755, file: !729, line: 168, baseType: !754, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !755, file: !729, line: 168, baseType: !754, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !755, file: !729, line: 170, baseType: !522, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !755, file: !729, line: 172, baseType: !762, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !736, line: 144, size: 6016, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !943, !944, !945, !1277, !1281, !1285, !1286, !1358, !1362, !1366, !1367, !1368, !1369, !1373, !1374, !1378, !1382, !1386, !1390, !1394, !1398, !1402, !1403, !1410, !1412, !1421, !1430}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !763, file: !736, line: 145, baseType: !461, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !763, file: !736, line: 145, baseType: !461, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !763, file: !736, line: 146, baseType: !517, size: 16, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !763, file: !736, line: 148, baseType: !533, size: 512, offset: 144)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !763, file: !736, line: 149, baseType: !38, size: 32, offset: 672)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !763, file: !736, line: 151, baseType: !533, size: 512, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !763, file: !736, line: 152, baseType: !742, size: 2048, offset: 1216)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !763, file: !736, line: 153, baseType: !38, size: 32, offset: 3264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !763, file: !736, line: 155, baseType: !575, size: 32, offset: 3296)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !763, file: !736, line: 155, baseType: !575, size: 32, offset: 3328)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !763, file: !736, line: 155, baseType: !575, size: 32, offset: 3360)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !763, file: !736, line: 156, baseType: !575, size: 32, offset: 3392)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !763, file: !736, line: 156, baseType: !575, size: 32, offset: 3424)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !763, file: !736, line: 156, baseType: !575, size: 32, offset: 3456)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !763, file: !736, line: 157, baseType: !517, size: 16, offset: 3488)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !763, file: !736, line: 157, baseType: !517, size: 16, offset: 3504)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !763, file: !736, line: 157, baseType: !517, size: 16, offset: 3520)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !763, file: !736, line: 160, baseType: !783, size: 64, offset: 3584)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !736, line: 109, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !736, line: 98, size: 1408, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !942}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !785, file: !736, line: 99, baseType: !38, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !785, file: !736, line: 99, baseType: !38, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !736, line: 100, baseType: !533, size: 512, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !785, file: !736, line: 101, baseType: !575, size: 32, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !785, file: !736, line: 101, baseType: !575, size: 32, offset: 608)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !785, file: !736, line: 101, baseType: !575, size: 32, offset: 640)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !785, file: !736, line: 101, baseType: !575, size: 32, offset: 672)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !785, file: !736, line: 102, baseType: !575, size: 32, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !785, file: !736, line: 102, baseType: !575, size: 32, offset: 736)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !785, file: !736, line: 103, baseType: !38, size: 32, offset: 768)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !785, file: !736, line: 104, baseType: !38, size: 32, offset: 800)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !785, file: !736, line: 107, baseType: !799, size: 64, offset: 832)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !729, line: 87, size: 2816, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !921}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !800, file: !729, line: 88, baseType: !799, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !800, file: !729, line: 88, baseType: !799, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !800, file: !729, line: 88, baseType: !799, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !800, file: !729, line: 90, baseType: !522, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !800, file: !729, line: 92, baseType: !533, size: 512, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !800, file: !729, line: 94, baseType: !533, size: 512, offset: 768)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !800, file: !729, line: 99, baseType: !461, size: 64, offset: 1280)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !800, file: !729, line: 101, baseType: !517, size: 16, offset: 1344)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !800, file: !729, line: 101, baseType: !517, size: 16, offset: 1360)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !800, file: !729, line: 102, baseType: !517, size: 16, offset: 1376)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !800, file: !729, line: 103, baseType: !517, size: 16, offset: 1392)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !800, file: !729, line: 104, baseType: !814, size: 64, offset: 1408)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !736, line: 114, size: 1600, elements: !816)
!816 = !{!817, !818, !837, !841, !845, !849, !853, !857, !858, !862, !891, !892, !893}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !815, file: !736, line: 115, baseType: !533, size: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !815, file: !736, line: 117, baseType: !819, size: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !822, !823, !825, !825, !357}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !125, line: 61, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !827, line: 55, size: 192, elements: !828)
!827 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!828 = !{!829, !833, !836}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !826, file: !827, line: 58, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !826, file: !827, line: 56, size: 64, elements: !831)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !830, file: !827, line: 57, baseType: !461, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !826, file: !827, line: 60, baseType: !834, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !125, line: 57, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !826, file: !827, line: 61, baseType: !461, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !815, file: !736, line: 118, baseType: !838, size: 64, offset: 576)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !822, !825, !825, !637}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !815, file: !736, line: 120, baseType: !842, size: 64, offset: 640)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !822, !823, !825}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !815, file: !736, line: 121, baseType: !846, size: 64, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !822, !825, !637}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !815, file: !736, line: 122, baseType: !850, size: 64, offset: 768)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !727, !799, !834}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !815, file: !736, line: 123, baseType: !854, size: 64, offset: 832)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !727, !799, !754, !799, !357}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !815, file: !736, line: 124, baseType: !854, size: 64, offset: 896)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !815, file: !736, line: 125, baseType: !859, size: 64, offset: 960)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !727, !799, !754, !799}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !815, file: !736, line: 128, baseType: !863, size: 256, offset: 1024)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !827, line: 436, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !827, line: 430, size: 256, elements: !865)
!865 = !{!866, !867, !870, !886}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !864, file: !827, line: 431, baseType: !461, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !864, file: !827, line: 432, baseType: !868, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !827, line: 417, baseType: !835)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !864, file: !827, line: 433, baseType: !871, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !827, line: 408, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!38, !822, !825, !875, !877}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !827, line: 38, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !827, line: 348, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !827, line: 337, size: 256, elements: !880)
!880 = !{!881, !882, !883, !884, !885}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !879, file: !827, line: 339, baseType: !461, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !879, file: !827, line: 342, baseType: !875, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !879, file: !827, line: 345, baseType: !38, size: 32, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !879, file: !827, line: 347, baseType: !38, size: 32, offset: 160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !879, file: !827, line: 347, baseType: !38, size: 32, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !864, file: !827, line: 434, baseType: !887, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !827, line: 409, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !461}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !815, file: !736, line: 129, baseType: !863, size: 256, offset: 1280)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !815, file: !736, line: 132, baseType: !38, size: 32, offset: 1536)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !815, file: !736, line: 132, baseType: !38, size: 32, offset: 1568)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !800, file: !729, line: 105, baseType: !533, size: 512, offset: 1472)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !800, file: !729, line: 107, baseType: !575, size: 32, offset: 1984)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !800, file: !729, line: 107, baseType: !575, size: 32, offset: 2016)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !800, file: !729, line: 109, baseType: !461, size: 64, offset: 2048)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !800, file: !729, line: 112, baseType: !517, size: 16, offset: 2112)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !800, file: !729, line: 114, baseType: !517, size: 16, offset: 2128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !800, file: !729, line: 115, baseType: !38, size: 32, offset: 2144)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !800, file: !729, line: 117, baseType: !461, size: 64, offset: 2176)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !800, file: !729, line: 122, baseType: !38, size: 32, offset: 2240)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !800, file: !729, line: 124, baseType: !38, size: 32, offset: 2272)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !800, file: !729, line: 126, baseType: !799, size: 64, offset: 2304)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !800, file: !729, line: 128, baseType: !906, size: 64, offset: 2368)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !729, line: 298, size: 448, elements: !908)
!908 = !{!909, !910, !911, !914, !915, !918, !919, !920}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !907, file: !729, line: 299, baseType: !906, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !907, file: !729, line: 299, baseType: !906, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !907, file: !729, line: 301, baseType: !912, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !729, line: 218, baseType: !755)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !907, file: !729, line: 301, baseType: !912, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !907, file: !729, line: 302, baseType: !916, size: 64, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !729, line: 132, baseType: !800)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !907, file: !729, line: 302, baseType: !916, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !907, file: !729, line: 304, baseType: !38, size: 32, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !907, file: !729, line: 305, baseType: !38, size: 32, offset: 416)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !800, file: !729, line: 131, baseType: !922, size: 384, offset: 2432)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !729, line: 73, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !729, line: 62, size: 384, elements: !924)
!924 = !{!925, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !923, file: !729, line: 63, baseType: !926, size: 128)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 128, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 4)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !923, file: !729, line: 64, baseType: !575, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !923, file: !729, line: 64, baseType: !575, size: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !923, file: !729, line: 65, baseType: !461, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !923, file: !729, line: 66, baseType: !517, size: 16, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !923, file: !729, line: 67, baseType: !517, size: 16, offset: 272)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !923, file: !729, line: 68, baseType: !517, size: 16, offset: 288)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !923, file: !729, line: 69, baseType: !517, size: 16, offset: 304)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !923, file: !729, line: 70, baseType: !517, size: 16, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !923, file: !729, line: 71, baseType: !517, size: 16, offset: 336)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !923, file: !729, line: 72, baseType: !939, size: 32, offset: 352)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 32, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 2)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !785, file: !736, line: 108, baseType: !533, size: 512, offset: 896)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !763, file: !736, line: 160, baseType: !783, size: 64, offset: 3648)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !763, file: !736, line: 162, baseType: !533, size: 512, offset: 3712)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !763, file: !736, line: 165, baseType: !946, size: 64, offset: 4224)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !949, !951, !1237, !727, !754, !1273}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !109, line: 230, size: 3072, elements: !953)
!953 = !{!954, !955, !956, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1236}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !109, line: 231, baseType: !951, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !952, file: !109, line: 231, baseType: !951, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !952, file: !109, line: 233, baseType: !957, size: 1280, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !958, line: 71, baseType: !959)
!958 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !958, line: 40, size: 1280, elements: !960)
!960 = !{!961, !970, !971, !979, !980, !981, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1004}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !959, file: !958, line: 41, baseType: !962, size: 128)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !963, line: 95, baseType: !964)
!963 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !963, line: 92, size: 128, elements: !965)
!965 = !{!966, !967, !968, !969}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !964, file: !963, line: 93, baseType: !575, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !964, file: !963, line: 93, baseType: !575, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !964, file: !963, line: 94, baseType: !575, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !964, file: !963, line: 94, baseType: !575, size: 32, offset: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !959, file: !958, line: 41, baseType: !962, size: 128, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !959, file: !958, line: 42, baseType: !972, size: 128, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !963, line: 89, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !963, line: 86, size: 128, elements: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !973, file: !963, line: 87, baseType: !38, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !973, file: !963, line: 87, baseType: !38, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !973, file: !963, line: 88, baseType: !38, size: 32, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !973, file: !963, line: 88, baseType: !38, size: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !959, file: !958, line: 42, baseType: !972, size: 128, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !959, file: !958, line: 43, baseType: !972, size: 128, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !959, file: !958, line: 45, baseType: !982, size: 64, offset: 640)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 64, elements: !940)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !959, file: !958, line: 45, baseType: !982, size: 64, offset: 704)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !959, file: !958, line: 46, baseType: !575, size: 32, offset: 768)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !959, file: !958, line: 46, baseType: !575, size: 32, offset: 800)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !959, file: !958, line: 48, baseType: !517, size: 16, offset: 832)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !959, file: !958, line: 49, baseType: !517, size: 16, offset: 848)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !959, file: !958, line: 51, baseType: !517, size: 16, offset: 864)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !959, file: !958, line: 52, baseType: !517, size: 16, offset: 880)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !959, file: !958, line: 53, baseType: !517, size: 16, offset: 896)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !959, file: !958, line: 55, baseType: !517, size: 16, offset: 912)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !959, file: !958, line: 56, baseType: !517, size: 16, offset: 928)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !959, file: !958, line: 58, baseType: !517, size: 16, offset: 944)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !959, file: !958, line: 58, baseType: !517, size: 16, offset: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !959, file: !958, line: 59, baseType: !517, size: 16, offset: 976)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !959, file: !958, line: 59, baseType: !517, size: 16, offset: 992)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !959, file: !958, line: 61, baseType: !517, size: 16, offset: 1008)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !959, file: !958, line: 63, baseType: !637, size: 64, offset: 1024)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !959, file: !958, line: 64, baseType: !38, size: 32, offset: 1088)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !959, file: !958, line: 65, baseType: !38, size: 32, offset: 1120)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !959, file: !958, line: 68, baseType: !1002, size: 64, offset: 1152)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !958, line: 68, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !959, file: !958, line: 69, baseType: !468, size: 64, offset: 1216)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !952, file: !109, line: 234, baseType: !972, size: 128, offset: 1408)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !952, file: !109, line: 235, baseType: !972, size: 128, offset: 1536)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !952, file: !109, line: 236, baseType: !517, size: 16, offset: 1664)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !952, file: !109, line: 236, baseType: !517, size: 16, offset: 1680)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !952, file: !109, line: 238, baseType: !517, size: 16, offset: 1696)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !952, file: !109, line: 239, baseType: !517, size: 16, offset: 1712)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !952, file: !109, line: 240, baseType: !517, size: 16, offset: 1728)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !952, file: !109, line: 241, baseType: !517, size: 16, offset: 1744)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !952, file: !109, line: 243, baseType: !575, size: 32, offset: 1760)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !952, file: !109, line: 244, baseType: !517, size: 16, offset: 1792)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !952, file: !109, line: 244, baseType: !517, size: 16, offset: 1808)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !952, file: !109, line: 246, baseType: !517, size: 16, offset: 1824)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !952, file: !109, line: 247, baseType: !517, size: 16, offset: 1840)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !952, file: !109, line: 248, baseType: !517, size: 16, offset: 1856)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !952, file: !109, line: 249, baseType: !517, size: 16, offset: 1872)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !952, file: !109, line: 250, baseType: !517, size: 16, offset: 1888)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !952, file: !109, line: 251, baseType: !517, size: 16, offset: 1904)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !952, file: !109, line: 253, baseType: !1023, size: 64, offset: 1920)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !1025, line: 116, size: 1472, elements: !1026)
!1025 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1026 = !{!1027, !1028, !1029, !1030, !1071, !1072, !1076, !1200, !1204, !1208, !1209, !1210, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1024, file: !1025, line: 117, baseType: !1023, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1024, file: !1025, line: 117, baseType: !1023, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !1024, file: !1025, line: 119, baseType: !38, size: 32, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1024, file: !1025, line: 122, baseType: !1031, size: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{null, !1034, !951}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !125, line: 128, size: 2816, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1062, !1063, !1064, !1065, !1066, !1067}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1035, file: !125, line: 129, baseType: !485, size: 960)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !1035, file: !125, line: 131, baseType: !474, size: 64, offset: 960)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "winactive", scope: !1035, file: !125, line: 131, baseType: !474, size: 64, offset: 1024)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !1035, file: !125, line: 132, baseType: !456, size: 128, offset: 1088)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1035, file: !125, line: 134, baseType: !38, size: 32, offset: 1216)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "file_saved", scope: !1035, file: !125, line: 135, baseType: !517, size: 16, offset: 1248)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "op_undo_depth", scope: !1035, file: !125, line: 136, baseType: !517, size: 16, offset: 1264)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "operators", scope: !1035, file: !125, line: 138, baseType: !456, size: 128, offset: 1280)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !1035, file: !125, line: 140, baseType: !456, size: 128, offset: 1408)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !1035, file: !125, line: 142, baseType: !453, size: 320, offset: 1536)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !1035, file: !125, line: 144, baseType: !456, size: 128, offset: 1856)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursors", scope: !1035, file: !125, line: 146, baseType: !456, size: 128, offset: 1984)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "drags", scope: !1035, file: !125, line: 148, baseType: !456, size: 128, offset: 2112)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "keyconfigs", scope: !1035, file: !125, line: 150, baseType: !456, size: 128, offset: 2240)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "defaultconf", scope: !1035, file: !125, line: 151, baseType: !1052, size: 64, offset: 2368)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !125, line: 310, size: 1344, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1053, file: !125, line: 311, baseType: !1052, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1053, file: !125, line: 311, baseType: !1052, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1053, file: !125, line: 313, baseType: !533, size: 512, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !1053, file: !125, line: 314, baseType: !533, size: 512, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !1053, file: !125, line: 316, baseType: !456, size: 128, offset: 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !1053, file: !125, line: 317, baseType: !38, size: 32, offset: 1280)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1053, file: !125, line: 317, baseType: !38, size: 32, offset: 1312)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "addonconf", scope: !1035, file: !125, line: 152, baseType: !1052, size: 64, offset: 2432)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "userconf", scope: !1035, file: !125, line: 153, baseType: !1052, size: 64, offset: 2496)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "timers", scope: !1035, file: !125, line: 155, baseType: !456, size: 128, offset: 2560)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "autosavetimer", scope: !1035, file: !125, line: 156, baseType: !468, size: 64, offset: 2688)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "is_interface_locked", scope: !1035, file: !125, line: 158, baseType: !359, size: 8, offset: 2752)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1035, file: !125, line: 159, baseType: !1068, size: 56, offset: 2760)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 56, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 7)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !1024, file: !1025, line: 124, baseType: !1031, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1024, file: !1025, line: 126, baseType: !1073, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{null, !949, !951}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !1024, file: !1025, line: 128, baseType: !1077, size: 64, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !481, !1080, !951, !1157}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !109, line: 203, size: 1280, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1102, !1103, !1104, !1105, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1196, !1197, !1198, !1199}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1081, file: !109, line: 204, baseType: !1080, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1081, file: !109, line: 204, baseType: !1080, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1081, file: !109, line: 206, baseType: !1086, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !109, line: 87, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !109, line: 82, size: 256, elements: !1089)
!1089 = !{!1090, !1092, !1093, !1094, !1100, !1101}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1088, file: !109, line: 83, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1088, file: !109, line: 83, baseType: !1091, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !1088, file: !109, line: 83, baseType: !1091, size: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1088, file: !109, line: 84, baseType: !1095, size: 32, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !963, line: 43, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !963, line: 41, size: 32, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1096, file: !963, line: 42, baseType: !517, size: 16)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1096, file: !963, line: 42, baseType: !517, size: 16, offset: 16)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1088, file: !109, line: 86, baseType: !517, size: 16, offset: 224)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !1088, file: !109, line: 86, baseType: !517, size: 16, offset: 240)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1081, file: !109, line: 206, baseType: !1086, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !1081, file: !109, line: 206, baseType: !1086, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !1081, file: !109, line: 206, baseType: !1086, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1081, file: !109, line: 207, baseType: !1106, size: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !109, line: 80, baseType: !482)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "totrct", scope: !1081, file: !109, line: 209, baseType: !972, size: 128, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1081, file: !109, line: 211, baseType: !359, size: 8, offset: 576)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "butspacetype", scope: !1081, file: !109, line: 211, baseType: !359, size: 8, offset: 584)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1081, file: !109, line: 212, baseType: !517, size: 16, offset: 592)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1081, file: !109, line: 212, baseType: !517, size: 16, offset: 608)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "headertype", scope: !1081, file: !109, line: 214, baseType: !517, size: 16, offset: 624)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !1081, file: !109, line: 215, baseType: !517, size: 16, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1081, file: !109, line: 216, baseType: !517, size: 16, offset: 656)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "region_active_win", scope: !1081, file: !109, line: 217, baseType: !517, size: 16, offset: 672)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1081, file: !109, line: 219, baseType: !359, size: 8, offset: 688)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1081, file: !109, line: 219, baseType: !359, size: 8, offset: 696)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1081, file: !109, line: 221, baseType: !1120, size: 64, offset: 704)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !1025, line: 66, size: 1728, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1144, !1148, !1152, !1153, !1170, !1174, !1178, !1182, !1186, !1187, !1193, !1194, !1195}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1121, file: !1025, line: 67, baseType: !1120, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1121, file: !1025, line: 67, baseType: !1120, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1121, file: !1025, line: 69, baseType: !533, size: 512, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !1121, file: !1025, line: 70, baseType: !38, size: 32, offset: 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "iconid", scope: !1121, file: !1025, line: 71, baseType: !38, size: 32, offset: 672)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !1121, file: !1025, line: 74, baseType: !1129, size: 64, offset: 704)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!1132, !949}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !84, line: 85, size: 448, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1139, !1140}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1133, file: !84, line: 86, baseType: !1132, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1133, file: !84, line: 86, baseType: !1132, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1133, file: !84, line: 87, baseType: !456, size: 128, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1133, file: !84, line: 88, baseType: !38, size: 32, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1133, file: !84, line: 89, baseType: !575, size: 32, offset: 288)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1133, file: !84, line: 90, baseType: !1141, size: 128, offset: 320)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 128, elements: !1142)
!1142 = !{!1143}
!1143 = !DISubrange(count: 8)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1121, file: !1025, line: 76, baseType: !1145, size: 64, offset: 768)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !1132}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1121, file: !1025, line: 79, baseType: !1149, size: 64, offset: 832)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{null, !1034, !1080}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !1121, file: !1025, line: 81, baseType: !1149, size: 64, offset: 896)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !1121, file: !1025, line: 83, baseType: !1154, size: 64, offset: 960)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{null, !481, !1080, !1157}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmNotifier", file: !69, line: 195, size: 512, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1158, file: !69, line: 196, baseType: !1157, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1158, file: !69, line: 196, baseType: !1157, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !1158, file: !69, line: 198, baseType: !1034, size: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1158, file: !69, line: 199, baseType: !474, size: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1158, file: !69, line: 201, baseType: !38, size: 32, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1158, file: !69, line: 202, baseType: !7, size: 32, offset: 288)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1158, file: !69, line: 202, baseType: !7, size: 32, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1158, file: !69, line: 202, baseType: !7, size: 32, offset: 352)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1158, file: !69, line: 202, baseType: !7, size: 32, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1158, file: !69, line: 204, baseType: !461, size: 64, offset: 448)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !1121, file: !1025, line: 86, baseType: !1171, size: 64, offset: 1024)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{null, !949, !1080}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !1121, file: !1025, line: 89, baseType: !1175, size: 64, offset: 1088)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!1132, !1132}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "operatortypes", scope: !1121, file: !1025, line: 92, baseType: !1179, size: 64, offset: 1152)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{null}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "keymap", scope: !1121, file: !1025, line: 94, baseType: !1183, size: 64, offset: 1216)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{null, !1052}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "dropboxes", scope: !1121, file: !1025, line: 96, baseType: !1179, size: 64, offset: 1280)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1121, file: !1025, line: 99, baseType: !1188, size: 64, offset: 1344)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!38, !949, !357, !1191}
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContextDataResult", file: !354, line: 71, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "regiontypes", scope: !1121, file: !1025, line: 102, baseType: !456, size: 128, offset: 1408)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "toolshelf", scope: !1121, file: !1025, line: 105, baseType: !456, size: 128, offset: 1536)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "keymapflag", scope: !1121, file: !1025, line: 110, baseType: !38, size: 32, offset: 1664)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "spacedata", scope: !1081, file: !109, line: 223, baseType: !456, size: 128, offset: 768)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1081, file: !109, line: 224, baseType: !456, size: 128, offset: 896)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !1081, file: !109, line: 225, baseType: !456, size: 128, offset: 1024)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "actionzones", scope: !1081, file: !109, line: 227, baseType: !456, size: 128, offset: 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1024, file: !1025, line: 130, baseType: !1201, size: 64, offset: 448)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{null, !951}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !1024, file: !1025, line: 133, baseType: !1205, size: 64, offset: 512)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!461, !461}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "operatortypes", scope: !1024, file: !1025, line: 137, baseType: !1179, size: 64, offset: 576)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "keymap", scope: !1024, file: !1025, line: 139, baseType: !1183, size: 64, offset: 640)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1024, file: !1025, line: 141, baseType: !1211, size: 64, offset: 704)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{null, !474, !1080, !951}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1024, file: !1025, line: 144, baseType: !1188, size: 64, offset: 768)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "drawcalls", scope: !1024, file: !1025, line: 147, baseType: !456, size: 128, offset: 832)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "paneltypes", scope: !1024, file: !1025, line: 150, baseType: !456, size: 128, offset: 960)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "headertypes", scope: !1024, file: !1025, line: 153, baseType: !456, size: 128, offset: 1088)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "minsizex", scope: !1024, file: !1025, line: 156, baseType: !38, size: 32, offset: 1216)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "minsizey", scope: !1024, file: !1025, line: 156, baseType: !38, size: 32, offset: 1248)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "prefsizex", scope: !1024, file: !1025, line: 158, baseType: !38, size: 32, offset: 1280)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "prefsizey", scope: !1024, file: !1025, line: 158, baseType: !38, size: 32, offset: 1312)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "keymapflag", scope: !1024, file: !1025, line: 160, baseType: !38, size: 32, offset: 1344)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "do_lock", scope: !1024, file: !1025, line: 162, baseType: !517, size: 16, offset: 1376)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1024, file: !1025, line: 162, baseType: !517, size: 16, offset: 1392)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "event_cursor", scope: !1024, file: !1025, line: 164, baseType: !517, size: 16, offset: 1408)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !952, file: !109, line: 255, baseType: !456, size: 128, offset: 1984)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !952, file: !109, line: 256, baseType: !456, size: 128, offset: 2112)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !952, file: !109, line: 257, baseType: !456, size: 128, offset: 2240)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !952, file: !109, line: 258, baseType: !456, size: 128, offset: 2368)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !952, file: !109, line: 259, baseType: !456, size: 128, offset: 2496)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !952, file: !109, line: 260, baseType: !456, size: 128, offset: 2624)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !952, file: !109, line: 261, baseType: !456, size: 128, offset: 2752)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !952, file: !109, line: 263, baseType: !468, size: 64, offset: 2880)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !952, file: !109, line: 265, baseType: !1235, size: 64, offset: 2944)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !952, file: !109, line: 266, baseType: !461, size: 64, offset: 3008)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !84, line: 925, size: 3200, elements: !1239)
!1239 = !{!1240, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1238, file: !84, line: 926, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !84, line: 91, baseType: !1133)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1238, file: !84, line: 926, baseType: !1241, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1238, file: !84, line: 927, baseType: !456, size: 128, offset: 128)
