; ModuleID = 'blender/source/blender/editors/mesh/editmesh_intersect.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_intersect.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!47 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 249, baseType: !6, size: 32, elements: !50)
!49 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 260, baseType: !6, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62, !63}
!57 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !65, line: 57, baseType: !6, size: 32, elements: !66)
!65 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!67 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !82, line: 67, baseType: !6, size: 32, elements: !83)
!82 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92}
!84 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!87 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!88 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!89 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!90 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!91 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!92 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 351, baseType: !6, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100}
!95 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!98 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!99 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!100 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!101 = !{!102, !103, !104, !108, !112, !178, !180, !162, !124, !182, !185, !186}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !65, line: 79, baseType: !64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !65, line: 158, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !102}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !65, line: 159, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!102, !102}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !49, line: 103, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !49, line: 90, size: 448, elements: !115)
!115 = !{!116, !127, !133, !138, !139}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !114, file: !49, line: 91, baseType: !117, size: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !49, line: 82, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !49, line: 64, size: 128, elements: !119)
!119 = !{!120, !121, !123, !125, !126}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !118, file: !49, line: 65, baseType: !102, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !118, file: !49, line: 66, baseType: !122, size: 32, offset: 64)
!122 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !118, file: !49, line: 73, baseType: !124, size: 8, offset: 96)
!124 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !118, file: !49, line: 74, baseType: !124, size: 8, offset: 104)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !118, file: !49, line: 80, baseType: !124, size: 8, offset: 112)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !114, file: !49, line: 92, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !49, line: 180, size: 16, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !129, file: !49, line: 181, baseType: !132, size: 16)
!132 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !114, file: !49, line: 94, baseType: !134, size: 96, offset: 192)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 96, elements: !136)
!135 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!136 = !{!137}
!137 = !DISubrange(count: 3)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !114, file: !49, line: 95, baseType: !134, size: 96, offset: 288)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !114, file: !49, line: 102, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !49, line: 110, size: 640, elements: !142)
!142 = !{!143, !144, !145, !147, !148, !171, !177}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !49, line: 111, baseType: !117, size: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !141, file: !49, line: 112, baseType: !128, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !141, file: !49, line: 114, baseType: !146, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !141, file: !49, line: 114, baseType: !146, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !141, file: !49, line: 118, baseType: !149, size: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !49, line: 125, size: 576, elements: !151)
!151 = !{!152, !153, !154, !155, !167, !168, !169, !170}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !150, file: !49, line: 126, baseType: !117, size: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !150, file: !49, line: 129, baseType: !146, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !150, file: !49, line: 130, baseType: !140, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !150, file: !49, line: 131, baseType: !156, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !49, line: 164, size: 448, elements: !158)
!158 = !{!159, !160, !161, !164, !165, !166}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !157, file: !49, line: 165, baseType: !117, size: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !157, file: !49, line: 166, baseType: !128, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !157, file: !49, line: 172, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !49, line: 140, baseType: !150)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !157, file: !49, line: 174, baseType: !122, size: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !157, file: !49, line: 175, baseType: !134, size: 96, offset: 288)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !157, file: !49, line: 176, baseType: !132, size: 16, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !150, file: !49, line: 135, baseType: !149, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !150, file: !49, line: 135, baseType: !149, size: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !49, line: 139, baseType: !149, size: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !150, file: !49, line: 139, baseType: !149, size: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !141, file: !49, line: 122, baseType: !172, size: 128, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !49, line: 108, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !49, line: 106, size: 128, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !49, line: 107, baseType: !140, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !173, file: !49, line: 107, baseType: !140, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !141, file: !49, line: 122, baseType: !172, size: 128, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !49, line: 123, baseType: !141)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !49, line: 178, baseType: !157)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !183, line: 46, baseType: !184)
!183 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!184 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!187 = !{!0}
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 960, elements: !136)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "EnumPropertyItem", file: !190, line: 308, baseType: !191)
!190 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !190, line: 302, size: 320, elements: !192)
!192 = !{!193, !194, !197, !198, !199}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !191, file: !190, line: 303, baseType: !122, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !191, file: !190, line: 304, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !191, file: !190, line: 305, baseType: !122, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !190, line: 306, baseType: !195, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !191, file: !190, line: 307, baseType: !195, size: 64, offset: 256)
!200 = !{i32 7, !"Dwarf Version", i32 4}
!201 = !{i32 2, !"Debug Info Version", i32 3}
!202 = !{i32 1, !"wchar_size", i32 4}
!203 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!204 = distinct !DISubprogram(name: "MESH_OT_intersect", scope: !3, file: !3, line: 155, type: !205, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1987)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !209, line: 508, size: 1536, elements: !210)
!209 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!210 = !{!211, !212, !213, !214, !215, !1913, !1917, !1923, !1927, !1928, !1932, !1933, !1934, !1935, !1939, !1940, !1955, !1956, !1960, !1986}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !209, line: 509, baseType: !195, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !208, file: !209, line: 510, baseType: !195, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !208, file: !209, line: 511, baseType: !195, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !208, file: !209, line: 512, baseType: !195, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !208, file: !209, line: 518, baseType: !216, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!122, !219, !221}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !190, line: 44, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !82, line: 328, size: 1344, elements: !223)
!223 = !{!224, !225, !226, !230, !260, !261, !262, !263, !275, !1906, !1907, !1908, !1911, !1912}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !82, line: 329, baseType: !221, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !222, file: !82, line: 329, baseType: !221, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !222, file: !82, line: 332, baseType: !227, size: 512, offset: 128)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 512, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !222, file: !82, line: 333, baseType: !231, size: 64, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !233, line: 75, baseType: !234)
!233 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !233, line: 62, size: 1024, elements: !235)
!235 = !{!236, !238, !239, !240, !241, !242, !243, !244, !258, !259}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !233, line: 63, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !234, file: !233, line: 63, baseType: !237, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !233, line: 64, baseType: !124, size: 8, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !234, file: !233, line: 64, baseType: !124, size: 8, offset: 136)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !233, line: 65, baseType: !132, size: 16, offset: 144)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !233, line: 66, baseType: !227, size: 512, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !234, file: !233, line: 67, baseType: !122, size: 32, offset: 672)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !233, line: 69, baseType: !245, size: 256, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !233, line: 60, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !233, line: 48, size: 256, elements: !247)
!247 = !{!248, !249, !256, !257}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !246, file: !233, line: 49, baseType: !102, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !246, file: !233, line: 58, baseType: !250, size: 128, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !251, line: 71, baseType: !252)
!251 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !251, line: 69, size: 128, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !252, file: !251, line: 70, baseType: !102, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !252, file: !251, line: 70, baseType: !102, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !246, file: !233, line: 59, baseType: !122, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !246, file: !233, line: 59, baseType: !122, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !234, file: !233, line: 70, baseType: !122, size: 32, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !234, file: !233, line: 74, baseType: !122, size: 32, offset: 992)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !222, file: !82, line: 336, baseType: !207, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !222, file: !82, line: 337, baseType: !102, size: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !222, file: !82, line: 338, baseType: !102, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !222, file: !82, line: 340, baseType: !264, size: 64, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !190, line: 55, size: 192, elements: !266)
!266 = !{!267, !271, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !265, file: !190, line: 58, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !265, file: !190, line: 56, size: 64, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !190, line: 57, baseType: !102, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !265, file: !190, line: 60, baseType: !272, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !190, line: 41, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !265, file: !190, line: 61, baseType: !102, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !222, file: !82, line: 341, baseType: !276, size: 64, offset: 960)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !82, line: 106, size: 320, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !277, file: !82, line: 107, baseType: !250, size: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !277, file: !82, line: 108, baseType: !122, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !277, file: !82, line: 109, baseType: !122, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !82, line: 110, baseType: !122, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !277, file: !82, line: 110, baseType: !122, size: 32, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !277, file: !82, line: 111, baseType: !285, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !209, line: 490, size: 768, elements: !287)
!287 = !{!288, !289, !290, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !209, line: 491, baseType: !285, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !286, file: !209, line: 491, baseType: !285, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !286, file: !209, line: 493, baseType: !291, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !82, line: 169, size: 2048, elements: !293)
!293 = !{!294, !295, !296, !297, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1872, !1875, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !292, file: !82, line: 170, baseType: !291, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !292, file: !82, line: 170, baseType: !291, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !292, file: !82, line: 172, baseType: !102, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !292, file: !82, line: 174, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !300, line: 49, size: 1984, elements: !301)
!300 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!301 = !{!302, !338, !339, !340, !341, !342, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !299, file: !300, line: 50, baseType: !303, size: 960)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !233, line: 130, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !233, line: 117, size: 960, elements: !305)
!305 = !{!306, !307, !308, !310, !329, !333, !334, !335, !336, !337}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !233, line: 118, baseType: !102, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !233, line: 118, baseType: !102, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !304, file: !233, line: 119, baseType: !309, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !304, file: !233, line: 120, baseType: !311, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !233, line: 136, size: 17600, elements: !313)
!313 = !{!314, !315, !317, !320, !324, !325, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !312, file: !233, line: 137, baseType: !303, size: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !312, file: !233, line: 138, baseType: !316, size: 64, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !312, file: !233, line: 139, baseType: !318, size: 64, offset: 1024)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !233, line: 43, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !233, line: 140, baseType: !321, size: 8192, offset: 1088)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 8192, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 1024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !312, file: !233, line: 141, baseType: !321, size: 8192, offset: 9280)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !312, file: !233, line: 148, baseType: !311, size: 64, offset: 17472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !312, file: !233, line: 150, baseType: !327, size: 64, offset: 17536)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !233, line: 45, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !233, line: 121, baseType: !330, size: 528, offset: 256)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 528, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 66)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !304, file: !233, line: 126, baseType: !132, size: 16, offset: 784)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !304, file: !233, line: 127, baseType: !122, size: 32, offset: 800)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !304, file: !233, line: 128, baseType: !122, size: 32, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !304, file: !233, line: 128, baseType: !122, size: 32, offset: 864)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !304, file: !233, line: 129, baseType: !231, size: 64, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !299, file: !300, line: 52, baseType: !250, size: 128, offset: 960)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !299, file: !300, line: 53, baseType: !250, size: 128, offset: 1088)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !299, file: !300, line: 54, baseType: !250, size: 128, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !299, file: !300, line: 55, baseType: !250, size: 128, offset: 1344)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !299, file: !300, line: 57, baseType: !343, size: 64, offset: 1472)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !345, line: 1216, size: 39680, elements: !346)
!345 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!346 = !{!347, !348, !352, !638, !641, !642, !643, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !669, !737, !1165, !1381, !1384, !1672, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1694, !1695, !1696, !1697, !1698, !1706, !1773, !1780, !1781, !1788, !1789, !1790, !1791, !1792, !1793, !1794}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !344, file: !345, line: 1217, baseType: !303, size: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !344, file: !345, line: 1218, baseType: !349, size: 64, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !351, line: 45, flags: DIFlagFwdDecl)
!351 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !344, file: !345, line: 1220, baseType: !353, size: 64, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !355, line: 115, size: 11392, elements: !356)
!355 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !{!357, !358, !359, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !376, !386, !400, !401, !442, !443, !446, !447, !463, !464, !465, !466, !467, !468, !469, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !488, !489, !490, !491, !492, !493, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !553, !554, !555, !556, !557, !558, !559, !560, !561, !564, !567, !570, !571, !572, !573, !574, !577, !580, !583, !584, !589, !590, !591, !592, !593, !594, !596, !599, !602, !606, !626, !627}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !354, file: !355, line: 116, baseType: !303, size: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !354, file: !355, line: 117, baseType: !349, size: 64, offset: 960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !354, file: !355, line: 119, baseType: !360, size: 64, offset: 1024)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !355, line: 57, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !355, line: 121, baseType: !132, size: 16, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !354, file: !355, line: 121, baseType: !132, size: 16, offset: 1104)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !354, file: !355, line: 122, baseType: !122, size: 32, offset: 1120)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !354, file: !355, line: 122, baseType: !122, size: 32, offset: 1152)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !354, file: !355, line: 122, baseType: !122, size: 32, offset: 1184)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !354, file: !355, line: 123, baseType: !227, size: 512, offset: 1216)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !354, file: !355, line: 124, baseType: !353, size: 64, offset: 1728)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !354, file: !355, line: 124, baseType: !353, size: 64, offset: 1792)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !354, file: !355, line: 127, baseType: !353, size: 64, offset: 1856)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !354, file: !355, line: 127, baseType: !353, size: 64, offset: 1920)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !354, file: !355, line: 127, baseType: !353, size: 64, offset: 1984)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !354, file: !355, line: 128, baseType: !374, size: 64, offset: 2048)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !351, line: 46, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !354, file: !355, line: 130, baseType: !377, size: 64, offset: 2112)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !355, line: 97, size: 832, elements: !379)
!379 = !{!380, !384, !385}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !378, file: !355, line: 98, baseType: !381, size: 768)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 768, elements: !382)
!382 = !{!383, !137}
!383 = !DISubrange(count: 8)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !378, file: !355, line: 99, baseType: !122, size: 32, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !378, file: !355, line: 99, baseType: !122, size: 32, offset: 800)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !354, file: !355, line: 131, baseType: !387, size: 64, offset: 2176)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !389, line: 486, size: 1600, elements: !390)
!389 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !388, file: !389, line: 487, baseType: !303, size: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !388, file: !389, line: 489, baseType: !250, size: 128, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !388, file: !389, line: 490, baseType: !250, size: 128, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !388, file: !389, line: 491, baseType: !250, size: 128, offset: 1216)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !388, file: !389, line: 492, baseType: !250, size: 128, offset: 1344)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !388, file: !389, line: 494, baseType: !122, size: 32, offset: 1472)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !388, file: !389, line: 495, baseType: !122, size: 32, offset: 1504)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !388, file: !389, line: 497, baseType: !122, size: 32, offset: 1536)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !388, file: !389, line: 498, baseType: !122, size: 32, offset: 1568)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !354, file: !355, line: 132, baseType: !387, size: 64, offset: 2240)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !354, file: !355, line: 133, baseType: !402, size: 64, offset: 2304)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !389, line: 334, size: 1728, elements: !404)
!404 = !{!405, !406, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !441}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !403, file: !389, line: 335, baseType: !250, size: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !403, file: !389, line: 336, baseType: !407, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !389, line: 47, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !403, file: !389, line: 338, baseType: !132, size: 16, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !403, file: !389, line: 338, baseType: !132, size: 16, offset: 208)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !403, file: !389, line: 339, baseType: !6, size: 32, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !403, file: !389, line: 340, baseType: !122, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !403, file: !389, line: 342, baseType: !135, size: 32, offset: 288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !403, file: !389, line: 343, baseType: !134, size: 96, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !403, file: !389, line: 344, baseType: !134, size: 96, offset: 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !403, file: !389, line: 347, baseType: !250, size: 128, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !403, file: !389, line: 349, baseType: !122, size: 32, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !403, file: !389, line: 350, baseType: !122, size: 32, offset: 672)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !403, file: !389, line: 351, baseType: !102, size: 64, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !403, file: !389, line: 352, baseType: !102, size: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !403, file: !389, line: 354, baseType: !422, size: 384, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !389, line: 116, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !389, line: 94, size: 384, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !423, file: !389, line: 96, baseType: !122, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !423, file: !389, line: 96, baseType: !122, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !423, file: !389, line: 97, baseType: !122, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !423, file: !389, line: 97, baseType: !122, size: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !423, file: !389, line: 99, baseType: !132, size: 16, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !423, file: !389, line: 100, baseType: !132, size: 16, offset: 144)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !423, file: !389, line: 102, baseType: !132, size: 16, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !423, file: !389, line: 105, baseType: !132, size: 16, offset: 176)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !423, file: !389, line: 108, baseType: !132, size: 16, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !423, file: !389, line: 109, baseType: !132, size: 16, offset: 208)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !423, file: !389, line: 111, baseType: !132, size: 16, offset: 224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !423, file: !389, line: 112, baseType: !132, size: 16, offset: 240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !423, file: !389, line: 114, baseType: !122, size: 32, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !423, file: !389, line: 114, baseType: !122, size: 32, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !423, file: !389, line: 115, baseType: !122, size: 32, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !423, file: !389, line: 115, baseType: !122, size: 32, offset: 352)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !403, file: !389, line: 355, baseType: !227, size: 512, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !355, line: 134, baseType: !102, size: 64, offset: 2368)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !354, file: !355, line: 136, baseType: !444, size: 64, offset: 2432)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !355, line: 58, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !354, file: !355, line: 138, baseType: !422, size: 384, offset: 2496)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !354, file: !355, line: 139, baseType: !448, size: 64, offset: 2880)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !389, line: 80, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !389, line: 72, size: 192, elements: !451)
!451 = !{!452, !459, !460, !461, !462}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !450, file: !389, line: 73, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !389, line: 59, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !389, line: 56, size: 128, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !455, file: !389, line: 57, baseType: !134, size: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !455, file: !389, line: 58, baseType: !122, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !450, file: !389, line: 74, baseType: !122, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !450, file: !389, line: 76, baseType: !122, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !450, file: !389, line: 77, baseType: !122, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !450, file: !389, line: 79, baseType: !122, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !354, file: !355, line: 141, baseType: !250, size: 128, offset: 2944)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !354, file: !355, line: 142, baseType: !250, size: 128, offset: 3072)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !354, file: !355, line: 143, baseType: !250, size: 128, offset: 3200)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !354, file: !355, line: 144, baseType: !250, size: 128, offset: 3328)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !354, file: !355, line: 146, baseType: !122, size: 32, offset: 3456)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !354, file: !355, line: 147, baseType: !122, size: 32, offset: 3488)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !354, file: !355, line: 150, baseType: !470, size: 64, offset: 3520)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !355, line: 50, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !354, file: !355, line: 151, baseType: !186, size: 64, offset: 3584)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !354, file: !355, line: 152, baseType: !122, size: 32, offset: 3648)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !354, file: !355, line: 153, baseType: !122, size: 32, offset: 3680)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !354, file: !355, line: 156, baseType: !134, size: 96, offset: 3712)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !354, file: !355, line: 156, baseType: !134, size: 96, offset: 3808)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !354, file: !355, line: 156, baseType: !134, size: 96, offset: 3904)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !354, file: !355, line: 157, baseType: !134, size: 96, offset: 4000)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !354, file: !355, line: 158, baseType: !134, size: 96, offset: 4096)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !354, file: !355, line: 159, baseType: !134, size: 96, offset: 4192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !354, file: !355, line: 160, baseType: !134, size: 96, offset: 4288)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !354, file: !355, line: 160, baseType: !134, size: 96, offset: 4384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !354, file: !355, line: 161, baseType: !485, size: 128, offset: 4480)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 128, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 4)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !354, file: !355, line: 161, baseType: !485, size: 128, offset: 4608)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !354, file: !355, line: 162, baseType: !134, size: 96, offset: 4736)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !354, file: !355, line: 162, baseType: !134, size: 96, offset: 4832)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !354, file: !355, line: 163, baseType: !135, size: 32, offset: 4928)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !354, file: !355, line: 163, baseType: !135, size: 32, offset: 4960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !354, file: !355, line: 164, baseType: !494, size: 512, offset: 4992)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 512, elements: !495)
!495 = !{!487, !487}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !354, file: !355, line: 165, baseType: !494, size: 512, offset: 5504)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !354, file: !355, line: 166, baseType: !494, size: 512, offset: 6016)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !354, file: !355, line: 167, baseType: !494, size: 512, offset: 6528)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !354, file: !355, line: 176, baseType: !494, size: 512, offset: 7040)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !354, file: !355, line: 178, baseType: !6, size: 32, offset: 7552)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !355, line: 180, baseType: !132, size: 16, offset: 7584)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !354, file: !355, line: 181, baseType: !132, size: 16, offset: 7600)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !354, file: !355, line: 183, baseType: !132, size: 16, offset: 7616)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !354, file: !355, line: 183, baseType: !132, size: 16, offset: 7632)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !354, file: !355, line: 184, baseType: !132, size: 16, offset: 7648)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !354, file: !355, line: 184, baseType: !132, size: 16, offset: 7664)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !354, file: !355, line: 185, baseType: !132, size: 16, offset: 7680)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !354, file: !355, line: 186, baseType: !132, size: 16, offset: 7696)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !354, file: !355, line: 187, baseType: !132, size: 16, offset: 7712)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !354, file: !355, line: 188, baseType: !124, size: 8, offset: 7728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !354, file: !355, line: 189, baseType: !124, size: 8, offset: 7736)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !354, file: !355, line: 192, baseType: !122, size: 32, offset: 7744)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !354, file: !355, line: 192, baseType: !122, size: 32, offset: 7776)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !354, file: !355, line: 192, baseType: !122, size: 32, offset: 7808)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !354, file: !355, line: 192, baseType: !122, size: 32, offset: 7840)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !354, file: !355, line: 194, baseType: !122, size: 32, offset: 7872)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !354, file: !355, line: 202, baseType: !135, size: 32, offset: 7904)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !354, file: !355, line: 202, baseType: !135, size: 32, offset: 7936)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !354, file: !355, line: 202, baseType: !135, size: 32, offset: 7968)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !354, file: !355, line: 211, baseType: !135, size: 32, offset: 8000)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !354, file: !355, line: 212, baseType: !135, size: 32, offset: 8032)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !354, file: !355, line: 213, baseType: !135, size: 32, offset: 8064)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !354, file: !355, line: 214, baseType: !135, size: 32, offset: 8096)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !354, file: !355, line: 215, baseType: !135, size: 32, offset: 8128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !354, file: !355, line: 216, baseType: !135, size: 32, offset: 8160)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !354, file: !355, line: 219, baseType: !135, size: 32, offset: 8192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !354, file: !355, line: 220, baseType: !135, size: 32, offset: 8224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !354, file: !355, line: 221, baseType: !135, size: 32, offset: 8256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !354, file: !355, line: 224, baseType: !530, size: 16, offset: 8288)
!530 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !354, file: !355, line: 224, baseType: !530, size: 16, offset: 8304)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !354, file: !355, line: 226, baseType: !132, size: 16, offset: 8320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !354, file: !355, line: 228, baseType: !124, size: 8, offset: 8336)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !354, file: !355, line: 229, baseType: !124, size: 8, offset: 8344)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !354, file: !355, line: 231, baseType: !132, size: 16, offset: 8352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !354, file: !355, line: 232, baseType: !124, size: 8, offset: 8368)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !354, file: !355, line: 233, baseType: !124, size: 8, offset: 8376)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !354, file: !355, line: 234, baseType: !135, size: 32, offset: 8384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !354, file: !355, line: 235, baseType: !135, size: 32, offset: 8416)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !354, file: !355, line: 237, baseType: !250, size: 128, offset: 8448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !354, file: !355, line: 238, baseType: !250, size: 128, offset: 8576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !354, file: !355, line: 239, baseType: !250, size: 128, offset: 8704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !354, file: !355, line: 240, baseType: !250, size: 128, offset: 8832)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !354, file: !355, line: 242, baseType: !135, size: 32, offset: 8960)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !354, file: !355, line: 244, baseType: !132, size: 16, offset: 8992)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !354, file: !355, line: 245, baseType: !530, size: 16, offset: 9008)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !354, file: !355, line: 246, baseType: !485, size: 128, offset: 9024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !354, file: !355, line: 248, baseType: !122, size: 32, offset: 9152)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !354, file: !355, line: 249, baseType: !122, size: 32, offset: 9184)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !354, file: !355, line: 251, baseType: !551, size: 64, offset: 9216)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !355, line: 251, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !354, file: !355, line: 253, baseType: !124, size: 8, offset: 9280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !354, file: !355, line: 254, baseType: !124, size: 8, offset: 9288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !354, file: !355, line: 255, baseType: !132, size: 16, offset: 9296)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !354, file: !355, line: 256, baseType: !134, size: 96, offset: 9312)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !354, file: !355, line: 258, baseType: !250, size: 128, offset: 9408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !354, file: !355, line: 259, baseType: !250, size: 128, offset: 9536)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !354, file: !355, line: 260, baseType: !250, size: 128, offset: 9664)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !354, file: !355, line: 261, baseType: !250, size: 128, offset: 9792)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !354, file: !355, line: 263, baseType: !562, size: 64, offset: 9920)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !355, line: 52, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !354, file: !355, line: 264, baseType: !565, size: 64, offset: 9984)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !355, line: 53, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !354, file: !355, line: 265, baseType: !568, size: 64, offset: 10048)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !389, line: 46, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !354, file: !355, line: 267, baseType: !124, size: 8, offset: 10112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !354, file: !355, line: 268, baseType: !124, size: 8, offset: 10120)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !354, file: !355, line: 269, baseType: !132, size: 16, offset: 10128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !354, file: !355, line: 270, baseType: !135, size: 32, offset: 10144)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !354, file: !355, line: 272, baseType: !575, size: 64, offset: 10176)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !355, line: 54, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !354, file: !355, line: 275, baseType: !578, size: 64, offset: 10240)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !355, line: 275, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !354, file: !355, line: 277, baseType: !581, size: 64, offset: 10304)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !355, line: 56, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !354, file: !355, line: 277, baseType: !581, size: 64, offset: 10368)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !354, file: !355, line: 278, baseType: !585, size: 64, offset: 10432)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !586, line: 27, baseType: !587)
!586 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !588, line: 45, baseType: !184)
!588 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!589 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !354, file: !355, line: 279, baseType: !585, size: 64, offset: 10496)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !354, file: !355, line: 280, baseType: !6, size: 32, offset: 10560)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !354, file: !355, line: 281, baseType: !6, size: 32, offset: 10592)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !354, file: !355, line: 283, baseType: !250, size: 128, offset: 10624)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !354, file: !355, line: 284, baseType: !250, size: 128, offset: 10752)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !354, file: !355, line: 285, baseType: !595, size: 64, offset: 10880)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !354, file: !355, line: 287, baseType: !597, size: 64, offset: 10944)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !355, line: 59, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !354, file: !355, line: 288, baseType: !600, size: 64, offset: 11008)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !355, line: 288, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !354, file: !355, line: 290, baseType: !603, size: 64, offset: 11072)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 2)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !354, file: !355, line: 291, baseType: !607, size: 64, offset: 11136)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !609, line: 65, baseType: !610)
!609 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !609, line: 50, size: 320, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !610, file: !609, line: 51, baseType: !343, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !610, file: !609, line: 53, baseType: !122, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !610, file: !609, line: 54, baseType: !122, size: 32, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !610, file: !609, line: 55, baseType: !122, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !610, file: !609, line: 55, baseType: !122, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !610, file: !609, line: 56, baseType: !124, size: 8, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !610, file: !609, line: 56, baseType: !124, size: 8, offset: 200)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !610, file: !609, line: 57, baseType: !124, size: 8, offset: 208)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !610, file: !609, line: 57, baseType: !124, size: 8, offset: 216)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !610, file: !609, line: 59, baseType: !132, size: 16, offset: 224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !610, file: !609, line: 59, baseType: !132, size: 16, offset: 240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !610, file: !609, line: 59, baseType: !132, size: 16, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !609, line: 61, baseType: !132, size: 16, offset: 272)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !610, file: !609, line: 63, baseType: !122, size: 32, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !354, file: !355, line: 293, baseType: !250, size: 128, offset: 11200)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !354, file: !355, line: 294, baseType: !628, size: 64, offset: 11328)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !355, line: 113, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !355, line: 108, size: 256, elements: !631)
!631 = !{!632, !634, !635, !636, !637}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !630, file: !355, line: 109, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !630, file: !355, line: 109, baseType: !633, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !630, file: !355, line: 110, baseType: !353, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !355, line: 111, baseType: !122, size: 32, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !630, file: !355, line: 112, baseType: !135, size: 32, offset: 224)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !344, file: !345, line: 1221, baseType: !639, size: 64, offset: 1088)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !345, line: 52, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !344, file: !345, line: 1223, baseType: !343, size: 64, offset: 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !344, file: !345, line: 1225, baseType: !250, size: 128, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !344, file: !345, line: 1226, baseType: !644, size: 64, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !345, line: 69, size: 320, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !645, file: !345, line: 70, baseType: !644, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !645, file: !345, line: 70, baseType: !644, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !645, file: !345, line: 71, baseType: !6, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !645, file: !345, line: 71, baseType: !6, size: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !645, file: !345, line: 72, baseType: !122, size: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !645, file: !345, line: 73, baseType: !132, size: 16, offset: 224)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !645, file: !345, line: 73, baseType: !132, size: 16, offset: 240)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !645, file: !345, line: 74, baseType: !353, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !344, file: !345, line: 1227, baseType: !353, size: 64, offset: 1408)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !344, file: !345, line: 1229, baseType: !134, size: 96, offset: 1472)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !344, file: !345, line: 1230, baseType: !134, size: 96, offset: 1568)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !344, file: !345, line: 1231, baseType: !134, size: 96, offset: 1664)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !344, file: !345, line: 1231, baseType: !134, size: 96, offset: 1760)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !344, file: !345, line: 1233, baseType: !6, size: 32, offset: 1856)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !344, file: !345, line: 1234, baseType: !122, size: 32, offset: 1888)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !344, file: !345, line: 1235, baseType: !6, size: 32, offset: 1920)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !344, file: !345, line: 1237, baseType: !132, size: 16, offset: 1952)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !344, file: !345, line: 1239, baseType: !124, size: 8, offset: 1968)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !344, file: !345, line: 1240, baseType: !666, size: 8, offset: 1976)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 8, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 1)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !344, file: !345, line: 1242, baseType: !670, size: 64, offset: 1984)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !672, line: 328, size: 3456, elements: !673)
!672 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!673 = !{!674, !675, !676, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !706, !707, !708, !711, !716, !717, !720, !724, !728, !732, !733, !734, !735, !736}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !671, file: !672, line: 329, baseType: !303, size: 960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !671, file: !672, line: 330, baseType: !349, size: 64, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !671, file: !672, line: 332, baseType: !677, size: 64, offset: 1024)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !672, line: 332, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !671, file: !672, line: 333, baseType: !227, size: 512, offset: 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !671, file: !672, line: 335, baseType: !272, size: 64, offset: 1600)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !671, file: !672, line: 337, baseType: !444, size: 64, offset: 1664)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !671, file: !672, line: 338, baseType: !603, size: 64, offset: 1728)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !671, file: !672, line: 340, baseType: !250, size: 128, offset: 1792)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !671, file: !672, line: 340, baseType: !250, size: 128, offset: 1920)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !672, line: 342, baseType: !122, size: 32, offset: 2048)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !671, file: !672, line: 342, baseType: !122, size: 32, offset: 2080)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !671, file: !672, line: 343, baseType: !122, size: 32, offset: 2112)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !671, file: !672, line: 345, baseType: !122, size: 32, offset: 2144)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !671, file: !672, line: 346, baseType: !122, size: 32, offset: 2176)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !671, file: !672, line: 347, baseType: !132, size: 16, offset: 2208)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !671, file: !672, line: 348, baseType: !132, size: 16, offset: 2224)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !671, file: !672, line: 349, baseType: !122, size: 32, offset: 2240)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !671, file: !672, line: 351, baseType: !122, size: 32, offset: 2272)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !671, file: !672, line: 353, baseType: !132, size: 16, offset: 2304)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !671, file: !672, line: 354, baseType: !132, size: 16, offset: 2320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !671, file: !672, line: 355, baseType: !122, size: 32, offset: 2336)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !671, file: !672, line: 357, baseType: !698, size: 128, offset: 2368)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !699, line: 95, baseType: !700)
!699 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !699, line: 92, size: 128, elements: !701)
!701 = !{!702, !703, !704, !705}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !700, file: !699, line: 93, baseType: !135, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !700, file: !699, line: 93, baseType: !135, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !700, file: !699, line: 94, baseType: !135, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !700, file: !699, line: 94, baseType: !135, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !671, file: !672, line: 363, baseType: !250, size: 128, offset: 2496)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !671, file: !672, line: 363, baseType: !250, size: 128, offset: 2624)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !671, file: !672, line: 368, baseType: !709, size: 64, offset: 2752)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !672, line: 48, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !671, file: !672, line: 372, baseType: !712, size: 32, offset: 2816)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !672, line: 274, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !672, line: 271, size: 32, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !713, file: !672, line: 273, baseType: !6, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !671, file: !672, line: 373, baseType: !122, size: 32, offset: 2848)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !671, file: !672, line: 382, baseType: !718, size: 64, offset: 2880)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !672, line: 46, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !671, file: !672, line: 385, baseType: !721, size: 64, offset: 2944)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !102, !135}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !671, file: !672, line: 386, baseType: !725, size: 64, offset: 3008)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !102, !186}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !671, file: !672, line: 387, baseType: !729, size: 64, offset: 3072)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!122, !102}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !671, file: !672, line: 388, baseType: !105, size: 64, offset: 3136)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !671, file: !672, line: 389, baseType: !102, size: 64, offset: 3200)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !671, file: !672, line: 389, baseType: !102, size: 64, offset: 3264)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !671, file: !672, line: 389, baseType: !102, size: 64, offset: 3328)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !671, file: !672, line: 389, baseType: !102, size: 64, offset: 3392)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !344, file: !345, line: 1244, baseType: !738, size: 64, offset: 2048)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !740, line: 200, size: 17024, elements: !741)
!740 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!741 = !{!742, !743, !744, !745, !1158, !1159, !1160, !1161, !1162, !1163, !1164}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !739, file: !740, line: 201, baseType: !595, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !739, file: !740, line: 202, baseType: !250, size: 128, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !739, file: !740, line: 203, baseType: !250, size: 128, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !739, file: !740, line: 206, baseType: !746, size: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !740, line: 190, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !740, line: 126, size: 2816, elements: !749)
!749 = !{!750, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !848, !849, !850, !851, !1129, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1157}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !748, file: !740, line: 127, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !748, file: !740, line: 127, baseType: !751, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !748, file: !740, line: 128, baseType: !102, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !748, file: !740, line: 129, baseType: !102, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !748, file: !740, line: 130, baseType: !227, size: 512, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !740, line: 132, baseType: !122, size: 32, offset: 768)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !740, line: 132, baseType: !122, size: 32, offset: 800)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !748, file: !740, line: 133, baseType: !122, size: 32, offset: 832)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !748, file: !740, line: 134, baseType: !122, size: 32, offset: 864)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !748, file: !740, line: 134, baseType: !122, size: 32, offset: 896)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !748, file: !740, line: 134, baseType: !122, size: 32, offset: 928)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !748, file: !740, line: 135, baseType: !122, size: 32, offset: 960)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !748, file: !740, line: 135, baseType: !122, size: 32, offset: 992)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !748, file: !740, line: 136, baseType: !122, size: 32, offset: 1024)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !748, file: !740, line: 136, baseType: !122, size: 32, offset: 1056)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !748, file: !740, line: 137, baseType: !122, size: 32, offset: 1088)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !748, file: !740, line: 137, baseType: !122, size: 32, offset: 1120)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !748, file: !740, line: 138, baseType: !135, size: 32, offset: 1152)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !748, file: !740, line: 139, baseType: !135, size: 32, offset: 1184)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !748, file: !740, line: 139, baseType: !135, size: 32, offset: 1216)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !748, file: !740, line: 141, baseType: !132, size: 16, offset: 1248)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !748, file: !740, line: 142, baseType: !132, size: 16, offset: 1264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !748, file: !740, line: 143, baseType: !122, size: 32, offset: 1280)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !748, file: !740, line: 144, baseType: !122, size: 32, offset: 1312)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !748, file: !740, line: 146, baseType: !776, size: 64, offset: 1344)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !740, line: 114, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !740, line: 99, size: 7232, elements: !779)
!779 = !{!780, !782, !783, !784, !785, !786, !787, !798, !802, !816, !825, !832, !842}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !778, file: !740, line: 100, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !778, file: !740, line: 100, baseType: !781, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !778, file: !740, line: 101, baseType: !122, size: 32, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !778, file: !740, line: 101, baseType: !122, size: 32, offset: 160)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !778, file: !740, line: 102, baseType: !122, size: 32, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !778, file: !740, line: 102, baseType: !122, size: 32, offset: 224)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !778, file: !740, line: 103, baseType: !788, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !740, line: 59, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !740, line: 56, size: 2112, elements: !791)
!791 = !{!792, !796, !797}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !790, file: !740, line: 57, baseType: !793, size: 2048)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 2048, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !790, file: !740, line: 58, baseType: !122, size: 32, offset: 2048)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !790, file: !740, line: 58, baseType: !122, size: 32, offset: 2080)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !778, file: !740, line: 106, baseType: !799, size: 6144, offset: 320)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 6144, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 768)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !778, file: !740, line: 107, baseType: !803, size: 64, offset: 6464)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !740, line: 97, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !740, line: 83, size: 8320, elements: !806)
!806 = !{!807, !808, !809, !812, !813, !814, !815}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !805, file: !740, line: 84, baseType: !799, size: 6144)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !805, file: !740, line: 87, baseType: !793, size: 2048, offset: 6144)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !805, file: !740, line: 88, baseType: !810, size: 64, offset: 8192)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !609, line: 41, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !805, file: !740, line: 90, baseType: !132, size: 16, offset: 8256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !805, file: !740, line: 92, baseType: !132, size: 16, offset: 8272)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !805, file: !740, line: 93, baseType: !132, size: 16, offset: 8288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !805, file: !740, line: 95, baseType: !132, size: 16, offset: 8304)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !778, file: !740, line: 108, baseType: !817, size: 64, offset: 6528)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !740, line: 66, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !740, line: 61, size: 128, elements: !820)
!820 = !{!821, !822, !823, !824}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !819, file: !740, line: 62, baseType: !122, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !819, file: !740, line: 63, baseType: !122, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !819, file: !740, line: 64, baseType: !122, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !819, file: !740, line: 65, baseType: !122, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !778, file: !740, line: 109, baseType: !826, size: 64, offset: 6592)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !740, line: 71, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !740, line: 68, size: 64, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !828, file: !740, line: 69, baseType: !122, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !828, file: !740, line: 70, baseType: !122, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !778, file: !740, line: 110, baseType: !833, size: 64, offset: 6656)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !740, line: 81, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !740, line: 73, size: 352, elements: !836)
!836 = !{!837, !838, !839, !840, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !835, file: !740, line: 74, baseType: !134, size: 96)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !835, file: !740, line: 75, baseType: !134, size: 96, offset: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !835, file: !740, line: 76, baseType: !134, size: 96, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !835, file: !740, line: 77, baseType: !122, size: 32, offset: 288)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !835, file: !740, line: 78, baseType: !122, size: 32, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !778, file: !740, line: 113, baseType: !843, size: 512, offset: 6720)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !844, line: 182, baseType: !845)
!844 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !844, line: 180, size: 512, elements: !846)
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !845, file: !844, line: 181, baseType: !227, size: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !748, file: !740, line: 148, baseType: !374, size: 64, offset: 1408)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !748, file: !740, line: 151, baseType: !343, size: 64, offset: 1472)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !748, file: !740, line: 152, baseType: !353, size: 64, offset: 1536)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !748, file: !740, line: 153, baseType: !852, size: 64, offset: 1600)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !854, line: 64, size: 19136, elements: !855)
!854 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!855 = !{!856, !857, !858, !859, !860, !861, !863, !864, !865, !866, !869, !870, !1115, !1116, !1124, !1125, !1126, !1127, !1128}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !853, file: !854, line: 65, baseType: !303, size: 960)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !853, file: !854, line: 66, baseType: !349, size: 64, offset: 960)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !854, line: 68, baseType: !321, size: 8192, offset: 1024)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !853, file: !854, line: 70, baseType: !122, size: 32, offset: 9216)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !853, file: !854, line: 71, baseType: !122, size: 32, offset: 9248)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !853, file: !854, line: 72, baseType: !862, size: 64, offset: 9280)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64, elements: !604)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !853, file: !854, line: 74, baseType: !135, size: 32, offset: 9344)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !853, file: !854, line: 74, baseType: !135, size: 32, offset: 9376)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !853, file: !854, line: 76, baseType: !810, size: 64, offset: 9408)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !853, file: !854, line: 77, baseType: !867, size: 64, offset: 9472)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !854, line: 77, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !853, file: !854, line: 78, baseType: !444, size: 64, offset: 9536)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !853, file: !854, line: 80, baseType: !871, size: 2624, offset: 9600)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !872, line: 340, size: 2624, elements: !873)
!872 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!873 = !{!874, !902, !920, !921, !922, !937, !995, !996, !1095, !1096, !1097, !1098, !1104}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !871, file: !872, line: 341, baseType: !875, size: 576)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !872, line: 251, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !872, line: 207, size: 576, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !876, file: !872, line: 208, baseType: !122, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !876, file: !872, line: 211, baseType: !132, size: 16, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !876, file: !872, line: 212, baseType: !132, size: 16, offset: 48)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !876, file: !872, line: 213, baseType: !135, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !876, file: !872, line: 214, baseType: !132, size: 16, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !876, file: !872, line: 215, baseType: !132, size: 16, offset: 112)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !876, file: !872, line: 216, baseType: !132, size: 16, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !876, file: !872, line: 217, baseType: !132, size: 16, offset: 144)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !876, file: !872, line: 218, baseType: !132, size: 16, offset: 160)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !876, file: !872, line: 219, baseType: !132, size: 16, offset: 176)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !876, file: !872, line: 220, baseType: !135, size: 32, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !876, file: !872, line: 222, baseType: !132, size: 16, offset: 224)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !876, file: !872, line: 225, baseType: !132, size: 16, offset: 240)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !876, file: !872, line: 228, baseType: !122, size: 32, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !876, file: !872, line: 229, baseType: !122, size: 32, offset: 288)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !876, file: !872, line: 233, baseType: !122, size: 32, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !876, file: !872, line: 236, baseType: !132, size: 16, offset: 352)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !876, file: !872, line: 236, baseType: !132, size: 16, offset: 368)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !876, file: !872, line: 241, baseType: !135, size: 32, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !876, file: !872, line: 244, baseType: !122, size: 32, offset: 416)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !876, file: !872, line: 244, baseType: !122, size: 32, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !876, file: !872, line: 245, baseType: !135, size: 32, offset: 480)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !876, file: !872, line: 248, baseType: !135, size: 32, offset: 512)
