; ModuleID = 'blender/source/blender/blenkernel/intern/tracking_region_tracker.c'
source_filename = "blender/source/blender/blenkernel/intern/tracking_region_tracker.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MovieTrackingContext = type { %struct.MovieClipUser, %struct.MovieClip*, i32, i32, i32, i8, %struct.MovieTrackingSettings, %struct.TracksMap*, i8, i8, i32 }
%struct.MovieClipUser = type { i32, i16, i16 }
%struct.MovieTrackingSettings = type { i32, i16, i16, float, i16, i16, i16, i16, i16, i16, float, i16, i16, i32, i32, i32, i16, i16, float, i32, i32, float, float, i32 }
%struct.TracksMap = type { [64 x i8], i8, i32, i32, i8*, %struct.MovieTrackingTrack*, %struct.GHash*, i32, i32 }
%struct.MovieTrackingTrack = type { %struct.MovieTrackingTrack*, %struct.MovieTrackingTrack*, [64 x i8], [2 x float], [2 x float], [2 x float], [2 x float], [2 x float], i32, i32, %struct.MovieTrackingMarker*, [3 x float], float, i32, i32, i32, [3 x float], i16, i16, i16, i16, i32, float, %struct.bGPdata*, float, float }
%struct.MovieTrackingMarker = type { [2 x float], [4 x [2 x float]], [2 x float], [2 x float], i32, i32 }
%struct.bGPdata = type opaque
%struct.GHash = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !55, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/tracking_region_tracker.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !18, !25, !28, !34, !41, !45, !50}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 380, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!7 = !DIEnumerator(name: "TRACK_HAS_BUNDLE", value: 2, isUnsigned: true)
!8 = !DIEnumerator(name: "TRACK_DISABLE_RED", value: 4, isUnsigned: true)
!9 = !DIEnumerator(name: "TRACK_DISABLE_GREEN", value: 8, isUnsigned: true)
!10 = !DIEnumerator(name: "TRACK_DISABLE_BLUE", value: 16, isUnsigned: true)
!11 = !DIEnumerator(name: "TRACK_HIDDEN", value: 32, isUnsigned: true)
!12 = !DIEnumerator(name: "TRACK_LOCKED", value: 64, isUnsigned: true)
!13 = !DIEnumerator(name: "TRACK_CUSTOMCOLOR", value: 128, isUnsigned: true)
!14 = !DIEnumerator(name: "TRACK_USE_2D_STAB", value: 256, isUnsigned: true)
!15 = !DIEnumerator(name: "TRACK_PREVIEW_GRAYSCALE", value: 512, isUnsigned: true)
!16 = !DIEnumerator(name: "TRACK_DOPE_SEL", value: 1024, isUnsigned: true)
!17 = !DIEnumerator(name: "TRACK_PREVIEW_ALPHA", value: 2048, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 371, baseType: !5, size: 32, elements: !19)
!19 = !{!20, !21, !22, !23, !24}
!20 = !DIEnumerator(name: "MARKER_DISABLED", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "MARKER_TRACKED", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "MARKER_GRAPH_SEL_X", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "MARKER_GRAPH_SEL_Y", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "MARKER_GRAPH_SEL", value: 12, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 473, baseType: !5, size: 32, elements: !26)
!26 = !{!27}
!27 = !DIEnumerator(name: "TRACKING_OBJECT_CAMERA", value: 1, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 145, baseType: !5, size: 32, elements: !30)
!29 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "MCLIP_USE_PROXY", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "MCLIP_USE_PROXY_CUSTOM_DIR", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "MCLIP_TIMECODE_FLAGS", value: 3, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 154, baseType: !5, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40}
!36 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_FULL", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_25", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_50", value: 2, isUnsigned: true)
!39 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_75", value: 3, isUnsigned: true)
!40 = !DIEnumerator(name: "MCLIP_PROXY_RENDER_SIZE_100", value: 4, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 412, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44}
!43 = !DIEnumerator(name: "TRACK_MATCH_KEYFRAME", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TRACK_MATCH_PREVFRAME", value: 1, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 512, baseType: !5, size: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "PLANE_TRACK_HIDDEN", value: 2, isUnsigned: true)
!48 = !DIEnumerator(name: "PLANE_TRACK_LOCKED", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "PLANE_TRACK_AUTOKEY", value: 8, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 405, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "TRACK_ALGORITHM_FLAG_USE_BRUTE", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "TRACK_ALGORITHM_FLAG_USE_NORMALIZATION", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "TRACK_ALGORITHM_FLAG_USE_MASK", value: 8, isUnsigned: true)
!55 = !{!56, !57, !58, !68, !86}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "TrackContext", file: !1, line: 65, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TrackContext", file: !1, line: 54, size: 768, elements: !61)
!61 = !{!62, !80, !82, !83, !84, !85}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "reference_marker", scope: !60, file: !1, line: 56, baseType: !63, size: 512)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !4, line: 106, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !4, line: 81, size: 512, elements: !65)
!65 = !{!66, !71, !75, !76, !77, !79}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !64, file: !4, line: 82, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, elements: !69)
!68 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!69 = !{!70}
!70 = !DISubrange(count: 2)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !64, file: !4, line: 97, baseType: !72, size: 256, offset: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 256, elements: !73)
!73 = !{!74, !70}
!74 = !DISubrange(count: 4)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !64, file: !4, line: 102, baseType: !67, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !64, file: !4, line: 102, baseType: !67, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !64, file: !4, line: 104, baseType: !78, size: 32, offset: 448)
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !64, file: !4, line: 105, baseType: !78, size: 32, offset: 480)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "search_area", scope: !60, file: !1, line: 59, baseType: !81, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "search_area_height", scope: !60, file: !1, line: 60, baseType: !78, size: 32, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "search_area_width", scope: !60, file: !1, line: 61, baseType: !78, size: 32, offset: 608)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !60, file: !1, line: 62, baseType: !78, size: 32, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !60, file: !1, line: 64, baseType: !81, size: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!88 = !{i32 7, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!92 = distinct !DISubprogram(name: "BKE_tracking_context_new", scope: !1, file: !1, line: 97, type: !93, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !503)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !107, !501, !502, !502}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingContext", file: !1, line: 67, size: 960, elements: !97)
!97 = !{!98, !106, !466, !467, !468, !469, !470, !471, !498, !499, !500}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !96, file: !1, line: 68, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClipUser", file: !29, line: 53, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !29, line: 50, size: 64, elements: !101)
!101 = !{!102, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !100, file: !29, line: 51, baseType: !78, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !100, file: !29, line: 52, baseType: !104, size: 16, offset: 32)
!104 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !100, file: !29, line: 52, baseType: !104, size: 16, offset: 48)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !96, file: !1, line: 69, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClip", file: !29, line: 101, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !29, line: 64, size: 19136, elements: !110)
!110 = !{!111, !180, !183, !184, !185, !186, !188, !189, !190, !193, !196, !199, !449, !450, !461, !462, !463, !464, !465}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !29, line: 65, baseType: !112, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !113, line: 130, baseType: !114)
!113 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !113, line: 117, size: 960, elements: !115)
!115 = !{!116, !117, !118, !120, !140, !144, !145, !146, !147, !148}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !113, line: 118, baseType: !57, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !113, line: 118, baseType: !57, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !114, file: !113, line: 119, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !114, file: !113, line: 120, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !113, line: 136, size: 17600, elements: !123)
!123 = !{!124, !125, !127, !130, !135, !136, !137}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !122, file: !113, line: 137, baseType: !112, size: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !122, file: !113, line: 138, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !122, file: !113, line: 139, baseType: !128, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !113, line: 43, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !113, line: 140, baseType: !131, size: 8192, offset: 1088)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8192, elements: !133)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !{!134}
!134 = !DISubrange(count: 1024)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !122, file: !113, line: 141, baseType: !131, size: 8192, offset: 9280)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !122, file: !113, line: 148, baseType: !121, size: 64, offset: 17472)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !122, file: !113, line: 150, baseType: !138, size: 64, offset: 17536)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !113, line: 45, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !113, line: 121, baseType: !141, size: 528, offset: 256)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 528, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 66)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !113, line: 126, baseType: !104, size: 16, offset: 784)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !114, file: !113, line: 127, baseType: !78, size: 32, offset: 800)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !114, file: !113, line: 128, baseType: !78, size: 32, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !114, file: !113, line: 128, baseType: !78, size: 32, offset: 864)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !114, file: !113, line: 129, baseType: !149, size: 64, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !113, line: 75, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !113, line: 62, size: 1024, elements: !152)
!152 = !{!153, !155, !156, !157, !158, !159, !163, !164, !178, !179}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !151, file: !113, line: 63, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !151, file: !113, line: 63, baseType: !154, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !113, line: 64, baseType: !132, size: 8, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !151, file: !113, line: 64, baseType: !132, size: 8, offset: 136)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !151, file: !113, line: 65, baseType: !104, size: 16, offset: 144)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !113, line: 66, baseType: !160, size: 512, offset: 160)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 512, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !151, file: !113, line: 67, baseType: !78, size: 32, offset: 672)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !151, file: !113, line: 69, baseType: !165, size: 256, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !113, line: 60, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !113, line: 48, size: 256, elements: !167)
!167 = !{!168, !169, !176, !177}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !166, file: !113, line: 49, baseType: !57, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !166, file: !113, line: 58, baseType: !170, size: 128, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !171, line: 71, baseType: !172)
!171 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !171, line: 69, size: 128, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !172, file: !171, line: 70, baseType: !57, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !172, file: !171, line: 70, baseType: !57, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !166, file: !113, line: 59, baseType: !78, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !166, file: !113, line: 59, baseType: !78, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !151, file: !113, line: 70, baseType: !78, size: 32, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !151, file: !113, line: 74, baseType: !78, size: 32, offset: 992)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !109, file: !29, line: 66, baseType: !181, size: 64, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !29, line: 43, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !29, line: 68, baseType: !131, size: 8192, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !109, file: !29, line: 70, baseType: !78, size: 32, offset: 9216)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !109, file: !29, line: 71, baseType: !78, size: 32, offset: 9248)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !109, file: !29, line: 72, baseType: !187, size: 64, offset: 9280)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !69)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !109, file: !29, line: 74, baseType: !68, size: 32, offset: 9344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !109, file: !29, line: 74, baseType: !68, size: 32, offset: 9376)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !109, file: !29, line: 76, baseType: !191, size: 64, offset: 9408)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !29, line: 42, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !109, file: !29, line: 77, baseType: !194, size: 64, offset: 9472)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !29, line: 77, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !109, file: !29, line: 78, baseType: !197, size: 64, offset: 9536)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 45, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !109, file: !29, line: 80, baseType: !200, size: 2624, offset: 9600)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !4, line: 340, size: 2624, elements: !201)
!201 = !{!202, !230, !248, !249, !250, !267, !317, !318, !426, !427, !428, !429, !438}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !200, file: !4, line: 341, baseType: !203, size: 576)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !4, line: 251, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !4, line: 207, size: 576, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !204, file: !4, line: 208, baseType: !78, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !204, file: !4, line: 211, baseType: !104, size: 16, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !204, file: !4, line: 212, baseType: !104, size: 16, offset: 48)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !204, file: !4, line: 213, baseType: !68, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !204, file: !4, line: 214, baseType: !104, size: 16, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !204, file: !4, line: 215, baseType: !104, size: 16, offset: 112)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !204, file: !4, line: 216, baseType: !104, size: 16, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !204, file: !4, line: 217, baseType: !104, size: 16, offset: 144)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !204, file: !4, line: 218, baseType: !104, size: 16, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !204, file: !4, line: 219, baseType: !104, size: 16, offset: 176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !204, file: !4, line: 220, baseType: !68, size: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !204, file: !4, line: 222, baseType: !104, size: 16, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !204, file: !4, line: 225, baseType: !104, size: 16, offset: 240)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !204, file: !4, line: 228, baseType: !78, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !204, file: !4, line: 229, baseType: !78, size: 32, offset: 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !204, file: !4, line: 233, baseType: !78, size: 32, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !204, file: !4, line: 236, baseType: !104, size: 16, offset: 352)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !204, file: !4, line: 236, baseType: !104, size: 16, offset: 368)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !204, file: !4, line: 241, baseType: !68, size: 32, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !204, file: !4, line: 244, baseType: !78, size: 32, offset: 416)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !204, file: !4, line: 244, baseType: !78, size: 32, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !204, file: !4, line: 245, baseType: !68, size: 32, offset: 480)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !204, file: !4, line: 248, baseType: !68, size: 32, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !204, file: !4, line: 250, baseType: !78, size: 32, offset: 544)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !200, file: !4, line: 342, baseType: !231, size: 448, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !4, line: 79, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !4, line: 61, size: 448, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !232, file: !4, line: 62, baseType: !57, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !232, file: !4, line: 64, baseType: !104, size: 16, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !232, file: !4, line: 65, baseType: !104, size: 16, offset: 80)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !232, file: !4, line: 67, baseType: !68, size: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !232, file: !4, line: 68, baseType: !68, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !232, file: !4, line: 69, baseType: !68, size: 32, offset: 160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !232, file: !4, line: 70, baseType: !104, size: 16, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !232, file: !4, line: 71, baseType: !104, size: 16, offset: 208)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !232, file: !4, line: 72, baseType: !67, size: 64, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !232, file: !4, line: 75, baseType: !68, size: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !232, file: !4, line: 75, baseType: !68, size: 32, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !232, file: !4, line: 75, baseType: !68, size: 32, offset: 352)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !232, file: !4, line: 78, baseType: !68, size: 32, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !232, file: !4, line: 78, baseType: !68, size: 32, offset: 416)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !200, file: !4, line: 343, baseType: !170, size: 128, offset: 1024)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !200, file: !4, line: 344, baseType: !170, size: 128, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !200, file: !4, line: 345, baseType: !251, size: 192, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !4, line: 278, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !4, line: 270, size: 192, elements: !253)
!253 = !{!254, !255, !256, !257, !258}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !252, file: !4, line: 271, baseType: !78, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !252, file: !4, line: 273, baseType: !68, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !252, file: !4, line: 275, baseType: !78, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !252, file: !4, line: 276, baseType: !78, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !252, file: !4, line: 277, baseType: !259, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !4, line: 55, size: 576, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !260, file: !4, line: 56, baseType: !78, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !260, file: !4, line: 57, baseType: !68, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !260, file: !4, line: 58, baseType: !265, size: 512, offset: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 512, elements: !266)
!266 = !{!74, !74}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !200, file: !4, line: 346, baseType: !268, size: 384, offset: 1472)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !4, line: 268, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !4, line: 253, size: 384, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !311, !312, !313, !314, !315, !316}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !4, line: 254, baseType: !78, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !269, file: !4, line: 255, baseType: !78, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !269, file: !4, line: 255, baseType: !78, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !269, file: !4, line: 258, baseType: !68, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !269, file: !4, line: 259, baseType: !276, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !4, line: 164, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !4, line: 108, size: 1664, elements: !279)
!279 = !{!280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !293, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !4, line: 109, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !278, file: !4, line: 109, baseType: !281, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !278, file: !4, line: 111, baseType: !160, size: 512, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !278, file: !4, line: 119, baseType: !67, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !278, file: !4, line: 119, baseType: !67, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !278, file: !4, line: 125, baseType: !67, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !278, file: !4, line: 125, baseType: !67, size: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !278, file: !4, line: 127, baseType: !67, size: 64, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !278, file: !4, line: 130, baseType: !78, size: 32, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !278, file: !4, line: 131, baseType: !78, size: 32, offset: 992)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !278, file: !4, line: 132, baseType: !292, size: 64, offset: 1024)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !278, file: !4, line: 135, baseType: !294, size: 96, offset: 1088)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 96, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 3)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !278, file: !4, line: 136, baseType: !68, size: 32, offset: 1184)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !4, line: 139, baseType: !78, size: 32, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !278, file: !4, line: 139, baseType: !78, size: 32, offset: 1248)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !278, file: !4, line: 139, baseType: !78, size: 32, offset: 1280)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !278, file: !4, line: 140, baseType: !294, size: 96, offset: 1312)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !278, file: !4, line: 143, baseType: !104, size: 16, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !278, file: !4, line: 144, baseType: !104, size: 16, offset: 1424)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !278, file: !4, line: 145, baseType: !104, size: 16, offset: 1440)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !278, file: !4, line: 148, baseType: !104, size: 16, offset: 1456)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !278, file: !4, line: 149, baseType: !78, size: 32, offset: 1472)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !278, file: !4, line: 150, baseType: !68, size: 32, offset: 1504)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !278, file: !4, line: 152, baseType: !197, size: 64, offset: 1536)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !278, file: !4, line: 163, baseType: !68, size: 32, offset: 1600)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !278, file: !4, line: 163, baseType: !68, size: 32, offset: 1632)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !269, file: !4, line: 261, baseType: !68, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !269, file: !4, line: 261, baseType: !68, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !269, file: !4, line: 261, baseType: !68, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !269, file: !4, line: 263, baseType: !78, size: 32, offset: 288)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !269, file: !4, line: 266, baseType: !78, size: 32, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !269, file: !4, line: 267, baseType: !68, size: 32, offset: 352)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !200, file: !4, line: 347, baseType: !276, size: 64, offset: 1856)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !200, file: !4, line: 348, baseType: !319, size: 64, offset: 1920)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !4, line: 205, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !4, line: 186, size: 1024, elements: !322)
!322 = !{!323, !325, !326, !327, !329, !330, !331, !339, !340, !341, !424, !425}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !4, line: 187, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !321, file: !4, line: 187, baseType: !324, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !321, file: !4, line: 189, baseType: !160, size: 512, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !321, file: !4, line: 191, baseType: !328, size: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !321, file: !4, line: 193, baseType: !78, size: 32, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !321, file: !4, line: 193, baseType: !78, size: 32, offset: 736)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !321, file: !4, line: 195, baseType: !332, size: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !4, line: 184, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !4, line: 166, size: 320, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !334, file: !4, line: 180, baseType: !72, size: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !334, file: !4, line: 182, baseType: !78, size: 32, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !334, file: !4, line: 183, baseType: !78, size: 32, offset: 288)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !321, file: !4, line: 196, baseType: !78, size: 32, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !321, file: !4, line: 198, baseType: !78, size: 32, offset: 864)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !321, file: !4, line: 200, baseType: !342, size: 64, offset: 896)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !344, line: 77, size: 15424, elements: !345)
!344 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!345 = !{!346, !347, !348, !351, !354, !355, !358, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !378, !379, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !405, !406, !407, !413, !414, !418}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !343, file: !344, line: 78, baseType: !112, size: 960)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !343, file: !344, line: 80, baseType: !131, size: 8192, offset: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !343, file: !344, line: 82, baseType: !349, size: 64, offset: 9152)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !344, line: 43, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !343, file: !344, line: 83, baseType: !352, size: 64, offset: 9216)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !113, line: 46, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !343, file: !344, line: 86, baseType: !191, size: 64, offset: 9280)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !343, file: !344, line: 87, baseType: !356, size: 64, offset: 9344)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !344, line: 44, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !343, file: !344, line: 89, baseType: !359, size: 512, offset: 9408)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 512, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !343, file: !344, line: 90, baseType: !104, size: 16, offset: 9920)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !343, file: !344, line: 90, baseType: !104, size: 16, offset: 9936)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !343, file: !344, line: 92, baseType: !104, size: 16, offset: 9952)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !343, file: !344, line: 92, baseType: !104, size: 16, offset: 9968)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !343, file: !344, line: 93, baseType: !104, size: 16, offset: 9984)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !343, file: !344, line: 93, baseType: !104, size: 16, offset: 10000)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !343, file: !344, line: 94, baseType: !78, size: 32, offset: 10016)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !343, file: !344, line: 97, baseType: !104, size: 16, offset: 10048)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !343, file: !344, line: 97, baseType: !104, size: 16, offset: 10064)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !343, file: !344, line: 98, baseType: !104, size: 16, offset: 10080)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !343, file: !344, line: 98, baseType: !104, size: 16, offset: 10096)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !343, file: !344, line: 99, baseType: !104, size: 16, offset: 10112)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !343, file: !344, line: 99, baseType: !104, size: 16, offset: 10128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !343, file: !344, line: 100, baseType: !5, size: 32, offset: 10144)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !343, file: !344, line: 101, baseType: !377, size: 64, offset: 10176)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !343, file: !344, line: 103, baseType: !138, size: 64, offset: 10240)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !343, file: !344, line: 104, baseType: !380, size: 64, offset: 10304)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !113, line: 159, size: 448, elements: !382)
!382 = !{!383, !385, !386, !388, !389, !391}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !381, file: !113, line: 161, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !69)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !381, file: !113, line: 162, baseType: !384, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !381, file: !113, line: 163, baseType: !387, size: 32, offset: 128)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 32, elements: !69)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !381, file: !113, line: 164, baseType: !387, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !381, file: !113, line: 165, baseType: !390, size: 128, offset: 192)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 128, elements: !69)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !381, file: !113, line: 166, baseType: !392, size: 128, offset: 320)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 128, elements: !69)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !343, file: !344, line: 107, baseType: !68, size: 32, offset: 10368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !343, file: !344, line: 108, baseType: !78, size: 32, offset: 10400)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !343, file: !344, line: 109, baseType: !104, size: 16, offset: 10432)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !343, file: !344, line: 110, baseType: !104, size: 16, offset: 10448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !343, file: !344, line: 113, baseType: !78, size: 32, offset: 10464)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !343, file: !344, line: 113, baseType: !78, size: 32, offset: 10496)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !343, file: !344, line: 114, baseType: !132, size: 8, offset: 10528)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !343, file: !344, line: 114, baseType: !132, size: 8, offset: 10536)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !343, file: !344, line: 115, baseType: !104, size: 16, offset: 10544)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !343, file: !344, line: 116, baseType: !403, size: 128, offset: 10560)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 128, elements: !404)
!404 = !{!74}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !343, file: !344, line: 119, baseType: !68, size: 32, offset: 10688)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !343, file: !344, line: 119, baseType: !68, size: 32, offset: 10720)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !343, file: !344, line: 122, baseType: !408, size: 512, offset: 10752)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !409, line: 182, baseType: !410)
!409 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !409, line: 180, size: 512, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !409, line: 181, baseType: !160, size: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !343, file: !344, line: 123, baseType: !132, size: 8, offset: 11264)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !343, file: !344, line: 125, baseType: !415, size: 56, offset: 11272)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 56, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 7)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !343, file: !344, line: 126, baseType: !419, size: 4096, offset: 11328)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 4096, elements: !360)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !344, line: 69, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !344, line: 67, size: 512, elements: !422)
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !421, file: !344, line: 68, baseType: !160, size: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !321, file: !4, line: 201, baseType: !68, size: 32, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !321, file: !4, line: 204, baseType: !78, size: 32, offset: 992)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !200, file: !4, line: 350, baseType: !170, size: 128, offset: 1984)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !200, file: !4, line: 351, baseType: !78, size: 32, offset: 2112)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !200, file: !4, line: 351, baseType: !78, size: 32, offset: 2144)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !200, file: !4, line: 353, baseType: !430, size: 64, offset: 2176)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !4, line: 297, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !4, line: 295, size: 2048, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !432, file: !4, line: 296, baseType: !435, size: 2048)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 2048, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !200, file: !4, line: 355, baseType: !439, size: 384, offset: 2240)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !4, line: 338, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !4, line: 322, size: 384, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !447, !448}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !440, file: !4, line: 323, baseType: !78, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !440, file: !4, line: 325, baseType: !104, size: 16, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !440, file: !4, line: 326, baseType: !104, size: 16, offset: 48)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !440, file: !4, line: 331, baseType: !170, size: 128, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !440, file: !4, line: 334, baseType: !170, size: 128, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !440, file: !4, line: 335, baseType: !78, size: 32, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !440, file: !4, line: 337, baseType: !78, size: 32, offset: 352)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !109, file: !29, line: 81, baseType: !57, size: 64, offset: 12224)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !109, file: !29, line: 85, baseType: !451, size: 6208, offset: 12288)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !29, line: 55, size: 6208, elements: !452)
!452 = !{!453, !457, !458, !459, !460}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !451, file: !29, line: 56, baseType: !454, size: 6144)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 6144, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 768)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !451, file: !29, line: 58, baseType: !104, size: 16, offset: 6144)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !451, file: !29, line: 59, baseType: !104, size: 16, offset: 6160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !451, file: !29, line: 60, baseType: !104, size: 16, offset: 6176)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !451, file: !29, line: 61, baseType: !104, size: 16, offset: 6192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !109, file: !29, line: 86, baseType: !78, size: 32, offset: 18496)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !109, file: !29, line: 88, baseType: !78, size: 32, offset: 18528)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !109, file: !29, line: 90, baseType: !78, size: 32, offset: 18560)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !109, file: !29, line: 94, baseType: !78, size: 32, offset: 18592)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !109, file: !29, line: 100, baseType: !408, size: 512, offset: 18624)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !96, file: !1, line: 70, baseType: !78, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !96, file: !1, line: 72, baseType: !78, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "first_frame", scope: !96, file: !1, line: 72, baseType: !78, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "first_time", scope: !96, file: !1, line: 73, baseType: !87, size: 8, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !96, file: !1, line: 75, baseType: !203, size: 576, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tracks_map", scope: !96, file: !1, line: 76, baseType: !472, size: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "TracksMap", file: !474, line: 64, baseType: !475)
!474 = !DIFile(filename: "blender/source/blender/blenkernel/tracking_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TracksMap", file: !474, line: 48, size: 896, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !483, !484, !488, !489}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "object_name", scope: !475, file: !474, line: 49, baseType: !160, size: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "is_camera", scope: !475, file: !474, line: 50, baseType: !87, size: 8, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "num_tracks", scope: !475, file: !474, line: 52, baseType: !78, size: 32, offset: 544)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_size", scope: !475, file: !474, line: 53, baseType: !78, size: 32, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !475, file: !474, line: 55, baseType: !482, size: 64, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !475, file: !474, line: 56, baseType: !276, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !475, file: !474, line: 58, baseType: !485, size: 64, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !487, line: 47, flags: DIFlagFwdDecl)
!487 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !475, file: !474, line: 60, baseType: !78, size: 32, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "spin_lock", scope: !475, file: !474, line: 63, baseType: !490, size: 32, offset: 864)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpinLock", file: !491, line: 127, baseType: !492)
!491 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_spinlock_t", file: !493, line: 9, baseType: !494)
!493 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !495, line: 26, baseType: !496)
!495 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !497, line: 42, baseType: !5)
!497 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "backwards", scope: !96, file: !1, line: 78, baseType: !87, size: 8, offset: 896)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !96, file: !1, line: 78, baseType: !87, size: 8, offset: 904)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sync_frame", scope: !96, file: !1, line: 79, baseType: !78, size: 32, offset: 928)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!503 = !{}
!504 = !DILocalVariable(name: "clip", arg: 1, scope: !92, file: !1, line: 97, type: !107)
!505 = !DILocation(line: 97, column: 59, scope: !92)
!506 = !DILocalVariable(name: "user", arg: 2, scope: !92, file: !1, line: 97, type: !501)
!507 = !DILocation(line: 97, column: 80, scope: !92)
!508 = !DILocalVariable(name: "backwards", arg: 3, scope: !92, file: !1, line: 98, type: !502)
!509 = !DILocation(line: 98, column: 59, scope: !92)
!510 = !DILocalVariable(name: "sequence", arg: 4, scope: !92, file: !1, line: 98, type: !502)
!511 = !DILocation(line: 98, column: 81, scope: !92)
!512 = !DILocalVariable(name: "context", scope: !92, file: !1, line: 100, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingContext", file: !1, line: 80, baseType: !96)
!515 = !DILocation(line: 100, column: 24, scope: !92)
!516 = !DILocation(line: 100, column: 34, scope: !92)
!517 = !DILocalVariable(name: "tracking", scope: !92, file: !1, line: 101, type: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTracking", file: !4, line: 356, baseType: !200)
!520 = !DILocation(line: 101, column: 17, scope: !92)
!521 = !DILocation(line: 101, column: 29, scope: !92)
!522 = !DILocation(line: 101, column: 35, scope: !92)
!523 = !DILocalVariable(name: "settings", scope: !92, file: !1, line: 102, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!525 = !DILocation(line: 102, column: 25, scope: !92)
!526 = !DILocation(line: 102, column: 37, scope: !92)
!527 = !DILocation(line: 102, column: 47, scope: !92)
!528 = !DILocalVariable(name: "tracksbase", scope: !92, file: !1, line: 103, type: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!530 = !DILocation(line: 103, column: 12, scope: !92)
!531 = !DILocation(line: 103, column: 56, scope: !92)
!532 = !DILocation(line: 103, column: 25, scope: !92)
!533 = !DILocalVariable(name: "track", scope: !92, file: !1, line: 104, type: !276)
!534 = !DILocation(line: 104, column: 22, scope: !92)
!535 = !DILocalVariable(name: "object", scope: !92, file: !1, line: 105, type: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingObject", file: !4, line: 293, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingObject", file: !4, line: 280, size: 1216, elements: !539)
!539 = !{!540, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !4, line: 281, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !538, file: !4, line: 281, baseType: !541, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !538, file: !4, line: 283, baseType: !160, size: 512, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !4, line: 284, baseType: !78, size: 32, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !538, file: !4, line: 285, baseType: !68, size: 32, offset: 672)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !538, file: !4, line: 287, baseType: !170, size: 128, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !538, file: !4, line: 288, baseType: !170, size: 128, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !538, file: !4, line: 289, baseType: !251, size: 192, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !538, file: !4, line: 292, baseType: !78, size: 32, offset: 1152)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !538, file: !4, line: 292, baseType: !78, size: 32, offset: 1184)
!551 = !DILocation(line: 105, column: 23, scope: !92)
!552 = !DILocation(line: 105, column: 63, scope: !92)
!553 = !DILocation(line: 105, column: 32, scope: !92)
!554 = !DILocalVariable(name: "num_tracks", scope: !92, file: !1, line: 106, type: !78)
!555 = !DILocation(line: 106, column: 6, scope: !92)
!556 = !DILocation(line: 108, column: 18, scope: !92)
!557 = !DILocation(line: 108, column: 2, scope: !92)
!558 = !DILocation(line: 108, column: 11, scope: !92)
!559 = !DILocation(line: 108, column: 16, scope: !92)
!560 = !DILocation(line: 109, column: 2, scope: !92)
!561 = !DILocation(line: 109, column: 11, scope: !92)
!562 = !DILocation(line: 109, column: 23, scope: !92)
!563 = !DILocation(line: 109, column: 22, scope: !92)
!564 = !DILocation(line: 110, column: 23, scope: !92)
!565 = !DILocation(line: 110, column: 2, scope: !92)
!566 = !DILocation(line: 110, column: 11, scope: !92)
!567 = !DILocation(line: 110, column: 21, scope: !92)
!568 = !DILocation(line: 111, column: 24, scope: !92)
!569 = !DILocation(line: 111, column: 30, scope: !92)
!570 = !DILocation(line: 111, column: 2, scope: !92)
!571 = !DILocation(line: 111, column: 11, scope: !92)
!572 = !DILocation(line: 111, column: 22, scope: !92)
!573 = !DILocation(line: 112, column: 2, scope: !92)
!574 = !DILocation(line: 112, column: 11, scope: !92)
!575 = !DILocation(line: 112, column: 22, scope: !92)
!576 = !DILocation(line: 113, column: 25, scope: !92)
!577 = !DILocation(line: 113, column: 31, scope: !92)
!578 = !DILocation(line: 113, column: 2, scope: !92)
!579 = !DILocation(line: 113, column: 11, scope: !92)
!580 = !DILocation(line: 113, column: 23, scope: !92)
!581 = !DILocation(line: 114, column: 22, scope: !92)
!582 = !DILocation(line: 114, column: 2, scope: !92)
!583 = !DILocation(line: 114, column: 11, scope: !92)
!584 = !DILocation(line: 114, column: 20, scope: !92)
!585 = !DILocation(line: 117, column: 10, scope: !92)
!586 = !DILocation(line: 117, column: 22, scope: !92)
!587 = !DILocation(line: 117, column: 8, scope: !92)
!588 = !DILocation(line: 118, column: 2, scope: !92)
!589 = !DILocation(line: 118, column: 9, scope: !92)
!590 = !DILocation(line: 119, column: 7, scope: !591)
!591 = distinct !DILexicalBlock(scope: !592, file: !1, line: 119, column: 7)
!592 = distinct !DILexicalBlock(scope: !92, file: !1, line: 118, column: 16)
!593 = !DILocation(line: 119, column: 29, scope: !591)
!594 = !DILocation(line: 119, column: 33, scope: !591)
!595 = !DILocation(line: 119, column: 40, scope: !591)
!596 = !DILocation(line: 119, column: 45, scope: !591)
!597 = !DILocation(line: 119, column: 78, scope: !591)
!598 = !DILocation(line: 119, column: 7, scope: !592)
!599 = !DILocalVariable(name: "framenr", scope: !600, file: !1, line: 120, type: !78)
!600 = distinct !DILexicalBlock(scope: !591, file: !1, line: 119, column: 84)
!601 = !DILocation(line: 120, column: 8, scope: !600)
!602 = !DILocation(line: 120, column: 58, scope: !600)
!603 = !DILocation(line: 120, column: 64, scope: !600)
!604 = !DILocation(line: 120, column: 70, scope: !600)
!605 = !DILocation(line: 120, column: 18, scope: !600)
!606 = !DILocalVariable(name: "marker", scope: !600, file: !1, line: 121, type: !292)
!607 = !DILocation(line: 121, column: 25, scope: !600)
!608 = !DILocation(line: 121, column: 58, scope: !600)
!609 = !DILocation(line: 121, column: 65, scope: !600)
!610 = !DILocation(line: 121, column: 34, scope: !600)
!611 = !DILocation(line: 123, column: 9, scope: !612)
!612 = distinct !DILexicalBlock(scope: !600, file: !1, line: 123, column: 8)
!613 = !DILocation(line: 123, column: 17, scope: !612)
!614 = !DILocation(line: 123, column: 22, scope: !612)
!615 = !DILocation(line: 123, column: 41, scope: !612)
!616 = !DILocation(line: 123, column: 8, scope: !600)
!617 = !DILocation(line: 124, column: 15, scope: !612)
!618 = !DILocation(line: 124, column: 5, scope: !612)
!619 = !DILocation(line: 125, column: 3, scope: !600)
!620 = !DILocation(line: 127, column: 11, scope: !592)
!621 = !DILocation(line: 127, column: 18, scope: !592)
!622 = !DILocation(line: 127, column: 9, scope: !592)
!623 = distinct !{!623, !588, !624}
!624 = !DILocation(line: 128, column: 2, scope: !92)
!625 = !DILocation(line: 131, column: 6, scope: !626)
!626 = distinct !DILexicalBlock(scope: !92, file: !1, line: 131, column: 6)
!627 = !DILocation(line: 131, column: 6, scope: !92)
!628 = !DILocalVariable(name: "width", scope: !629, file: !1, line: 132, type: !78)
!629 = distinct !DILexicalBlock(scope: !626, file: !1, line: 131, column: 18)
!630 = !DILocation(line: 132, column: 7, scope: !629)
!631 = !DILocalVariable(name: "height", scope: !629, file: !1, line: 132, type: !78)
!632 = !DILocation(line: 132, column: 14, scope: !629)
!633 = !DILocation(line: 134, column: 40, scope: !629)
!634 = !DILocation(line: 134, column: 48, scope: !629)
!635 = !DILocation(line: 134, column: 54, scope: !629)
!636 = !DILocation(line: 134, column: 62, scope: !629)
!637 = !DILocation(line: 134, column: 67, scope: !629)
!638 = !DILocation(line: 135, column: 40, scope: !629)
!639 = !DILocation(line: 134, column: 25, scope: !629)
!640 = !DILocation(line: 134, column: 3, scope: !629)
!641 = !DILocation(line: 134, column: 12, scope: !629)
!642 = !DILocation(line: 134, column: 23, scope: !629)
!643 = !DILocation(line: 137, column: 26, scope: !629)
!644 = !DILocation(line: 137, column: 32, scope: !629)
!645 = !DILocation(line: 137, column: 3, scope: !629)
!646 = !DILocation(line: 140, column: 11, scope: !629)
!647 = !DILocation(line: 140, column: 23, scope: !629)
!648 = !DILocation(line: 140, column: 9, scope: !629)
!649 = !DILocation(line: 141, column: 3, scope: !629)
!650 = !DILocation(line: 141, column: 10, scope: !629)
!651 = !DILocation(line: 142, column: 8, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !1, line: 142, column: 8)
!653 = distinct !DILexicalBlock(scope: !629, file: !1, line: 141, column: 17)
!654 = !DILocation(line: 142, column: 30, scope: !652)
!655 = !DILocation(line: 142, column: 34, scope: !652)
!656 = !DILocation(line: 142, column: 41, scope: !652)
!657 = !DILocation(line: 142, column: 46, scope: !652)
!658 = !DILocation(line: 142, column: 79, scope: !652)
!659 = !DILocation(line: 142, column: 8, scope: !653)
!660 = !DILocalVariable(name: "framenr", scope: !661, file: !1, line: 143, type: !78)
!661 = distinct !DILexicalBlock(scope: !652, file: !1, line: 142, column: 85)
!662 = !DILocation(line: 143, column: 9, scope: !661)
!663 = !DILocation(line: 143, column: 59, scope: !661)
!664 = !DILocation(line: 143, column: 65, scope: !661)
!665 = !DILocation(line: 143, column: 71, scope: !661)
!666 = !DILocation(line: 143, column: 19, scope: !661)
!667 = !DILocalVariable(name: "marker", scope: !661, file: !1, line: 144, type: !292)
!668 = !DILocation(line: 144, column: 26, scope: !661)
!669 = !DILocation(line: 144, column: 59, scope: !661)
!670 = !DILocation(line: 144, column: 66, scope: !661)
!671 = !DILocation(line: 144, column: 35, scope: !661)
!672 = !DILocation(line: 146, column: 10, scope: !673)
!673 = distinct !DILexicalBlock(scope: !661, file: !1, line: 146, column: 9)
!674 = !DILocation(line: 146, column: 18, scope: !673)
!675 = !DILocation(line: 146, column: 23, scope: !673)
!676 = !DILocation(line: 146, column: 42, scope: !673)
!677 = !DILocation(line: 146, column: 9, scope: !661)
!678 = !DILocalVariable(name: "track_context", scope: !679, file: !1, line: 147, type: !59)
!679 = distinct !DILexicalBlock(scope: !673, file: !1, line: 146, column: 48)
!680 = !DILocation(line: 147, column: 19, scope: !679)
!681 = !DILocation(line: 148, column: 6, scope: !679)
!682 = !DILocation(line: 149, column: 24, scope: !679)
!683 = !DILocation(line: 149, column: 33, scope: !679)
!684 = !DILocation(line: 149, column: 45, scope: !679)
!685 = !DILocation(line: 149, column: 52, scope: !679)
!686 = !DILocation(line: 149, column: 6, scope: !679)
!687 = !DILocation(line: 150, column: 5, scope: !679)
!688 = !DILocation(line: 151, column: 4, scope: !661)
!689 = !DILocation(line: 153, column: 12, scope: !653)
!690 = !DILocation(line: 153, column: 19, scope: !653)
!691 = !DILocation(line: 153, column: 10, scope: !653)
!692 = distinct !{!692, !649, !693}
!693 = !DILocation(line: 154, column: 3, scope: !629)
!694 = !DILocation(line: 155, column: 2, scope: !629)
!695 = !DILocation(line: 166, column: 23, scope: !92)
!696 = !DILocation(line: 166, column: 29, scope: !92)
!697 = !DILocation(line: 166, column: 34, scope: !92)
!698 = !DILocation(line: 166, column: 2, scope: !92)
!699 = !DILocation(line: 166, column: 11, scope: !92)
!700 = !DILocation(line: 166, column: 21, scope: !92)
!701 = !DILocation(line: 168, column: 2, scope: !92)
!702 = !DILocation(line: 168, column: 11, scope: !92)
!703 = !DILocation(line: 168, column: 19, scope: !92)
!704 = !DILocation(line: 168, column: 18, scope: !92)
!705 = !DILocation(line: 169, column: 2, scope: !92)
!706 = !DILocation(line: 169, column: 11, scope: !92)
!707 = !DILocation(line: 169, column: 16, scope: !92)
!708 = !DILocation(line: 169, column: 28, scope: !92)
!709 = !DILocation(line: 170, column: 2, scope: !92)
!710 = !DILocation(line: 170, column: 11, scope: !92)
!711 = !DILocation(line: 170, column: 16, scope: !92)
!712 = !DILocation(line: 170, column: 28, scope: !92)
!713 = !DILocation(line: 172, column: 7, scope: !714)
!714 = distinct !DILexicalBlock(scope: !92, file: !1, line: 172, column: 6)
!715 = !DILocation(line: 172, column: 6, scope: !92)
!716 = !DILocation(line: 173, column: 3, scope: !714)
!717 = !DILocation(line: 175, column: 9, scope: !92)
!718 = !DILocation(line: 175, column: 2, scope: !92)
!719 = distinct !DISubprogram(name: "BKE_tracking_context_free", scope: !1, file: !1, line: 179, type: !720, scopeLine: 180, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !503)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !513}
!722 = !DILocalVariable(name: "context", arg: 1, scope: !719, file: !1, line: 179, type: !513)
!723 = !DILocation(line: 179, column: 54, scope: !719)
!724 = !DILocation(line: 181, column: 7, scope: !725)
!725 = distinct !DILexicalBlock(scope: !719, file: !1, line: 181, column: 6)
!726 = !DILocation(line: 181, column: 16, scope: !725)
!727 = !DILocation(line: 181, column: 6, scope: !719)
!728 = !DILocation(line: 182, column: 3, scope: !725)
!729 = !DILocation(line: 184, column: 18, scope: !719)
!730 = !DILocation(line: 184, column: 27, scope: !719)
!731 = !DILocation(line: 184, column: 2, scope: !719)
!732 = !DILocation(line: 186, column: 2, scope: !719)
!733 = !DILocation(line: 186, column: 12, scope: !719)
!734 = !DILocation(line: 187, column: 1, scope: !719)
!735 = distinct !DISubprogram(name: "track_context_free", scope: !1, file: !1, line: 82, type: !736, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !503)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !57}
!738 = !DILocalVariable(name: "customdata", arg: 1, scope: !735, file: !1, line: 82, type: !57)
!739 = !DILocation(line: 82, column: 38, scope: !735)
!740 = !DILocalVariable(name: "track_context", scope: !735, file: !1, line: 84, type: !58)
!741 = !DILocation(line: 84, column: 16, scope: !735)
!742 = !DILocation(line: 84, column: 48, scope: !735)
!743 = !DILocation(line: 84, column: 32, scope: !735)
!744 = !DILocation(line: 86, column: 6, scope: !745)
!745 = distinct !DILexicalBlock(scope: !735, file: !1, line: 86, column: 6)
!746 = !DILocation(line: 86, column: 21, scope: !745)
!747 = !DILocation(line: 86, column: 6, scope: !735)
!748 = !DILocation(line: 87, column: 3, scope: !745)
!749 = !DILocation(line: 87, column: 13, scope: !745)
!750 = !DILocation(line: 87, column: 28, scope: !745)
!751 = !DILocation(line: 89, column: 6, scope: !752)
!752 = distinct !DILexicalBlock(scope: !735, file: !1, line: 89, column: 6)
!753 = !DILocation(line: 89, column: 21, scope: !752)
!754 = !DILocation(line: 89, column: 6, scope: !735)
!755 = !DILocation(line: 90, column: 3, scope: !752)
!756 = !DILocation(line: 90, column: 13, scope: !752)
!757 = !DILocation(line: 90, column: 28, scope: !752)
!758 = !DILocation(line: 91, column: 1, scope: !735)
!759 = distinct !DISubprogram(name: "BKE_tracking_context_sync", scope: !1, file: !1, line: 193, type: !720, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !503)
!760 = !DILocalVariable(name: "context", arg: 1, scope: !759, file: !1, line: 193, type: !513)
!761 = !DILocation(line: 193, column: 54, scope: !759)
!762 = !DILocalVariable(name: "tracking", scope: !759, file: !1, line: 195, type: !518)
!763 = !DILocation(line: 195, column: 17, scope: !759)
!764 = !DILocation(line: 195, column: 29, scope: !759)
!765 = !DILocation(line: 195, column: 38, scope: !759)
!766 = !DILocation(line: 195, column: 44, scope: !759)
!767 = !DILocalVariable(name: "newframe", scope: !759, file: !1, line: 196, type: !78)
!768 = !DILocation(line: 196, column: 6, scope: !759)
!769 = !DILocation(line: 198, column: 19, scope: !759)
!770 = !DILocation(line: 198, column: 28, scope: !759)
!771 = !DILocation(line: 198, column: 40, scope: !759)
!772 = !DILocation(line: 198, column: 2, scope: !759)
!773 = !DILocation(line: 200, column: 6, scope: !774)
!774 = distinct !DILexicalBlock(scope: !759, file: !1, line: 200, column: 6)
!775 = !DILocation(line: 200, column: 15, scope: !774)
!776 = !DILocation(line: 200, column: 6, scope: !759)
!777 = !DILocation(line: 201, column: 14, scope: !774)
!778 = !DILocation(line: 201, column: 23, scope: !774)
!779 = !DILocation(line: 201, column: 28, scope: !774)
!780 = !DILocation(line: 201, column: 36, scope: !774)
!781 = !DILocation(line: 201, column: 12, scope: !774)
!782 = !DILocation(line: 201, column: 3, scope: !774)
!783 = !DILocation(line: 203, column: 14, scope: !774)
!784 = !DILocation(line: 203, column: 23, scope: !774)
!785 = !DILocation(line: 203, column: 28, scope: !774)
!786 = !DILocation(line: 203, column: 36, scope: !774)
!787 = !DILocation(line: 203, column: 12, scope: !774)
!788 = !DILocation(line: 205, column: 24, scope: !759)
!789 = !DILocation(line: 205, column: 2, scope: !759)
!790 = !DILocation(line: 205, column: 11, scope: !759)
!791 = !DILocation(line: 205, column: 22, scope: !759)
!792 = !DILocation(line: 207, column: 36, scope: !759)
!793 = !DILocation(line: 207, column: 2, scope: !759)
!794 = !DILocation(line: 208, column: 1, scope: !759)
!795 = distinct !DISubprogram(name: "BKE_tracking_context_sync_user", scope: !1, file: !1, line: 213, type: !796, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !503)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !798, !501}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!800 = !DILocalVariable(name: "context", arg: 1, scope: !795, file: !1, line: 213, type: !798)
!801 = !DILocation(line: 213, column: 65, scope: !795)
!802 = !DILocalVariable(name: "user", arg: 2, scope: !795, file: !1, line: 213, type: !501)
!803 = !DILocation(line: 213, column: 89, scope: !795)
!804 = !DILocation(line: 215, column: 18, scope: !795)
!805 = !DILocation(line: 215, column: 27, scope: !795)
!806 = !DILocation(line: 215, column: 2, scope: !795)
!807 = !DILocation(line: 215, column: 8, scope: !795)
!808 = !DILocation(line: 215, column: 16, scope: !795)
!809 = !DILocation(line: 216, column: 1, scope: !795)
!810 = distinct !DISubprogram(name: "BKE_tracking_context_step", scope: !1, file: !1, line: 607, type: !811, scopeLine: 608, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !503)
!811 = !DISubroutineType(types: !812)
!812 = !{!87, !513}
!813 = !DILocalVariable(name: "context", arg: 1, scope: !810, file: !1, line: 607, type: !513)
!814 = !DILocation(line: 607, column: 54, scope: !810)
!815 = !DILocalVariable(name: "destination_ibuf", scope: !810, file: !1, line: 609, type: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !818, line: 141, baseType: !819)
!818 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !818, line: 70, size: 19840, elements: !820)
!820 = !{!821, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !835, !836, !837, !838, !839, !841, !843, !844, !845, !849, !850, !851, !852, !853, !856, !857, !858, !859, !860, !863, !864, !865, !866, !867, !870, !871, !872, !875, !876, !885}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !819, file: !818, line: 71, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !819, file: !818, line: 71, baseType: !822, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !819, file: !818, line: 74, baseType: !78, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !819, file: !818, line: 74, baseType: !78, size: 32, offset: 160)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !819, file: !818, line: 79, baseType: !87, size: 8, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !819, file: !818, line: 80, baseType: !78, size: 32, offset: 224)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !819, file: !818, line: 83, baseType: !78, size: 32, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !819, file: !818, line: 84, baseType: !78, size: 32, offset: 288)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !819, file: !818, line: 87, baseType: !377, size: 64, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !819, file: !818, line: 88, baseType: !81, size: 64, offset: 384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !819, file: !818, line: 93, baseType: !833, size: 128, offset: 448)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 128, elements: !69)
!834 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !819, file: !818, line: 96, baseType: !78, size: 32, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !819, file: !818, line: 96, baseType: !78, size: 32, offset: 608)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !819, file: !818, line: 97, baseType: !78, size: 32, offset: 640)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !819, file: !818, line: 97, baseType: !78, size: 32, offset: 672)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !819, file: !818, line: 98, baseType: !840, size: 64, offset: 704)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !819, file: !818, line: 101, baseType: !842, size: 64, offset: 768)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !819, file: !818, line: 102, baseType: !81, size: 64, offset: 832)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !819, file: !818, line: 105, baseType: !68, size: 32, offset: 896)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !819, file: !818, line: 108, baseType: !846, size: 1280, offset: 960)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 1280, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 20)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !819, file: !818, line: 109, baseType: !78, size: 32, offset: 2240)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !819, file: !818, line: 109, baseType: !78, size: 32, offset: 2272)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !819, file: !818, line: 112, baseType: !78, size: 32, offset: 2304)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !819, file: !818, line: 113, baseType: !78, size: 32, offset: 2336)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !819, file: !818, line: 114, baseType: !854, size: 64, offset: 2368)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !818, line: 50, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !819, file: !818, line: 115, baseType: !57, size: 64, offset: 2432)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !819, file: !818, line: 118, baseType: !78, size: 32, offset: 2496)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !818, line: 119, baseType: !131, size: 8192, offset: 2528)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !819, file: !818, line: 120, baseType: !131, size: 8192, offset: 10720)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !819, file: !818, line: 123, baseType: !861, size: 64, offset: 18944)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !818, line: 123, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !819, file: !818, line: 124, baseType: !78, size: 32, offset: 19008)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !819, file: !818, line: 127, baseType: !86, size: 64, offset: 19072)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !819, file: !818, line: 128, baseType: !5, size: 32, offset: 19136)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !819, file: !818, line: 129, baseType: !5, size: 32, offset: 19168)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !819, file: !818, line: 132, baseType: !868, size: 64, offset: 19200)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !818, line: 132, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !819, file: !818, line: 133, baseType: !868, size: 64, offset: 19264)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !819, file: !818, line: 134, baseType: !377, size: 64, offset: 19328)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !819, file: !818, line: 135, baseType: !873, size: 64, offset: 19392)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !818, line: 135, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !819, file: !818, line: 136, baseType: !78, size: 32, offset: 19456)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !819, file: !818, line: 137, baseType: !877, size: 128, offset: 19488)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !878, line: 89, baseType: !879)
!878 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !878, line: 86, size: 128, elements: !880)
!880 = !{!881, !882, !883, !884}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !879, file: !878, line: 87, baseType: !78, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !879, file: !878, line: 87, baseType: !78, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !879, file: !878, line: 88, baseType: !78, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !879, file: !878, line: 88, baseType: !78, size: 32, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !819, file: !818, line: 140, baseType: !886, size: 192, offset: 19648)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !818, line: 55, size: 192, elements: !887)
!887 = !{!888, !889, !890, !891}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !886, file: !818, line: 56, baseType: !5, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !886, file: !818, line: 57, baseType: !5, size: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !886, file: !818, line: 58, baseType: !86, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !886, file: !818, line: 59, baseType: !5, size: 32, offset: 128)
!892 = !DILocation(line: 609, column: 9, scope: !810)
!893 = !DILocalVariable(name: "frame_delta", scope: !810, file: !1, line: 610, type: !78)
!894 = !DILocation(line: 610, column: 6, scope: !810)
!895 = !DILocation(line: 610, column: 20, scope: !810)
!896 = !DILocation(line: 610, column: 29, scope: !810)
!897 = !DILocalVariable(name: "curfra", scope: !810, file: !1, line: 611, type: !78)
!898 = !DILocation(line: 611, column: 6, scope: !810)
!899 = !DILocation(line: 611, column: 56, scope: !810)
!900 = !DILocation(line: 611, column: 65, scope: !810)
!901 = !DILocation(line: 611, column: 71, scope: !810)
!902 = !DILocation(line: 611, column: 80, scope: !810)
!903 = !DILocation(line: 611, column: 85, scope: !810)
!904 = !DILocation(line: 611, column: 16, scope: !810)
!905 = !DILocalVariable(name: "a", scope: !810, file: !1, line: 612, type: !78)
!906 = !DILocation(line: 612, column: 6, scope: !810)
!907 = !DILocalVariable(name: "map_size", scope: !810, file: !1, line: 612, type: !78)
!908 = !DILocation(line: 612, column: 9, scope: !810)
!909 = !DILocalVariable(name: "ok", scope: !810, file: !1, line: 613, type: !87)
!910 = !DILocation(line: 613, column: 7, scope: !810)
!911 = !DILocalVariable(name: "frame_width", scope: !810, file: !1, line: 615, type: !78)
!912 = !DILocation(line: 615, column: 6, scope: !810)
!913 = !DILocalVariable(name: "frame_height", scope: !810, file: !1, line: 615, type: !78)
!914 = !DILocation(line: 615, column: 19, scope: !810)
!915 = !DILocation(line: 617, column: 33, scope: !810)
!916 = !DILocation(line: 617, column: 42, scope: !810)
!917 = !DILocation(line: 617, column: 13, scope: !810)
!918 = !DILocation(line: 617, column: 11, scope: !810)
!919 = !DILocation(line: 620, column: 7, scope: !920)
!920 = distinct !DILexicalBlock(scope: !810, file: !1, line: 620, column: 6)
!921 = !DILocation(line: 620, column: 6, scope: !810)
!922 = !DILocation(line: 621, column: 3, scope: !920)
!923 = !DILocation(line: 624, column: 27, scope: !810)
!924 = !DILocation(line: 624, column: 2, scope: !810)
!925 = !DILocation(line: 624, column: 11, scope: !810)
!926 = !DILocation(line: 624, column: 16, scope: !810)
!927 = !DILocation(line: 624, column: 24, scope: !810)
!928 = !DILocation(line: 626, column: 49, scope: !810)
!929 = !DILocation(line: 626, column: 58, scope: !810)
!930 = !DILocation(line: 626, column: 65, scope: !810)
!931 = !DILocation(line: 626, column: 74, scope: !810)
!932 = !DILocation(line: 627, column: 49, scope: !810)
!933 = !DILocation(line: 627, column: 58, scope: !810)
!934 = !DILocation(line: 626, column: 21, scope: !810)
!935 = !DILocation(line: 626, column: 19, scope: !810)
!936 = !DILocation(line: 628, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !810, file: !1, line: 628, column: 6)
!938 = !DILocation(line: 628, column: 6, scope: !810)
!939 = !DILocation(line: 629, column: 3, scope: !937)
!940 = !DILocation(line: 631, column: 16, scope: !810)
!941 = !DILocation(line: 631, column: 34, scope: !810)
!942 = !DILocation(line: 631, column: 14, scope: !810)
!943 = !DILocation(line: 632, column: 17, scope: !810)
!944 = !DILocation(line: 632, column: 35, scope: !810)
!945 = !DILocation(line: 632, column: 15, scope: !810)
!946 = !DILocation(line: 637, column: 9, scope: !947)
!947 = distinct !DILexicalBlock(scope: !810, file: !1, line: 637, column: 2)
!948 = !DILocation(line: 637, column: 7, scope: !947)
!949 = !DILocation(line: 637, column: 14, scope: !950)
!950 = distinct !DILexicalBlock(scope: !947, file: !1, line: 637, column: 2)
!951 = !DILocation(line: 637, column: 18, scope: !950)
!952 = !DILocation(line: 637, column: 16, scope: !950)
!953 = !DILocation(line: 637, column: 2, scope: !947)
!954 = !DILocalVariable(name: "track_context", scope: !955, file: !1, line: 638, type: !58)
!955 = distinct !DILexicalBlock(scope: !950, file: !1, line: 637, column: 33)
!956 = !DILocation(line: 638, column: 17, scope: !955)
!957 = !DILocalVariable(name: "track", scope: !955, file: !1, line: 639, type: !276)
!958 = !DILocation(line: 639, column: 23, scope: !955)
!959 = !DILocalVariable(name: "marker", scope: !955, file: !1, line: 640, type: !292)
!960 = !DILocation(line: 640, column: 24, scope: !955)
!961 = !DILocation(line: 642, column: 34, scope: !955)
!962 = !DILocation(line: 642, column: 43, scope: !955)
!963 = !DILocation(line: 642, column: 55, scope: !955)
!964 = !DILocation(line: 642, column: 66, scope: !955)
!965 = !DILocation(line: 642, column: 3, scope: !955)
!966 = !DILocation(line: 644, column: 42, scope: !955)
!967 = !DILocation(line: 644, column: 49, scope: !955)
!968 = !DILocation(line: 644, column: 12, scope: !955)
!969 = !DILocation(line: 644, column: 10, scope: !955)
!970 = !DILocation(line: 646, column: 7, scope: !971)
!971 = distinct !DILexicalBlock(scope: !955, file: !1, line: 646, column: 7)
!972 = !DILocation(line: 646, column: 14, scope: !971)
!973 = !DILocation(line: 646, column: 18, scope: !971)
!974 = !DILocation(line: 646, column: 26, scope: !971)
!975 = !DILocation(line: 646, column: 31, scope: !971)
!976 = !DILocation(line: 646, column: 50, scope: !971)
!977 = !DILocation(line: 646, column: 7, scope: !955)
!978 = !DILocalVariable(name: "tracked", scope: !979, file: !1, line: 647, type: !87)
!979 = distinct !DILexicalBlock(scope: !971, file: !1, line: 646, column: 56)
!980 = !DILocation(line: 647, column: 9, scope: !979)
!981 = !DILocalVariable(name: "need_readjust", scope: !979, file: !1, line: 647, type: !87)
!982 = !DILocation(line: 647, column: 26, scope: !979)
!983 = !DILocalVariable(name: "dst_pixel_x", scope: !979, file: !1, line: 648, type: !984)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 320, elements: !985)
!985 = !{!986}
!986 = !DISubrange(count: 5)
!987 = !DILocation(line: 648, column: 11, scope: !979)
!988 = !DILocalVariable(name: "dst_pixel_y", scope: !979, file: !1, line: 648, type: !984)
!989 = !DILocation(line: 648, column: 27, scope: !979)
!990 = !DILocation(line: 650, column: 8, scope: !991)
!991 = distinct !DILexicalBlock(scope: !979, file: !1, line: 650, column: 8)
!992 = !DILocation(line: 650, column: 15, scope: !991)
!993 = !DILocation(line: 650, column: 29, scope: !991)
!994 = !DILocation(line: 650, column: 8, scope: !979)
!995 = !DILocation(line: 651, column: 21, scope: !991)
!996 = !DILocation(line: 651, column: 30, scope: !991)
!997 = !DILocation(line: 651, column: 19, scope: !991)
!998 = !DILocation(line: 651, column: 5, scope: !991)
!999 = !DILocation(line: 653, column: 19, scope: !991)
!1000 = !DILocation(line: 656, column: 37, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !979, file: !1, line: 656, column: 8)
!1002 = !DILocation(line: 656, column: 44, scope: !1001)
!1003 = !DILocation(line: 656, column: 52, scope: !1001)
!1004 = !DILocation(line: 656, column: 65, scope: !1001)
!1005 = !DILocation(line: 656, column: 8, scope: !1001)
!1006 = !DILocation(line: 656, column: 8, scope: !979)
!1007 = !DILocation(line: 657, column: 9, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !1, line: 657, column: 9)
!1009 = distinct !DILexicalBlock(scope: !1001, file: !1, line: 656, column: 80)
!1010 = !DILocation(line: 657, column: 9, scope: !1009)
!1011 = !DILocation(line: 658, column: 41, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !1, line: 658, column: 10)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !1, line: 657, column: 24)
!1014 = !DILocation(line: 658, column: 50, scope: !1012)
!1015 = !DILocation(line: 658, column: 65, scope: !1012)
!1016 = !DILocation(line: 658, column: 72, scope: !1012)
!1017 = !DILocation(line: 659, column: 41, scope: !1012)
!1018 = !DILocation(line: 659, column: 49, scope: !1012)
!1019 = !DILocation(line: 659, column: 62, scope: !1012)
!1020 = !DILocation(line: 658, column: 10, scope: !1012)
!1021 = !DILocation(line: 659, column: 76, scope: !1012)
!1022 = !DILocation(line: 658, column: 10, scope: !1013)
!1023 = !DILocation(line: 662, column: 7, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1012, file: !1, line: 660, column: 6)
!1025 = !DILocation(line: 664, column: 5, scope: !1013)
!1026 = !DILocation(line: 666, column: 41, scope: !1009)
!1027 = !DILocation(line: 666, column: 59, scope: !1009)
!1028 = !DILocation(line: 667, column: 42, scope: !1009)
!1029 = !DILocation(line: 667, column: 57, scope: !1009)
!1030 = !DILocation(line: 667, column: 75, scope: !1009)
!1031 = !DILocation(line: 668, column: 41, scope: !1009)
!1032 = !DILocation(line: 668, column: 56, scope: !1009)
!1033 = !DILocation(line: 669, column: 41, scope: !1009)
!1034 = !DILocation(line: 669, column: 56, scope: !1009)
!1035 = !DILocation(line: 670, column: 41, scope: !1009)
!1036 = !DILocation(line: 670, column: 56, scope: !1009)
!1037 = !DILocation(line: 671, column: 41, scope: !1009)
!1038 = !DILocation(line: 671, column: 56, scope: !1009)
!1039 = !DILocation(line: 672, column: 41, scope: !1009)
!1040 = !DILocation(line: 672, column: 54, scope: !1009)
!1041 = !DILocation(line: 666, column: 15, scope: !1009)
!1042 = !DILocation(line: 666, column: 13, scope: !1009)
!1043 = !DILocation(line: 673, column: 4, scope: !1009)
!1044 = !DILocation(line: 675, column: 19, scope: !979)
!1045 = !DILocation(line: 675, column: 28, scope: !979)
!1046 = !DILocation(line: 675, column: 40, scope: !979)
!1047 = !DILocation(line: 675, column: 4, scope: !979)
!1048 = !DILocation(line: 676, column: 31, scope: !979)
!1049 = !DILocation(line: 676, column: 40, scope: !979)
!1050 = !DILocation(line: 676, column: 47, scope: !979)
!1051 = !DILocation(line: 676, column: 55, scope: !979)
!1052 = !DILocation(line: 676, column: 63, scope: !979)
!1053 = !DILocation(line: 677, column: 31, scope: !979)
!1054 = !DILocation(line: 677, column: 44, scope: !979)
!1055 = !DILocation(line: 677, column: 58, scope: !979)
!1056 = !DILocation(line: 677, column: 71, scope: !979)
!1057 = !DILocation(line: 676, column: 4, scope: !979)
!1058 = !DILocation(line: 678, column: 21, scope: !979)
!1059 = !DILocation(line: 678, column: 30, scope: !979)
!1060 = !DILocation(line: 678, column: 42, scope: !979)
!1061 = !DILocation(line: 678, column: 4, scope: !979)
!1062 = !DILocation(line: 680, column: 7, scope: !979)
!1063 = !DILocation(line: 681, column: 3, scope: !979)
!1064 = !DILocation(line: 682, column: 2, scope: !955)
!1065 = !DILocation(line: 637, column: 29, scope: !950)
!1066 = !DILocation(line: 637, column: 2, scope: !950)
!1067 = distinct !{!1067, !953, !1068}
!1068 = !DILocation(line: 682, column: 2, scope: !947)
!1069 = !DILocation(line: 684, column: 16, scope: !810)
!1070 = !DILocation(line: 684, column: 2, scope: !810)
!1071 = !DILocation(line: 686, column: 2, scope: !810)
!1072 = !DILocation(line: 686, column: 11, scope: !810)
!1073 = !DILocation(line: 686, column: 22, scope: !810)
!1074 = !DILocation(line: 687, column: 2, scope: !810)
!1075 = !DILocation(line: 687, column: 11, scope: !810)
!1076 = !DILocation(line: 687, column: 17, scope: !810)
!1077 = !DILocation(line: 689, column: 9, scope: !810)
!1078 = !DILocation(line: 689, column: 2, scope: !810)
!1079 = !DILocation(line: 690, column: 1, scope: !810)
!1080 = distinct !DISubprogram(name: "tracking_check_marker_margin", scope: !1, file: !1, line: 446, type: !1081, scopeLine: 448, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !503)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!87, !276, !292, !78, !78}
!1083 = !DILocalVariable(name: "track", arg: 1, scope: !1080, file: !1, line: 446, type: !276)
!1084 = !DILocation(line: 446, column: 62, scope: !1080)
!1085 = !DILocalVariable(name: "marker", arg: 2, scope: !1080, file: !1, line: 446, type: !292)
!1086 = !DILocation(line: 446, column: 90, scope: !1080)
!1087 = !DILocalVariable(name: "frame_width", arg: 3, scope: !1080, file: !1, line: 447, type: !78)
!1088 = !DILocation(line: 447, column: 46, scope: !1080)
!1089 = !DILocalVariable(name: "frame_height", arg: 4, scope: !1080, file: !1, line: 447, type: !78)
!1090 = !DILocation(line: 447, column: 63, scope: !1080)
!1091 = !DILocalVariable(name: "pat_min", scope: !1080, file: !1, line: 449, type: !67)
!1092 = !DILocation(line: 449, column: 8, scope: !1080)
!1093 = !DILocalVariable(name: "pat_max", scope: !1080, file: !1, line: 449, type: !67)
!1094 = !DILocation(line: 449, column: 20, scope: !1080)
!1095 = !DILocalVariable(name: "margin_left", scope: !1080, file: !1, line: 450, type: !68)
!1096 = !DILocation(line: 450, column: 8, scope: !1080)
!1097 = !DILocalVariable(name: "margin_top", scope: !1080, file: !1, line: 450, type: !68)
!1098 = !DILocation(line: 450, column: 21, scope: !1080)
!1099 = !DILocalVariable(name: "margin_right", scope: !1080, file: !1, line: 450, type: !68)
!1100 = !DILocation(line: 450, column: 33, scope: !1080)
!1101 = !DILocalVariable(name: "margin_bottom", scope: !1080, file: !1, line: 450, type: !68)
!1102 = !DILocation(line: 450, column: 47, scope: !1080)
!1103 = !DILocalVariable(name: "normalized_track_margin", scope: !1080, file: !1, line: 451, type: !67)
!1104 = !DILocation(line: 451, column: 8, scope: !1080)
!1105 = !DILocation(line: 454, column: 37, scope: !1080)
!1106 = !DILocation(line: 454, column: 45, scope: !1080)
!1107 = !DILocation(line: 454, column: 54, scope: !1080)
!1108 = !DILocation(line: 454, column: 2, scope: !1080)
!1109 = !DILocation(line: 456, column: 38, scope: !1080)
!1110 = !DILocation(line: 456, column: 45, scope: !1080)
!1111 = !DILocation(line: 456, column: 31, scope: !1080)
!1112 = !DILocation(line: 456, column: 54, scope: !1080)
!1113 = !DILocation(line: 456, column: 52, scope: !1080)
!1114 = !DILocation(line: 456, column: 2, scope: !1080)
!1115 = !DILocation(line: 456, column: 29, scope: !1080)
