; ModuleID = 'blender/source/blender/editors/uvedit/uvedit_unwrap_ops.c'
source_filename = "blender/source/blender/editors/uvedit/uvedit_unwrap_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque

!411 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_subsurf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!412 = !{!413, !414, !415, !416, !417}
!413 = !DIEnumerator(name: "SUBSURF_USE_RENDER_PARAMS", value: 1, isUnsigned: true)
!414 = !DIEnumerator(name: "SUBSURF_IS_FINAL_CALC", value: 2, isUnsigned: true)
!415 = !DIEnumerator(name: "SUBSURF_FOR_EDIT_MODE", value: 4, isUnsigned: true)
!416 = !DIEnumerator(name: "SUBSURF_IN_EDIT_MODE", value: 8, isUnsigned: true)
!417 = !DIEnumerator(name: "SUBSURF_ALLOC_PAINT_MASK", value: 16, isUnsigned: true)
!418 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 249, baseType: !7, size: 32, elements: !419)
!419 = !{!420, !421, !422, !423}
!420 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!421 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!422 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!423 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !425, line: 115, baseType: !7, size: 32, elements: !426)
!425 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!426 = !{!427, !428, !429}
!427 = !DIEnumerator(name: "MLOOPUV_EDGESEL", value: 1, isUnsigned: true)
!428 = !DIEnumerator(name: "MLOOPUV_VERTSEL", value: 2, isUnsigned: true)
!429 = !DIEnumerator(name: "MLOOPUV_PINNED", value: 4, isUnsigned: true)
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !121, line: 67, baseType: !7, size: 32, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440}
!432 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!433 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!434 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!435 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!436 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!437 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!438 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!439 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!440 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!441 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !442, line: 1163, baseType: !7, size: 32, elements: !443)
!442 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!444 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!445 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!446 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!447 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!448 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!449 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!450 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!451 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!452 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!453 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!454 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!455 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!456 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!457 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!458 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!459 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!460 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!461 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!462 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!463 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!464 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!465 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!466 = !{!467, !468, !469, !473, !477, !543, !545, !527, !547, !2503, !763, !2507, !500, !2598}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !130, line: 79, baseType: !129)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !130, line: 158, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !467}
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !130, line: 159, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!467, !467}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !147, line: 103, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !147, line: 90, size: 448, elements: !480)
!480 = !{!481, !492, !498, !503, !504}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !479, file: !147, line: 91, baseType: !482, size: 128)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !147, line: 82, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !147, line: 64, size: 128, elements: !484)
!484 = !{!485, !486, !488, !490, !491}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !483, file: !147, line: 65, baseType: !467, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !483, file: !147, line: 66, baseType: !487, size: 32, offset: 64)
!487 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !483, file: !147, line: 73, baseType: !489, size: 8, offset: 96)
!489 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !483, file: !147, line: 74, baseType: !489, size: 8, offset: 104)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !483, file: !147, line: 80, baseType: !489, size: 8, offset: 112)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !479, file: !147, line: 92, baseType: !493, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !147, line: 180, size: 16, elements: !495)
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !494, file: !147, line: 181, baseType: !497, size: 16)
!497 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !479, file: !147, line: 94, baseType: !499, size: 96, offset: 192)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 96, elements: !501)
!500 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!501 = !{!502}
!502 = !DISubrange(count: 3)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !479, file: !147, line: 95, baseType: !499, size: 96, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !479, file: !147, line: 102, baseType: !505, size: 64, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !147, line: 110, size: 640, elements: !507)
!507 = !{!508, !509, !510, !512, !513, !536, !542}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !506, file: !147, line: 111, baseType: !482, size: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !506, file: !147, line: 112, baseType: !493, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !506, file: !147, line: 114, baseType: !511, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !506, file: !147, line: 114, baseType: !511, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !506, file: !147, line: 118, baseType: !514, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !147, line: 125, size: 576, elements: !516)
!516 = !{!517, !518, !519, !520, !532, !533, !534, !535}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !515, file: !147, line: 126, baseType: !482, size: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !515, file: !147, line: 129, baseType: !511, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !515, file: !147, line: 130, baseType: !505, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !515, file: !147, line: 131, baseType: !521, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !147, line: 164, size: 448, elements: !523)
!523 = !{!524, !525, !526, !529, !530, !531}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !522, file: !147, line: 165, baseType: !482, size: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !522, file: !147, line: 166, baseType: !493, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !522, file: !147, line: 172, baseType: !527, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !147, line: 140, baseType: !515)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !522, file: !147, line: 174, baseType: !487, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !522, file: !147, line: 175, baseType: !499, size: 96, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !522, file: !147, line: 176, baseType: !497, size: 16, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !515, file: !147, line: 135, baseType: !514, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !515, file: !147, line: 135, baseType: !514, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !515, file: !147, line: 139, baseType: !514, size: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !515, file: !147, line: 139, baseType: !514, size: 64, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !506, file: !147, line: 122, baseType: !537, size: 128, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !147, line: 108, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !147, line: 106, size: 128, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !147, line: 107, baseType: !505, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !538, file: !147, line: 107, baseType: !505, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !506, file: !147, line: 122, baseType: !537, size: 128, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !147, line: 123, baseType: !506)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !147, line: 178, baseType: !522)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "SubsurfModifierData", file: !358, line: 136, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SubsurfModifierData", file: !358, line: 130, size: 1088, elements: !550)
!550 = !{!551, !2497, !2498, !2499, !2500, !2501, !2502}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !549, file: !358, line: 131, baseType: !552, size: 896)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !358, line: 110, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !358, line: 99, size: 896, elements: !554)
!554 = !{!555, !557, !558, !559, !560, !561, !562, !566, !2496}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !358, line: 100, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !553, file: !358, line: 100, baseType: !556, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !358, line: 102, baseType: !487, size: 32, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !553, file: !358, line: 102, baseType: !487, size: 32, offset: 160)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !553, file: !358, line: 103, baseType: !487, size: 32, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !553, file: !358, line: 103, baseType: !487, size: 32, offset: 224)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !553, file: !358, line: 104, baseType: !563, size: 512, offset: 256)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 512, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !553, file: !358, line: 107, baseType: !567, size: 64, offset: 768)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !569, line: 1216, size: 39680, elements: !570)
!569 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!570 = !{!571, !636, !640, !1409, !1412, !1413, !1414, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1440, !1511, !1857, !2080, !2083, !2372, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2394, !2395, !2396, !2397, !2398, !2406, !2472, !2479, !2480, !2487, !2488, !2489, !2490, !2491, !2492, !2493}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !568, file: !569, line: 1217, baseType: !572, size: 960)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !573, line: 130, baseType: !574)
!573 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !573, line: 117, size: 960, elements: !575)
!575 = !{!576, !577, !578, !580, !599, !603, !604, !605, !606, !607}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !574, file: !573, line: 118, baseType: !467, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !574, file: !573, line: 118, baseType: !467, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !574, file: !573, line: 119, baseType: !579, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !574, file: !573, line: 120, baseType: !581, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !573, line: 136, size: 17600, elements: !583)
!583 = !{!584, !585, !587, !590, !594, !595, !596}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !582, file: !573, line: 137, baseType: !572, size: 960)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !582, file: !573, line: 138, baseType: !586, size: 64, offset: 960)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !582, file: !573, line: 139, baseType: !588, size: 64, offset: 1024)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !573, line: 43, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !582, file: !573, line: 140, baseType: !591, size: 8192, offset: 1088)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 8192, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 1024)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !582, file: !573, line: 141, baseType: !591, size: 8192, offset: 9280)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !582, file: !573, line: 148, baseType: !581, size: 64, offset: 17472)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !582, file: !573, line: 150, baseType: !597, size: 64, offset: 17536)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !573, line: 45, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !574, file: !573, line: 121, baseType: !600, size: 528, offset: 256)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 528, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 66)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !574, file: !573, line: 126, baseType: !497, size: 16, offset: 784)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !574, file: !573, line: 127, baseType: !487, size: 32, offset: 800)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !574, file: !573, line: 128, baseType: !487, size: 32, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !574, file: !573, line: 128, baseType: !487, size: 32, offset: 864)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !574, file: !573, line: 129, baseType: !608, size: 64, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !573, line: 75, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !573, line: 62, size: 1024, elements: !611)
!611 = !{!612, !614, !615, !616, !617, !618, !619, !620, !634, !635}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !573, line: 63, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !610, file: !573, line: 63, baseType: !613, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !610, file: !573, line: 64, baseType: !489, size: 8, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !610, file: !573, line: 64, baseType: !489, size: 8, offset: 136)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !573, line: 65, baseType: !497, size: 16, offset: 144)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !573, line: 66, baseType: !563, size: 512, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !610, file: !573, line: 67, baseType: !487, size: 32, offset: 672)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !610, file: !573, line: 69, baseType: !621, size: 256, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !573, line: 60, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !573, line: 48, size: 256, elements: !623)
!623 = !{!624, !625, !632, !633}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !622, file: !573, line: 49, baseType: !467, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !622, file: !573, line: 58, baseType: !626, size: 128, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !627, line: 71, baseType: !628)
!627 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !627, line: 69, size: 128, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !628, file: !627, line: 70, baseType: !467, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !628, file: !627, line: 70, baseType: !467, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !622, file: !573, line: 59, baseType: !487, size: 32, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !622, file: !573, line: 59, baseType: !487, size: 32, offset: 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !610, file: !573, line: 70, baseType: !487, size: 32, offset: 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !610, file: !573, line: 74, baseType: !487, size: 32, offset: 992)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !568, file: !569, line: 1218, baseType: !637, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !639, line: 44, flags: DIFlagFwdDecl)
!639 = !DIFile(filename: "blender/source/blender/makesdna/DNA_camera_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!640 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !568, file: !569, line: 1220, baseType: !641, size: 64, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !643, line: 115, size: 11392, elements: !644)
!643 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!644 = !{!645, !646, !647, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !664, !674, !688, !689, !730, !731, !734, !735, !751, !752, !753, !754, !755, !756, !757, !762, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !778, !779, !780, !781, !782, !783, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !843, !844, !845, !846, !847, !848, !849, !850, !851, !854, !857, !860, !861, !862, !863, !864, !867, !870, !1356, !1357, !1363, !1364, !1365, !1366, !1367, !1368, !1370, !1373, !1376, !1378, !1397, !1398}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !642, file: !643, line: 116, baseType: !572, size: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !642, file: !643, line: 117, baseType: !637, size: 64, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !642, file: !643, line: 119, baseType: !648, size: 64, offset: 1024)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !643, line: 57, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !642, file: !643, line: 121, baseType: !497, size: 16, offset: 1088)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !642, file: !643, line: 121, baseType: !497, size: 16, offset: 1104)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !642, file: !643, line: 122, baseType: !487, size: 32, offset: 1120)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !642, file: !643, line: 122, baseType: !487, size: 32, offset: 1152)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !642, file: !643, line: 122, baseType: !487, size: 32, offset: 1184)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !642, file: !643, line: 123, baseType: !563, size: 512, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !642, file: !643, line: 124, baseType: !641, size: 64, offset: 1728)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !642, file: !643, line: 124, baseType: !641, size: 64, offset: 1792)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !642, file: !643, line: 127, baseType: !641, size: 64, offset: 1856)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !642, file: !643, line: 127, baseType: !641, size: 64, offset: 1920)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !642, file: !643, line: 127, baseType: !641, size: 64, offset: 1984)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !642, file: !643, line: 128, baseType: !662, size: 64, offset: 2048)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !639, line: 45, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !642, file: !643, line: 130, baseType: !665, size: 64, offset: 2112)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !643, line: 97, size: 832, elements: !667)
!667 = !{!668, !672, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !666, file: !643, line: 98, baseType: !669, size: 768)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 768, elements: !670)
!670 = !{!671, !502}
!671 = !DISubrange(count: 8)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !666, file: !643, line: 99, baseType: !487, size: 32, offset: 768)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !666, file: !643, line: 99, baseType: !487, size: 32, offset: 800)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !642, file: !643, line: 131, baseType: !675, size: 64, offset: 2176)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !677, line: 486, size: 1600, elements: !678)
!677 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !676, file: !677, line: 487, baseType: !572, size: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !676, file: !677, line: 489, baseType: !626, size: 128, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !676, file: !677, line: 490, baseType: !626, size: 128, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !676, file: !677, line: 491, baseType: !626, size: 128, offset: 1216)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !676, file: !677, line: 492, baseType: !626, size: 128, offset: 1344)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !676, file: !677, line: 494, baseType: !487, size: 32, offset: 1472)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !676, file: !677, line: 495, baseType: !487, size: 32, offset: 1504)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !676, file: !677, line: 497, baseType: !487, size: 32, offset: 1536)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !676, file: !677, line: 498, baseType: !487, size: 32, offset: 1568)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !642, file: !643, line: 132, baseType: !675, size: 64, offset: 2240)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !642, file: !643, line: 133, baseType: !690, size: 64, offset: 2304)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !677, line: 334, size: 1728, elements: !692)
!692 = !{!693, !694, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !729}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !691, file: !677, line: 335, baseType: !626, size: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !691, file: !677, line: 336, baseType: !695, size: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !677, line: 47, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !677, line: 338, baseType: !497, size: 16, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !691, file: !677, line: 338, baseType: !497, size: 16, offset: 208)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !691, file: !677, line: 339, baseType: !7, size: 32, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !691, file: !677, line: 340, baseType: !487, size: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !691, file: !677, line: 342, baseType: !500, size: 32, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !691, file: !677, line: 343, baseType: !499, size: 96, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !691, file: !677, line: 344, baseType: !499, size: 96, offset: 416)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !691, file: !677, line: 347, baseType: !626, size: 128, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !691, file: !677, line: 349, baseType: !487, size: 32, offset: 640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !691, file: !677, line: 350, baseType: !487, size: 32, offset: 672)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !691, file: !677, line: 351, baseType: !467, size: 64, offset: 704)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !691, file: !677, line: 352, baseType: !467, size: 64, offset: 768)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !691, file: !677, line: 354, baseType: !710, size: 384, offset: 832)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !677, line: 116, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !677, line: 94, size: 384, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !711, file: !677, line: 96, baseType: !487, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !711, file: !677, line: 96, baseType: !487, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !711, file: !677, line: 97, baseType: !487, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !711, file: !677, line: 97, baseType: !487, size: 32, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !711, file: !677, line: 99, baseType: !497, size: 16, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !711, file: !677, line: 100, baseType: !497, size: 16, offset: 144)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !711, file: !677, line: 102, baseType: !497, size: 16, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !711, file: !677, line: 105, baseType: !497, size: 16, offset: 176)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !711, file: !677, line: 108, baseType: !497, size: 16, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !711, file: !677, line: 109, baseType: !497, size: 16, offset: 208)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !711, file: !677, line: 111, baseType: !497, size: 16, offset: 224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !711, file: !677, line: 112, baseType: !497, size: 16, offset: 240)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !711, file: !677, line: 114, baseType: !487, size: 32, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !711, file: !677, line: 114, baseType: !487, size: 32, offset: 288)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !711, file: !677, line: 115, baseType: !487, size: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !711, file: !677, line: 115, baseType: !487, size: 32, offset: 352)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !691, file: !677, line: 355, baseType: !563, size: 512, offset: 1216)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !642, file: !643, line: 134, baseType: !467, size: 64, offset: 2368)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !642, file: !643, line: 136, baseType: !732, size: 64, offset: 2432)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !643, line: 58, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !642, file: !643, line: 138, baseType: !710, size: 384, offset: 2496)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !642, file: !643, line: 139, baseType: !736, size: 64, offset: 2880)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !677, line: 80, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !677, line: 72, size: 192, elements: !739)
!739 = !{!740, !747, !748, !749, !750}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !738, file: !677, line: 73, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !677, line: 59, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !677, line: 56, size: 128, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !743, file: !677, line: 57, baseType: !499, size: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !743, file: !677, line: 58, baseType: !487, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !738, file: !677, line: 74, baseType: !487, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !738, file: !677, line: 76, baseType: !487, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !738, file: !677, line: 77, baseType: !487, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !738, file: !677, line: 79, baseType: !487, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !642, file: !643, line: 141, baseType: !626, size: 128, offset: 2944)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !642, file: !643, line: 142, baseType: !626, size: 128, offset: 3072)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !642, file: !643, line: 143, baseType: !626, size: 128, offset: 3200)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !642, file: !643, line: 144, baseType: !626, size: 128, offset: 3328)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !642, file: !643, line: 146, baseType: !487, size: 32, offset: 3456)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !642, file: !643, line: 147, baseType: !487, size: 32, offset: 3488)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !642, file: !643, line: 150, baseType: !758, size: 64, offset: 3520)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !761, line: 53, flags: DIFlagFwdDecl)
!761 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!762 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !642, file: !643, line: 151, baseType: !763, size: 64, offset: 3584)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !642, file: !643, line: 152, baseType: !487, size: 32, offset: 3648)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !642, file: !643, line: 153, baseType: !487, size: 32, offset: 3680)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !642, file: !643, line: 156, baseType: !499, size: 96, offset: 3712)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !642, file: !643, line: 156, baseType: !499, size: 96, offset: 3808)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !642, file: !643, line: 156, baseType: !499, size: 96, offset: 3904)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !642, file: !643, line: 157, baseType: !499, size: 96, offset: 4000)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !642, file: !643, line: 158, baseType: !499, size: 96, offset: 4096)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !642, file: !643, line: 159, baseType: !499, size: 96, offset: 4192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !642, file: !643, line: 160, baseType: !499, size: 96, offset: 4288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !642, file: !643, line: 160, baseType: !499, size: 96, offset: 4384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !642, file: !643, line: 161, baseType: !775, size: 128, offset: 4480)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 128, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 4)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !642, file: !643, line: 161, baseType: !775, size: 128, offset: 4608)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !642, file: !643, line: 162, baseType: !499, size: 96, offset: 4736)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !642, file: !643, line: 162, baseType: !499, size: 96, offset: 4832)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !642, file: !643, line: 163, baseType: !500, size: 32, offset: 4928)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !642, file: !643, line: 163, baseType: !500, size: 32, offset: 4960)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !642, file: !643, line: 164, baseType: !784, size: 512, offset: 4992)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 512, elements: !785)
!785 = !{!777, !777}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !642, file: !643, line: 165, baseType: !784, size: 512, offset: 5504)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !642, file: !643, line: 166, baseType: !784, size: 512, offset: 6016)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !642, file: !643, line: 167, baseType: !784, size: 512, offset: 6528)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !642, file: !643, line: 176, baseType: !784, size: 512, offset: 7040)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !642, file: !643, line: 178, baseType: !7, size: 32, offset: 7552)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !642, file: !643, line: 180, baseType: !497, size: 16, offset: 7584)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !642, file: !643, line: 181, baseType: !497, size: 16, offset: 7600)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !642, file: !643, line: 183, baseType: !497, size: 16, offset: 7616)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !642, file: !643, line: 183, baseType: !497, size: 16, offset: 7632)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !642, file: !643, line: 184, baseType: !497, size: 16, offset: 7648)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !642, file: !643, line: 184, baseType: !497, size: 16, offset: 7664)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !642, file: !643, line: 185, baseType: !497, size: 16, offset: 7680)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !642, file: !643, line: 186, baseType: !497, size: 16, offset: 7696)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !642, file: !643, line: 187, baseType: !497, size: 16, offset: 7712)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !642, file: !643, line: 188, baseType: !489, size: 8, offset: 7728)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !642, file: !643, line: 189, baseType: !489, size: 8, offset: 7736)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !642, file: !643, line: 192, baseType: !487, size: 32, offset: 7744)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !642, file: !643, line: 192, baseType: !487, size: 32, offset: 7776)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !642, file: !643, line: 192, baseType: !487, size: 32, offset: 7808)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !642, file: !643, line: 192, baseType: !487, size: 32, offset: 7840)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !642, file: !643, line: 194, baseType: !487, size: 32, offset: 7872)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !642, file: !643, line: 202, baseType: !500, size: 32, offset: 7904)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !642, file: !643, line: 202, baseType: !500, size: 32, offset: 7936)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !642, file: !643, line: 202, baseType: !500, size: 32, offset: 7968)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !642, file: !643, line: 211, baseType: !500, size: 32, offset: 8000)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !642, file: !643, line: 212, baseType: !500, size: 32, offset: 8032)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !642, file: !643, line: 213, baseType: !500, size: 32, offset: 8064)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !642, file: !643, line: 214, baseType: !500, size: 32, offset: 8096)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !642, file: !643, line: 215, baseType: !500, size: 32, offset: 8128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !642, file: !643, line: 216, baseType: !500, size: 32, offset: 8160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !642, file: !643, line: 219, baseType: !500, size: 32, offset: 8192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !642, file: !643, line: 220, baseType: !500, size: 32, offset: 8224)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !642, file: !643, line: 221, baseType: !500, size: 32, offset: 8256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !642, file: !643, line: 224, baseType: !820, size: 16, offset: 8288)
!820 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !642, file: !643, line: 224, baseType: !820, size: 16, offset: 8304)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !642, file: !643, line: 226, baseType: !497, size: 16, offset: 8320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !642, file: !643, line: 228, baseType: !489, size: 8, offset: 8336)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !642, file: !643, line: 229, baseType: !489, size: 8, offset: 8344)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !642, file: !643, line: 231, baseType: !497, size: 16, offset: 8352)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !642, file: !643, line: 232, baseType: !489, size: 8, offset: 8368)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !642, file: !643, line: 233, baseType: !489, size: 8, offset: 8376)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !642, file: !643, line: 234, baseType: !500, size: 32, offset: 8384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !642, file: !643, line: 235, baseType: !500, size: 32, offset: 8416)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !642, file: !643, line: 237, baseType: !626, size: 128, offset: 8448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !642, file: !643, line: 238, baseType: !626, size: 128, offset: 8576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !642, file: !643, line: 239, baseType: !626, size: 128, offset: 8704)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !642, file: !643, line: 240, baseType: !626, size: 128, offset: 8832)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !642, file: !643, line: 242, baseType: !500, size: 32, offset: 8960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !642, file: !643, line: 244, baseType: !497, size: 16, offset: 8992)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !642, file: !643, line: 245, baseType: !820, size: 16, offset: 9008)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !642, file: !643, line: 246, baseType: !775, size: 128, offset: 9024)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !642, file: !643, line: 248, baseType: !487, size: 32, offset: 9152)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !642, file: !643, line: 249, baseType: !487, size: 32, offset: 9184)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !642, file: !643, line: 251, baseType: !841, size: 64, offset: 9216)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !643, line: 251, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !642, file: !643, line: 253, baseType: !489, size: 8, offset: 9280)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !642, file: !643, line: 254, baseType: !489, size: 8, offset: 9288)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !642, file: !643, line: 255, baseType: !497, size: 16, offset: 9296)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !642, file: !643, line: 256, baseType: !499, size: 96, offset: 9312)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !642, file: !643, line: 258, baseType: !626, size: 128, offset: 9408)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !642, file: !643, line: 259, baseType: !626, size: 128, offset: 9536)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !642, file: !643, line: 260, baseType: !626, size: 128, offset: 9664)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !642, file: !643, line: 261, baseType: !626, size: 128, offset: 9792)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !642, file: !643, line: 263, baseType: !852, size: 64, offset: 9920)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !643, line: 52, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !642, file: !643, line: 264, baseType: !855, size: 64, offset: 9984)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !643, line: 53, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !642, file: !643, line: 265, baseType: !858, size: 64, offset: 10048)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !677, line: 46, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !642, file: !643, line: 267, baseType: !489, size: 8, offset: 10112)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !642, file: !643, line: 268, baseType: !489, size: 8, offset: 10120)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !642, file: !643, line: 269, baseType: !497, size: 16, offset: 10128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !642, file: !643, line: 270, baseType: !500, size: 32, offset: 10144)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !642, file: !643, line: 272, baseType: !865, size: 64, offset: 10176)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !643, line: 54, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !642, file: !643, line: 275, baseType: !868, size: 64, offset: 10240)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !643, line: 275, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !642, file: !643, line: 277, baseType: !871, size: 64, offset: 10304)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 178, size: 13504, elements: !873)
!873 = !{!874, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !925, !928, !930, !931, !933, !934, !935, !936, !942, !947, !948, !952, !953, !954, !955, !956, !968, !980, !994, !998, !1002, !1006, !1015, !1027, !1031, !1035, !1039, !1043, !1047, !1048, !1049, !1050, !1051, !1052, !1056, !1057, !1058, !1059, !1063, !1064, !1065, !1066, !1067, !1072, !1073, !1074, !1075, !1076, !1080, !1081, !1082, !1083, !1084, !1091, !1102, !1107, !1113, !1123, !1129, !1140, !1147, !1154, !1158, !1163, !1167, !1172, !1173, !1174, !1181, !1187, !1188, !1189, !1194, !1195, !1204, !1313, !1317, !1325, !1329, !1333, !1337, !1345, !1355}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !872, file: !6, line: 180, baseType: !875, size: 1600)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !72, line: 73, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !72, line: 64, size: 1600, elements: !877)
!877 = !{!878, !893, !897, !898, !899, !900, !903}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !876, file: !72, line: 65, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !72, line: 53, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !72, line: 42, size: 832, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !881, file: !72, line: 43, baseType: !487, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !881, file: !72, line: 44, baseType: !487, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !881, file: !72, line: 45, baseType: !487, size: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !881, file: !72, line: 46, baseType: !487, size: 32, offset: 96)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !881, file: !72, line: 47, baseType: !487, size: 32, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !881, file: !72, line: 48, baseType: !487, size: 32, offset: 160)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !881, file: !72, line: 49, baseType: !487, size: 32, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !881, file: !72, line: 50, baseType: !487, size: 32, offset: 224)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !881, file: !72, line: 51, baseType: !563, size: 512, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !881, file: !72, line: 52, baseType: !467, size: 64, offset: 768)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !876, file: !72, line: 66, baseType: !894, size: 1312, offset: 64)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 1312, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 41)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !876, file: !72, line: 69, baseType: !487, size: 32, offset: 1376)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !876, file: !72, line: 69, baseType: !487, size: 32, offset: 1408)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !876, file: !72, line: 70, baseType: !487, size: 32, offset: 1440)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !876, file: !72, line: 71, baseType: !901, size: 64, offset: 1472)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !72, line: 71, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !876, file: !72, line: 72, baseType: !904, size: 64, offset: 1536)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !72, line: 59, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !72, line: 57, size: 8192, elements: !907)
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !906, file: !72, line: 58, baseType: !591, size: 8192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !872, file: !6, line: 180, baseType: !875, size: 1600, offset: 1600)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !872, file: !6, line: 180, baseType: !875, size: 1600, offset: 3200)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !872, file: !6, line: 180, baseType: !875, size: 1600, offset: 4800)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !872, file: !6, line: 180, baseType: !875, size: 1600, offset: 6400)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !872, file: !6, line: 181, baseType: !487, size: 32, offset: 8000)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !872, file: !6, line: 181, baseType: !487, size: 32, offset: 8032)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !872, file: !6, line: 181, baseType: !487, size: 32, offset: 8064)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !872, file: !6, line: 181, baseType: !487, size: 32, offset: 8096)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !872, file: !6, line: 181, baseType: !487, size: 32, offset: 8128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !872, file: !6, line: 182, baseType: !487, size: 32, offset: 8160)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !872, file: !6, line: 183, baseType: !487, size: 32, offset: 8192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !872, file: !6, line: 184, baseType: !921, size: 64, offset: 8256)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !922, line: 124, baseType: !923)
!922 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !922, line: 124, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !872, file: !6, line: 185, baseType: !926, size: 64, offset: 8320)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !6, line: 97, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !872, file: !6, line: 186, baseType: !929, size: 32, offset: 8384)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !6, line: 132, baseType: !5)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !872, file: !6, line: 187, baseType: !500, size: 32, offset: 8416)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !872, file: !6, line: 188, baseType: !932, size: 32, offset: 8448)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !6, line: 175, baseType: !12)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !872, file: !6, line: 189, baseType: !487, size: 32, offset: 8480)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !872, file: !6, line: 190, baseType: !758, size: 64, offset: 8512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !872, file: !6, line: 193, baseType: !489, size: 8, offset: 8576)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !872, file: !6, line: 196, baseType: !937, size: 64, offset: 8640)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !6, line: 177, baseType: !872)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !872, file: !6, line: 199, baseType: !943, size: 64, offset: 8704)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !940, !946}
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !872, file: !6, line: 202, baseType: !937, size: 64, offset: 8768)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !872, file: !6, line: 207, baseType: !949, size: 64, offset: 8832)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!487, !940}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !872, file: !6, line: 208, baseType: !949, size: 64, offset: 8896)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !872, file: !6, line: 209, baseType: !949, size: 64, offset: 8960)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !872, file: !6, line: 210, baseType: !949, size: 64, offset: 9024)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !872, file: !6, line: 211, baseType: !949, size: 64, offset: 9088)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !872, file: !6, line: 218, baseType: !957, size: 64, offset: 9152)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !940, !487, !960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !425, line: 65, size: 160, elements: !962)
!962 = !{!963, !964, !966, !967}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !961, file: !425, line: 66, baseType: !499, size: 96)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !961, file: !425, line: 67, baseType: !965, size: 48, offset: 96)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 48, elements: !501)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !961, file: !425, line: 68, baseType: !489, size: 8, offset: 144)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !961, file: !425, line: 68, baseType: !489, size: 8, offset: 152)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !872, file: !6, line: 219, baseType: !969, size: 64, offset: 9216)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !940, !487, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !425, line: 48, size: 96, elements: !974)
!974 = !{!975, !976, !977, !978, !979}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !973, file: !425, line: 49, baseType: !7, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !973, file: !425, line: 49, baseType: !7, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !973, file: !425, line: 50, baseType: !489, size: 8, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !973, file: !425, line: 50, baseType: !489, size: 8, offset: 72)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !973, file: !425, line: 51, baseType: !497, size: 16, offset: 80)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !872, file: !6, line: 220, baseType: !981, size: 64, offset: 9280)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !940, !487, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !425, line: 42, size: 160, elements: !986)
!986 = !{!987, !988, !989, !990, !991, !992, !993}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !985, file: !425, line: 43, baseType: !7, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !985, file: !425, line: 43, baseType: !7, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !985, file: !425, line: 43, baseType: !7, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !985, file: !425, line: 43, baseType: !7, size: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !985, file: !425, line: 44, baseType: !497, size: 16, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !985, file: !425, line: 45, baseType: !489, size: 8, offset: 144)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !985, file: !425, line: 45, baseType: !489, size: 8, offset: 152)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !872, file: !6, line: 227, baseType: !995, size: 64, offset: 9344)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!960, !940}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !872, file: !6, line: 228, baseType: !999, size: 64, offset: 9408)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!972, !940}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !872, file: !6, line: 229, baseType: !1003, size: 64, offset: 9472)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!984, !940}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !872, file: !6, line: 230, baseType: !1007, size: 64, offset: 9536)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!1010, !940}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !425, line: 88, size: 64, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1011, file: !425, line: 89, baseType: !7, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1011, file: !425, line: 90, baseType: !7, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !872, file: !6, line: 231, baseType: !1016, size: 64, offset: 9600)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019, !940}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !425, line: 79, size: 96, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !1020, file: !425, line: 81, baseType: !487, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !1020, file: !425, line: 82, baseType: !487, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1020, file: !425, line: 83, baseType: !497, size: 16, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1020, file: !425, line: 84, baseType: !489, size: 8, offset: 80)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1020, file: !425, line: 84, baseType: !489, size: 8, offset: 88)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !872, file: !6, line: 236, baseType: !1028, size: 64, offset: 9664)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !940, !960}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !872, file: !6, line: 237, baseType: !1032, size: 64, offset: 9728)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !940, !972}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !872, file: !6, line: 238, baseType: !1036, size: 64, offset: 9792)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !940, !984}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !872, file: !6, line: 239, baseType: !1040, size: 64, offset: 9856)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !940, !1010}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !872, file: !6, line: 240, baseType: !1044, size: 64, offset: 9920)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !940, !1019}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !872, file: !6, line: 245, baseType: !995, size: 64, offset: 9984)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !872, file: !6, line: 246, baseType: !999, size: 64, offset: 10048)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !872, file: !6, line: 247, baseType: !1003, size: 64, offset: 10112)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !872, file: !6, line: 248, baseType: !1007, size: 64, offset: 10176)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !872, file: !6, line: 249, baseType: !1016, size: 64, offset: 10240)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !872, file: !6, line: 255, baseType: !1053, size: 64, offset: 10304)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!467, !940, !487, !487}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !872, file: !6, line: 256, baseType: !1053, size: 64, offset: 10368)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !872, file: !6, line: 257, baseType: !1053, size: 64, offset: 10432)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !872, file: !6, line: 258, baseType: !1053, size: 64, offset: 10496)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !872, file: !6, line: 264, baseType: !1060, size: 64, offset: 10560)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!467, !940, !487}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !872, file: !6, line: 265, baseType: !1060, size: 64, offset: 10624)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !872, file: !6, line: 266, baseType: !1060, size: 64, offset: 10688)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !872, file: !6, line: 267, baseType: !1060, size: 64, offset: 10752)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !872, file: !6, line: 268, baseType: !1060, size: 64, offset: 10816)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !872, file: !6, line: 272, baseType: !1068, size: 64, offset: 10880)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!1071, !940}
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !872, file: !6, line: 273, baseType: !1068, size: 64, offset: 10944)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !872, file: !6, line: 274, baseType: !1068, size: 64, offset: 11008)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !872, file: !6, line: 275, baseType: !1068, size: 64, offset: 11072)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !872, file: !6, line: 276, baseType: !1068, size: 64, offset: 11136)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !872, file: !6, line: 279, baseType: !1077, size: 64, offset: 11200)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !940, !487, !1071, !487}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !872, file: !6, line: 280, baseType: !1077, size: 64, offset: 11264)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !872, file: !6, line: 281, baseType: !1077, size: 64, offset: 11328)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !872, file: !6, line: 284, baseType: !949, size: 64, offset: 11392)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !872, file: !6, line: 285, baseType: !949, size: 64, offset: 11456)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !872, file: !6, line: 286, baseType: !1085, size: 64, offset: 11520)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!1088, !940}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !6, line: 82, flags: DIFlagFwdDecl)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !872, file: !6, line: 287, baseType: !1092, size: 64, offset: 11584)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!1095, !940}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !6, line: 120, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !6, line: 117, size: 256, elements: !1098)
!1098 = !{!1099, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1097, file: !6, line: 118, baseType: !1100, size: 128)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 128, elements: !776)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !1097, file: !6, line: 119, baseType: !1100, size: 128, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !872, file: !6, line: 288, baseType: !1103, size: 64, offset: 11648)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!1106, !940}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !872, file: !6, line: 289, baseType: !1108, size: 64, offset: 11712)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null, !940, !1111}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !6, line: 83, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !872, file: !6, line: 290, baseType: !1114, size: 64, offset: 11776)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!1117, !940}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !6, line: 126, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !6, line: 123, size: 32, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1119, file: !6, line: 124, baseType: !497, size: 16)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1119, file: !6, line: 125, baseType: !489, size: 8, offset: 16)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !872, file: !6, line: 291, baseType: !1124, size: 64, offset: 11840)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!1127, !940}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !872, file: !6, line: 299, baseType: !1130, size: 64, offset: 11904)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{null, !940, !1133, !467, !1139}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !467, !487, !1136, !1136, !1137}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !6, line: 162, baseType: !17)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !872, file: !6, line: 309, baseType: !1141, size: 64, offset: 11968)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{null, !940, !1144, !467}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{null, !467, !487, !1136, !1136}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !872, file: !6, line: 317, baseType: !1148, size: 64, offset: 12032)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{null, !940, !1151, !467, !1139}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{null, !467, !487, !487, !1136, !1136}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !872, file: !6, line: 327, baseType: !1155, size: 64, offset: 12096)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{null, !940, !1144, !467, !1139}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !872, file: !6, line: 337, baseType: !1159, size: 64, offset: 12160)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !940, !1162, !1162}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !872, file: !6, line: 344, baseType: !1164, size: 64, offset: 12224)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{null, !940, !487, !1162}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !872, file: !6, line: 347, baseType: !1168, size: 64, offset: 12288)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{null, !940, !1171}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !872, file: !6, line: 350, baseType: !1164, size: 64, offset: 12352)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !872, file: !6, line: 351, baseType: !1164, size: 64, offset: 12416)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !872, file: !6, line: 355, baseType: !1175, size: 64, offset: 12480)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!1178, !641, !940}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !6, line: 355, flags: DIFlagFwdDecl)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !872, file: !6, line: 359, baseType: !1182, size: 64, offset: 12544)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!1185, !641, !940}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !6, line: 100, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !872, file: !6, line: 364, baseType: !937, size: 64, offset: 12608)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !872, file: !6, line: 367, baseType: !937, size: 64, offset: 12672)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !872, file: !6, line: 373, baseType: !1190, size: 64, offset: 12736)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{null, !940, !1193, !1193}
!1193 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !872, file: !6, line: 376, baseType: !937, size: 64, offset: 12800)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !872, file: !6, line: 385, baseType: !1196, size: 64, offset: 12864)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{null, !940, !1199, !1193, !1200}
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !6, line: 146, baseType: !1201)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!487, !487, !467}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !872, file: !6, line: 391, baseType: !1205, size: 64, offset: 12928)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !940, !1208, !1308, !467, !1312}
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !6, line: 150, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!1212, !1213, !1307, !487}
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !6, line: 143, baseType: !21)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !425, line: 160, size: 384, elements: !1215)
!1215 = !{!1216, !1220, !1302, !1303, !1304, !1305, !1306}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !1214, file: !425, line: 161, baseType: !1217, size: 256)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 256, elements: !1218)
!1218 = !{!777, !1219}
!1219 = !DISubrange(count: 2)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !1214, file: !425, line: 162, baseType: !1221, size: 64, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1223, line: 77, size: 15424, elements: !1224)
!1223 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1224 = !{!1225, !1226, !1227, !1230, !1233, !1236, !1239, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1291, !1292, !1296}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1222, file: !1223, line: 78, baseType: !572, size: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1222, file: !1223, line: 80, baseType: !591, size: 8192, offset: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1222, file: !1223, line: 82, baseType: !1228, size: 64, offset: 9152)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1223, line: 43, flags: DIFlagFwdDecl)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1222, file: !1223, line: 83, baseType: !1231, size: 64, offset: 9216)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !573, line: 46, flags: DIFlagFwdDecl)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1222, file: !1223, line: 86, baseType: !1234, size: 64, offset: 9280)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1223, line: 41, flags: DIFlagFwdDecl)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1222, file: !1223, line: 87, baseType: !1237, size: 64, offset: 9344)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1223, line: 44, flags: DIFlagFwdDecl)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1222, file: !1223, line: 89, baseType: !1240, size: 512, offset: 9408)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1237, size: 512, elements: !1241)
!1241 = !{!671}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1222, file: !1223, line: 90, baseType: !497, size: 16, offset: 9920)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1222, file: !1223, line: 90, baseType: !497, size: 16, offset: 9936)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1222, file: !1223, line: 92, baseType: !497, size: 16, offset: 9952)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1222, file: !1223, line: 92, baseType: !497, size: 16, offset: 9968)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1222, file: !1223, line: 93, baseType: !497, size: 16, offset: 9984)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1222, file: !1223, line: 93, baseType: !497, size: 16, offset: 10000)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1222, file: !1223, line: 94, baseType: !487, size: 32, offset: 10016)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1222, file: !1223, line: 97, baseType: !497, size: 16, offset: 10048)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1222, file: !1223, line: 97, baseType: !497, size: 16, offset: 10064)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1222, file: !1223, line: 98, baseType: !497, size: 16, offset: 10080)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1222, file: !1223, line: 98, baseType: !497, size: 16, offset: 10096)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1222, file: !1223, line: 99, baseType: !497, size: 16, offset: 10112)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1222, file: !1223, line: 99, baseType: !497, size: 16, offset: 10128)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1222, file: !1223, line: 100, baseType: !7, size: 32, offset: 10144)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1222, file: !1223, line: 101, baseType: !1128, size: 64, offset: 10176)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1222, file: !1223, line: 103, baseType: !597, size: 64, offset: 10240)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1222, file: !1223, line: 104, baseType: !1259, size: 64, offset: 10304)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !573, line: 159, size: 448, elements: !1261)
!1261 = !{!1262, !1265, !1266, !1268, !1269, !1271}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1260, file: !573, line: 161, baseType: !1263, size: 64)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1264)
!1264 = !{!1219}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1260, file: !573, line: 162, baseType: !1263, size: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1260, file: !573, line: 163, baseType: !1267, size: 32, offset: 128)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 32, elements: !1264)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1260, file: !573, line: 164, baseType: !1267, size: 32, offset: 160)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1260, file: !573, line: 165, baseType: !1270, size: 128, offset: 192)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 128, elements: !1264)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1260, file: !573, line: 166, baseType: !1272, size: 128, offset: 320)
!1272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1231, size: 128, elements: !1264)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1222, file: !1223, line: 107, baseType: !500, size: 32, offset: 10368)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1222, file: !1223, line: 108, baseType: !487, size: 32, offset: 10400)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1222, file: !1223, line: 109, baseType: !497, size: 16, offset: 10432)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1222, file: !1223, line: 110, baseType: !497, size: 16, offset: 10448)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1222, file: !1223, line: 113, baseType: !487, size: 32, offset: 10464)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1222, file: !1223, line: 113, baseType: !487, size: 32, offset: 10496)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1222, file: !1223, line: 114, baseType: !489, size: 8, offset: 10528)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1222, file: !1223, line: 114, baseType: !489, size: 8, offset: 10536)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1222, file: !1223, line: 115, baseType: !497, size: 16, offset: 10544)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1222, file: !1223, line: 116, baseType: !775, size: 128, offset: 10560)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1222, file: !1223, line: 119, baseType: !500, size: 32, offset: 10688)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1222, file: !1223, line: 119, baseType: !500, size: 32, offset: 10720)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1222, file: !1223, line: 122, baseType: !1286, size: 512, offset: 10752)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1287, line: 182, baseType: !1288)
!1287 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1287, line: 180, size: 512, elements: !1289)
!1289 = !{!1290}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1288, file: !1287, line: 181, baseType: !563, size: 512)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1222, file: !1223, line: 123, baseType: !489, size: 8, offset: 11264)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1222, file: !1223, line: 125, baseType: !1293, size: 56, offset: 11272)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 56, elements: !1294)
!1294 = !{!1295}
!1295 = !DISubrange(count: 7)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1222, file: !1223, line: 126, baseType: !1297, size: 4096, offset: 11328)
!1297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1298, size: 4096, elements: !1241)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1223, line: 69, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1223, line: 67, size: 512, elements: !1300)
!1300 = !{!1301}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1299, file: !1223, line: 68, baseType: !563, size: 512)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1214, file: !425, line: 163, baseType: !489, size: 8, offset: 320)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !1214, file: !425, line: 163, baseType: !489, size: 8, offset: 328)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1214, file: !425, line: 164, baseType: !497, size: 16, offset: 336)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1214, file: !425, line: 164, baseType: !497, size: 16, offset: 352)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !1214, file: !425, line: 164, baseType: !497, size: 16, offset: 368)
!1307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1193)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !6, line: 147, baseType: !1309)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!487, !467, !487, !487}
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !6, line: 157, baseType: !27)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !872, file: !6, line: 400, baseType: !1314, size: 64, offset: 12992)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{null, !940, !1200}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !872, file: !6, line: 415, baseType: !1318, size: 64, offset: 13056)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{null, !940, !1321, !1200, !1308, !467, !1312}
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !6, line: 149, baseType: !1322)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!1212, !467, !487}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !872, file: !6, line: 425, baseType: !1326, size: 64, offset: 13120)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{null, !940, !1321, !1308, !467, !1312}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !872, file: !6, line: 435, baseType: !1330, size: 64, offset: 13184)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{null, !940, !1200, !1321, !467}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !872, file: !6, line: 444, baseType: !1334, size: 64, offset: 13248)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{null, !940, !1321, !467}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !872, file: !6, line: 455, baseType: !1338, size: 64, offset: 13312)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{null, !940, !1321, !1341, !467}
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !6, line: 148, baseType: !1342)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{null, !467, !487, !500}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !872, file: !6, line: 464, baseType: !1346, size: 64, offset: 13376)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{null, !940, !1349, !1352, !467}
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{null, !467, !487, !467}
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!1193, !467, !487}
