; ModuleID = 'blender/source/blender/blenkernel/intern/suggestions.c'
source_filename = "blender/source/blender/blenkernel/intern/suggestions.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Text = type { %struct.ID, i8*, i32, i32, %struct.ListBase, %struct.TextLine*, %struct.TextLine*, i32, i32, i8*, i32, i32, i8*, double }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.TextLine = type { %struct.TextLine*, %struct.TextLine*, i8*, i8*, i32, i32 }
%struct.SuggList = type { %struct.SuggItem*, %struct.SuggItem*, %struct.SuggItem*, %struct.SuggItem*, %struct.SuggItem*, i32 }
%struct.SuggItem = type { %struct.SuggItem*, %struct.SuggItem*, i8*, i8 }

@activeToolText = internal global %struct.Text* null, align 8, !dbg !0
@MEM_mallocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [9 x i8] c"SuggItem\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "activeToolText", scope: !2, file: !3, line: 45, type: !33, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/suggestions.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!0, !9, !31}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "suggestions", scope: !2, file: !3, line: 46, type: !11, isLocal: true, isDefinition: true)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "SuggList", file: !12, line: 66, baseType: !13)
!12 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_suggestions.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SuggList", file: !12, line: 61, size: 384, elements: !14)
!14 = !{!15, !25, !26, !27, !28, !29}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !13, file: !12, line: 62, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "SuggItem", file: !12, line: 59, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SuggItem", file: !12, line: 55, size: 256, elements: !19)
!19 = !{!20, !22, !23, !24}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !18, file: !12, line: 56, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !18, file: !12, line: 56, baseType: !21, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !12, line: 57, baseType: !6, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !12, line: 58, baseType: !7, size: 8, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !13, file: !12, line: 62, baseType: !16, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "firstmatch", scope: !13, file: !12, line: 63, baseType: !16, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "lastmatch", scope: !13, file: !12, line: 63, baseType: !16, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !13, file: !12, line: 64, baseType: !16, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !13, file: !12, line: 65, baseType: !30, size: 32, offset: 320)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "documentation", scope: !2, file: !3, line: 47, type: !6, isLocal: true, isDefinition: true)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Text", file: !35, line: 66, baseType: !36)
!35 = !DIFile(filename: "blender/source/blender/makesdna/DNA_text_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !35, line: 50, size: 1664, elements: !37)
!37 = !{!38, !108, !109, !110, !111, !112, !124, !125, !126, !127, !128, !129, !130, !131}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !36, file: !35, line: 51, baseType: !39, size: 960)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !40, line: 130, baseType: !41)
!40 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !40, line: 117, size: 960, elements: !42)
!42 = !{!43, !45, !46, !48, !67, !71, !73, !74, !75, !76}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !40, line: 118, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !41, file: !40, line: 118, baseType: !44, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !41, file: !40, line: 119, baseType: !47, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !41, file: !40, line: 120, baseType: !49, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !40, line: 136, size: 17600, elements: !51)
!51 = !{!52, !53, !55, !58, !62, !63, !64}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !50, file: !40, line: 137, baseType: !39, size: 960)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !50, file: !40, line: 138, baseType: !54, size: 64, offset: 960)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !50, file: !40, line: 139, baseType: !56, size: 64, offset: 1024)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !40, line: 43, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !40, line: 140, baseType: !59, size: 8192, offset: 1088)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 1024)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !50, file: !40, line: 141, baseType: !59, size: 8192, offset: 9280)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !50, file: !40, line: 148, baseType: !49, size: 64, offset: 17472)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !50, file: !40, line: 150, baseType: !65, size: 64, offset: 17536)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !40, line: 45, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !40, line: 121, baseType: !68, size: 528, offset: 256)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 528, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 66)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !41, file: !40, line: 126, baseType: !72, size: 16, offset: 784)
!72 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !41, file: !40, line: 127, baseType: !30, size: 32, offset: 800)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !41, file: !40, line: 128, baseType: !30, size: 32, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !41, file: !40, line: 128, baseType: !30, size: 32, offset: 864)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !41, file: !40, line: 129, baseType: !77, size: 64, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !40, line: 75, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !40, line: 62, size: 1024, elements: !80)
!80 = !{!81, !83, !84, !85, !86, !87, !91, !92, !106, !107}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !40, line: 63, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !79, file: !40, line: 63, baseType: !82, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !40, line: 64, baseType: !7, size: 8, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !79, file: !40, line: 64, baseType: !7, size: 8, offset: 136)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !79, file: !40, line: 65, baseType: !72, size: 16, offset: 144)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !40, line: 66, baseType: !88, size: 512, offset: 160)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !79, file: !40, line: 67, baseType: !30, size: 32, offset: 672)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !40, line: 69, baseType: !93, size: 256, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !40, line: 60, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !40, line: 48, size: 256, elements: !95)
!95 = !{!96, !97, !104, !105}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !94, file: !40, line: 49, baseType: !44, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !94, file: !40, line: 58, baseType: !98, size: 128, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !99, line: 71, baseType: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !99, line: 69, size: 128, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !100, file: !99, line: 70, baseType: !44, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !100, file: !99, line: 70, baseType: !44, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !94, file: !40, line: 59, baseType: !30, size: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !94, file: !40, line: 59, baseType: !30, size: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !79, file: !40, line: 70, baseType: !30, size: 32, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !79, file: !40, line: 74, baseType: !30, size: 32, offset: 992)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !35, line: 53, baseType: !6, size: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !35, line: 55, baseType: !30, size: 32, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !36, file: !35, line: 55, baseType: !30, size: 32, offset: 1056)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !36, file: !35, line: 57, baseType: !98, size: 128, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "curl", scope: !36, file: !35, line: 58, baseType: !113, size: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextLine", file: !35, line: 48, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextLine", file: !35, line: 42, size: 320, elements: !116)
!116 = !{!117, !119, !120, !121, !122, !123}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !35, line: 43, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !35, line: 43, baseType: !118, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !115, file: !35, line: 45, baseType: !6, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !115, file: !35, line: 46, baseType: !6, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !115, file: !35, line: 47, baseType: !30, size: 32, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "blen", scope: !115, file: !35, line: 47, baseType: !30, size: 32, offset: 288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sell", scope: !36, file: !35, line: 58, baseType: !113, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "curc", scope: !36, file: !35, line: 59, baseType: !30, size: 32, offset: 1344)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "selc", scope: !36, file: !35, line: 59, baseType: !30, size: 32, offset: 1376)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "undo_buf", scope: !36, file: !35, line: 61, baseType: !6, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "undo_pos", scope: !36, file: !35, line: 62, baseType: !30, size: 32, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "undo_len", scope: !36, file: !35, line: 62, baseType: !30, size: 32, offset: 1504)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "compiled", scope: !36, file: !35, line: 64, baseType: !44, size: 64, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !36, file: !35, line: 65, baseType: !132, size: 64, offset: 1600)
!132 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!133 = !{i32 7, !"Dwarf Version", i32 4}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{i32 1, !"wchar_size", i32 4}
!136 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!137 = distinct !DISubprogram(name: "free_texttools", scope: !3, file: !3, line: 87, type: !138, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!138 = !DISubroutineType(types: !139)
!139 = !{null}
!140 = !DILocation(line: 89, column: 2, scope: !137)
!141 = !DILocation(line: 90, column: 2, scope: !137)
!142 = !DILocation(line: 91, column: 1, scope: !137)
!143 = distinct !DISubprogram(name: "txttl_free_suggest", scope: !3, file: !3, line: 62, type: !138, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!144 = !DILocalVariable(name: "item", scope: !143, file: !3, line: 64, type: !16)
!145 = !DILocation(line: 64, column: 12, scope: !143)
!146 = !DILocalVariable(name: "prev", scope: !143, file: !3, line: 64, type: !16)
!147 = !DILocation(line: 64, column: 19, scope: !143)
!148 = !DILocation(line: 65, column: 26, scope: !149)
!149 = distinct !DILexicalBlock(scope: !143, file: !3, line: 65, column: 2)
!150 = !DILocation(line: 65, column: 12, scope: !149)
!151 = !DILocation(line: 65, column: 7, scope: !149)
!152 = !DILocation(line: 65, column: 32, scope: !153)
!153 = distinct !DILexicalBlock(scope: !149, file: !3, line: 65, column: 2)
!154 = !DILocation(line: 65, column: 2, scope: !149)
!155 = !DILocation(line: 66, column: 10, scope: !156)
!156 = distinct !DILexicalBlock(scope: !153, file: !3, line: 65, column: 51)
!157 = !DILocation(line: 66, column: 16, scope: !156)
!158 = !DILocation(line: 66, column: 8, scope: !156)
!159 = !DILocation(line: 67, column: 3, scope: !156)
!160 = !DILocation(line: 67, column: 13, scope: !156)
!161 = !DILocation(line: 68, column: 2, scope: !156)
!162 = !DILocation(line: 65, column: 45, scope: !153)
!163 = !DILocation(line: 65, column: 43, scope: !153)
!164 = !DILocation(line: 65, column: 2, scope: !153)
!165 = distinct !{!165, !154, !166}
!166 = !DILocation(line: 68, column: 2, scope: !149)
!167 = !DILocation(line: 69, column: 39, scope: !143)
!168 = !DILocation(line: 69, column: 20, scope: !143)
!169 = !DILocation(line: 70, column: 49, scope: !143)
!170 = !DILocation(line: 70, column: 25, scope: !143)
!171 = !DILocation(line: 71, column: 23, scope: !143)
!172 = !DILocation(line: 72, column: 18, scope: !143)
!173 = !DILocation(line: 73, column: 1, scope: !143)
!174 = distinct !DISubprogram(name: "txttl_free_docs", scope: !3, file: !3, line: 75, type: !138, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!175 = !DILocation(line: 77, column: 6, scope: !176)
!176 = distinct !DILexicalBlock(scope: !174, file: !3, line: 77, column: 6)
!177 = !DILocation(line: 77, column: 6, scope: !174)
!178 = !DILocation(line: 78, column: 3, scope: !179)
!179 = distinct !DILexicalBlock(scope: !176, file: !3, line: 77, column: 21)
!180 = !DILocation(line: 78, column: 13, scope: !179)
!181 = !DILocation(line: 79, column: 17, scope: !179)
!182 = !DILocation(line: 80, column: 2, scope: !179)
!183 = !DILocation(line: 81, column: 1, scope: !174)
!184 = distinct !DISubprogram(name: "texttool_text_set_active", scope: !3, file: !3, line: 93, type: !185, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !33}
!187 = !DILocalVariable(name: "text", arg: 1, scope: !184, file: !3, line: 93, type: !33)
!188 = !DILocation(line: 93, column: 37, scope: !184)
!189 = !DILocation(line: 95, column: 6, scope: !190)
