; ModuleID = 'blender/source/blender/modifiers/intern/MOD_hook.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_hook.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 339, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!63 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!67 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!69 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!70 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!71 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!72 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!73 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 76, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!77 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "HookModifierData", file: !121, line: 551, baseType: !122)
!121 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HookModifierData", file: !121, line: 537, size: 2752, elements: !123)
!123 = !{!124, !147, !986, !987, !988, !989, !990, !991, !992, !993}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !122, file: !121, line: 538, baseType: !125, size: 896)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !121, line: 110, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !121, line: 99, size: 896, elements: !127)
!127 = !{!128, !130, !131, !133, !134, !135, !136, !141, !145}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !121, line: 100, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !121, line: 100, baseType: !129, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !121, line: 102, baseType: !132, size: 32, offset: 128)
!132 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !126, file: !121, line: 102, baseType: !132, size: 32, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !126, file: !121, line: 103, baseType: !132, size: 32, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !126, file: !121, line: 103, baseType: !132, size: 32, offset: 224)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !121, line: 104, baseType: !137, size: 512, offset: 256)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 512, elements: !139)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!139 = !{!140}
!140 = !DISubrange(count: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !126, file: !121, line: 107, baseType: !142, size: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !144, line: 40, flags: DIFlagFwdDecl)
!144 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!145 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !126, file: !121, line: 109, baseType: !146, size: 64, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !122, file: !121, line: 540, baseType: !148, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !61, line: 115, size: 11392, elements: !150)
!150 = !{!151, !218, !222, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !239, !251, !265, !266, !309, !310, !313, !314, !330, !331, !332, !333, !334, !335, !336, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !355, !356, !357, !358, !359, !360, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !420, !421, !422, !423, !424, !425, !426, !427, !428, !431, !434, !437, !438, !439, !440, !441, !444, !447, !933, !934, !940, !941, !942, !943, !944, !945, !947, !950, !953, !955, !974, !975}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !149, file: !61, line: 116, baseType: !152, size: 960)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !153, line: 130, baseType: !154)
!153 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !153, line: 117, size: 960, elements: !155)
!155 = !{!156, !158, !159, !161, !180, !184, !186, !187, !188, !189}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !153, line: 118, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !153, line: 118, baseType: !157, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !154, file: !153, line: 119, baseType: !160, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !154, file: !153, line: 120, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !153, line: 136, size: 17600, elements: !164)
!164 = !{!165, !166, !168, !171, !175, !176, !177}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !153, line: 137, baseType: !152, size: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !163, file: !153, line: 138, baseType: !167, size: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !163, file: !153, line: 139, baseType: !169, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !153, line: 43, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !153, line: 140, baseType: !172, size: 8192, offset: 1088)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 8192, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 1024)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !163, file: !153, line: 141, baseType: !172, size: 8192, offset: 9280)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !163, file: !153, line: 148, baseType: !162, size: 64, offset: 17472)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !163, file: !153, line: 150, baseType: !178, size: 64, offset: 17536)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !153, line: 45, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !153, line: 121, baseType: !181, size: 528, offset: 256)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 528, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 66)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !153, line: 126, baseType: !185, size: 16, offset: 784)
!185 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !154, file: !153, line: 127, baseType: !132, size: 32, offset: 800)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !154, file: !153, line: 128, baseType: !132, size: 32, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !154, file: !153, line: 128, baseType: !132, size: 32, offset: 864)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !154, file: !153, line: 129, baseType: !190, size: 64, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !153, line: 75, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !153, line: 62, size: 1024, elements: !193)
!193 = !{!194, !196, !197, !198, !199, !200, !201, !202, !216, !217}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !153, line: 63, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !153, line: 63, baseType: !195, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !153, line: 64, baseType: !138, size: 8, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !192, file: !153, line: 64, baseType: !138, size: 8, offset: 136)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !153, line: 65, baseType: !185, size: 16, offset: 144)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !153, line: 66, baseType: !137, size: 512, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !192, file: !153, line: 67, baseType: !132, size: 32, offset: 672)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !153, line: 69, baseType: !203, size: 256, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !153, line: 60, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !153, line: 48, size: 256, elements: !205)
!205 = !{!206, !207, !214, !215}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !204, file: !153, line: 49, baseType: !157, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !204, file: !153, line: 58, baseType: !208, size: 128, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !209, line: 71, baseType: !210)
!209 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !209, line: 69, size: 128, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !210, file: !209, line: 70, baseType: !157, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !210, file: !209, line: 70, baseType: !157, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !204, file: !153, line: 59, baseType: !132, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !204, file: !153, line: 59, baseType: !132, size: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !192, file: !153, line: 70, baseType: !132, size: 32, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !192, file: !153, line: 74, baseType: !132, size: 32, offset: 992)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !149, file: !61, line: 117, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !221, line: 45, flags: DIFlagFwdDecl)
!221 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !149, file: !61, line: 119, baseType: !223, size: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !61, line: 57, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !61, line: 121, baseType: !185, size: 16, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !149, file: !61, line: 121, baseType: !185, size: 16, offset: 1104)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !149, file: !61, line: 122, baseType: !132, size: 32, offset: 1120)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !149, file: !61, line: 122, baseType: !132, size: 32, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !149, file: !61, line: 122, baseType: !132, size: 32, offset: 1184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !149, file: !61, line: 123, baseType: !137, size: 512, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !149, file: !61, line: 124, baseType: !148, size: 64, offset: 1728)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !149, file: !61, line: 124, baseType: !148, size: 64, offset: 1792)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !149, file: !61, line: 127, baseType: !148, size: 64, offset: 1856)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !149, file: !61, line: 127, baseType: !148, size: 64, offset: 1920)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !149, file: !61, line: 127, baseType: !148, size: 64, offset: 1984)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !149, file: !61, line: 128, baseType: !237, size: 64, offset: 2048)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !221, line: 46, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !149, file: !61, line: 130, baseType: !240, size: 64, offset: 2112)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !61, line: 97, size: 832, elements: !242)
!242 = !{!243, !249, !250}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !241, file: !61, line: 98, baseType: !244, size: 768)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 768, elements: !246)
!245 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!246 = !{!247, !248}
!247 = !DISubrange(count: 8)
!248 = !DISubrange(count: 3)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !241, file: !61, line: 99, baseType: !132, size: 32, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !241, file: !61, line: 99, baseType: !132, size: 32, offset: 800)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !149, file: !61, line: 131, baseType: !252, size: 64, offset: 2176)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !254, line: 486, size: 1600, elements: !255)
!254 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !253, file: !254, line: 487, baseType: !152, size: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !253, file: !254, line: 489, baseType: !208, size: 128, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !253, file: !254, line: 490, baseType: !208, size: 128, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !253, file: !254, line: 491, baseType: !208, size: 128, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !253, file: !254, line: 492, baseType: !208, size: 128, offset: 1344)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !253, file: !254, line: 494, baseType: !132, size: 32, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !253, file: !254, line: 495, baseType: !132, size: 32, offset: 1504)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !253, file: !254, line: 497, baseType: !132, size: 32, offset: 1536)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !253, file: !254, line: 498, baseType: !132, size: 32, offset: 1568)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !149, file: !61, line: 132, baseType: !252, size: 64, offset: 2240)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !149, file: !61, line: 133, baseType: !267, size: 64, offset: 2304)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !254, line: 334, size: 1728, elements: !269)
!269 = !{!270, !271, !274, !275, !276, !277, !278, !279, !282, !283, !284, !285, !286, !287, !288, !308}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !268, file: !254, line: 335, baseType: !208, size: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !268, file: !254, line: 336, baseType: !272, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !254, line: 47, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !254, line: 338, baseType: !185, size: 16, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !268, file: !254, line: 338, baseType: !185, size: 16, offset: 208)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !268, file: !254, line: 339, baseType: !7, size: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !268, file: !254, line: 340, baseType: !132, size: 32, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !268, file: !254, line: 342, baseType: !245, size: 32, offset: 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !268, file: !254, line: 343, baseType: !280, size: 96, offset: 320)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 96, elements: !281)
!281 = !{!248}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !268, file: !254, line: 344, baseType: !280, size: 96, offset: 416)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !268, file: !254, line: 347, baseType: !208, size: 128, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !268, file: !254, line: 349, baseType: !132, size: 32, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !268, file: !254, line: 350, baseType: !132, size: 32, offset: 672)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !268, file: !254, line: 351, baseType: !157, size: 64, offset: 704)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !268, file: !254, line: 352, baseType: !157, size: 64, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !268, file: !254, line: 354, baseType: !289, size: 384, offset: 832)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !254, line: 116, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !254, line: 94, size: 384, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !290, file: !254, line: 96, baseType: !132, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !290, file: !254, line: 96, baseType: !132, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !290, file: !254, line: 97, baseType: !132, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !290, file: !254, line: 97, baseType: !132, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !290, file: !254, line: 99, baseType: !185, size: 16, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !290, file: !254, line: 100, baseType: !185, size: 16, offset: 144)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !290, file: !254, line: 102, baseType: !185, size: 16, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !290, file: !254, line: 105, baseType: !185, size: 16, offset: 176)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !290, file: !254, line: 108, baseType: !185, size: 16, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !290, file: !254, line: 109, baseType: !185, size: 16, offset: 208)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !290, file: !254, line: 111, baseType: !185, size: 16, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !290, file: !254, line: 112, baseType: !185, size: 16, offset: 240)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !290, file: !254, line: 114, baseType: !132, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !290, file: !254, line: 114, baseType: !132, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !290, file: !254, line: 115, baseType: !132, size: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !290, file: !254, line: 115, baseType: !132, size: 32, offset: 352)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !268, file: !254, line: 355, baseType: !137, size: 512, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !61, line: 134, baseType: !157, size: 64, offset: 2368)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !149, file: !61, line: 136, baseType: !311, size: 64, offset: 2432)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !61, line: 58, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !149, file: !61, line: 138, baseType: !289, size: 384, offset: 2496)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !149, file: !61, line: 139, baseType: !315, size: 64, offset: 2880)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !254, line: 80, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !254, line: 72, size: 192, elements: !318)
!318 = !{!319, !326, !327, !328, !329}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !317, file: !254, line: 73, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !254, line: 59, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !254, line: 56, size: 128, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !322, file: !254, line: 57, baseType: !280, size: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !254, line: 58, baseType: !132, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !317, file: !254, line: 74, baseType: !132, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !317, file: !254, line: 76, baseType: !132, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !317, file: !254, line: 77, baseType: !132, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !317, file: !254, line: 79, baseType: !132, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !149, file: !61, line: 141, baseType: !208, size: 128, offset: 2944)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !149, file: !61, line: 142, baseType: !208, size: 128, offset: 3072)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !149, file: !61, line: 143, baseType: !208, size: 128, offset: 3200)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !149, file: !61, line: 144, baseType: !208, size: 128, offset: 3328)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !149, file: !61, line: 146, baseType: !132, size: 32, offset: 3456)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !149, file: !61, line: 147, baseType: !132, size: 32, offset: 3488)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !149, file: !61, line: 150, baseType: !337, size: 64, offset: 3520)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !61, line: 50, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !149, file: !61, line: 151, baseType: !146, size: 64, offset: 3584)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !149, file: !61, line: 152, baseType: !132, size: 32, offset: 3648)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !149, file: !61, line: 153, baseType: !132, size: 32, offset: 3680)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !149, file: !61, line: 156, baseType: !280, size: 96, offset: 3712)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !149, file: !61, line: 156, baseType: !280, size: 96, offset: 3808)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !149, file: !61, line: 156, baseType: !280, size: 96, offset: 3904)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !149, file: !61, line: 157, baseType: !280, size: 96, offset: 4000)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !149, file: !61, line: 158, baseType: !280, size: 96, offset: 4096)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !149, file: !61, line: 159, baseType: !280, size: 96, offset: 4192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !149, file: !61, line: 160, baseType: !280, size: 96, offset: 4288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !149, file: !61, line: 160, baseType: !280, size: 96, offset: 4384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !149, file: !61, line: 161, baseType: !352, size: 128, offset: 4480)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 128, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 4)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !149, file: !61, line: 161, baseType: !352, size: 128, offset: 4608)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !149, file: !61, line: 162, baseType: !280, size: 96, offset: 4736)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !149, file: !61, line: 162, baseType: !280, size: 96, offset: 4832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !149, file: !61, line: 163, baseType: !245, size: 32, offset: 4928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !149, file: !61, line: 163, baseType: !245, size: 32, offset: 4960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !149, file: !61, line: 164, baseType: !361, size: 512, offset: 4992)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 512, elements: !362)
!362 = !{!354, !354}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !149, file: !61, line: 165, baseType: !361, size: 512, offset: 5504)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !149, file: !61, line: 166, baseType: !361, size: 512, offset: 6016)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !149, file: !61, line: 167, baseType: !361, size: 512, offset: 6528)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !149, file: !61, line: 176, baseType: !361, size: 512, offset: 7040)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !149, file: !61, line: 178, baseType: !7, size: 32, offset: 7552)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !149, file: !61, line: 180, baseType: !185, size: 16, offset: 7584)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !149, file: !61, line: 181, baseType: !185, size: 16, offset: 7600)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !149, file: !61, line: 183, baseType: !185, size: 16, offset: 7616)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !149, file: !61, line: 183, baseType: !185, size: 16, offset: 7632)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !149, file: !61, line: 184, baseType: !185, size: 16, offset: 7648)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !149, file: !61, line: 184, baseType: !185, size: 16, offset: 7664)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !149, file: !61, line: 185, baseType: !185, size: 16, offset: 7680)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !149, file: !61, line: 186, baseType: !185, size: 16, offset: 7696)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !149, file: !61, line: 187, baseType: !185, size: 16, offset: 7712)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !149, file: !61, line: 188, baseType: !138, size: 8, offset: 7728)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !149, file: !61, line: 189, baseType: !138, size: 8, offset: 7736)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !149, file: !61, line: 192, baseType: !132, size: 32, offset: 7744)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !149, file: !61, line: 192, baseType: !132, size: 32, offset: 7776)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !149, file: !61, line: 192, baseType: !132, size: 32, offset: 7808)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !149, file: !61, line: 192, baseType: !132, size: 32, offset: 7840)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !149, file: !61, line: 194, baseType: !132, size: 32, offset: 7872)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !149, file: !61, line: 202, baseType: !245, size: 32, offset: 7904)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !149, file: !61, line: 202, baseType: !245, size: 32, offset: 7936)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !149, file: !61, line: 202, baseType: !245, size: 32, offset: 7968)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !149, file: !61, line: 211, baseType: !245, size: 32, offset: 8000)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !149, file: !61, line: 212, baseType: !245, size: 32, offset: 8032)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !149, file: !61, line: 213, baseType: !245, size: 32, offset: 8064)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !149, file: !61, line: 214, baseType: !245, size: 32, offset: 8096)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !149, file: !61, line: 215, baseType: !245, size: 32, offset: 8128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !149, file: !61, line: 216, baseType: !245, size: 32, offset: 8160)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !149, file: !61, line: 219, baseType: !245, size: 32, offset: 8192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !149, file: !61, line: 220, baseType: !245, size: 32, offset: 8224)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !149, file: !61, line: 221, baseType: !245, size: 32, offset: 8256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !149, file: !61, line: 224, baseType: !397, size: 16, offset: 8288)
!397 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !149, file: !61, line: 224, baseType: !397, size: 16, offset: 8304)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !149, file: !61, line: 226, baseType: !185, size: 16, offset: 8320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !149, file: !61, line: 228, baseType: !138, size: 8, offset: 8336)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !149, file: !61, line: 229, baseType: !138, size: 8, offset: 8344)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !149, file: !61, line: 231, baseType: !185, size: 16, offset: 8352)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !149, file: !61, line: 232, baseType: !138, size: 8, offset: 8368)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !149, file: !61, line: 233, baseType: !138, size: 8, offset: 8376)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !149, file: !61, line: 234, baseType: !245, size: 32, offset: 8384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !149, file: !61, line: 235, baseType: !245, size: 32, offset: 8416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !149, file: !61, line: 237, baseType: !208, size: 128, offset: 8448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !149, file: !61, line: 238, baseType: !208, size: 128, offset: 8576)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !149, file: !61, line: 239, baseType: !208, size: 128, offset: 8704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !149, file: !61, line: 240, baseType: !208, size: 128, offset: 8832)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !149, file: !61, line: 242, baseType: !245, size: 32, offset: 8960)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !149, file: !61, line: 244, baseType: !185, size: 16, offset: 8992)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !149, file: !61, line: 245, baseType: !397, size: 16, offset: 9008)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !149, file: !61, line: 246, baseType: !352, size: 128, offset: 9024)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !149, file: !61, line: 248, baseType: !132, size: 32, offset: 9152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !149, file: !61, line: 249, baseType: !132, size: 32, offset: 9184)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !149, file: !61, line: 251, baseType: !418, size: 64, offset: 9216)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !61, line: 251, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !149, file: !61, line: 253, baseType: !138, size: 8, offset: 9280)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !149, file: !61, line: 254, baseType: !138, size: 8, offset: 9288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !149, file: !61, line: 255, baseType: !185, size: 16, offset: 9296)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !149, file: !61, line: 256, baseType: !280, size: 96, offset: 9312)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !149, file: !61, line: 258, baseType: !208, size: 128, offset: 9408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !149, file: !61, line: 259, baseType: !208, size: 128, offset: 9536)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !149, file: !61, line: 260, baseType: !208, size: 128, offset: 9664)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !149, file: !61, line: 261, baseType: !208, size: 128, offset: 9792)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !149, file: !61, line: 263, baseType: !429, size: 64, offset: 9920)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !61, line: 52, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !149, file: !61, line: 264, baseType: !432, size: 64, offset: 9984)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !61, line: 53, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !149, file: !61, line: 265, baseType: !435, size: 64, offset: 10048)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !254, line: 46, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !149, file: !61, line: 267, baseType: !138, size: 8, offset: 10112)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !149, file: !61, line: 268, baseType: !138, size: 8, offset: 10120)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !149, file: !61, line: 269, baseType: !185, size: 16, offset: 10128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !149, file: !61, line: 270, baseType: !245, size: 32, offset: 10144)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !149, file: !61, line: 272, baseType: !442, size: 64, offset: 10176)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !61, line: 54, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !149, file: !61, line: 275, baseType: !445, size: 64, offset: 10240)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !61, line: 275, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !149, file: !61, line: 277, baseType: !448, size: 64, offset: 10304)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !450)
!450 = !{!451, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !502, !505, !507, !508, !510, !511, !512, !513, !519, !524, !525, !529, !530, !531, !532, !533, !546, !558, !572, !576, !580, !584, !593, !605, !609, !613, !617, !621, !625, !626, !627, !628, !629, !630, !634, !635, !636, !637, !641, !642, !643, !644, !645, !650, !651, !652, !653, !654, !658, !659, !660, !661, !662, !669, !680, !685, !691, !701, !707, !718, !725, !732, !736, !741, !745, !750, !751, !752, !759, !765, !766, !767, !772, !773, !782, !890, !894, !902, !906, !910, !914, !922, !932}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !449, file: !28, line: 180, baseType: !452, size: 1600)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !75, line: 73, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !75, line: 64, size: 1600, elements: !454)
!454 = !{!455, !470, !474, !475, !476, !477, !480}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !453, file: !75, line: 65, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !75, line: 53, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !75, line: 42, size: 832, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !458, file: !75, line: 43, baseType: !132, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !458, file: !75, line: 44, baseType: !132, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !75, line: 45, baseType: !132, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !458, file: !75, line: 46, baseType: !132, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !458, file: !75, line: 47, baseType: !132, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !458, file: !75, line: 48, baseType: !132, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !458, file: !75, line: 49, baseType: !132, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !458, file: !75, line: 50, baseType: !132, size: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !75, line: 51, baseType: !137, size: 512, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !458, file: !75, line: 52, baseType: !157, size: 64, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !453, file: !75, line: 66, baseType: !471, size: 1312, offset: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 1312, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 41)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !453, file: !75, line: 69, baseType: !132, size: 32, offset: 1376)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !453, file: !75, line: 69, baseType: !132, size: 32, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !453, file: !75, line: 70, baseType: !132, size: 32, offset: 1440)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !453, file: !75, line: 71, baseType: !478, size: 64, offset: 1472)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !75, line: 71, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !453, file: !75, line: 72, baseType: !481, size: 64, offset: 1536)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !75, line: 59, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !75, line: 57, size: 8192, elements: !484)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !483, file: !75, line: 58, baseType: !172, size: 8192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !449, file: !28, line: 180, baseType: !452, size: 1600, offset: 1600)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !449, file: !28, line: 180, baseType: !452, size: 1600, offset: 3200)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !449, file: !28, line: 180, baseType: !452, size: 1600, offset: 4800)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !449, file: !28, line: 180, baseType: !452, size: 1600, offset: 6400)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !449, file: !28, line: 181, baseType: !132, size: 32, offset: 8000)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !449, file: !28, line: 181, baseType: !132, size: 32, offset: 8032)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !449, file: !28, line: 181, baseType: !132, size: 32, offset: 8064)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !449, file: !28, line: 181, baseType: !132, size: 32, offset: 8096)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !449, file: !28, line: 181, baseType: !132, size: 32, offset: 8128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !449, file: !28, line: 182, baseType: !132, size: 32, offset: 8160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !449, file: !28, line: 183, baseType: !132, size: 32, offset: 8192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !449, file: !28, line: 184, baseType: !498, size: 64, offset: 8256)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !499, line: 124, baseType: !500)
!499 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !499, line: 124, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !449, file: !28, line: 185, baseType: !503, size: 64, offset: 8320)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !28, line: 186, baseType: !506, size: 32, offset: 8384)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !449, file: !28, line: 187, baseType: !245, size: 32, offset: 8416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !449, file: !28, line: 188, baseType: !509, size: 32, offset: 8448)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !449, file: !28, line: 189, baseType: !132, size: 32, offset: 8480)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !449, file: !28, line: 190, baseType: !337, size: 64, offset: 8512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !449, file: !28, line: 193, baseType: !138, size: 8, offset: 8576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !449, file: !28, line: 196, baseType: !514, size: 64, offset: 8640)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !449)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !449, file: !28, line: 199, baseType: !520, size: 64, offset: 8704)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !517, !523}
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !449, file: !28, line: 202, baseType: !514, size: 64, offset: 8768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !449, file: !28, line: 207, baseType: !526, size: 64, offset: 8832)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!132, !517}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !449, file: !28, line: 208, baseType: !526, size: 64, offset: 8896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !449, file: !28, line: 209, baseType: !526, size: 64, offset: 8960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !449, file: !28, line: 210, baseType: !526, size: 64, offset: 9024)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !449, file: !28, line: 211, baseType: !526, size: 64, offset: 9088)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !449, file: !28, line: 218, baseType: !534, size: 64, offset: 9152)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !517, !132, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !539, line: 65, size: 160, elements: !540)
!539 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!540 = !{!541, !542, !544, !545}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !538, file: !539, line: 66, baseType: !280, size: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !538, file: !539, line: 67, baseType: !543, size: 48, offset: 96)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 48, elements: !281)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !539, line: 68, baseType: !138, size: 8, offset: 144)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !538, file: !539, line: 68, baseType: !138, size: 8, offset: 152)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !449, file: !28, line: 219, baseType: !547, size: 64, offset: 9216)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !517, !132, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !539, line: 48, size: 96, elements: !552)
!552 = !{!553, !554, !555, !556, !557}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !551, file: !539, line: 49, baseType: !7, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !551, file: !539, line: 49, baseType: !7, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !551, file: !539, line: 50, baseType: !138, size: 8, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !551, file: !539, line: 50, baseType: !138, size: 8, offset: 72)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !551, file: !539, line: 51, baseType: !185, size: 16, offset: 80)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !449, file: !28, line: 220, baseType: !559, size: 64, offset: 9280)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !517, !132, !562}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !539, line: 42, size: 160, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !563, file: !539, line: 43, baseType: !7, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !563, file: !539, line: 43, baseType: !7, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !563, file: !539, line: 43, baseType: !7, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !563, file: !539, line: 43, baseType: !7, size: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !563, file: !539, line: 44, baseType: !185, size: 16, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !563, file: !539, line: 45, baseType: !138, size: 8, offset: 144)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !563, file: !539, line: 45, baseType: !138, size: 8, offset: 152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !449, file: !28, line: 227, baseType: !573, size: 64, offset: 9344)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!537, !517}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !449, file: !28, line: 228, baseType: !577, size: 64, offset: 9408)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!550, !517}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !449, file: !28, line: 229, baseType: !581, size: 64, offset: 9472)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!562, !517}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !449, file: !28, line: 230, baseType: !585, size: 64, offset: 9536)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!588, !517}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !539, line: 88, size: 64, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !589, file: !539, line: 89, baseType: !7, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !589, file: !539, line: 90, baseType: !7, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !449, file: !28, line: 231, baseType: !594, size: 64, offset: 9600)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!597, !517}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !539, line: 79, size: 96, elements: !599)
!599 = !{!600, !601, !602, !603, !604}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !598, file: !539, line: 81, baseType: !132, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !598, file: !539, line: 82, baseType: !132, size: 32, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !598, file: !539, line: 83, baseType: !185, size: 16, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !598, file: !539, line: 84, baseType: !138, size: 8, offset: 80)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !598, file: !539, line: 84, baseType: !138, size: 8, offset: 88)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !449, file: !28, line: 236, baseType: !606, size: 64, offset: 9664)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !517, !537}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !449, file: !28, line: 237, baseType: !610, size: 64, offset: 9728)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !517, !550}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !449, file: !28, line: 238, baseType: !614, size: 64, offset: 9792)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !517, !562}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !449, file: !28, line: 239, baseType: !618, size: 64, offset: 9856)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !517, !588}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !449, file: !28, line: 240, baseType: !622, size: 64, offset: 9920)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !517, !597}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !449, file: !28, line: 245, baseType: !573, size: 64, offset: 9984)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !449, file: !28, line: 246, baseType: !577, size: 64, offset: 10048)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !449, file: !28, line: 247, baseType: !581, size: 64, offset: 10112)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !449, file: !28, line: 248, baseType: !585, size: 64, offset: 10176)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !449, file: !28, line: 249, baseType: !594, size: 64, offset: 10240)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !449, file: !28, line: 255, baseType: !631, size: 64, offset: 10304)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!157, !517, !132, !132}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !449, file: !28, line: 256, baseType: !631, size: 64, offset: 10368)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !449, file: !28, line: 257, baseType: !631, size: 64, offset: 10432)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !449, file: !28, line: 258, baseType: !631, size: 64, offset: 10496)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !449, file: !28, line: 264, baseType: !638, size: 64, offset: 10560)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!157, !517, !132}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !449, file: !28, line: 265, baseType: !638, size: 64, offset: 10624)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !449, file: !28, line: 266, baseType: !638, size: 64, offset: 10688)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !449, file: !28, line: 267, baseType: !638, size: 64, offset: 10752)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !449, file: !28, line: 268, baseType: !638, size: 64, offset: 10816)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !449, file: !28, line: 272, baseType: !646, size: 64, offset: 10880)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!649, !517}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !449, file: !28, line: 273, baseType: !646, size: 64, offset: 10944)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !449, file: !28, line: 274, baseType: !646, size: 64, offset: 11008)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !449, file: !28, line: 275, baseType: !646, size: 64, offset: 11072)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !449, file: !28, line: 276, baseType: !646, size: 64, offset: 11136)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !449, file: !28, line: 279, baseType: !655, size: 64, offset: 11200)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !517, !132, !649, !132}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !449, file: !28, line: 280, baseType: !655, size: 64, offset: 11264)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !449, file: !28, line: 281, baseType: !655, size: 64, offset: 11328)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !449, file: !28, line: 284, baseType: !526, size: 64, offset: 11392)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !449, file: !28, line: 285, baseType: !526, size: 64, offset: 11456)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !449, file: !28, line: 286, baseType: !663, size: 64, offset: 11520)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!666, !517}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !449, file: !28, line: 287, baseType: !670, size: 64, offset: 11584)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!673, !517}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !676)
!676 = !{!677, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !675, file: !28, line: 118, baseType: !678, size: 128)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 128, elements: !353)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !675, file: !28, line: 119, baseType: !678, size: 128, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !449, file: !28, line: 288, baseType: !681, size: 64, offset: 11648)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!684, !517}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !449, file: !28, line: 289, baseType: !686, size: 64, offset: 11712)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !517, !689}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !449, file: !28, line: 290, baseType: !692, size: 64, offset: 11776)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!695, !517}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !697, file: !28, line: 124, baseType: !185, size: 16)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !697, file: !28, line: 125, baseType: !138, size: 8, offset: 16)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !449, file: !28, line: 291, baseType: !702, size: 64, offset: 11840)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!705, !517}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !449, file: !28, line: 299, baseType: !708, size: 64, offset: 11904)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !517, !711, !157, !717}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !157, !132, !714, !714, !715}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !449, file: !28, line: 309, baseType: !719, size: 64, offset: 11968)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !517, !722, !157}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !157, !132, !714, !714}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !449, file: !28, line: 317, baseType: !726, size: 64, offset: 12032)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !517, !729, !157, !717}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !157, !132, !132, !714, !714}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !449, file: !28, line: 327, baseType: !733, size: 64, offset: 12096)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !517, !722, !157, !717}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !449, file: !28, line: 337, baseType: !737, size: 64, offset: 12160)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !517, !740, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !449, file: !28, line: 344, baseType: !742, size: 64, offset: 12224)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !517, !132, !740}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !449, file: !28, line: 347, baseType: !746, size: 64, offset: 12288)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !517, !749}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !449, file: !28, line: 350, baseType: !742, size: 64, offset: 12352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !449, file: !28, line: 351, baseType: !742, size: 64, offset: 12416)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !449, file: !28, line: 355, baseType: !753, size: 64, offset: 12480)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!756, !148, !517}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !758)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !449, file: !28, line: 359, baseType: !760, size: 64, offset: 12544)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!763, !148, !517}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !449, file: !28, line: 364, baseType: !514, size: 64, offset: 12608)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !449, file: !28, line: 367, baseType: !514, size: 64, offset: 12672)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !449, file: !28, line: 373, baseType: !768, size: 64, offset: 12736)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !517, !771, !771}
!771 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !449, file: !28, line: 376, baseType: !514, size: 64, offset: 12800)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !449, file: !28, line: 385, baseType: !774, size: 64, offset: 12864)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !517, !777, !771, !778}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!132, !132, !157}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !449, file: !28, line: 391, baseType: !783, size: 64, offset: 12928)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !517, !786, !885, !157, !889}
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!790, !791, !884, !132}
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !539, line: 160, size: 384, elements: !793)
!793 = !{!794, !798, !879, !880, !881, !882, !883}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !792, file: !539, line: 161, baseType: !795, size: 256)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 256, elements: !796)
!796 = !{!354, !797}
!797 = !DISubrange(count: 2)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !792, file: !539, line: 162, baseType: !799, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !144, line: 77, size: 15424, elements: !801)
!801 = !{!802, !803, !804, !807, !810, !813, !816, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !868, !869, !873}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !800, file: !144, line: 78, baseType: !152, size: 960)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !800, file: !144, line: 80, baseType: !172, size: 8192, offset: 960)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !800, file: !144, line: 82, baseType: !805, size: 64, offset: 9152)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !144, line: 43, flags: DIFlagFwdDecl)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !800, file: !144, line: 83, baseType: !808, size: 64, offset: 9216)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !153, line: 46, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !800, file: !144, line: 86, baseType: !811, size: 64, offset: 9280)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !144, line: 41, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !800, file: !144, line: 87, baseType: !814, size: 64, offset: 9344)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !144, line: 44, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !800, file: !144, line: 89, baseType: !817, size: 512, offset: 9408)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 512, elements: !818)
!818 = !{!247}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !800, file: !144, line: 90, baseType: !185, size: 16, offset: 9920)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !800, file: !144, line: 90, baseType: !185, size: 16, offset: 9936)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !800, file: !144, line: 92, baseType: !185, size: 16, offset: 9952)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !800, file: !144, line: 92, baseType: !185, size: 16, offset: 9968)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !800, file: !144, line: 93, baseType: !185, size: 16, offset: 9984)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !800, file: !144, line: 93, baseType: !185, size: 16, offset: 10000)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !800, file: !144, line: 94, baseType: !132, size: 32, offset: 10016)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !800, file: !144, line: 97, baseType: !185, size: 16, offset: 10048)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !800, file: !144, line: 97, baseType: !185, size: 16, offset: 10064)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !800, file: !144, line: 98, baseType: !185, size: 16, offset: 10080)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !800, file: !144, line: 98, baseType: !185, size: 16, offset: 10096)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !800, file: !144, line: 99, baseType: !185, size: 16, offset: 10112)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !800, file: !144, line: 99, baseType: !185, size: 16, offset: 10128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !800, file: !144, line: 100, baseType: !7, size: 32, offset: 10144)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !800, file: !144, line: 101, baseType: !706, size: 64, offset: 10176)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !800, file: !144, line: 103, baseType: !178, size: 64, offset: 10240)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !800, file: !144, line: 104, baseType: !836, size: 64, offset: 10304)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !153, line: 159, size: 448, elements: !838)
!838 = !{!839, !842, !843, !845, !846, !848}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !837, file: !153, line: 161, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !841)
!841 = !{!797}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !837, file: !153, line: 162, baseType: !840, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !837, file: !153, line: 163, baseType: !844, size: 32, offset: 128)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 32, elements: !841)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !837, file: !153, line: 164, baseType: !844, size: 32, offset: 160)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !837, file: !153, line: 165, baseType: !847, size: 128, offset: 192)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 128, elements: !841)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !837, file: !153, line: 166, baseType: !849, size: 128, offset: 320)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 128, elements: !841)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !800, file: !144, line: 107, baseType: !245, size: 32, offset: 10368)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !800, file: !144, line: 108, baseType: !132, size: 32, offset: 10400)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !800, file: !144, line: 109, baseType: !185, size: 16, offset: 10432)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !800, file: !144, line: 110, baseType: !185, size: 16, offset: 10448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !800, file: !144, line: 113, baseType: !132, size: 32, offset: 10464)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !800, file: !144, line: 113, baseType: !132, size: 32, offset: 10496)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !800, file: !144, line: 114, baseType: !138, size: 8, offset: 10528)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !800, file: !144, line: 114, baseType: !138, size: 8, offset: 10536)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !800, file: !144, line: 115, baseType: !185, size: 16, offset: 10544)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !800, file: !144, line: 116, baseType: !352, size: 128, offset: 10560)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !800, file: !144, line: 119, baseType: !245, size: 32, offset: 10688)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !800, file: !144, line: 119, baseType: !245, size: 32, offset: 10720)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !800, file: !144, line: 122, baseType: !863, size: 512, offset: 10752)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !864, line: 182, baseType: !865)
!864 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !864, line: 180, size: 512, elements: !866)
!866 = !{!867}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !865, file: !864, line: 181, baseType: !137, size: 512)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !800, file: !144, line: 123, baseType: !138, size: 8, offset: 11264)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !800, file: !144, line: 125, baseType: !870, size: 56, offset: 11272)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 56, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 7)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !800, file: !144, line: 126, baseType: !874, size: 4096, offset: 11328)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 4096, elements: !818)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !144, line: 69, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !144, line: 67, size: 512, elements: !877)
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !876, file: !144, line: 68, baseType: !137, size: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !792, file: !539, line: 163, baseType: !138, size: 8, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !792, file: !539, line: 163, baseType: !138, size: 8, offset: 328)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !792, file: !539, line: 164, baseType: !185, size: 16, offset: 336)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !792, file: !539, line: 164, baseType: !185, size: 16, offset: 352)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !792, file: !539, line: 164, baseType: !185, size: 16, offset: 368)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!132, !157, !132, !132}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !449, file: !28, line: 400, baseType: !891, size: 64, offset: 12992)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !517, !778}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !449, file: !28, line: 415, baseType: !895, size: 64, offset: 13056)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !517, !898, !778, !885, !157, !889}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!790, !157, !132}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !449, file: !28, line: 425, baseType: !903, size: 64, offset: 13120)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{null, !517, !898, !885, !157, !889}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !449, file: !28, line: 435, baseType: !907, size: 64, offset: 13184)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !517, !778, !898, !157}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !449, file: !28, line: 444, baseType: !911, size: 64, offset: 13248)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !517, !898, !157}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !449, file: !28, line: 455, baseType: !915, size: 64, offset: 13312)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !517, !898, !918, !157}
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !157, !132, !245}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !449, file: !28, line: 464, baseType: !923, size: 64, offset: 13376)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !517, !926, !929, !157}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !157, !132, !157}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!771, !157, !132}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !449, file: !28, line: 470, baseType: !514, size: 64, offset: 13440)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !149, file: !61, line: 277, baseType: !448, size: 64, offset: 10368)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !149, file: !61, line: 278, baseType: !935, size: 64, offset: 10432)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !936, line: 27, baseType: !937)
!936 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !938, line: 45, baseType: !939)
!938 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!939 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !149, file: !61, line: 279, baseType: !935, size: 64, offset: 10496)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !149, file: !61, line: 280, baseType: !7, size: 32, offset: 10560)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !149, file: !61, line: 281, baseType: !7, size: 32, offset: 10592)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !149, file: !61, line: 283, baseType: !208, size: 128, offset: 10624)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !149, file: !61, line: 284, baseType: !208, size: 128, offset: 10752)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !149, file: !61, line: 285, baseType: !946, size: 64, offset: 10880)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !149, file: !61, line: 287, baseType: !948, size: 64, offset: 10944)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !61, line: 59, flags: DIFlagFwdDecl)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !149, file: !61, line: 288, baseType: !951, size: 64, offset: 11008)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !61, line: 288, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !149, file: !61, line: 290, baseType: !954, size: 64, offset: 11072)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 64, elements: !841)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !149, file: !61, line: 291, baseType: !956, size: 64, offset: 11136)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !144, line: 65, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !144, line: 50, size: 320, elements: !959)
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !958, file: !144, line: 51, baseType: !142, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !958, file: !144, line: 53, baseType: !132, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !958, file: !144, line: 54, baseType: !132, size: 32, offset: 96)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !958, file: !144, line: 55, baseType: !132, size: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !958, file: !144, line: 55, baseType: !132, size: 32, offset: 160)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !958, file: !144, line: 56, baseType: !138, size: 8, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !958, file: !144, line: 56, baseType: !138, size: 8, offset: 200)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !958, file: !144, line: 57, baseType: !138, size: 8, offset: 208)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !958, file: !144, line: 57, baseType: !138, size: 8, offset: 216)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !958, file: !144, line: 59, baseType: !185, size: 16, offset: 224)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !958, file: !144, line: 59, baseType: !185, size: 16, offset: 240)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !958, file: !144, line: 59, baseType: !185, size: 16, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !958, file: !144, line: 61, baseType: !185, size: 16, offset: 272)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !958, file: !144, line: 63, baseType: !132, size: 32, offset: 288)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !149, file: !61, line: 293, baseType: !208, size: 128, offset: 11200)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !149, file: !61, line: 294, baseType: !976, size: 64, offset: 11328)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !61, line: 113, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !61, line: 108, size: 256, elements: !979)
!979 = !{!980, !982, !983, !984, !985}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !978, file: !61, line: 109, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !978, file: !61, line: 109, baseType: !981, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !978, file: !61, line: 110, baseType: !148, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !978, file: !61, line: 111, baseType: !132, size: 32, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !978, file: !61, line: 112, baseType: !245, size: 32, offset: 224)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "subtarget", scope: !122, file: !121, line: 541, baseType: !137, size: 512, offset: 960)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !122, file: !121, line: 543, baseType: !361, size: 512, offset: 1472)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "cent", scope: !122, file: !121, line: 544, baseType: !280, size: 96, offset: 1984)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !122, file: !121, line: 545, baseType: !245, size: 32, offset: 2080)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "indexar", scope: !122, file: !121, line: 547, baseType: !684, size: 64, offset: 2112)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "totindex", scope: !122, file: !121, line: 548, baseType: !132, size: 32, offset: 2176)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !122, file: !121, line: 549, baseType: !245, size: 32, offset: 2208)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !121, line: 550, baseType: !137, size: 512, offset: 2240)
!994 = !{!0}
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !997)
!997 = !{!998, !1002, !1003, !1004, !1006, !1008, !1012, !1017, !1024, !1030, !1034, !1038, !1042, !1046, !1052, !1053, !1057, !1109, !1113, !1114, !1123, !1132}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !6, line: 123, baseType: !999, size: 256)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 256, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !996, file: !6, line: 128, baseType: !999, size: 256, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !996, file: !6, line: 131, baseType: !132, size: 32, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !996, file: !6, line: 133, baseType: !1005, size: 32, offset: 544)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !996, file: !6, line: 134, baseType: !1007, size: 32, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !996, file: !6, line: 142, baseType: !1009, size: 64, offset: 640)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !129, !129}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !996, file: !6, line: 151, baseType: !1013, size: 64, offset: 704)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !129, !148, !448, !749, !132, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierApplyFlag", file: !6, line: 118, baseType: !54)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "deformMatrices", scope: !996, file: !6, line: 157, baseType: !1018, size: 64, offset: 768)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{null, !129, !148, !448, !749, !1021, !132}
