; ModuleID = 'blender/source/blender/editors/space_graph/graph_ops.c'
source_filename = "blender/source/blender/editors/space_graph/graph_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!266 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !267, line: 351, baseType: !41, size: 32, elements: !268)
!267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = !{!269, !270, !271, !272, !273, !274}
!269 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!271 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!272 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!273 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!274 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eGraphKeys_LeftRightSelect_Mode", file: !276, line: 73, baseType: !41, size: 32, elements: !277)
!276 = !DIFile(filename: "blender/source/blender/editors/space_graph/graph_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = !{!278, !279, !280}
!278 = !DIEnumerator(name: "GRAPHKEYS_LRSEL_TEST", value: 0, isUnsigned: true)
!279 = !DIEnumerator(name: "GRAPHKEYS_LRSEL_LEFT", value: 1, isUnsigned: true)
!280 = !DIEnumerator(name: "GRAPHKEYS_LRSEL_RIGHT", value: 2, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eGraphKeys_ColumnSelect_Mode", file: !276, line: 80, baseType: !41, size: 32, elements: !282)
!282 = !{!283, !284, !285, !286}
!283 = !DIEnumerator(name: "GRAPHKEYS_COLUMNSEL_KEYS", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "GRAPHKEYS_COLUMNSEL_CFRA", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "GRAPHKEYS_COLUMNSEL_MARKERS_COLUMN", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "GRAPHKEYS_COLUMNSEL_MARKERS_BETWEEN", value: 3, isUnsigned: true)
!287 = !{!288, !5}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!289 = !{i32 7, !"Dwarf Version", i32 4}
!290 = !{i32 2, !"Debug Info Version", i32 3}
!291 = !{i32 1, !"wchar_size", i32 4}
!292 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!293 = distinct !DISubprogram(name: "graphedit_operatortypes", scope: !1, file: !1, line: 205, type: !294, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !296)
!294 = !DISubroutineType(types: !295)
!295 = !{null}
!296 = !{}
!297 = !DILocation(line: 208, column: 2, scope: !293)
!298 = !DILocation(line: 210, column: 2, scope: !293)
!299 = !DILocation(line: 211, column: 2, scope: !293)
!300 = !DILocation(line: 212, column: 2, scope: !293)
!301 = !DILocation(line: 213, column: 2, scope: !293)
!302 = !DILocation(line: 215, column: 2, scope: !293)
!303 = !DILocation(line: 216, column: 2, scope: !293)
!304 = !DILocation(line: 220, column: 2, scope: !293)
!305 = !DILocation(line: 221, column: 2, scope: !293)
!306 = !DILocation(line: 222, column: 2, scope: !293)
!307 = !DILocation(line: 223, column: 2, scope: !293)
!308 = !DILocation(line: 224, column: 2, scope: !293)
!309 = !DILocation(line: 225, column: 2, scope: !293)
!310 = !DILocation(line: 226, column: 2, scope: !293)
!311 = !DILocation(line: 227, column: 2, scope: !293)
!312 = !DILocation(line: 228, column: 2, scope: !293)
!313 = !DILocation(line: 231, column: 2, scope: !293)
!314 = !DILocation(line: 232, column: 2, scope: !293)
!315 = !DILocation(line: 233, column: 2, scope: !293)
!316 = !DILocation(line: 234, column: 2, scope: !293)
!317 = !DILocation(line: 235, column: 2, scope: !293)
!318 = !DILocation(line: 236, column: 2, scope: !293)
!319 = !DILocation(line: 237, column: 2, scope: !293)
!320 = !DILocation(line: 238, column: 2, scope: !293)
!321 = !DILocation(line: 239, column: 2, scope: !293)
!322 = !DILocation(line: 240, column: 2, scope: !293)
!323 = !DILocation(line: 241, column: 2, scope: !293)
!324 = !DILocation(line: 242, column: 2, scope: !293)
!325 = !DILocation(line: 243, column: 2, scope: !293)
!326 = !DILocation(line: 244, column: 2, scope: !293)
!327 = !DILocation(line: 245, column: 2, scope: !293)
!328 = !DILocation(line: 247, column: 2, scope: !293)
!329 = !DILocation(line: 248, column: 2, scope: !293)
!330 = !DILocation(line: 250, column: 2, scope: !293)
!331 = !DILocation(line: 251, column: 2, scope: !293)
!332 = !DILocation(line: 254, column: 2, scope: !293)
!333 = !DILocation(line: 255, column: 2, scope: !293)
!334 = !DILocation(line: 256, column: 2, scope: !293)
!335 = !DILocation(line: 257, column: 1, scope: !293)
!336 = distinct !DISubprogram(name: "GRAPH_OT_cursor_set", scope: !1, file: !1, line: 182, type: !337, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !296)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !341, line: 568, baseType: !342)
!341 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !341, line: 508, size: 1536, elements: !343)
!343 = !{!344, !348, !349, !350, !351, !1798, !1802, !1808, !1812, !1813, !1817, !1818, !1819, !1820, !1824, !1825, !1840, !1841, !1845, !1871}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !341, line: 509, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !342, file: !341, line: 510, baseType: !345, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !342, file: !341, line: 511, baseType: !345, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !342, file: !341, line: 512, baseType: !345, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !342, file: !341, line: 518, baseType: !352, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!5, !355, !358}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !357, line: 44, flags: DIFlagFwdDecl)
!357 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !267, line: 328, size: 1344, elements: !360)
!360 = !{!361, !362, !363, !367, !398, !400, !401, !402, !414, !1790, !1791, !1792, !1796, !1797}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !359, file: !267, line: 329, baseType: !358, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !359, file: !267, line: 329, baseType: !358, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !359, file: !267, line: 332, baseType: !364, size: 512, offset: 128)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 512, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !359, file: !267, line: 333, baseType: !368, size: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !370, line: 75, baseType: !371)
!370 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !370, line: 62, size: 1024, elements: !372)
!372 = !{!373, !375, !376, !377, !378, !380, !381, !382, !396, !397}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !370, line: 63, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !371, file: !370, line: 63, baseType: !374, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !371, file: !370, line: 64, baseType: !347, size: 8, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !371, file: !370, line: 64, baseType: !347, size: 8, offset: 136)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !371, file: !370, line: 65, baseType: !379, size: 16, offset: 144)
!379 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !371, file: !370, line: 66, baseType: !364, size: 512, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !371, file: !370, line: 67, baseType: !5, size: 32, offset: 672)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !371, file: !370, line: 69, baseType: !383, size: 256, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !370, line: 60, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !370, line: 48, size: 256, elements: !385)
!385 = !{!386, !387, !394, !395}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !384, file: !370, line: 49, baseType: !288, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !384, file: !370, line: 58, baseType: !388, size: 128, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !389, line: 71, baseType: !390)
!389 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !389, line: 69, size: 128, elements: !391)
!391 = !{!392, !393}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !390, file: !389, line: 70, baseType: !288, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !390, file: !389, line: 70, baseType: !288, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !384, file: !370, line: 59, baseType: !5, size: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !384, file: !370, line: 59, baseType: !5, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !371, file: !370, line: 70, baseType: !5, size: 32, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !371, file: !370, line: 74, baseType: !5, size: 32, offset: 992)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !359, file: !267, line: 336, baseType: !399, size: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !359, file: !267, line: 337, baseType: !288, size: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !359, file: !267, line: 338, baseType: !288, size: 64, offset: 832)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !359, file: !267, line: 340, baseType: !403, size: 64, offset: 896)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !357, line: 55, size: 192, elements: !405)
!405 = !{!406, !410, !413}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !404, file: !357, line: 58, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !357, line: 56, size: 64, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !407, file: !357, line: 57, baseType: !288, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !404, file: !357, line: 60, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !357, line: 41, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !357, line: 61, baseType: !288, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !359, file: !267, line: 341, baseType: !415, size: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !267, line: 106, size: 320, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !416, file: !267, line: 107, baseType: !388, size: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !416, file: !267, line: 108, baseType: !5, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !416, file: !267, line: 109, baseType: !5, size: 32, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !416, file: !267, line: 110, baseType: !5, size: 32, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !416, file: !267, line: 110, baseType: !5, size: 32, offset: 224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !416, file: !267, line: 111, baseType: !424, size: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !341, line: 490, size: 768, elements: !426)
!426 = !{!427, !428, !429, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !425, file: !341, line: 491, baseType: !424, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !425, file: !341, line: 491, baseType: !424, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !425, file: !341, line: 493, baseType: !430, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !267, line: 169, size: 2048, elements: !432)
!432 = !{!433, !434, !435, !436, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1756, !1759, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !267, line: 170, baseType: !430, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !431, file: !267, line: 170, baseType: !430, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !431, file: !267, line: 172, baseType: !288, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !431, file: !267, line: 174, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !439, line: 49, size: 1984, elements: !440)
!439 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!440 = !{!441, !477, !478, !479, !480, !481, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !438, file: !439, line: 50, baseType: !442, size: 960)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !370, line: 130, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !370, line: 117, size: 960, elements: !444)
!444 = !{!445, !446, !447, !449, !468, !472, !473, !474, !475, !476}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !443, file: !370, line: 118, baseType: !288, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !443, file: !370, line: 118, baseType: !288, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !443, file: !370, line: 119, baseType: !448, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !443, file: !370, line: 120, baseType: !450, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !370, line: 136, size: 17600, elements: !452)
!452 = !{!453, !454, !456, !459, !463, !464, !465}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !451, file: !370, line: 137, baseType: !442, size: 960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !451, file: !370, line: 138, baseType: !455, size: 64, offset: 960)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !451, file: !370, line: 139, baseType: !457, size: 64, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !370, line: 43, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !451, file: !370, line: 140, baseType: !460, size: 8192, offset: 1088)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 8192, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 1024)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !451, file: !370, line: 141, baseType: !460, size: 8192, offset: 9280)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !451, file: !370, line: 148, baseType: !450, size: 64, offset: 17472)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !451, file: !370, line: 150, baseType: !466, size: 64, offset: 17536)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !370, line: 45, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !443, file: !370, line: 121, baseType: !469, size: 528, offset: 256)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 528, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 66)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !443, file: !370, line: 126, baseType: !379, size: 16, offset: 784)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !443, file: !370, line: 127, baseType: !5, size: 32, offset: 800)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !443, file: !370, line: 128, baseType: !5, size: 32, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !443, file: !370, line: 128, baseType: !5, size: 32, offset: 864)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !443, file: !370, line: 129, baseType: !368, size: 64, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !438, file: !439, line: 52, baseType: !388, size: 128, offset: 960)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !438, file: !439, line: 53, baseType: !388, size: 128, offset: 1088)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !438, file: !439, line: 54, baseType: !388, size: 128, offset: 1216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !438, file: !439, line: 55, baseType: !388, size: 128, offset: 1344)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !438, file: !439, line: 57, baseType: !482, size: 64, offset: 1472)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !484, line: 1216, size: 39680, elements: !485)
!484 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!485 = !{!486, !487, !490, !493, !496, !497, !498, !510, !511, !516, !517, !518, !519, !520, !521, !522, !523, !524, !528, !605, !1044, !1259, !1262, !1551, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1573, !1574, !1575, !1576, !1577, !1585, !1652, !1659, !1660, !1667, !1668, !1674, !1675, !1676, !1677, !1678}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !483, file: !484, line: 1217, baseType: !442, size: 960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !483, file: !484, line: 1218, baseType: !488, size: 64, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !484, line: 58, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !483, file: !484, line: 1220, baseType: !491, size: 64, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !484, line: 50, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !483, file: !484, line: 1221, baseType: !494, size: 64, offset: 1088)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !484, line: 52, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !483, file: !484, line: 1223, baseType: !482, size: 64, offset: 1152)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !483, file: !484, line: 1225, baseType: !388, size: 128, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !483, file: !484, line: 1226, baseType: !499, size: 64, offset: 1344)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !484, line: 69, size: 320, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !500, file: !484, line: 70, baseType: !499, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !500, file: !484, line: 70, baseType: !499, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !500, file: !484, line: 71, baseType: !41, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !500, file: !484, line: 71, baseType: !41, size: 32, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !500, file: !484, line: 72, baseType: !5, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !500, file: !484, line: 73, baseType: !379, size: 16, offset: 224)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !500, file: !484, line: 73, baseType: !379, size: 16, offset: 240)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !500, file: !484, line: 74, baseType: !491, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !483, file: !484, line: 1227, baseType: !491, size: 64, offset: 1408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !483, file: !484, line: 1229, baseType: !512, size: 96, offset: 1472)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 96, elements: !514)
!513 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!514 = !{!515}
!515 = !DISubrange(count: 3)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !483, file: !484, line: 1230, baseType: !512, size: 96, offset: 1568)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !483, file: !484, line: 1231, baseType: !512, size: 96, offset: 1664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !483, file: !484, line: 1231, baseType: !512, size: 96, offset: 1760)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !483, file: !484, line: 1233, baseType: !41, size: 32, offset: 1856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !483, file: !484, line: 1234, baseType: !5, size: 32, offset: 1888)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !483, file: !484, line: 1235, baseType: !41, size: 32, offset: 1920)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !484, line: 1237, baseType: !379, size: 16, offset: 1952)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !483, file: !484, line: 1239, baseType: !347, size: 8, offset: 1968)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !483, file: !484, line: 1240, baseType: !525, size: 8, offset: 1976)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 8, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 1)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !483, file: !484, line: 1242, baseType: !529, size: 64, offset: 1984)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !531, line: 328, size: 3456, elements: !532)
!531 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!532 = !{!533, !534, !535, !538, !539, !540, !543, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !570, !571, !572, !575, !580, !581, !584, !588, !593, !597, !601, !602, !603, !604}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !530, file: !531, line: 329, baseType: !442, size: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !530, file: !531, line: 330, baseType: !488, size: 64, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !530, file: !531, line: 332, baseType: !536, size: 64, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !531, line: 332, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !530, file: !531, line: 333, baseType: !364, size: 512, offset: 1088)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !530, file: !531, line: 335, baseType: !411, size: 64, offset: 1600)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !530, file: !531, line: 337, baseType: !541, size: 64, offset: 1664)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !484, line: 61, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !530, file: !531, line: 338, baseType: !544, size: 64, offset: 1728)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 64, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 2)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !530, file: !531, line: 340, baseType: !388, size: 128, offset: 1792)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !530, file: !531, line: 340, baseType: !388, size: 128, offset: 1920)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !531, line: 342, baseType: !5, size: 32, offset: 2048)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !530, file: !531, line: 342, baseType: !5, size: 32, offset: 2080)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !530, file: !531, line: 343, baseType: !5, size: 32, offset: 2112)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !530, file: !531, line: 345, baseType: !5, size: 32, offset: 2144)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !530, file: !531, line: 346, baseType: !5, size: 32, offset: 2176)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !530, file: !531, line: 347, baseType: !379, size: 16, offset: 2208)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !530, file: !531, line: 348, baseType: !379, size: 16, offset: 2224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !530, file: !531, line: 349, baseType: !5, size: 32, offset: 2240)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !530, file: !531, line: 351, baseType: !5, size: 32, offset: 2272)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !530, file: !531, line: 353, baseType: !379, size: 16, offset: 2304)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !530, file: !531, line: 354, baseType: !379, size: 16, offset: 2320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !530, file: !531, line: 355, baseType: !5, size: 32, offset: 2336)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !530, file: !531, line: 357, baseType: !562, size: 128, offset: 2368)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !563, line: 95, baseType: !564)
!563 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !563, line: 92, size: 128, elements: !565)
!565 = !{!566, !567, !568, !569}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !564, file: !563, line: 93, baseType: !513, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !564, file: !563, line: 93, baseType: !513, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !564, file: !563, line: 94, baseType: !513, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !564, file: !563, line: 94, baseType: !513, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !530, file: !531, line: 363, baseType: !388, size: 128, offset: 2496)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !530, file: !531, line: 363, baseType: !388, size: 128, offset: 2624)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !530, file: !531, line: 368, baseType: !573, size: 64, offset: 2752)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !531, line: 48, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !530, file: !531, line: 372, baseType: !576, size: 32, offset: 2816)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !531, line: 274, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !531, line: 271, size: 32, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !577, file: !531, line: 273, baseType: !41, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !530, file: !531, line: 373, baseType: !5, size: 32, offset: 2848)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !530, file: !531, line: 382, baseType: !582, size: 64, offset: 2880)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !531, line: 46, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !530, file: !531, line: 385, baseType: !585, size: 64, offset: 2944)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !288, !513}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !530, file: !531, line: 386, baseType: !589, size: 64, offset: 3008)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !288, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !530, file: !531, line: 387, baseType: !594, size: 64, offset: 3072)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!5, !288}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !530, file: !531, line: 388, baseType: !598, size: 64, offset: 3136)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !288}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !530, file: !531, line: 389, baseType: !288, size: 64, offset: 3200)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !530, file: !531, line: 389, baseType: !288, size: 64, offset: 3264)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !530, file: !531, line: 389, baseType: !288, size: 64, offset: 3328)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !530, file: !531, line: 389, baseType: !288, size: 64, offset: 3392)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !483, file: !484, line: 1244, baseType: !606, size: 64, offset: 2048)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !608, line: 200, size: 17024, elements: !609)
!608 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!609 = !{!610, !612, !613, !614, !1037, !1038, !1039, !1040, !1041, !1042, !1043}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !607, file: !608, line: 201, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !607, file: !608, line: 202, baseType: !388, size: 128, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !607, file: !608, line: 203, baseType: !388, size: 128, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !607, file: !608, line: 206, baseType: !615, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !608, line: 190, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !608, line: 126, size: 2816, elements: !618)
!618 = !{!619, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !718, !721, !722, !723, !1007, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1036}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !617, file: !608, line: 127, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !617, file: !608, line: 127, baseType: !620, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !617, file: !608, line: 128, baseType: !288, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !617, file: !608, line: 129, baseType: !288, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !617, file: !608, line: 130, baseType: !364, size: 512, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !617, file: !608, line: 132, baseType: !5, size: 32, offset: 768)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !617, file: !608, line: 132, baseType: !5, size: 32, offset: 800)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !617, file: !608, line: 133, baseType: !5, size: 32, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !617, file: !608, line: 134, baseType: !5, size: 32, offset: 864)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !617, file: !608, line: 134, baseType: !5, size: 32, offset: 896)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !617, file: !608, line: 134, baseType: !5, size: 32, offset: 928)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !617, file: !608, line: 135, baseType: !5, size: 32, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !617, file: !608, line: 135, baseType: !5, size: 32, offset: 992)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !617, file: !608, line: 136, baseType: !5, size: 32, offset: 1024)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !617, file: !608, line: 136, baseType: !5, size: 32, offset: 1056)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !617, file: !608, line: 137, baseType: !5, size: 32, offset: 1088)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !617, file: !608, line: 137, baseType: !5, size: 32, offset: 1120)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !617, file: !608, line: 138, baseType: !513, size: 32, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !617, file: !608, line: 139, baseType: !513, size: 32, offset: 1184)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !617, file: !608, line: 139, baseType: !513, size: 32, offset: 1216)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !617, file: !608, line: 141, baseType: !379, size: 16, offset: 1248)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !617, file: !608, line: 142, baseType: !379, size: 16, offset: 1264)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !617, file: !608, line: 143, baseType: !5, size: 32, offset: 1280)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !617, file: !608, line: 144, baseType: !5, size: 32, offset: 1312)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !617, file: !608, line: 146, baseType: !645, size: 64, offset: 1344)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !608, line: 114, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !608, line: 99, size: 7232, elements: !648)
!648 = !{!649, !651, !652, !653, !654, !655, !656, !667, !671, !686, !695, !702, !712}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !647, file: !608, line: 100, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !647, file: !608, line: 100, baseType: !650, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !647, file: !608, line: 101, baseType: !5, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !647, file: !608, line: 101, baseType: !5, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !647, file: !608, line: 102, baseType: !5, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !647, file: !608, line: 102, baseType: !5, size: 32, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !647, file: !608, line: 103, baseType: !657, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !608, line: 59, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !608, line: 56, size: 2112, elements: !660)
!660 = !{!661, !665, !666}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !659, file: !608, line: 57, baseType: !662, size: 2048)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 2048, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !659, file: !608, line: 58, baseType: !5, size: 32, offset: 2048)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !659, file: !608, line: 58, baseType: !5, size: 32, offset: 2080)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !647, file: !608, line: 106, baseType: !668, size: 6144, offset: 320)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 6144, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !647, file: !608, line: 107, baseType: !672, size: 64, offset: 6464)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !608, line: 97, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !608, line: 83, size: 8320, elements: !675)
!675 = !{!676, !677, !678, !682, !683, !684, !685}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !674, file: !608, line: 84, baseType: !668, size: 6144)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !674, file: !608, line: 87, baseType: !662, size: 2048, offset: 6144)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !674, file: !608, line: 88, baseType: !679, size: 64, offset: 8192)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !681, line: 41, flags: DIFlagFwdDecl)
!681 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !674, file: !608, line: 90, baseType: !379, size: 16, offset: 8256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !674, file: !608, line: 92, baseType: !379, size: 16, offset: 8272)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !674, file: !608, line: 93, baseType: !379, size: 16, offset: 8288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !674, file: !608, line: 95, baseType: !379, size: 16, offset: 8304)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !647, file: !608, line: 108, baseType: !687, size: 64, offset: 6528)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !608, line: 66, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !608, line: 61, size: 128, elements: !690)
!690 = !{!691, !692, !693, !694}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !689, file: !608, line: 62, baseType: !5, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !689, file: !608, line: 63, baseType: !5, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !689, file: !608, line: 64, baseType: !5, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !689, file: !608, line: 65, baseType: !5, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !647, file: !608, line: 109, baseType: !696, size: 64, offset: 6592)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !608, line: 71, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !608, line: 68, size: 64, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !698, file: !608, line: 69, baseType: !5, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !698, file: !608, line: 70, baseType: !5, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !647, file: !608, line: 110, baseType: !703, size: 64, offset: 6656)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !608, line: 81, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !608, line: 73, size: 352, elements: !706)
!706 = !{!707, !708, !709, !710, !711}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !705, file: !608, line: 74, baseType: !512, size: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !705, file: !608, line: 75, baseType: !512, size: 96, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !705, file: !608, line: 76, baseType: !512, size: 96, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !705, file: !608, line: 77, baseType: !5, size: 32, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !705, file: !608, line: 78, baseType: !5, size: 32, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !647, file: !608, line: 113, baseType: !713, size: 512, offset: 6720)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !714, line: 182, baseType: !715)
!714 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !714, line: 180, size: 512, elements: !716)
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !714, line: 181, baseType: !364, size: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !617, file: !608, line: 148, baseType: !719, size: 64, offset: 1408)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !608, line: 49, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !617, file: !608, line: 151, baseType: !482, size: 64, offset: 1472)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !617, file: !608, line: 152, baseType: !491, size: 64, offset: 1536)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !617, file: !608, line: 153, baseType: !724, size: 64, offset: 1600)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !726, line: 64, size: 19136, elements: !727)
!726 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!727 = !{!728, !729, !730, !731, !732, !733, !735, !736, !737, !738, !741, !742, !993, !994, !1002, !1003, !1004, !1005, !1006}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !725, file: !726, line: 65, baseType: !442, size: 960)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !725, file: !726, line: 66, baseType: !488, size: 64, offset: 960)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !726, line: 68, baseType: !460, size: 8192, offset: 1024)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !725, file: !726, line: 70, baseType: !5, size: 32, offset: 9216)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !725, file: !726, line: 71, baseType: !5, size: 32, offset: 9248)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !725, file: !726, line: 72, baseType: !734, size: 64, offset: 9280)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !545)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !725, file: !726, line: 74, baseType: !513, size: 32, offset: 9344)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !725, file: !726, line: 74, baseType: !513, size: 32, offset: 9376)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !725, file: !726, line: 76, baseType: !679, size: 64, offset: 9408)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !725, file: !726, line: 77, baseType: !739, size: 64, offset: 9472)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !726, line: 77, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !725, file: !726, line: 78, baseType: !541, size: 64, offset: 9536)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !725, file: !726, line: 80, baseType: !743, size: 2624, offset: 9600)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !744, line: 340, size: 2624, elements: !745)
!744 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!745 = !{!746, !774, !792, !793, !794, !812, !870, !871, !973, !974, !975, !976, !982}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !743, file: !744, line: 341, baseType: !747, size: 576)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !744, line: 251, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !744, line: 207, size: 576, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !744, line: 208, baseType: !5, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !748, file: !744, line: 211, baseType: !379, size: 16, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !748, file: !744, line: 212, baseType: !379, size: 16, offset: 48)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !748, file: !744, line: 213, baseType: !513, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !748, file: !744, line: 214, baseType: !379, size: 16, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !748, file: !744, line: 215, baseType: !379, size: 16, offset: 112)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !748, file: !744, line: 216, baseType: !379, size: 16, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !748, file: !744, line: 217, baseType: !379, size: 16, offset: 144)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !748, file: !744, line: 218, baseType: !379, size: 16, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !748, file: !744, line: 219, baseType: !379, size: 16, offset: 176)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !748, file: !744, line: 220, baseType: !513, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !748, file: !744, line: 222, baseType: !379, size: 16, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !748, file: !744, line: 225, baseType: !379, size: 16, offset: 240)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !748, file: !744, line: 228, baseType: !5, size: 32, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !748, file: !744, line: 229, baseType: !5, size: 32, offset: 288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !748, file: !744, line: 233, baseType: !5, size: 32, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !748, file: !744, line: 236, baseType: !379, size: 16, offset: 352)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !748, file: !744, line: 236, baseType: !379, size: 16, offset: 368)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !748, file: !744, line: 241, baseType: !513, size: 32, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !748, file: !744, line: 244, baseType: !5, size: 32, offset: 416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !748, file: !744, line: 244, baseType: !5, size: 32, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !748, file: !744, line: 245, baseType: !513, size: 32, offset: 480)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !748, file: !744, line: 248, baseType: !513, size: 32, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !748, file: !744, line: 250, baseType: !5, size: 32, offset: 544)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !743, file: !744, line: 342, baseType: !775, size: 448, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !744, line: 79, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !744, line: 61, size: 448, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !776, file: !744, line: 62, baseType: !288, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !776, file: !744, line: 64, baseType: !379, size: 16, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !776, file: !744, line: 65, baseType: !379, size: 16, offset: 80)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !776, file: !744, line: 67, baseType: !513, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !776, file: !744, line: 68, baseType: !513, size: 32, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !776, file: !744, line: 69, baseType: !513, size: 32, offset: 160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !776, file: !744, line: 70, baseType: !379, size: 16, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !776, file: !744, line: 71, baseType: !379, size: 16, offset: 208)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !776, file: !744, line: 72, baseType: !544, size: 64, offset: 224)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !776, file: !744, line: 75, baseType: !513, size: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !776, file: !744, line: 75, baseType: !513, size: 32, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !776, file: !744, line: 75, baseType: !513, size: 32, offset: 352)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !776, file: !744, line: 78, baseType: !513, size: 32, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !776, file: !744, line: 78, baseType: !513, size: 32, offset: 416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !743, file: !744, line: 343, baseType: !388, size: 128, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !743, file: !744, line: 344, baseType: !388, size: 128, offset: 1152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !743, file: !744, line: 345, baseType: !795, size: 192, offset: 1280)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !744, line: 278, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !744, line: 270, size: 192, elements: !797)
!797 = !{!798, !799, !800, !801, !802}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !796, file: !744, line: 271, baseType: !5, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !796, file: !744, line: 273, baseType: !513, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !796, file: !744, line: 275, baseType: !5, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !796, file: !744, line: 276, baseType: !5, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !796, file: !744, line: 277, baseType: !803, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !744, line: 55, size: 576, elements: !805)
!805 = !{!806, !807, !808}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !804, file: !744, line: 56, baseType: !5, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !804, file: !744, line: 57, baseType: !513, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !804, file: !744, line: 58, baseType: !809, size: 512, offset: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 512, elements: !810)
!810 = !{!811, !811}
!811 = !DISubrange(count: 4)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !743, file: !744, line: 346, baseType: !813, size: 384, offset: 1472)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !744, line: 268, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !744, line: 253, size: 384, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !864, !865, !866, !867, !868, !869}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !814, file: !744, line: 254, baseType: !5, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !814, file: !744, line: 255, baseType: !5, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !814, file: !744, line: 255, baseType: !5, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !814, file: !744, line: 258, baseType: !513, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !814, file: !744, line: 259, baseType: !821, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !744, line: 164, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !744, line: 108, size: 1664, elements: !824)
!824 = !{!825, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !823, file: !744, line: 109, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !823, file: !744, line: 109, baseType: !826, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !823, file: !744, line: 111, baseType: !364, size: 512, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !823, file: !744, line: 119, baseType: !544, size: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !823, file: !744, line: 119, baseType: !544, size: 64, offset: 704)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !823, file: !744, line: 125, baseType: !544, size: 64, offset: 768)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !823, file: !744, line: 125, baseType: !544, size: 64, offset: 832)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !823, file: !744, line: 127, baseType: !544, size: 64, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !823, file: !744, line: 130, baseType: !5, size: 32, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !823, file: !744, line: 131, baseType: !5, size: 32, offset: 992)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !823, file: !744, line: 132, baseType: !837, size: 64, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !744, line: 106, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !744, line: 81, size: 512, elements: !840)
!840 = !{!841, !842, !845, !846, !847, !848}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !839, file: !744, line: 82, baseType: !544, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !839, file: !744, line: 97, baseType: !843, size: 256, offset: 64)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 256, elements: !844)
!844 = !{!811, !546}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !839, file: !744, line: 102, baseType: !544, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !839, file: !744, line: 102, baseType: !544, size: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !839, file: !744, line: 104, baseType: !5, size: 32, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !839, file: !744, line: 105, baseType: !5, size: 32, offset: 480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !823, file: !744, line: 135, baseType: !512, size: 96, offset: 1088)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !823, file: !744, line: 136, baseType: !513, size: 32, offset: 1184)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !823, file: !744, line: 139, baseType: !5, size: 32, offset: 1216)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !823, file: !744, line: 139, baseType: !5, size: 32, offset: 1248)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !823, file: !744, line: 139, baseType: !5, size: 32, offset: 1280)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !823, file: !744, line: 140, baseType: !512, size: 96, offset: 1312)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !823, file: !744, line: 143, baseType: !379, size: 16, offset: 1408)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !823, file: !744, line: 144, baseType: !379, size: 16, offset: 1424)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !823, file: !744, line: 145, baseType: !379, size: 16, offset: 1440)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !823, file: !744, line: 148, baseType: !379, size: 16, offset: 1456)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !823, file: !744, line: 149, baseType: !5, size: 32, offset: 1472)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !823, file: !744, line: 150, baseType: !513, size: 32, offset: 1504)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !823, file: !744, line: 152, baseType: !541, size: 64, offset: 1536)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !823, file: !744, line: 163, baseType: !513, size: 32, offset: 1600)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !823, file: !744, line: 163, baseType: !513, size: 32, offset: 1632)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !814, file: !744, line: 261, baseType: !513, size: 32, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !814, file: !744, line: 261, baseType: !513, size: 32, offset: 224)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !814, file: !744, line: 261, baseType: !513, size: 32, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !814, file: !744, line: 263, baseType: !5, size: 32, offset: 288)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !814, file: !744, line: 266, baseType: !5, size: 32, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !814, file: !744, line: 267, baseType: !513, size: 32, offset: 352)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !743, file: !744, line: 347, baseType: !821, size: 64, offset: 1856)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !743, file: !744, line: 348, baseType: !872, size: 64, offset: 1920)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !744, line: 205, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !744, line: 186, size: 1024, elements: !875)
!875 = !{!876, !878, !879, !880, !882, !883, !884, !892, !893, !894, !971, !972}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !874, file: !744, line: 187, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !874, file: !744, line: 187, baseType: !877, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !744, line: 189, baseType: !364, size: 512, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !874, file: !744, line: 191, baseType: !881, size: 64, offset: 640)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !874, file: !744, line: 193, baseType: !5, size: 32, offset: 704)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !874, file: !744, line: 193, baseType: !5, size: 32, offset: 736)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !874, file: !744, line: 195, baseType: !885, size: 64, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !744, line: 184, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !744, line: 166, size: 320, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !887, file: !744, line: 180, baseType: !843, size: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !887, file: !744, line: 182, baseType: !5, size: 32, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !887, file: !744, line: 183, baseType: !5, size: 32, offset: 288)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !874, file: !744, line: 196, baseType: !5, size: 32, offset: 832)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !874, file: !744, line: 198, baseType: !5, size: 32, offset: 864)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !874, file: !744, line: 200, baseType: !895, size: 64, offset: 896)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !681, line: 77, size: 15424, elements: !897)
!897 = !{!898, !899, !900, !903, !906, !907, !910, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !930, !931, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !957, !958, !959, !960, !961, !965}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !896, file: !681, line: 78, baseType: !442, size: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !896, file: !681, line: 80, baseType: !460, size: 8192, offset: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !896, file: !681, line: 82, baseType: !901, size: 64, offset: 9152)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !681, line: 43, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !896, file: !681, line: 83, baseType: !904, size: 64, offset: 9216)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !370, line: 46, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !896, file: !681, line: 86, baseType: !679, size: 64, offset: 9280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !896, file: !681, line: 87, baseType: !908, size: 64, offset: 9344)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !681, line: 44, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !896, file: !681, line: 89, baseType: !911, size: 512, offset: 9408)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 512, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 8)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !896, file: !681, line: 90, baseType: !379, size: 16, offset: 9920)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !896, file: !681, line: 90, baseType: !379, size: 16, offset: 9936)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !896, file: !681, line: 92, baseType: !379, size: 16, offset: 9952)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !896, file: !681, line: 92, baseType: !379, size: 16, offset: 9968)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !896, file: !681, line: 93, baseType: !379, size: 16, offset: 9984)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !896, file: !681, line: 93, baseType: !379, size: 16, offset: 10000)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !896, file: !681, line: 94, baseType: !5, size: 32, offset: 10016)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !896, file: !681, line: 97, baseType: !379, size: 16, offset: 10048)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !896, file: !681, line: 97, baseType: !379, size: 16, offset: 10064)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !896, file: !681, line: 98, baseType: !379, size: 16, offset: 10080)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !896, file: !681, line: 98, baseType: !379, size: 16, offset: 10096)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !896, file: !681, line: 99, baseType: !379, size: 16, offset: 10112)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !896, file: !681, line: 99, baseType: !379, size: 16, offset: 10128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !896, file: !681, line: 100, baseType: !41, size: 32, offset: 10144)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !896, file: !681, line: 101, baseType: !929, size: 64, offset: 10176)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !896, file: !681, line: 103, baseType: !466, size: 64, offset: 10240)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !896, file: !681, line: 104, baseType: !932, size: 64, offset: 10304)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !370, line: 159, size: 448, elements: !934)
!934 = !{!935, !937, !938, !940, !941, !943}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !933, file: !370, line: 161, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, elements: !545)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !933, file: !370, line: 162, baseType: !936, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !933, file: !370, line: 163, baseType: !939, size: 32, offset: 128)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 32, elements: !545)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !933, file: !370, line: 164, baseType: !939, size: 32, offset: 160)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !933, file: !370, line: 165, baseType: !942, size: 128, offset: 192)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 128, elements: !545)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !933, file: !370, line: 166, baseType: !944, size: 128, offset: 320)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 128, elements: !545)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !896, file: !681, line: 107, baseType: !513, size: 32, offset: 10368)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !896, file: !681, line: 108, baseType: !5, size: 32, offset: 10400)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !896, file: !681, line: 109, baseType: !379, size: 16, offset: 10432)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !896, file: !681, line: 110, baseType: !379, size: 16, offset: 10448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !896, file: !681, line: 113, baseType: !5, size: 32, offset: 10464)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !896, file: !681, line: 113, baseType: !5, size: 32, offset: 10496)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !896, file: !681, line: 114, baseType: !347, size: 8, offset: 10528)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !896, file: !681, line: 114, baseType: !347, size: 8, offset: 10536)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !896, file: !681, line: 115, baseType: !379, size: 16, offset: 10544)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !896, file: !681, line: 116, baseType: !955, size: 128, offset: 10560)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 128, elements: !956)
!956 = !{!811}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !896, file: !681, line: 119, baseType: !513, size: 32, offset: 10688)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !896, file: !681, line: 119, baseType: !513, size: 32, offset: 10720)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !896, file: !681, line: 122, baseType: !713, size: 512, offset: 10752)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !896, file: !681, line: 123, baseType: !347, size: 8, offset: 11264)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !896, file: !681, line: 125, baseType: !962, size: 56, offset: 11272)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 56, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 7)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !896, file: !681, line: 126, baseType: !966, size: 4096, offset: 11328)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 4096, elements: !912)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !681, line: 69, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !681, line: 67, size: 512, elements: !969)
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !681, line: 68, baseType: !364, size: 512)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !874, file: !744, line: 201, baseType: !513, size: 32, offset: 960)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !874, file: !744, line: 204, baseType: !5, size: 32, offset: 992)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !743, file: !744, line: 350, baseType: !388, size: 128, offset: 1984)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !743, file: !744, line: 351, baseType: !5, size: 32, offset: 2112)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !743, file: !744, line: 351, baseType: !5, size: 32, offset: 2144)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !743, file: !744, line: 353, baseType: !977, size: 64, offset: 2176)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !744, line: 297, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !744, line: 295, size: 2048, elements: !980)
!980 = !{!981}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !979, file: !744, line: 296, baseType: !662, size: 2048)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !743, file: !744, line: 355, baseType: !983, size: 384, offset: 2240)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !744, line: 338, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !744, line: 322, size: 384, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !992}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !984, file: !744, line: 323, baseType: !5, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !984, file: !744, line: 325, baseType: !379, size: 16, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !984, file: !744, line: 326, baseType: !379, size: 16, offset: 48)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !984, file: !744, line: 331, baseType: !388, size: 128, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !984, file: !744, line: 334, baseType: !388, size: 128, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !984, file: !744, line: 335, baseType: !5, size: 32, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !984, file: !744, line: 337, baseType: !5, size: 32, offset: 352)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !725, file: !726, line: 81, baseType: !288, size: 64, offset: 12224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !725, file: !726, line: 85, baseType: !995, size: 6208, offset: 12288)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !726, line: 55, size: 6208, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !995, file: !726, line: 56, baseType: !668, size: 6144)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !995, file: !726, line: 58, baseType: !379, size: 16, offset: 6144)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !995, file: !726, line: 59, baseType: !379, size: 16, offset: 6160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !995, file: !726, line: 60, baseType: !379, size: 16, offset: 6176)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !995, file: !726, line: 61, baseType: !379, size: 16, offset: 6192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !725, file: !726, line: 86, baseType: !5, size: 32, offset: 18496)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !725, file: !726, line: 88, baseType: !5, size: 32, offset: 18528)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !725, file: !726, line: 90, baseType: !5, size: 32, offset: 18560)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !725, file: !726, line: 94, baseType: !5, size: 32, offset: 18592)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !725, file: !726, line: 100, baseType: !713, size: 512, offset: 18624)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !617, file: !608, line: 154, baseType: !1008, size: 64, offset: 1664)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1010, line: 264, flags: DIFlagFwdDecl)
!1010 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !617, file: !608, line: 156, baseType: !679, size: 64, offset: 1728)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !617, file: !608, line: 158, baseType: !513, size: 32, offset: 1792)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !617, file: !608, line: 159, baseType: !513, size: 32, offset: 1824)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !617, file: !608, line: 162, baseType: !620, size: 64, offset: 1856)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !617, file: !608, line: 162, baseType: !620, size: 64, offset: 1920)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !617, file: !608, line: 162, baseType: !620, size: 64, offset: 1984)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !617, file: !608, line: 164, baseType: !388, size: 128, offset: 2048)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !617, file: !608, line: 166, baseType: !1019, size: 64, offset: 2176)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1021, line: 39, flags: DIFlagFwdDecl)
!1021 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sound.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !617, file: !608, line: 167, baseType: !288, size: 64, offset: 2240)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !617, file: !608, line: 168, baseType: !513, size: 32, offset: 2304)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !617, file: !608, line: 170, baseType: !513, size: 32, offset: 2336)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !617, file: !608, line: 170, baseType: !513, size: 32, offset: 2368)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !617, file: !608, line: 171, baseType: !513, size: 32, offset: 2400)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !617, file: !608, line: 173, baseType: !288, size: 64, offset: 2432)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !617, file: !608, line: 175, baseType: !5, size: 32, offset: 2496)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !617, file: !608, line: 176, baseType: !5, size: 32, offset: 2528)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !617, file: !608, line: 179, baseType: !5, size: 32, offset: 2560)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !617, file: !608, line: 180, baseType: !513, size: 32, offset: 2592)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !617, file: !608, line: 183, baseType: !5, size: 32, offset: 2624)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !617, file: !608, line: 185, baseType: !347, size: 8, offset: 2656)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !617, file: !608, line: 186, baseType: !1035, size: 24, offset: 2664)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 24, elements: !514)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !617, file: !608, line: 189, baseType: !388, size: 128, offset: 2688)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !607, file: !608, line: 207, baseType: !460, size: 8192, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !607, file: !608, line: 208, baseType: !460, size: 8192, offset: 8576)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !607, file: !608, line: 210, baseType: !5, size: 32, offset: 16768)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !607, file: !608, line: 210, baseType: !5, size: 32, offset: 16800)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !607, file: !608, line: 211, baseType: !5, size: 32, offset: 16832)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !607, file: !608, line: 211, baseType: !5, size: 32, offset: 16864)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !607, file: !608, line: 212, baseType: !562, size: 128, offset: 16896)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !483, file: !484, line: 1246, baseType: !1045, size: 64, offset: 2112)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !484, line: 1067, size: 5184, elements: !1047)
!1047 = !{!1048, !1078, !1079, !1094, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1116, !1132, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1242}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1046, file: !484, line: 1068, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !484, line: 934, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !484, line: 925, size: 576, elements: !1052)
!1052 = !{!1053, !1070, !1071, !1072, !1073, !1074, !1077}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1051, file: !484, line: 926, baseType: !1054, size: 320)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !484, line: 830, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !484, line: 813, size: 320, elements: !1056)
!1056 = !{!1057, !1060, !1063, !1064, !1067, !1068, !1069}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1055, file: !484, line: 814, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !484, line: 51, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1055, file: !484, line: 815, baseType: !1061, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !484, line: 815, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1055, file: !484, line: 818, baseType: !288, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1055, file: !484, line: 819, baseType: !1065, size: 32, offset: 192)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 32, elements: !956)
!1066 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1055, file: !484, line: 822, baseType: !5, size: 32, offset: 224)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1055, file: !484, line: 826, baseType: !5, size: 32, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1055, file: !484, line: 829, baseType: !5, size: 32, offset: 288)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1051, file: !484, line: 928, baseType: !379, size: 16, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1051, file: !484, line: 928, baseType: !379, size: 16, offset: 336)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1051, file: !484, line: 929, baseType: !5, size: 32, offset: 352)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1051, file: !484, line: 930, baseType: !929, size: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1051, file: !484, line: 931, baseType: !1075, size: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !484, line: 931, flags: DIFlagFwdDecl)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1051, file: !484, line: 933, baseType: !288, size: 64, offset: 512)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1046, file: !484, line: 1069, baseType: !1049, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1046, file: !484, line: 1070, baseType: !1080, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !484, line: 916, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !484, line: 891, size: 704, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1088, !1089, !1090, !1091, !1092, !1093}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1082, file: !484, line: 892, baseType: !1054, size: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !484, line: 896, baseType: !5, size: 32, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1082, file: !484, line: 900, baseType: !1087, size: 96, offset: 352)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, elements: !514)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1082, file: !484, line: 903, baseType: !513, size: 32, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1082, file: !484, line: 906, baseType: !5, size: 32, offset: 480)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1082, file: !484, line: 909, baseType: !513, size: 32, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1082, file: !484, line: 912, baseType: !513, size: 32, offset: 544)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1082, file: !484, line: 914, baseType: !491, size: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1082, file: !484, line: 915, baseType: !288, size: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1046, file: !484, line: 1071, baseType: !1095, size: 64, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !484, line: 920, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !484, line: 918, size: 320, elements: !1098)
!1098 = !{!1099}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1097, file: !484, line: 919, baseType: !1054, size: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1046, file: !484, line: 1075, baseType: !513, size: 32, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1046, file: !484, line: 1077, baseType: !513, size: 32, offset: 288)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1046, file: !484, line: 1078, baseType: !513, size: 32, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1046, file: !484, line: 1079, baseType: !379, size: 16, offset: 352)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1046, file: !484, line: 1082, baseType: !379, size: 16, offset: 368)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1046, file: !484, line: 1085, baseType: !347, size: 8, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1046, file: !484, line: 1086, baseType: !347, size: 8, offset: 392)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1046, file: !484, line: 1087, baseType: !347, size: 8, offset: 400)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !1046, file: !484, line: 1088, baseType: !347, size: 8, offset: 408)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !1046, file: !484, line: 1090, baseType: !513, size: 32, offset: 416)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !1046, file: !484, line: 1093, baseType: !379, size: 16, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !1046, file: !484, line: 1096, baseType: !347, size: 8, offset: 464)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1046, file: !484, line: 1098, baseType: !1113, size: 40, offset: 472)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 40, elements: !1114)
!1114 = !{!1115}
!1115 = !DISubrange(count: 5)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !1046, file: !484, line: 1101, baseType: !1117, size: 832, offset: 512)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !484, line: 836, size: 832, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1117, file: !484, line: 837, baseType: !1054, size: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1117, file: !484, line: 839, baseType: !379, size: 16, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1117, file: !484, line: 839, baseType: !379, size: 16, offset: 336)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1117, file: !484, line: 842, baseType: !379, size: 16, offset: 352)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1117, file: !484, line: 842, baseType: !379, size: 16, offset: 368)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1117, file: !484, line: 843, baseType: !939, size: 32, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1117, file: !484, line: 845, baseType: !5, size: 32, offset: 416)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1117, file: !484, line: 847, baseType: !288, size: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !1117, file: !484, line: 848, baseType: !895, size: 64, offset: 512)
