; ModuleID = 'blender/source/blender/modifiers/intern/MOD_edgesplit.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_edgesplit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!73 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!74 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!75 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !66, line: 116, baseType: !7, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81}
!78 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!81 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !66, line: 131, baseType: !7, size: 32, elements: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!85 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!86 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!87 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !66, line: 123, baseType: !7, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95}
!90 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!91 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!92 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!93 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!94 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!95 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 182, baseType: !7, size: 32, elements: !97)
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!99 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!100 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!101 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !104, line: 57, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!106 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!108 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!109 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!110 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!111 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!112 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!113 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!114 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!115 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!116 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!117 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!118 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!119 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 260, baseType: !7, size: 32, elements: !122)
!121 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = !{!123, !124, !125, !126, !127, !128, !129}
!123 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!126 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!127 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!128 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!129 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!130 = !{!131, !160, !161, !162, !166, !170, !233, !235, !217, !158}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "EdgeSplitModifierData", file: !61, line: 294, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EdgeSplitModifierData", file: !61, line: 289, size: 960, elements: !134)
!134 = !{!135, !157, !159}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !133, file: !61, line: 290, baseType: !136, size: 896)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !138)
!138 = !{!139, !141, !142, !144, !145, !146, !147, !152, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !61, line: 100, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !61, line: 100, baseType: !140, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !61, line: 102, baseType: !143, size: 32, offset: 128)
!143 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !137, file: !61, line: 102, baseType: !143, size: 32, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !137, file: !61, line: 103, baseType: !143, size: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !137, file: !61, line: 103, baseType: !143, size: 32, offset: 224)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !61, line: 104, baseType: !148, size: 512, offset: 256)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 512, elements: !150)
!149 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!150 = !{!151}
!151 = !DISubrange(count: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !137, file: !61, line: 107, baseType: !153, size: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !28, line: 89, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !137, file: !61, line: 109, baseType: !156, size: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "split_angle", scope: !133, file: !61, line: 292, baseType: !158, size: 32, offset: 896)
!158 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !61, line: 293, baseType: !143, size: 32, offset: 928)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !104, line: 79, baseType: !103)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !104, line: 158, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !160}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !104, line: 159, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!160, !160}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !121, line: 103, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !121, line: 90, size: 448, elements: !173)
!173 = !{!174, !183, !189, !193, !194}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !172, file: !121, line: 91, baseType: !175, size: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !121, line: 82, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !121, line: 64, size: 128, elements: !177)
!177 = !{!178, !179, !180, !181, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !176, file: !121, line: 65, baseType: !160, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !176, file: !121, line: 66, baseType: !143, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !176, file: !121, line: 73, baseType: !149, size: 8, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !176, file: !121, line: 74, baseType: !149, size: 8, offset: 104)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !176, file: !121, line: 80, baseType: !149, size: 8, offset: 112)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !172, file: !121, line: 92, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !121, line: 180, size: 16, elements: !186)
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !185, file: !121, line: 181, baseType: !188, size: 16)
!188 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !172, file: !121, line: 94, baseType: !190, size: 96, offset: 192)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 96, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 3)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !172, file: !121, line: 95, baseType: !190, size: 96, offset: 288)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !172, file: !121, line: 102, baseType: !195, size: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !121, line: 110, size: 640, elements: !197)
!197 = !{!198, !199, !200, !202, !203, !226, !232}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !196, file: !121, line: 111, baseType: !175, size: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !196, file: !121, line: 112, baseType: !184, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !196, file: !121, line: 114, baseType: !201, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !196, file: !121, line: 114, baseType: !201, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !196, file: !121, line: 118, baseType: !204, size: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !121, line: 125, size: 576, elements: !206)
!206 = !{!207, !208, !209, !210, !222, !223, !224, !225}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !205, file: !121, line: 126, baseType: !175, size: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !205, file: !121, line: 129, baseType: !201, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !205, file: !121, line: 130, baseType: !195, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !205, file: !121, line: 131, baseType: !211, size: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !121, line: 164, size: 448, elements: !213)
!213 = !{!214, !215, !216, !219, !220, !221}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !212, file: !121, line: 165, baseType: !175, size: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !212, file: !121, line: 166, baseType: !184, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !212, file: !121, line: 172, baseType: !217, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !121, line: 140, baseType: !205)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !212, file: !121, line: 174, baseType: !143, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !212, file: !121, line: 175, baseType: !190, size: 96, offset: 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !212, file: !121, line: 176, baseType: !188, size: 16, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !205, file: !121, line: 135, baseType: !204, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !205, file: !121, line: 135, baseType: !204, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !121, line: 139, baseType: !204, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !121, line: 139, baseType: !204, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !196, file: !121, line: 122, baseType: !227, size: 128, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !121, line: 108, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !121, line: 106, size: 128, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !121, line: 107, baseType: !195, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !228, file: !121, line: 107, baseType: !195, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !196, file: !121, line: 122, baseType: !227, size: 128, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !121, line: 123, baseType: !196)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !121, line: 178, baseType: !212)
!237 = !{!0}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !240)
!240 = !{!241, !245, !246, !247, !249, !251, !255, !1096, !1103, !1109, !1113, !1117, !1121, !1125, !1131, !1132, !1136, !1144, !1148, !1149, !1158, !1167}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !6, line: 123, baseType: !242, size: 256)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 256, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !239, file: !6, line: 128, baseType: !242, size: 256, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !239, file: !6, line: 131, baseType: !143, size: 32, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !239, file: !6, line: 133, baseType: !248, size: 32, offset: 544)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !239, file: !6, line: 134, baseType: !250, size: 32, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !239, file: !6, line: 142, baseType: !252, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !140, !140}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !239, file: !6, line: 151, baseType: !256, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !140, !259, !555, !857, !143, !1095}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !261, line: 115, size: 11392, elements: !262)
!261 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!262 = !{!263, !328, !332, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !349, !359, !373, !374, !416, !417, !420, !421, !437, !438, !439, !440, !441, !442, !443, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !462, !463, !464, !465, !466, !467, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !527, !528, !529, !530, !531, !532, !533, !534, !535, !538, !541, !544, !545, !546, !547, !548, !551, !554, !1042, !1043, !1049, !1050, !1051, !1052, !1053, !1054, !1056, !1059, !1062, !1064, !1083, !1084}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !260, file: !261, line: 116, baseType: !264, size: 960)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !265, line: 130, baseType: !266)
!265 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !265, line: 117, size: 960, elements: !267)
!267 = !{!268, !269, !270, !272, !291, !295, !296, !297, !298, !299}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !265, line: 118, baseType: !160, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !266, file: !265, line: 118, baseType: !160, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !266, file: !265, line: 119, baseType: !271, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !266, file: !265, line: 120, baseType: !273, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !265, line: 136, size: 17600, elements: !275)
!275 = !{!276, !277, !279, !282, !286, !287, !288}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !274, file: !265, line: 137, baseType: !264, size: 960)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !274, file: !265, line: 138, baseType: !278, size: 64, offset: 960)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !274, file: !265, line: 139, baseType: !280, size: 64, offset: 1024)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !265, line: 43, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !265, line: 140, baseType: !283, size: 8192, offset: 1088)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 8192, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 1024)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !274, file: !265, line: 141, baseType: !283, size: 8192, offset: 9280)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !274, file: !265, line: 148, baseType: !273, size: 64, offset: 17472)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !274, file: !265, line: 150, baseType: !289, size: 64, offset: 17536)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !265, line: 45, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !265, line: 121, baseType: !292, size: 528, offset: 256)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 528, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 66)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !266, file: !265, line: 126, baseType: !188, size: 16, offset: 784)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !266, file: !265, line: 127, baseType: !143, size: 32, offset: 800)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !266, file: !265, line: 128, baseType: !143, size: 32, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !266, file: !265, line: 128, baseType: !143, size: 32, offset: 864)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !266, file: !265, line: 129, baseType: !300, size: 64, offset: 896)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !265, line: 75, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !265, line: 62, size: 1024, elements: !303)
!303 = !{!304, !306, !307, !308, !309, !310, !311, !312, !326, !327}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !265, line: 63, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !302, file: !265, line: 63, baseType: !305, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !302, file: !265, line: 64, baseType: !149, size: 8, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !302, file: !265, line: 64, baseType: !149, size: 8, offset: 136)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !302, file: !265, line: 65, baseType: !188, size: 16, offset: 144)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !265, line: 66, baseType: !148, size: 512, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !302, file: !265, line: 67, baseType: !143, size: 32, offset: 672)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !302, file: !265, line: 69, baseType: !313, size: 256, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !265, line: 60, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !265, line: 48, size: 256, elements: !315)
!315 = !{!316, !317, !324, !325}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !314, file: !265, line: 49, baseType: !160, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !314, file: !265, line: 58, baseType: !318, size: 128, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !319, line: 71, baseType: !320)
!319 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !319, line: 69, size: 128, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !320, file: !319, line: 70, baseType: !160, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !320, file: !319, line: 70, baseType: !160, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !314, file: !265, line: 59, baseType: !143, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !314, file: !265, line: 59, baseType: !143, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !302, file: !265, line: 70, baseType: !143, size: 32, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !302, file: !265, line: 74, baseType: !143, size: 32, offset: 992)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !260, file: !261, line: 117, baseType: !329, size: 64, offset: 960)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !331, line: 45, flags: DIFlagFwdDecl)
!331 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !260, file: !261, line: 119, baseType: !333, size: 64, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !261, line: 57, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !261, line: 121, baseType: !188, size: 16, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !260, file: !261, line: 121, baseType: !188, size: 16, offset: 1104)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !260, file: !261, line: 122, baseType: !143, size: 32, offset: 1120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !260, file: !261, line: 122, baseType: !143, size: 32, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !260, file: !261, line: 122, baseType: !143, size: 32, offset: 1184)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !260, file: !261, line: 123, baseType: !148, size: 512, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !260, file: !261, line: 124, baseType: !259, size: 64, offset: 1728)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !260, file: !261, line: 124, baseType: !259, size: 64, offset: 1792)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !260, file: !261, line: 127, baseType: !259, size: 64, offset: 1856)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !260, file: !261, line: 127, baseType: !259, size: 64, offset: 1920)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !260, file: !261, line: 127, baseType: !259, size: 64, offset: 1984)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !260, file: !261, line: 128, baseType: !347, size: 64, offset: 2048)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !331, line: 46, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !260, file: !261, line: 130, baseType: !350, size: 64, offset: 2112)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !261, line: 97, size: 832, elements: !352)
!352 = !{!353, !357, !358}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !351, file: !261, line: 98, baseType: !354, size: 768)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 768, elements: !355)
!355 = !{!356, !192}
!356 = !DISubrange(count: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !351, file: !261, line: 99, baseType: !143, size: 32, offset: 768)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !351, file: !261, line: 99, baseType: !143, size: 32, offset: 800)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !260, file: !261, line: 131, baseType: !360, size: 64, offset: 2176)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !362, line: 486, size: 1600, elements: !363)
!362 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !361, file: !362, line: 487, baseType: !264, size: 960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !361, file: !362, line: 489, baseType: !318, size: 128, offset: 960)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !361, file: !362, line: 490, baseType: !318, size: 128, offset: 1088)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !361, file: !362, line: 491, baseType: !318, size: 128, offset: 1216)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !361, file: !362, line: 492, baseType: !318, size: 128, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !361, file: !362, line: 494, baseType: !143, size: 32, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !361, file: !362, line: 495, baseType: !143, size: 32, offset: 1504)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !361, file: !362, line: 497, baseType: !143, size: 32, offset: 1536)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !361, file: !362, line: 498, baseType: !143, size: 32, offset: 1568)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !260, file: !261, line: 132, baseType: !360, size: 64, offset: 2240)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !260, file: !261, line: 133, baseType: !375, size: 64, offset: 2304)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !362, line: 334, size: 1728, elements: !377)
!377 = !{!378, !379, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !415}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !376, file: !362, line: 335, baseType: !318, size: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !376, file: !362, line: 336, baseType: !380, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !382, line: 48, flags: DIFlagFwdDecl)
!382 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !362, line: 338, baseType: !188, size: 16, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !376, file: !362, line: 338, baseType: !188, size: 16, offset: 208)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !376, file: !362, line: 339, baseType: !7, size: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !376, file: !362, line: 340, baseType: !143, size: 32, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !376, file: !362, line: 342, baseType: !158, size: 32, offset: 288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !376, file: !362, line: 343, baseType: !190, size: 96, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !376, file: !362, line: 344, baseType: !190, size: 96, offset: 416)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !376, file: !362, line: 347, baseType: !318, size: 128, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !376, file: !362, line: 349, baseType: !143, size: 32, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !376, file: !362, line: 350, baseType: !143, size: 32, offset: 672)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !376, file: !362, line: 351, baseType: !160, size: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !376, file: !362, line: 352, baseType: !160, size: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !376, file: !362, line: 354, baseType: !396, size: 384, offset: 832)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !362, line: 116, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !362, line: 94, size: 384, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !397, file: !362, line: 96, baseType: !143, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !397, file: !362, line: 96, baseType: !143, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !397, file: !362, line: 97, baseType: !143, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !397, file: !362, line: 97, baseType: !143, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !397, file: !362, line: 99, baseType: !188, size: 16, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !397, file: !362, line: 100, baseType: !188, size: 16, offset: 144)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !397, file: !362, line: 102, baseType: !188, size: 16, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !397, file: !362, line: 105, baseType: !188, size: 16, offset: 176)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !397, file: !362, line: 108, baseType: !188, size: 16, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !397, file: !362, line: 109, baseType: !188, size: 16, offset: 208)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !397, file: !362, line: 111, baseType: !188, size: 16, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !397, file: !362, line: 112, baseType: !188, size: 16, offset: 240)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !397, file: !362, line: 114, baseType: !143, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !397, file: !362, line: 114, baseType: !143, size: 32, offset: 288)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !397, file: !362, line: 115, baseType: !143, size: 32, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !397, file: !362, line: 115, baseType: !143, size: 32, offset: 352)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !376, file: !362, line: 355, baseType: !148, size: 512, offset: 1216)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !260, file: !261, line: 134, baseType: !160, size: 64, offset: 2368)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !260, file: !261, line: 136, baseType: !418, size: 64, offset: 2432)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !261, line: 58, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !260, file: !261, line: 138, baseType: !396, size: 384, offset: 2496)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !260, file: !261, line: 139, baseType: !422, size: 64, offset: 2880)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !362, line: 80, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !362, line: 72, size: 192, elements: !425)
!425 = !{!426, !433, !434, !435, !436}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !424, file: !362, line: 73, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !362, line: 59, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !362, line: 56, size: 128, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !429, file: !362, line: 57, baseType: !190, size: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !429, file: !362, line: 58, baseType: !143, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !424, file: !362, line: 74, baseType: !143, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !424, file: !362, line: 76, baseType: !143, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !424, file: !362, line: 77, baseType: !143, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !424, file: !362, line: 79, baseType: !143, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !260, file: !261, line: 141, baseType: !318, size: 128, offset: 2944)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !260, file: !261, line: 142, baseType: !318, size: 128, offset: 3072)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !260, file: !261, line: 143, baseType: !318, size: 128, offset: 3200)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !260, file: !261, line: 144, baseType: !318, size: 128, offset: 3328)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !260, file: !261, line: 146, baseType: !143, size: 32, offset: 3456)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !260, file: !261, line: 147, baseType: !143, size: 32, offset: 3488)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !260, file: !261, line: 150, baseType: !444, size: 64, offset: 3520)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !28, line: 190, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !260, file: !261, line: 151, baseType: !156, size: 64, offset: 3584)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !260, file: !261, line: 152, baseType: !143, size: 32, offset: 3648)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !260, file: !261, line: 153, baseType: !143, size: 32, offset: 3680)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !260, file: !261, line: 156, baseType: !190, size: 96, offset: 3712)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !260, file: !261, line: 156, baseType: !190, size: 96, offset: 3808)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !260, file: !261, line: 156, baseType: !190, size: 96, offset: 3904)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !260, file: !261, line: 157, baseType: !190, size: 96, offset: 4000)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !260, file: !261, line: 158, baseType: !190, size: 96, offset: 4096)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !260, file: !261, line: 159, baseType: !190, size: 96, offset: 4192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !260, file: !261, line: 160, baseType: !190, size: 96, offset: 4288)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !260, file: !261, line: 160, baseType: !190, size: 96, offset: 4384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !260, file: !261, line: 161, baseType: !459, size: 128, offset: 4480)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 4)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !260, file: !261, line: 161, baseType: !459, size: 128, offset: 4608)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !260, file: !261, line: 162, baseType: !190, size: 96, offset: 4736)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !260, file: !261, line: 162, baseType: !190, size: 96, offset: 4832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !260, file: !261, line: 163, baseType: !158, size: 32, offset: 4928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !260, file: !261, line: 163, baseType: !158, size: 32, offset: 4960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !260, file: !261, line: 164, baseType: !468, size: 512, offset: 4992)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 512, elements: !469)
!469 = !{!461, !461}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !260, file: !261, line: 165, baseType: !468, size: 512, offset: 5504)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !260, file: !261, line: 166, baseType: !468, size: 512, offset: 6016)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !260, file: !261, line: 167, baseType: !468, size: 512, offset: 6528)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !260, file: !261, line: 176, baseType: !468, size: 512, offset: 7040)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !260, file: !261, line: 178, baseType: !7, size: 32, offset: 7552)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !261, line: 180, baseType: !188, size: 16, offset: 7584)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !260, file: !261, line: 181, baseType: !188, size: 16, offset: 7600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !260, file: !261, line: 183, baseType: !188, size: 16, offset: 7616)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !260, file: !261, line: 183, baseType: !188, size: 16, offset: 7632)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !260, file: !261, line: 184, baseType: !188, size: 16, offset: 7648)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !260, file: !261, line: 184, baseType: !188, size: 16, offset: 7664)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !260, file: !261, line: 185, baseType: !188, size: 16, offset: 7680)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !260, file: !261, line: 186, baseType: !188, size: 16, offset: 7696)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !260, file: !261, line: 187, baseType: !188, size: 16, offset: 7712)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !260, file: !261, line: 188, baseType: !149, size: 8, offset: 7728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !260, file: !261, line: 189, baseType: !149, size: 8, offset: 7736)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !260, file: !261, line: 192, baseType: !143, size: 32, offset: 7744)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !260, file: !261, line: 192, baseType: !143, size: 32, offset: 7776)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !260, file: !261, line: 192, baseType: !143, size: 32, offset: 7808)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !260, file: !261, line: 192, baseType: !143, size: 32, offset: 7840)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !260, file: !261, line: 194, baseType: !143, size: 32, offset: 7872)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !260, file: !261, line: 202, baseType: !158, size: 32, offset: 7904)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !260, file: !261, line: 202, baseType: !158, size: 32, offset: 7936)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !260, file: !261, line: 202, baseType: !158, size: 32, offset: 7968)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !260, file: !261, line: 211, baseType: !158, size: 32, offset: 8000)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !260, file: !261, line: 212, baseType: !158, size: 32, offset: 8032)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !260, file: !261, line: 213, baseType: !158, size: 32, offset: 8064)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !260, file: !261, line: 214, baseType: !158, size: 32, offset: 8096)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !260, file: !261, line: 215, baseType: !158, size: 32, offset: 8128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !260, file: !261, line: 216, baseType: !158, size: 32, offset: 8160)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !260, file: !261, line: 219, baseType: !158, size: 32, offset: 8192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !260, file: !261, line: 220, baseType: !158, size: 32, offset: 8224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !260, file: !261, line: 221, baseType: !158, size: 32, offset: 8256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !260, file: !261, line: 224, baseType: !504, size: 16, offset: 8288)
!504 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !260, file: !261, line: 224, baseType: !504, size: 16, offset: 8304)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !260, file: !261, line: 226, baseType: !188, size: 16, offset: 8320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !260, file: !261, line: 228, baseType: !149, size: 8, offset: 8336)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !260, file: !261, line: 229, baseType: !149, size: 8, offset: 8344)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !260, file: !261, line: 231, baseType: !188, size: 16, offset: 8352)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !260, file: !261, line: 232, baseType: !149, size: 8, offset: 8368)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !260, file: !261, line: 233, baseType: !149, size: 8, offset: 8376)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !260, file: !261, line: 234, baseType: !158, size: 32, offset: 8384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !260, file: !261, line: 235, baseType: !158, size: 32, offset: 8416)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !260, file: !261, line: 237, baseType: !318, size: 128, offset: 8448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !260, file: !261, line: 238, baseType: !318, size: 128, offset: 8576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !260, file: !261, line: 239, baseType: !318, size: 128, offset: 8704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !260, file: !261, line: 240, baseType: !318, size: 128, offset: 8832)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !260, file: !261, line: 242, baseType: !158, size: 32, offset: 8960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !260, file: !261, line: 244, baseType: !188, size: 16, offset: 8992)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !260, file: !261, line: 245, baseType: !504, size: 16, offset: 9008)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !260, file: !261, line: 246, baseType: !459, size: 128, offset: 9024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !260, file: !261, line: 248, baseType: !143, size: 32, offset: 9152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !260, file: !261, line: 249, baseType: !143, size: 32, offset: 9184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !260, file: !261, line: 251, baseType: !525, size: 64, offset: 9216)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !261, line: 251, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !260, file: !261, line: 253, baseType: !149, size: 8, offset: 9280)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !260, file: !261, line: 254, baseType: !149, size: 8, offset: 9288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !260, file: !261, line: 255, baseType: !188, size: 16, offset: 9296)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !260, file: !261, line: 256, baseType: !190, size: 96, offset: 9312)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !260, file: !261, line: 258, baseType: !318, size: 128, offset: 9408)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !260, file: !261, line: 259, baseType: !318, size: 128, offset: 9536)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !260, file: !261, line: 260, baseType: !318, size: 128, offset: 9664)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !260, file: !261, line: 261, baseType: !318, size: 128, offset: 9792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !260, file: !261, line: 263, baseType: !536, size: 64, offset: 9920)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !261, line: 52, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !260, file: !261, line: 264, baseType: !539, size: 64, offset: 9984)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !261, line: 53, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !260, file: !261, line: 265, baseType: !542, size: 64, offset: 10048)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !362, line: 46, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !260, file: !261, line: 267, baseType: !149, size: 8, offset: 10112)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !260, file: !261, line: 268, baseType: !149, size: 8, offset: 10120)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !260, file: !261, line: 269, baseType: !188, size: 16, offset: 10128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !260, file: !261, line: 270, baseType: !158, size: 32, offset: 10144)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !260, file: !261, line: 272, baseType: !549, size: 64, offset: 10176)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !61, line: 732, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !260, file: !261, line: 275, baseType: !552, size: 64, offset: 10240)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !261, line: 275, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !260, file: !261, line: 277, baseType: !555, size: 64, offset: 10304)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !557)
!557 = !{!558, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !610, !613, !615, !616, !618, !619, !620, !621, !627, !632, !633, !637, !638, !639, !640, !641, !654, !666, !680, !684, !688, !692, !701, !713, !717, !721, !725, !729, !733, !734, !735, !736, !737, !738, !742, !743, !744, !745, !749, !750, !751, !752, !753, !758, !759, !760, !761, !762, !766, !767, !768, !769, !770, !777, !788, !793, !799, !809, !815, !826, !833, !840, !844, !849, !853, !858, !859, !860, !867, !873, !874, !875, !880, !881, !890, !999, !1003, !1011, !1015, !1019, !1023, !1031, !1041}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !556, file: !28, line: 180, baseType: !559, size: 1600)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !560, line: 73, baseType: !561)
!560 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !560, line: 64, size: 1600, elements: !562)
!562 = !{!563, !578, !582, !583, !584, !585, !588}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !561, file: !560, line: 65, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !560, line: 53, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !560, line: 42, size: 832, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !566, file: !560, line: 43, baseType: !143, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !566, file: !560, line: 44, baseType: !143, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !566, file: !560, line: 45, baseType: !143, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !566, file: !560, line: 46, baseType: !143, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !566, file: !560, line: 47, baseType: !143, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !566, file: !560, line: 48, baseType: !143, size: 32, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !566, file: !560, line: 49, baseType: !143, size: 32, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !566, file: !560, line: 50, baseType: !143, size: 32, offset: 224)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !566, file: !560, line: 51, baseType: !148, size: 512, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !566, file: !560, line: 52, baseType: !160, size: 64, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !561, file: !560, line: 66, baseType: !579, size: 1312, offset: 64)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 1312, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 41)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !561, file: !560, line: 69, baseType: !143, size: 32, offset: 1376)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !561, file: !560, line: 69, baseType: !143, size: 32, offset: 1408)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !561, file: !560, line: 70, baseType: !143, size: 32, offset: 1440)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !561, file: !560, line: 71, baseType: !586, size: 64, offset: 1472)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !560, line: 71, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !561, file: !560, line: 72, baseType: !589, size: 64, offset: 1536)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !560, line: 59, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !560, line: 57, size: 8192, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !591, file: !560, line: 58, baseType: !283, size: 8192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !556, file: !28, line: 180, baseType: !559, size: 1600, offset: 1600)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !556, file: !28, line: 180, baseType: !559, size: 1600, offset: 3200)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !556, file: !28, line: 180, baseType: !559, size: 1600, offset: 4800)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !556, file: !28, line: 180, baseType: !559, size: 1600, offset: 6400)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !556, file: !28, line: 181, baseType: !143, size: 32, offset: 8000)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !556, file: !28, line: 181, baseType: !143, size: 32, offset: 8032)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !556, file: !28, line: 181, baseType: !143, size: 32, offset: 8064)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !556, file: !28, line: 181, baseType: !143, size: 32, offset: 8096)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !556, file: !28, line: 181, baseType: !143, size: 32, offset: 8128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !556, file: !28, line: 182, baseType: !143, size: 32, offset: 8160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !556, file: !28, line: 183, baseType: !143, size: 32, offset: 8192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !556, file: !28, line: 184, baseType: !606, size: 64, offset: 8256)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !607, line: 124, baseType: !608)
!607 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !607, line: 124, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !556, file: !28, line: 185, baseType: !611, size: 64, offset: 8320)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !28, line: 186, baseType: !614, size: 32, offset: 8384)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !556, file: !28, line: 187, baseType: !158, size: 32, offset: 8416)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !556, file: !28, line: 188, baseType: !617, size: 32, offset: 8448)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !556, file: !28, line: 189, baseType: !143, size: 32, offset: 8480)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !556, file: !28, line: 190, baseType: !444, size: 64, offset: 8512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !556, file: !28, line: 193, baseType: !149, size: 8, offset: 8576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !556, file: !28, line: 196, baseType: !622, size: 64, offset: 8640)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !556)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !556, file: !28, line: 199, baseType: !628, size: 64, offset: 8704)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !625, !631}
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !556, file: !28, line: 202, baseType: !622, size: 64, offset: 8768)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !556, file: !28, line: 207, baseType: !634, size: 64, offset: 8832)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!143, !625}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !556, file: !28, line: 208, baseType: !634, size: 64, offset: 8896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !556, file: !28, line: 209, baseType: !634, size: 64, offset: 8960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !556, file: !28, line: 210, baseType: !634, size: 64, offset: 9024)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !556, file: !28, line: 211, baseType: !634, size: 64, offset: 9088)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !556, file: !28, line: 218, baseType: !642, size: 64, offset: 9152)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !625, !143, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !647, line: 65, size: 160, elements: !648)
!647 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!648 = !{!649, !650, !652, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !646, file: !647, line: 66, baseType: !190, size: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !646, file: !647, line: 67, baseType: !651, size: 48, offset: 96)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 48, elements: !191)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !646, file: !647, line: 68, baseType: !149, size: 8, offset: 144)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !646, file: !647, line: 68, baseType: !149, size: 8, offset: 152)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !556, file: !28, line: 219, baseType: !655, size: 64, offset: 9216)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !625, !143, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !647, line: 48, size: 96, elements: !660)
!660 = !{!661, !662, !663, !664, !665}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !659, file: !647, line: 49, baseType: !7, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !659, file: !647, line: 49, baseType: !7, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !659, file: !647, line: 50, baseType: !149, size: 8, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !659, file: !647, line: 50, baseType: !149, size: 8, offset: 72)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !659, file: !647, line: 51, baseType: !188, size: 16, offset: 80)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !556, file: !28, line: 220, baseType: !667, size: 64, offset: 9280)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !625, !143, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !647, line: 42, size: 160, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !671, file: !647, line: 43, baseType: !7, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !671, file: !647, line: 43, baseType: !7, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !671, file: !647, line: 43, baseType: !7, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !671, file: !647, line: 43, baseType: !7, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !671, file: !647, line: 44, baseType: !188, size: 16, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !671, file: !647, line: 45, baseType: !149, size: 8, offset: 144)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !671, file: !647, line: 45, baseType: !149, size: 8, offset: 152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !556, file: !28, line: 227, baseType: !681, size: 64, offset: 9344)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!645, !625}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !556, file: !28, line: 228, baseType: !685, size: 64, offset: 9408)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!658, !625}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !556, file: !28, line: 229, baseType: !689, size: 64, offset: 9472)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!670, !625}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !556, file: !28, line: 230, baseType: !693, size: 64, offset: 9536)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!696, !625}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !647, line: 88, size: 64, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !697, file: !647, line: 89, baseType: !7, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !697, file: !647, line: 90, baseType: !7, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !556, file: !28, line: 231, baseType: !702, size: 64, offset: 9600)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!705, !625}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !647, line: 79, size: 96, elements: !707)
!707 = !{!708, !709, !710, !711, !712}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !706, file: !647, line: 81, baseType: !143, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !706, file: !647, line: 82, baseType: !143, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !706, file: !647, line: 83, baseType: !188, size: 16, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !706, file: !647, line: 84, baseType: !149, size: 8, offset: 80)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !706, file: !647, line: 84, baseType: !149, size: 8, offset: 88)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !556, file: !28, line: 236, baseType: !714, size: 64, offset: 9664)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !625, !645}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !556, file: !28, line: 237, baseType: !718, size: 64, offset: 9728)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !625, !658}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !556, file: !28, line: 238, baseType: !722, size: 64, offset: 9792)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !625, !670}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !556, file: !28, line: 239, baseType: !726, size: 64, offset: 9856)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !625, !696}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !556, file: !28, line: 240, baseType: !730, size: 64, offset: 9920)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !625, !705}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !556, file: !28, line: 245, baseType: !681, size: 64, offset: 9984)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !556, file: !28, line: 246, baseType: !685, size: 64, offset: 10048)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !556, file: !28, line: 247, baseType: !689, size: 64, offset: 10112)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !556, file: !28, line: 248, baseType: !693, size: 64, offset: 10176)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !556, file: !28, line: 249, baseType: !702, size: 64, offset: 10240)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !556, file: !28, line: 255, baseType: !739, size: 64, offset: 10304)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!160, !625, !143, !143}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !556, file: !28, line: 256, baseType: !739, size: 64, offset: 10368)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !556, file: !28, line: 257, baseType: !739, size: 64, offset: 10432)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !556, file: !28, line: 258, baseType: !739, size: 64, offset: 10496)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !556, file: !28, line: 264, baseType: !746, size: 64, offset: 10560)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!160, !625, !143}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !556, file: !28, line: 265, baseType: !746, size: 64, offset: 10624)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !556, file: !28, line: 266, baseType: !746, size: 64, offset: 10688)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !556, file: !28, line: 267, baseType: !746, size: 64, offset: 10752)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !556, file: !28, line: 268, baseType: !746, size: 64, offset: 10816)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !556, file: !28, line: 272, baseType: !754, size: 64, offset: 10880)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!757, !625}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !556, file: !28, line: 273, baseType: !754, size: 64, offset: 10944)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !556, file: !28, line: 274, baseType: !754, size: 64, offset: 11008)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !556, file: !28, line: 275, baseType: !754, size: 64, offset: 11072)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !556, file: !28, line: 276, baseType: !754, size: 64, offset: 11136)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !556, file: !28, line: 279, baseType: !763, size: 64, offset: 11200)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !625, !143, !757, !143}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !556, file: !28, line: 280, baseType: !763, size: 64, offset: 11264)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !556, file: !28, line: 281, baseType: !763, size: 64, offset: 11328)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !556, file: !28, line: 284, baseType: !634, size: 64, offset: 11392)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !556, file: !28, line: 285, baseType: !634, size: 64, offset: 11456)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !556, file: !28, line: 286, baseType: !771, size: 64, offset: 11520)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!774, !625}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !556, file: !28, line: 287, baseType: !778, size: 64, offset: 11584)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !625}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !784)
!784 = !{!785, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !783, file: !28, line: 118, baseType: !786, size: 128)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !460)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !783, file: !28, line: 119, baseType: !786, size: 128, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !556, file: !28, line: 288, baseType: !789, size: 64, offset: 11648)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!792, !625}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !556, file: !28, line: 289, baseType: !794, size: 64, offset: 11712)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !625, !797}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !556, file: !28, line: 290, baseType: !800, size: 64, offset: 11776)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!803, !625}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !805, file: !28, line: 124, baseType: !188, size: 16)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !805, file: !28, line: 125, baseType: !149, size: 8, offset: 16)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !556, file: !28, line: 291, baseType: !810, size: 64, offset: 11840)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!813, !625}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !556, file: !28, line: 299, baseType: !816, size: 64, offset: 11904)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !625, !819, !160, !825}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !160, !143, !822, !822, !823}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !556, file: !28, line: 309, baseType: !827, size: 64, offset: 11968)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !625, !830, !160}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !160, !143, !822, !822}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !556, file: !28, line: 317, baseType: !834, size: 64, offset: 12032)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !625, !837, !160, !825}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !160, !143, !143, !822, !822}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !556, file: !28, line: 327, baseType: !841, size: 64, offset: 12096)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !625, !830, !160, !825}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !556, file: !28, line: 337, baseType: !845, size: 64, offset: 12160)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !625, !848, !848}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !556, file: !28, line: 344, baseType: !850, size: 64, offset: 12224)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !625, !143, !848}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !556, file: !28, line: 347, baseType: !854, size: 64, offset: 12288)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !625, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !556, file: !28, line: 350, baseType: !850, size: 64, offset: 12352)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !556, file: !28, line: 351, baseType: !850, size: 64, offset: 12416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !556, file: !28, line: 355, baseType: !861, size: 64, offset: 12480)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!864, !259, !625}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !556, file: !28, line: 359, baseType: !868, size: 64, offset: 12544)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!871, !259, !625}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !556, file: !28, line: 364, baseType: !622, size: 64, offset: 12608)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !556, file: !28, line: 367, baseType: !622, size: 64, offset: 12672)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !556, file: !28, line: 373, baseType: !876, size: 64, offset: 12736)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !625, !879, !879}
!879 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !556, file: !28, line: 376, baseType: !622, size: 64, offset: 12800)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !556, file: !28, line: 385, baseType: !882, size: 64, offset: 12864)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !625, !885, !879, !886}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!143, !143, !160}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !556, file: !28, line: 391, baseType: !891, size: 64, offset: 12928)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !625, !894, !994, !160, !998}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!898, !899, !993, !143}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !647, line: 160, size: 384, elements: !901)
!901 = !{!902, !906, !988, !989, !990, !991, !992}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !900, file: !647, line: 161, baseType: !903, size: 256)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 256, elements: !904)
!904 = !{!461, !905}
!905 = !DISubrange(count: 2)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !900, file: !647, line: 162, baseType: !907, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !909, line: 77, size: 15424, elements: !910)
!909 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!910 = !{!911, !912, !913, !916, !919, !922, !925, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !977, !978, !982}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !908, file: !909, line: 78, baseType: !264, size: 960)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !909, line: 80, baseType: !283, size: 8192, offset: 960)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !908, file: !909, line: 82, baseType: !914, size: 64, offset: 9152)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !909, line: 43, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !908, file: !909, line: 83, baseType: !917, size: 64, offset: 9216)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !265, line: 46, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !908, file: !909, line: 86, baseType: !920, size: 64, offset: 9280)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !909, line: 41, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !908, file: !909, line: 87, baseType: !923, size: 64, offset: 9344)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !909, line: 44, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !908, file: !909, line: 89, baseType: !926, size: 512, offset: 9408)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 512, elements: !927)
!927 = !{!356}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !908, file: !909, line: 90, baseType: !188, size: 16, offset: 9920)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !908, file: !909, line: 90, baseType: !188, size: 16, offset: 9936)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !908, file: !909, line: 92, baseType: !188, size: 16, offset: 9952)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !908, file: !909, line: 92, baseType: !188, size: 16, offset: 9968)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !908, file: !909, line: 93, baseType: !188, size: 16, offset: 9984)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !908, file: !909, line: 93, baseType: !188, size: 16, offset: 10000)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !908, file: !909, line: 94, baseType: !143, size: 32, offset: 10016)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !908, file: !909, line: 97, baseType: !188, size: 16, offset: 10048)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !908, file: !909, line: 97, baseType: !188, size: 16, offset: 10064)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !908, file: !909, line: 98, baseType: !188, size: 16, offset: 10080)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !908, file: !909, line: 98, baseType: !188, size: 16, offset: 10096)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !908, file: !909, line: 99, baseType: !188, size: 16, offset: 10112)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !908, file: !909, line: 99, baseType: !188, size: 16, offset: 10128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !908, file: !909, line: 100, baseType: !7, size: 32, offset: 10144)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !908, file: !909, line: 101, baseType: !814, size: 64, offset: 10176)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !908, file: !909, line: 103, baseType: !289, size: 64, offset: 10240)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !908, file: !909, line: 104, baseType: !945, size: 64, offset: 10304)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !265, line: 159, size: 448, elements: !947)
!947 = !{!948, !951, !952, !954, !955, !957}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !946, file: !265, line: 161, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !950)
!950 = !{!905}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !946, file: !265, line: 162, baseType: !949, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !946, file: !265, line: 163, baseType: !953, size: 32, offset: 128)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 32, elements: !950)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !946, file: !265, line: 164, baseType: !953, size: 32, offset: 160)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !946, file: !265, line: 165, baseType: !956, size: 128, offset: 192)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 128, elements: !950)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !946, file: !265, line: 166, baseType: !958, size: 128, offset: 320)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 128, elements: !950)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !908, file: !909, line: 107, baseType: !158, size: 32, offset: 10368)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !908, file: !909, line: 108, baseType: !143, size: 32, offset: 10400)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !908, file: !909, line: 109, baseType: !188, size: 16, offset: 10432)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !908, file: !909, line: 110, baseType: !188, size: 16, offset: 10448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !908, file: !909, line: 113, baseType: !143, size: 32, offset: 10464)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !908, file: !909, line: 113, baseType: !143, size: 32, offset: 10496)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !908, file: !909, line: 114, baseType: !149, size: 8, offset: 10528)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !908, file: !909, line: 114, baseType: !149, size: 8, offset: 10536)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !908, file: !909, line: 115, baseType: !188, size: 16, offset: 10544)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !908, file: !909, line: 116, baseType: !459, size: 128, offset: 10560)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !908, file: !909, line: 119, baseType: !158, size: 32, offset: 10688)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !908, file: !909, line: 119, baseType: !158, size: 32, offset: 10720)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !908, file: !909, line: 122, baseType: !972, size: 512, offset: 10752)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !973, line: 182, baseType: !974)
!973 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !973, line: 180, size: 512, elements: !975)
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !974, file: !973, line: 181, baseType: !148, size: 512)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !908, file: !909, line: 123, baseType: !149, size: 8, offset: 11264)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !908, file: !909, line: 125, baseType: !979, size: 56, offset: 11272)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 56, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 7)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !908, file: !909, line: 126, baseType: !983, size: 4096, offset: 11328)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 4096, elements: !927)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !909, line: 69, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !909, line: 67, size: 512, elements: !986)
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !985, file: !909, line: 68, baseType: !148, size: 512)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !900, file: !647, line: 163, baseType: !149, size: 8, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !900, file: !647, line: 163, baseType: !149, size: 8, offset: 328)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !900, file: !647, line: 164, baseType: !188, size: 16, offset: 336)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !900, file: !647, line: 164, baseType: !188, size: 16, offset: 352)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !900, file: !647, line: 164, baseType: !188, size: 16, offset: 368)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !879)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!143, !160, !143, !143}
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !556, file: !28, line: 400, baseType: !1000, size: 64, offset: 12992)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !625, !886}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !556, file: !28, line: 415, baseType: !1004, size: 64, offset: 13056)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !625, !1007, !886, !994, !160, !998}
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!898, !160, !143}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !556, file: !28, line: 425, baseType: !1012, size: 64, offset: 13120)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !625, !1007, !994, !160, !998}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !556, file: !28, line: 435, baseType: !1016, size: 64, offset: 13184)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !625, !886, !1007, !160}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !556, file: !28, line: 444, baseType: !1020, size: 64, offset: 13248)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !625, !1007, !160}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !556, file: !28, line: 455, baseType: !1024, size: 64, offset: 13312)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !625, !1007, !1027, !160}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !160, !143, !158}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !556, file: !28, line: 464, baseType: !1032, size: 64, offset: 13376)
