; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_queries.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_queries.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFace = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMLoop*, i32, [3 x float], i16 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMIter = type { %union.anon, void (i8*)*, i8* (i8*)*, i32, i8 }
%union.anon = type { %struct.BMIter__face_of_vert }

!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "_FLAG_JF", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "_FLAG_MF", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "_FLAG_MV", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "_FLAG_OVERLAP", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "_FLAG_WALK", value: 8, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 260, baseType: !5, size: 32, elements: !31)
!30 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = !{!32, !33, !34, !35, !36, !37, !38}
!32 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!36 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!37 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!38 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !40, line: 94, baseType: !5, size: 32, elements: !41)
!40 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49}
!42 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!45 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!46 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!47 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!48 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!49 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !40, line: 116, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !40, line: 131, baseType: !5, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!59 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!60 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!61 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !40, line: 123, baseType: !5, size: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!65 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!66 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!67 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!68 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!69 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 182, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76}
!72 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 249, baseType: !5, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!83 = !{!84, !85, !86, !151, !153, !158, !159, !163, !167, !108, !169, !98}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !30, line: 178, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !30, line: 164, size: 448, elements: !89)
!89 = !{!90, !101, !107, !148, !149, !150}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !88, file: !30, line: 165, baseType: !91, size: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !30, line: 82, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !30, line: 64, size: 128, elements: !93)
!93 = !{!94, !95, !97, !99, !100}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !30, line: 65, baseType: !84, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !92, file: !30, line: 66, baseType: !96, size: 32, offset: 64)
!96 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !92, file: !30, line: 73, baseType: !98, size: 8, offset: 96)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !92, file: !30, line: 74, baseType: !98, size: 8, offset: 104)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !92, file: !30, line: 80, baseType: !98, size: 8, offset: 112)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !88, file: !30, line: 166, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !30, line: 180, size: 16, elements: !104)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !103, file: !30, line: 181, baseType: !106, size: 16)
!106 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !88, file: !30, line: 172, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !30, line: 140, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !30, line: 125, size: 576, elements: !111)
!111 = !{!112, !113, !141, !142, !144, !145, !146, !147}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !110, file: !30, line: 126, baseType: !91, size: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !110, file: !30, line: 129, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !30, line: 90, size: 448, elements: !116)
!116 = !{!117, !118, !119, !123, !124}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !115, file: !30, line: 91, baseType: !91, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !115, file: !30, line: 92, baseType: !102, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !115, file: !30, line: 94, baseType: !120, size: 96, offset: 192)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 96, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 3)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !115, file: !30, line: 95, baseType: !120, size: 96, offset: 288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !115, file: !30, line: 102, baseType: !125, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !30, line: 110, size: 640, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !134, !140}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !126, file: !30, line: 111, baseType: !91, size: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !126, file: !30, line: 112, baseType: !102, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !126, file: !30, line: 114, baseType: !114, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !126, file: !30, line: 114, baseType: !114, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !126, file: !30, line: 118, baseType: !133, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !126, file: !30, line: 122, baseType: !135, size: 128, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !30, line: 108, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !30, line: 106, size: 128, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !136, file: !30, line: 107, baseType: !125, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !136, file: !30, line: 107, baseType: !125, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !126, file: !30, line: 122, baseType: !135, size: 128, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !110, file: !30, line: 130, baseType: !125, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !110, file: !30, line: 131, baseType: !143, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !110, file: !30, line: 135, baseType: !133, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !110, file: !30, line: 135, baseType: !133, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !30, line: 139, baseType: !133, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !30, line: 139, baseType: !133, size: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !88, file: !30, line: 174, baseType: !96, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !88, file: !30, line: 175, baseType: !120, size: 96, offset: 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !88, file: !30, line: 176, baseType: !106, size: 16, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !30, line: 103, baseType: !115)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !30, line: 154, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !30, line: 152, size: 128, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !30, line: 153, baseType: !91, size: 128)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !4, line: 79, baseType: !3)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !4, line: 158, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !84}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !4, line: 159, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!84, !84}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !30, line: 123, baseType: !126)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!170 = !{i32 7, !"Dwarf Version", i32 4}
!171 = !{i32 2, !"Debug Info Version", i32 3}
!172 = !{i32 1, !"wchar_size", i32 4}
!173 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!174 = distinct !DISubprogram(name: "BM_face_other_edge_loop", scope: !1, file: !1, line: 62, type: !175, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!175 = !DISubroutineType(types: !176)
!176 = !{!108, !86, !167, !151}
!177 = !{}
!178 = !DILocalVariable(name: "f", arg: 1, scope: !174, file: !1, line: 62, type: !86)
!179 = !DILocation(line: 62, column: 41, scope: !174)
!180 = !DILocalVariable(name: "e", arg: 2, scope: !174, file: !1, line: 62, type: !167)
!181 = !DILocation(line: 62, column: 52, scope: !174)
!182 = !DILocalVariable(name: "v", arg: 3, scope: !174, file: !1, line: 62, type: !151)
!183 = !DILocation(line: 62, column: 63, scope: !174)
!184 = !DILocalVariable(name: "l", scope: !174, file: !1, line: 64, type: !108)
!185 = !DILocation(line: 64, column: 10, scope: !174)
!186 = !DILocation(line: 64, column: 38, scope: !174)
!187 = !DILocation(line: 64, column: 41, scope: !174)
!188 = !DILocation(line: 64, column: 14, scope: !174)
!189 = !DILocation(line: 66, column: 33, scope: !174)
!190 = !DILocation(line: 66, column: 36, scope: !174)
!191 = !DILocation(line: 66, column: 9, scope: !174)
!192 = !DILocation(line: 66, column: 2, scope: !174)
!193 = distinct !DISubprogram(name: "BM_face_edge_share_loop", scope: !1, file: !1, line: 1073, type: !194, scopeLine: 1074, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!194 = !DISubroutineType(types: !195)
!195 = !{!108, !86, !167}
!196 = !DILocalVariable(name: "f", arg: 1, scope: !193, file: !1, line: 1073, type: !86)
!197 = !DILocation(line: 1073, column: 41, scope: !193)
!198 = !DILocalVariable(name: "e", arg: 2, scope: !193, file: !1, line: 1073, type: !167)
!199 = !DILocation(line: 1073, column: 52, scope: !193)
!200 = !DILocalVariable(name: "l_first", scope: !193, file: !1, line: 1075, type: !108)
!201 = !DILocation(line: 1075, column: 10, scope: !193)
!202 = !DILocalVariable(name: "l_iter", scope: !193, file: !1, line: 1076, type: !108)
!203 = !DILocation(line: 1076, column: 10, scope: !193)
!204 = !DILocation(line: 1078, column: 21, scope: !193)
!205 = !DILocation(line: 1078, column: 24, scope: !193)
!206 = !DILocation(line: 1078, column: 19, scope: !193)
!207 = !DILocation(line: 1078, column: 9, scope: !193)
!208 = !DILocation(line: 1079, column: 2, scope: !193)
!209 = !DILocation(line: 1080, column: 7, scope: !210)
!210 = distinct !DILexicalBlock(scope: !211, file: !1, line: 1080, column: 7)
!211 = distinct !DILexicalBlock(scope: !193, file: !1, line: 1079, column: 5)
!212 = !DILocation(line: 1080, column: 15, scope: !210)
!213 = !DILocation(line: 1080, column: 20, scope: !210)
!214 = !DILocation(line: 1080, column: 17, scope: !210)
!215 = !DILocation(line: 1080, column: 7, scope: !211)
!216 = !DILocation(line: 1081, column: 11, scope: !217)
!217 = distinct !DILexicalBlock(scope: !210, file: !1, line: 1080, column: 23)
!218 = !DILocation(line: 1081, column: 4, scope: !217)
!219 = !DILocation(line: 1083, column: 2, scope: !211)
!220 = !DILocation(line: 1083, column: 21, scope: !193)
!221 = !DILocation(line: 1083, column: 29, scope: !193)
!222 = !DILocation(line: 1083, column: 19, scope: !193)
!223 = !DILocation(line: 1083, column: 45, scope: !193)
!224 = !DILocation(line: 1083, column: 42, scope: !193)
!225 = distinct !{!225, !208, !226}
!226 = !DILocation(line: 1083, column: 52, scope: !193)
!227 = !DILocation(line: 1085, column: 2, scope: !193)
!228 = !DILocation(line: 1086, column: 1, scope: !193)
!229 = distinct !DISubprogram(name: "BM_loop_other_edge_loop", scope: !1, file: !1, line: 73, type: !230, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!230 = !DISubroutineType(types: !231)
!231 = !{!108, !108, !151}
!232 = !DILocalVariable(name: "l", arg: 1, scope: !229, file: !1, line: 73, type: !108)
!233 = !DILocation(line: 73, column: 41, scope: !229)
!234 = !DILocalVariable(name: "v", arg: 2, scope: !229, file: !1, line: 73, type: !151)
!235 = !DILocation(line: 73, column: 52, scope: !229)
!236 = !DILocation(line: 76, column: 9, scope: !229)
!237 = !DILocation(line: 76, column: 12, scope: !229)
!238 = !DILocation(line: 76, column: 17, scope: !229)
!239 = !DILocation(line: 76, column: 14, scope: !229)
!240 = !DILocation(line: 76, column: 21, scope: !229)
!241 = !DILocation(line: 76, column: 24, scope: !229)
!242 = !DILocation(line: 76, column: 31, scope: !229)
!243 = !DILocation(line: 76, column: 34, scope: !229)
!244 = !DILocation(line: 76, column: 2, scope: !229)
!245 = distinct !DISubprogram(name: "BM_face_other_vert_loop", scope: !1, file: !1, line: 101, type: !246, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!246 = !DISubroutineType(types: !247)
!247 = !{!108, !86, !151, !151}
!248 = !DILocalVariable(name: "f", arg: 1, scope: !245, file: !1, line: 101, type: !86)
!249 = !DILocation(line: 101, column: 41, scope: !245)
!250 = !DILocalVariable(name: "v_prev", arg: 2, scope: !245, file: !1, line: 101, type: !151)
!251 = !DILocation(line: 101, column: 52, scope: !245)
!252 = !DILocalVariable(name: "v", arg: 3, scope: !245, file: !1, line: 101, type: !151)
!253 = !DILocation(line: 101, column: 68, scope: !245)
!254 = !DILocalVariable(name: "liter", scope: !245, file: !1, line: 103, type: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !4, line: 186, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !4, line: 164, size: 512, elements: !257)
!257 = !{!258, !340, !341, !342, !343}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !4, line: 179, baseType: !259, size: 320)
!259 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !4, line: 166, size: 320, elements: !260)
!260 = !{!261, !278, !284, !292, !300, !306, !312, !318, !322, !328, !334}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !259, file: !4, line: 167, baseType: !262, size: 192)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !4, line: 113, size: 192, elements: !263)
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !262, file: !4, line: 114, baseType: !265, size: 192)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !266, line: 80, baseType: !267)
!266 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !266, line: 76, size: 192, elements: !268)
!268 = !{!269, !274, !277}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !267, file: !266, line: 77, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !266, line: 47, baseType: !272)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !273, line: 39, flags: DIFlagFwdDecl)
!273 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !267, file: !266, line: 78, baseType: !275, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !266, line: 45, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !267, file: !266, line: 79, baseType: !5, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !259, file: !4, line: 169, baseType: !279, size: 192)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !4, line: 116, size: 192, elements: !280)
!280 = !{!281, !282, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !279, file: !4, line: 117, baseType: !151, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !279, file: !4, line: 118, baseType: !167, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !279, file: !4, line: 118, baseType: !167, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !259, file: !4, line: 170, baseType: !285, size: 320)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !4, line: 120, size: 320, elements: !286)
!286 = !{!287, !288, !289, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !285, file: !4, line: 121, baseType: !151, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !285, file: !4, line: 122, baseType: !108, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !285, file: !4, line: 122, baseType: !108, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !285, file: !4, line: 123, baseType: !167, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !285, file: !4, line: 123, baseType: !167, size: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !259, file: !4, line: 171, baseType: !293, size: 320)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !4, line: 125, size: 320, elements: !294)
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !293, file: !4, line: 126, baseType: !151, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !293, file: !4, line: 127, baseType: !108, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !293, file: !4, line: 127, baseType: !108, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !293, file: !4, line: 128, baseType: !167, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !293, file: !4, line: 128, baseType: !167, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !259, file: !4, line: 172, baseType: !301, size: 192)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !4, line: 130, size: 192, elements: !302)
!302 = !{!303, !304, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !301, file: !4, line: 131, baseType: !167, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !301, file: !4, line: 132, baseType: !108, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !301, file: !4, line: 132, baseType: !108, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !259, file: !4, line: 173, baseType: !307, size: 192)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !4, line: 134, size: 192, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !307, file: !4, line: 135, baseType: !108, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !307, file: !4, line: 136, baseType: !108, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !307, file: !4, line: 136, baseType: !108, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !259, file: !4, line: 174, baseType: !313, size: 192)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !4, line: 138, size: 192, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !313, file: !4, line: 139, baseType: !167, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !313, file: !4, line: 140, baseType: !108, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !313, file: !4, line: 140, baseType: !108, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !259, file: !4, line: 175, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !4, line: 142, size: 64, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !319, file: !4, line: 143, baseType: !167, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !259, file: !4, line: 176, baseType: !323, size: 192)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !4, line: 145, size: 192, elements: !324)
!324 = !{!325, !326, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !323, file: !4, line: 146, baseType: !86, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !323, file: !4, line: 147, baseType: !108, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !323, file: !4, line: 147, baseType: !108, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !259, file: !4, line: 177, baseType: !329, size: 192)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !4, line: 149, size: 192, elements: !330)
!330 = !{!331, !332, !333}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !329, file: !4, line: 150, baseType: !86, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !329, file: !4, line: 151, baseType: !108, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !329, file: !4, line: 151, baseType: !108, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !259, file: !4, line: 178, baseType: !335, size: 192)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !4, line: 153, size: 192, elements: !336)
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !335, file: !4, line: 154, baseType: !86, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !335, file: !4, line: 155, baseType: !108, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !335, file: !4, line: 155, baseType: !108, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !256, file: !4, line: 181, baseType: !159, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !256, file: !4, line: 182, baseType: !163, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !256, file: !4, line: 184, baseType: !96, size: 32, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !256, file: !4, line: 185, baseType: !98, size: 8, offset: 480)
!344 = !DILocation(line: 103, column: 9, scope: !245)
!345 = !DILocalVariable(name: "l_iter", scope: !245, file: !1, line: 104, type: !108)
!346 = !DILocation(line: 104, column: 10, scope: !245)
!347 = !DILocation(line: 108, column: 2, scope: !348)
!348 = distinct !DILexicalBlock(scope: !245, file: !1, line: 108, column: 2)
!349 = !DILocation(line: 108, column: 2, scope: !350)
!350 = distinct !DILexicalBlock(scope: !348, file: !1, line: 108, column: 2)
!351 = !DILocation(line: 109, column: 7, scope: !352)
!352 = distinct !DILexicalBlock(scope: !353, file: !1, line: 109, column: 7)
!353 = distinct !DILexicalBlock(scope: !350, file: !1, line: 108, column: 53)
!354 = !DILocation(line: 109, column: 15, scope: !352)
!355 = !DILocation(line: 109, column: 20, scope: !352)
!356 = !DILocation(line: 109, column: 17, scope: !352)
!357 = !DILocation(line: 109, column: 7, scope: !353)
!358 = !DILocation(line: 110, column: 4, scope: !359)
!359 = distinct !DILexicalBlock(scope: !352, file: !1, line: 109, column: 23)
!360 = !DILocation(line: 112, column: 2, scope: !353)
!361 = distinct !{!361, !347, !362}
!362 = !DILocation(line: 112, column: 2, scope: !348)
!363 = !DILocation(line: 114, column: 6, scope: !364)
!364 = distinct !DILexicalBlock(scope: !245, file: !1, line: 114, column: 6)
!365 = !DILocation(line: 114, column: 6, scope: !245)
!366 = !DILocation(line: 115, column: 7, scope: !367)
!367 = distinct !DILexicalBlock(scope: !368, file: !1, line: 115, column: 7)
!368 = distinct !DILexicalBlock(scope: !364, file: !1, line: 114, column: 14)
!369 = !DILocation(line: 115, column: 15, scope: !367)
!370 = !DILocation(line: 115, column: 21, scope: !367)
!371 = !DILocation(line: 115, column: 26, scope: !367)
!372 = !DILocation(line: 115, column: 23, scope: !367)
!373 = !DILocation(line: 115, column: 7, scope: !368)
!374 = !DILocation(line: 116, column: 11, scope: !375)
!375 = distinct !DILexicalBlock(scope: !367, file: !1, line: 115, column: 34)
!376 = !DILocation(line: 116, column: 19, scope: !375)
!377 = !DILocation(line: 116, column: 4, scope: !375)
!378 = !DILocation(line: 118, column: 12, scope: !379)
!379 = distinct !DILexicalBlock(scope: !367, file: !1, line: 118, column: 12)
!380 = !DILocation(line: 118, column: 20, scope: !379)
!381 = !DILocation(line: 118, column: 26, scope: !379)
!382 = !DILocation(line: 118, column: 31, scope: !379)
!383 = !DILocation(line: 118, column: 28, scope: !379)
!384 = !DILocation(line: 118, column: 12, scope: !367)
!385 = !DILocation(line: 119, column: 11, scope: !386)
!386 = distinct !DILexicalBlock(scope: !379, file: !1, line: 118, column: 39)
!387 = !DILocation(line: 119, column: 19, scope: !386)
!388 = !DILocation(line: 119, column: 4, scope: !386)
!389 = !DILocation(line: 124, column: 4, scope: !390)
!390 = distinct !DILexicalBlock(scope: !379, file: !1, line: 121, column: 8)
!391 = !DILocation(line: 130, column: 3, scope: !392)
!392 = distinct !DILexicalBlock(scope: !364, file: !1, line: 127, column: 7)
!393 = !DILocation(line: 132, column: 1, scope: !245)
!394 = distinct !DISubprogram(name: "BM_iter_new", scope: !395, file: !395, line: 172, type: !396, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !177)
!395 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!396 = !DISubroutineType(types: !397)
!397 = !{!84, !398, !399, !440, !84}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !30, line: 246, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !30, line: 186, size: 8064, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !414, !415, !416, !417, !419, !421, !423, !424, !425, !426, !427, !428, !429, !430, !482, !522, !523, !524, !525, !526, !527, !528, !529, !536, !537, !538}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !401, file: !30, line: 187, baseType: !96, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !401, file: !30, line: 187, baseType: !96, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !401, file: !30, line: 187, baseType: !96, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !401, file: !30, line: 187, baseType: !96, size: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !401, file: !30, line: 188, baseType: !96, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !401, file: !30, line: 188, baseType: !96, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !401, file: !30, line: 188, baseType: !96, size: 32, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !401, file: !30, line: 193, baseType: !98, size: 8, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !401, file: !30, line: 197, baseType: !98, size: 8, offset: 232)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !401, file: !30, line: 201, baseType: !413, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !401, file: !30, line: 201, baseType: !413, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !401, file: !30, line: 201, baseType: !413, size: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !401, file: !30, line: 201, baseType: !413, size: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !401, file: !30, line: 208, baseType: !418, size: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !401, file: !30, line: 209, baseType: !420, size: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !401, file: !30, line: 210, baseType: !422, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !401, file: !30, line: 213, baseType: !96, size: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !401, file: !30, line: 214, baseType: !96, size: 32, offset: 736)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !401, file: !30, line: 215, baseType: !96, size: 32, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !401, file: !30, line: 218, baseType: !413, size: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !401, file: !30, line: 218, baseType: !413, size: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !401, file: !30, line: 218, baseType: !413, size: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !401, file: !30, line: 220, baseType: !96, size: 32, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !401, file: !30, line: 221, baseType: !431, size: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !40, line: 190, size: 10496, elements: !433)
!433 = !{!434, !470, !471, !475, !478, !479, !481}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !432, file: !40, line: 191, baseType: !435, size: 5120)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 5120, elements: !468)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !40, line: 147, size: 320, elements: !437)
!437 = !{!438, !441, !443, !453, !454}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !436, file: !40, line: 148, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !436, file: !40, line: 149, baseType: !442, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !40, line: 112, baseType: !39)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !436, file: !40, line: 150, baseType: !444, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !40, line: 142, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !40, line: 138, size: 32, elements: !446)
!446 = !{!447, !449, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !445, file: !40, line: 139, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !40, line: 122, baseType: !50)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !445, file: !40, line: 140, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !40, line: 136, baseType: !56)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !445, file: !40, line: 141, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !40, line: 130, baseType: !62)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !436, file: !40, line: 152, baseType: !96, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !40, line: 162, baseType: !455, size: 128, offset: 192)
!455 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !436, file: !40, line: 155, size: 128, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !463}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !455, file: !40, line: 156, baseType: !96, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !455, file: !40, line: 157, baseType: !85, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !455, file: !40, line: 158, baseType: !84, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !455, file: !40, line: 159, baseType: !120, size: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !455, file: !40, line: 160, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !455, file: !40, line: 161, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !466, line: 48, baseType: !467)
!466 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !466, line: 48, flags: DIFlagFwdDecl)
!468 = !{!469}
!469 = !DISubrange(count: 16)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !432, file: !40, line: 192, baseType: !435, size: 5120, offset: 5120)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !432, file: !40, line: 193, baseType: !472, size: 64, offset: 10240)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !399, !431}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !432, file: !40, line: 194, baseType: !476, size: 64, offset: 10304)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !273, line: 38, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !40, line: 195, baseType: !96, size: 32, offset: 10368)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !432, file: !40, line: 196, baseType: !480, size: 32, offset: 10400)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !40, line: 188, baseType: !70)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !432, file: !40, line: 197, baseType: !96, size: 32, offset: 10432)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !401, file: !30, line: 223, baseType: !483, size: 1600, offset: 1152)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !484, line: 73, baseType: !485)
!484 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !484, line: 64, size: 1600, elements: !486)
!486 = !{!487, !505, !509, !510, !511, !512, !513}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !485, file: !484, line: 65, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !484, line: 53, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !484, line: 42, size: 832, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !504}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !484, line: 43, baseType: !96, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !490, file: !484, line: 44, baseType: !96, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !484, line: 45, baseType: !96, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !490, file: !484, line: 46, baseType: !96, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !490, file: !484, line: 47, baseType: !96, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !490, file: !484, line: 48, baseType: !96, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !490, file: !484, line: 49, baseType: !96, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !490, file: !484, line: 50, baseType: !96, size: 32, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !484, line: 51, baseType: !501, size: 512, offset: 256)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 512, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !490, file: !484, line: 52, baseType: !84, size: 64, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !485, file: !484, line: 66, baseType: !506, size: 1312, offset: 64)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1312, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 41)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !485, file: !484, line: 69, baseType: !96, size: 32, offset: 1376)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !485, file: !484, line: 69, baseType: !96, size: 32, offset: 1408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !485, file: !484, line: 70, baseType: !96, size: 32, offset: 1440)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !485, file: !484, line: 71, baseType: !413, size: 64, offset: 1472)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !485, file: !484, line: 72, baseType: !514, size: 64, offset: 1536)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !484, line: 59, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !484, line: 57, size: 8192, elements: !517)
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !516, file: !484, line: 58, baseType: !519, size: 8192)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8192, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 1024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !401, file: !30, line: 223, baseType: !483, size: 1600, offset: 2752)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !401, file: !30, line: 223, baseType: !483, size: 1600, offset: 4352)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !401, file: !30, line: 223, baseType: !483, size: 1600, offset: 5952)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !401, file: !30, line: 233, baseType: !106, size: 16, offset: 7552)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !401, file: !30, line: 236, baseType: !96, size: 32, offset: 7584)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !401, file: !30, line: 238, baseType: !96, size: 32, offset: 7616)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !401, file: !30, line: 238, baseType: !96, size: 32, offset: 7648)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !401, file: !30, line: 239, baseType: !530, size: 128, offset: 7680)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !531, line: 71, baseType: !532)
!531 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !531, line: 69, size: 128, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !532, file: !531, line: 70, baseType: !84, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !532, file: !531, line: 70, baseType: !84, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !401, file: !30, line: 241, baseType: !86, size: 64, offset: 7808)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !401, file: !30, line: 243, baseType: !530, size: 128, offset: 7872)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !401, file: !30, line: 245, baseType: !84, size: 64, offset: 8000)
!539 = !DILocalVariable(name: "iter", arg: 1, scope: !394, file: !395, line: 172, type: !398)
!540 = !DILocation(line: 172, column: 38, scope: !394)
!541 = !DILocalVariable(name: "bm", arg: 2, scope: !394, file: !395, line: 172, type: !399)
!542 = !DILocation(line: 172, column: 51, scope: !394)
!543 = !DILocalVariable(name: "itype", arg: 3, scope: !394, file: !395, line: 172, type: !440)
!544 = !DILocation(line: 172, column: 66, scope: !394)
!545 = !DILocalVariable(name: "data", arg: 4, scope: !394, file: !395, line: 172, type: !84)
!546 = !DILocation(line: 172, column: 79, scope: !394)
!547 = !DILocation(line: 174, column: 6, scope: !548)
!548 = distinct !DILexicalBlock(scope: !394, file: !395, line: 174, column: 6)
!549 = !DILocation(line: 174, column: 6, scope: !394)
!550 = !DILocation(line: 175, column: 23, scope: !551)
!551 = distinct !DILexicalBlock(scope: !548, file: !395, line: 174, column: 51)
!552 = !DILocation(line: 175, column: 10, scope: !551)
!553 = !DILocation(line: 175, column: 3, scope: !551)
!554 = !DILocation(line: 178, column: 3, scope: !555)
!555 = distinct !DILexicalBlock(scope: !548, file: !395, line: 177, column: 7)
!556 = !DILocation(line: 180, column: 1, scope: !394)
!557 = distinct !DISubprogram(name: "BM_iter_step", scope: !395, file: !395, line: 40, type: !558, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !177)
!558 = !DISubroutineType(types: !559)
!559 = !{!84, !398}
!560 = !DILocalVariable(name: "iter", arg: 1, scope: !557, file: !395, line: 40, type: !398)
!561 = !DILocation(line: 40, column: 39, scope: !557)
!562 = !DILocation(line: 42, column: 9, scope: !557)
!563 = !DILocation(line: 42, column: 15, scope: !557)
!564 = !DILocation(line: 42, column: 20, scope: !557)
!565 = !DILocation(line: 42, column: 2, scope: !557)
!566 = distinct !DISubprogram(name: "BM_loop_other_vert_loop", scope: !1, file: !1, line: 151, type: !230, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!567 = !DILocalVariable(name: "l", arg: 1, scope: !566, file: !1, line: 151, type: !108)
!568 = !DILocation(line: 151, column: 41, scope: !566)
!569 = !DILocalVariable(name: "v", arg: 2, scope: !566, file: !1, line: 151, type: !151)
!570 = !DILocation(line: 151, column: 52, scope: !566)
!571 = !DILocalVariable(name: "e", scope: !566, file: !1, line: 156, type: !167)
!572 = !DILocation(line: 156, column: 10, scope: !566)
!573 = !DILocation(line: 156, column: 14, scope: !566)
!574 = !DILocation(line: 156, column: 17, scope: !566)
!575 = !DILocalVariable(name: "v_prev", scope: !566, file: !1, line: 157, type: !151)
!576 = !DILocation(line: 157, column: 10, scope: !566)
!577 = !DILocation(line: 157, column: 38, scope: !566)
!578 = !DILocation(line: 157, column: 41, scope: !566)
!579 = !DILocation(line: 157, column: 19, scope: !566)
!580 = !DILocation(line: 158, column: 6, scope: !581)
!581 = distinct !DILexicalBlock(scope: !566, file: !1, line: 158, column: 6)
!582 = !DILocation(line: 158, column: 9, scope: !581)
!583 = !DILocation(line: 158, column: 14, scope: !581)
!584 = !DILocation(line: 158, column: 11, scope: !581)
!585 = !DILocation(line: 158, column: 6, scope: !566)
!586 = !DILocation(line: 159, column: 7, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !1, line: 159, column: 7)
!588 = distinct !DILexicalBlock(scope: !581, file: !1, line: 158, column: 17)
!589 = !DILocation(line: 159, column: 10, scope: !587)
!590 = !DILocation(line: 159, column: 16, scope: !587)
!591 = !DILocation(line: 159, column: 21, scope: !587)
!592 = !DILocation(line: 159, column: 18, scope: !587)
!593 = !DILocation(line: 159, column: 7, scope: !588)
!594 = !DILocation(line: 160, column: 11, scope: !595)
!595 = distinct !DILexicalBlock(scope: !587, file: !1, line: 159, column: 29)
!596 = !DILocation(line: 160, column: 14, scope: !595)
!597 = !DILocation(line: 160, column: 4, scope: !595)
!598 = !DILocation(line: 165, column: 11, scope: !599)
!599 = distinct !DILexicalBlock(scope: !587, file: !1, line: 162, column: 8)
!600 = !DILocation(line: 165, column: 14, scope: !599)
!601 = !DILocation(line: 165, column: 4, scope: !599)
!602 = !DILocation(line: 171, column: 7, scope: !603)
!603 = distinct !DILexicalBlock(scope: !604, file: !1, line: 171, column: 7)
!604 = distinct !DILexicalBlock(scope: !581, file: !1, line: 168, column: 7)
!605 = !DILocation(line: 171, column: 10, scope: !603)
!606 = !DILocation(line: 171, column: 16, scope: !603)
!607 = !DILocation(line: 171, column: 21, scope: !603)
!608 = !DILocation(line: 171, column: 18, scope: !603)
!609 = !DILocation(line: 171, column: 7, scope: !604)
!610 = !DILocation(line: 172, column: 11, scope: !611)
!611 = distinct !DILexicalBlock(scope: !603, file: !1, line: 171, column: 24)
!612 = !DILocation(line: 172, column: 14, scope: !611)
!613 = !DILocation(line: 172, column: 20, scope: !611)
!614 = !DILocation(line: 172, column: 4, scope: !611)
!615 = !DILocation(line: 176, column: 11, scope: !616)
!616 = distinct !DILexicalBlock(scope: !603, file: !1, line: 174, column: 8)
!617 = !DILocation(line: 176, column: 14, scope: !616)
!618 = !DILocation(line: 176, column: 20, scope: !616)
!619 = !DILocation(line: 176, column: 4, scope: !616)
!620 = !DILocation(line: 183, column: 1, scope: !566)
!621 = distinct !DISubprogram(name: "BM_edge_other_vert", scope: !622, file: !622, line: 60, type: !623, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !177)
!622 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_queries_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!623 = !DISubroutineType(types: !624)
!624 = !{!151, !167, !625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!627 = !DILocalVariable(name: "e", arg: 1, scope: !621, file: !622, line: 60, type: !167)
!628 = !DILocation(line: 60, column: 47, scope: !621)
!629 = !DILocalVariable(name: "v", arg: 2, scope: !621, file: !622, line: 60, type: !625)
!630 = !DILocation(line: 60, column: 64, scope: !621)
!631 = !DILocation(line: 62, column: 6, scope: !632)
!632 = distinct !DILexicalBlock(scope: !621, file: !622, line: 62, column: 6)
!633 = !DILocation(line: 62, column: 9, scope: !632)
!634 = !DILocation(line: 62, column: 15, scope: !632)
!635 = !DILocation(line: 62, column: 12, scope: !632)
!636 = !DILocation(line: 62, column: 6, scope: !621)
!637 = !DILocation(line: 63, column: 10, scope: !638)
!638 = distinct !DILexicalBlock(scope: !632, file: !622, line: 62, column: 18)
!639 = !DILocation(line: 63, column: 13, scope: !638)
!640 = !DILocation(line: 63, column: 3, scope: !638)
!641 = !DILocation(line: 65, column: 11, scope: !642)
!642 = distinct !DILexicalBlock(scope: !632, file: !622, line: 65, column: 11)
!643 = !DILocation(line: 65, column: 14, scope: !642)
!644 = !DILocation(line: 65, column: 20, scope: !642)
!645 = !DILocation(line: 65, column: 17, scope: !642)
!646 = !DILocation(line: 65, column: 11, scope: !632)
!647 = !DILocation(line: 66, column: 10, scope: !648)
!648 = distinct !DILexicalBlock(scope: !642, file: !622, line: 65, column: 23)
!649 = !DILocation(line: 66, column: 13, scope: !648)
!650 = !DILocation(line: 66, column: 3, scope: !648)
!651 = !DILocation(line: 68, column: 2, scope: !621)
!652 = !DILocation(line: 69, column: 1, scope: !621)
!653 = distinct !DISubprogram(name: "BM_vert_pair_share_face_check", scope: !1, file: !1, line: 188, type: !654, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !151, !151}
!656 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!657 = !DILocalVariable(name: "v_a", arg: 1, scope: !653, file: !1, line: 189, type: !151)
!658 = !DILocation(line: 189, column: 17, scope: !653)
!659 = !DILocalVariable(name: "v_b", arg: 2, scope: !653, file: !1, line: 189, type: !151)
!660 = !DILocation(line: 189, column: 30, scope: !653)
!661 = !DILocation(line: 191, column: 6, scope: !662)
!662 = distinct !DILexicalBlock(scope: !653, file: !1, line: 191, column: 6)
!663 = !DILocation(line: 191, column: 11, scope: !662)
!664 = !DILocation(line: 191, column: 13, scope: !662)
!665 = !DILocation(line: 191, column: 16, scope: !662)
!666 = !DILocation(line: 191, column: 21, scope: !662)
!667 = !DILocation(line: 191, column: 6, scope: !653)
!668 = !DILocalVariable(name: "iter", scope: !669, file: !1, line: 192, type: !255)
!669 = distinct !DILexicalBlock(scope: !662, file: !1, line: 191, column: 24)
!670 = !DILocation(line: 192, column: 10, scope: !669)
!671 = !DILocalVariable(name: "f", scope: !669, file: !1, line: 193, type: !86)
!672 = !DILocation(line: 193, column: 11, scope: !669)
!673 = !DILocation(line: 195, column: 3, scope: !674)
!674 = distinct !DILexicalBlock(scope: !669, file: !1, line: 195, column: 3)
!675 = !DILocation(line: 195, column: 3, scope: !676)
!676 = distinct !DILexicalBlock(scope: !674, file: !1, line: 195, column: 3)
!677 = !DILocation(line: 196, column: 24, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !1, line: 196, column: 8)
!679 = distinct !DILexicalBlock(scope: !676, file: !1, line: 195, column: 50)
!680 = !DILocation(line: 196, column: 27, scope: !678)
!681 = !DILocation(line: 196, column: 8, scope: !678)
!682 = !DILocation(line: 196, column: 8, scope: !679)
!683 = !DILocation(line: 197, column: 5, scope: !684)
!684 = distinct !DILexicalBlock(scope: !678, file: !1, line: 196, column: 33)
!685 = !DILocation(line: 199, column: 3, scope: !679)
!686 = distinct !{!686, !673, !687}
!687 = !DILocation(line: 199, column: 3, scope: !674)
!688 = !DILocation(line: 200, column: 2, scope: !669)
!689 = !DILocation(line: 202, column: 2, scope: !653)
!690 = !DILocation(line: 203, column: 1, scope: !653)
!691 = distinct !DISubprogram(name: "BM_vert_in_face", scope: !1, file: !1, line: 328, type: !692, scopeLine: 329, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!692 = !DISubroutineType(types: !693)
!693 = !{!656, !86, !151}
!694 = !DILocalVariable(name: "f", arg: 1, scope: !691, file: !1, line: 328, type: !86)
!695 = !DILocation(line: 328, column: 30, scope: !691)
!696 = !DILocalVariable(name: "v", arg: 2, scope: !691, file: !1, line: 328, type: !151)
!697 = !DILocation(line: 328, column: 41, scope: !691)
!698 = !DILocalVariable(name: "l_iter", scope: !691, file: !1, line: 330, type: !108)
!699 = !DILocation(line: 330, column: 10, scope: !691)
!700 = !DILocalVariable(name: "l_first", scope: !691, file: !1, line: 330, type: !108)
!701 = !DILocation(line: 330, column: 19, scope: !691)
!702 = !DILocation(line: 340, column: 22, scope: !703)
!703 = distinct !DILexicalBlock(scope: !691, file: !1, line: 336, column: 2)
!704 = !DILocation(line: 340, column: 25, scope: !703)
!705 = !DILocation(line: 340, column: 20, scope: !703)
!706 = !DILocation(line: 340, column: 10, scope: !703)
!707 = !DILocation(line: 342, column: 3, scope: !703)
!708 = !DILocation(line: 343, column: 8, scope: !709)
!709 = distinct !DILexicalBlock(scope: !710, file: !1, line: 343, column: 8)
!710 = distinct !DILexicalBlock(scope: !703, file: !1, line: 342, column: 6)
!711 = !DILocation(line: 343, column: 16, scope: !709)
!712 = !DILocation(line: 343, column: 21, scope: !709)
!713 = !DILocation(line: 343, column: 18, scope: !709)
!714 = !DILocation(line: 343, column: 8, scope: !710)
!715 = !DILocation(line: 344, column: 5, scope: !716)
!716 = distinct !DILexicalBlock(scope: !709, file: !1, line: 343, column: 24)
!717 = !DILocation(line: 346, column: 3, scope: !710)
!718 = !DILocation(line: 346, column: 22, scope: !703)
!719 = !DILocation(line: 346, column: 30, scope: !703)
!720 = !DILocation(line: 346, column: 20, scope: !703)
!721 = !DILocation(line: 346, column: 39, scope: !703)
!722 = !DILocation(line: 346, column: 36, scope: !703)
!723 = distinct !{!723, !707, !724}
!724 = !DILocation(line: 346, column: 46, scope: !703)
!725 = !DILocation(line: 349, column: 2, scope: !691)
!726 = !DILocation(line: 350, column: 1, scope: !691)
!727 = distinct !DISubprogram(name: "BM_vert_pair_share_face_by_len", scope: !1, file: !1, line: 208, type: !728, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!728 = !DISubroutineType(types: !729)
!729 = !{!86, !151, !151, !730, !730, !731}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!732 = !DILocalVariable(name: "v_a", arg: 1, scope: !727, file: !1, line: 209, type: !151)
!733 = !DILocation(line: 209, column: 17, scope: !727)
!734 = !DILocalVariable(name: "v_b", arg: 2, scope: !727, file: !1, line: 209, type: !151)
!735 = !DILocation(line: 209, column: 30, scope: !727)
!736 = !DILocalVariable(name: "r_l_a", arg: 3, scope: !727, file: !1, line: 210, type: !730)
!737 = !DILocation(line: 210, column: 18, scope: !727)
!738 = !DILocalVariable(name: "r_l_b", arg: 4, scope: !727, file: !1, line: 210, type: !730)
!739 = !DILocation(line: 210, column: 34, scope: !727)
!740 = !DILocalVariable(name: "allow_adjacent", arg: 5, scope: !727, file: !1, line: 211, type: !731)
!741 = !DILocation(line: 211, column: 20, scope: !727)
!742 = !DILocalVariable(name: "l_cur_a", scope: !727, file: !1, line: 213, type: !108)
!743 = !DILocation(line: 213, column: 10, scope: !727)
!744 = !DILocalVariable(name: "l_cur_b", scope: !727, file: !1, line: 213, type: !108)
!745 = !DILocation(line: 213, column: 27, scope: !727)
!746 = !DILocalVariable(name: "f_cur", scope: !727, file: !1, line: 214, type: !86)
!747 = !DILocation(line: 214, column: 10, scope: !727)
!748 = !DILocation(line: 216, column: 6, scope: !749)
!749 = distinct !DILexicalBlock(scope: !727, file: !1, line: 216, column: 6)
!750 = !DILocation(line: 216, column: 11, scope: !749)
!751 = !DILocation(line: 216, column: 13, scope: !749)
!752 = !DILocation(line: 216, column: 16, scope: !749)
!753 = !DILocation(line: 216, column: 21, scope: !749)
!754 = !DILocation(line: 216, column: 6, scope: !727)
!755 = !DILocalVariable(name: "iter", scope: !756, file: !1, line: 217, type: !255)
!756 = distinct !DILexicalBlock(scope: !749, file: !1, line: 216, column: 24)
!757 = !DILocation(line: 217, column: 10, scope: !756)
!758 = !DILocalVariable(name: "l_a", scope: !756, file: !1, line: 218, type: !108)
!759 = !DILocation(line: 218, column: 11, scope: !756)
!760 = !DILocalVariable(name: "l_b", scope: !756, file: !1, line: 218, type: !108)
!761 = !DILocation(line: 218, column: 17, scope: !756)
!762 = !DILocation(line: 220, column: 3, scope: !763)
!763 = distinct !DILexicalBlock(scope: !756, file: !1, line: 220, column: 3)
!764 = !DILocation(line: 220, column: 3, scope: !765)
!765 = distinct !DILexicalBlock(scope: !763, file: !1, line: 220, column: 3)
!766 = !DILocation(line: 221, column: 9, scope: !767)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 221, column: 8)
!768 = distinct !DILexicalBlock(scope: !765, file: !1, line: 220, column: 52)
!769 = !DILocation(line: 221, column: 15, scope: !767)
!770 = !DILocation(line: 221, column: 24, scope: !767)
!771 = !DILocation(line: 221, column: 28, scope: !767)
!772 = !DILocation(line: 221, column: 33, scope: !767)
!773 = !DILocation(line: 221, column: 36, scope: !767)
!774 = !DILocation(line: 221, column: 42, scope: !767)
!775 = !DILocation(line: 221, column: 49, scope: !767)
!776 = !DILocation(line: 221, column: 40, scope: !767)
!777 = !DILocation(line: 221, column: 8, scope: !768)
!778 = !DILocation(line: 222, column: 35, scope: !779)
!779 = distinct !DILexicalBlock(scope: !767, file: !1, line: 221, column: 55)
!780 = !DILocation(line: 222, column: 40, scope: !779)
!781 = !DILocation(line: 222, column: 43, scope: !779)
!782 = !DILocation(line: 222, column: 11, scope: !779)
!783 = !DILocation(line: 222, column: 9, scope: !779)
!784 = !DILocation(line: 223, column: 9, scope: !785)
!785 = distinct !DILexicalBlock(scope: !779, file: !1, line: 223, column: 9)
!786 = !DILocation(line: 223, column: 13, scope: !785)
!787 = !DILocation(line: 223, column: 17, scope: !785)
!788 = !DILocation(line: 223, column: 32, scope: !785)
!789 = !DILocation(line: 223, column: 56, scope: !785)
!790 = !DILocation(line: 223, column: 61, scope: !785)
!791 = !DILocation(line: 223, column: 36, scope: !785)
!792 = !DILocation(line: 223, column: 9, scope: !779)
!793 = !DILocation(line: 224, column: 14, scope: !794)
!794 = distinct !DILexicalBlock(scope: !785, file: !1, line: 223, column: 68)
!795 = !DILocation(line: 224, column: 19, scope: !794)
!796 = !DILocation(line: 224, column: 12, scope: !794)
!797 = !DILocation(line: 225, column: 16, scope: !794)
!798 = !DILocation(line: 225, column: 14, scope: !794)
!799 = !DILocation(line: 226, column: 16, scope: !794)
!800 = !DILocation(line: 226, column: 14, scope: !794)
!801 = !DILocation(line: 227, column: 5, scope: !794)
!802 = !DILocation(line: 228, column: 4, scope: !779)
!803 = !DILocation(line: 229, column: 3, scope: !768)
!804 = distinct !{!804, !762, !805}
!805 = !DILocation(line: 229, column: 3, scope: !763)
!806 = !DILocation(line: 230, column: 2, scope: !756)
!807 = !DILocation(line: 232, column: 11, scope: !727)
!808 = !DILocation(line: 232, column: 3, scope: !727)
!809 = !DILocation(line: 232, column: 9, scope: !727)
!810 = !DILocation(line: 233, column: 11, scope: !727)
!811 = !DILocation(line: 233, column: 3, scope: !727)
!812 = !DILocation(line: 233, column: 9, scope: !727)
!813 = !DILocation(line: 235, column: 9, scope: !727)
!814 = !DILocation(line: 235, column: 2, scope: !727)
!815 = distinct !DISubprogram(name: "BM_face_vert_share_loop", scope: !1, file: !1, line: 1050, type: !816, scopeLine: 1051, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!816 = !DISubroutineType(types: !817)
!817 = !{!108, !86, !151}
!818 = !DILocalVariable(name: "f", arg: 1, scope: !815, file: !1, line: 1050, type: !86)
!819 = !DILocation(line: 1050, column: 41, scope: !815)
!820 = !DILocalVariable(name: "v", arg: 2, scope: !815, file: !1, line: 1050, type: !151)
!821 = !DILocation(line: 1050, column: 52, scope: !815)
!822 = !DILocalVariable(name: "l_first", scope: !815, file: !1, line: 1052, type: !108)
!823 = !DILocation(line: 1052, column: 10, scope: !815)
!824 = !DILocalVariable(name: "l_iter", scope: !815, file: !1, line: 1053, type: !108)
!825 = !DILocation(line: 1053, column: 10, scope: !815)
!826 = !DILocation(line: 1055, column: 21, scope: !815)
!827 = !DILocation(line: 1055, column: 19, scope: !815)
!828 = !DILocation(line: 1055, column: 9, scope: !815)
!829 = !DILocation(line: 1056, column: 2, scope: !815)
!830 = !DILocation(line: 1057, column: 7, scope: !831)
!831 = distinct !DILexicalBlock(scope: !832, file: !1, line: 1057, column: 7)
!832 = distinct !DILexicalBlock(scope: !815, file: !1, line: 1056, column: 5)
!833 = !DILocation(line: 1057, column: 15, scope: !831)
!834 = !DILocation(line: 1057, column: 20, scope: !831)
!835 = !DILocation(line: 1057, column: 17, scope: !831)
!836 = !DILocation(line: 1057, column: 7, scope: !832)
!837 = !DILocation(line: 1058, column: 11, scope: !838)
!838 = distinct !DILexicalBlock(scope: !831, file: !1, line: 1057, column: 23)
!839 = !DILocation(line: 1058, column: 4, scope: !838)
!840 = !DILocation(line: 1060, column: 2, scope: !832)
!841 = !DILocation(line: 1060, column: 21, scope: !815)
!842 = !DILocation(line: 1060, column: 29, scope: !815)
!843 = !DILocation(line: 1060, column: 19, scope: !815)
!844 = !DILocation(line: 1060, column: 38, scope: !815)
!845 = !DILocation(line: 1060, column: 35, scope: !815)
!846 = distinct !{!846, !829, !847}
!847 = !DILocation(line: 1060, column: 45, scope: !815)
!848 = !DILocation(line: 1062, column: 2, scope: !815)
!849 = !DILocation(line: 1063, column: 1, scope: !815)
!850 = distinct !DISubprogram(name: "BM_loop_is_adjacent", scope: !622, file: !622, line: 133, type: !851, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !177)
!851 = !DISubroutineType(types: !852)
!852 = !{!656, !853, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!855 = !DILocalVariable(name: "l_a", arg: 1, scope: !850, file: !622, line: 133, type: !853)
!856 = !DILocation(line: 133, column: 51, scope: !850)
!857 = !DILocalVariable(name: "l_b", arg: 2, scope: !850, file: !622, line: 133, type: !853)
!858 = !DILocation(line: 133, column: 70, scope: !850)
!859 = !DILocation(line: 137, column: 10, scope: !850)
!860 = !DILocation(line: 137, column: 9, scope: !850)
!861 = !DILocation(line: 137, column: 2, scope: !850)
!862 = distinct !DISubprogram(name: "BM_vert_pair_share_face_by_angle", scope: !1, file: !1, line: 257, type: !728, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!863 = !DILocalVariable(name: "v_a", arg: 1, scope: !862, file: !1, line: 258, type: !151)
!864 = !DILocation(line: 258, column: 17, scope: !862)
!865 = !DILocalVariable(name: "v_b", arg: 2, scope: !862, file: !1, line: 258, type: !151)
!866 = !DILocation(line: 258, column: 30, scope: !862)
!867 = !DILocalVariable(name: "r_l_a", arg: 3, scope: !862, file: !1, line: 259, type: !730)
!868 = !DILocation(line: 259, column: 18, scope: !862)
!869 = !DILocalVariable(name: "r_l_b", arg: 4, scope: !862, file: !1, line: 259, type: !730)
!870 = !DILocation(line: 259, column: 34, scope: !862)
!871 = !DILocalVariable(name: "allow_adjacent", arg: 5, scope: !862, file: !1, line: 260, type: !731)
!872 = !DILocation(line: 260, column: 20, scope: !862)
!873 = !DILocalVariable(name: "l_cur_a", scope: !862, file: !1, line: 262, type: !108)
!874 = !DILocation(line: 262, column: 10, scope: !862)
!875 = !DILocalVariable(name: "l_cur_b", scope: !862, file: !1, line: 262, type: !108)
!876 = !DILocation(line: 262, column: 27, scope: !862)
!877 = !DILocalVariable(name: "f_cur", scope: !862, file: !1, line: 263, type: !86)
!878 = !DILocation(line: 263, column: 10, scope: !862)
!879 = !DILocation(line: 265, column: 6, scope: !880)
!880 = distinct !DILexicalBlock(scope: !862, file: !1, line: 265, column: 6)
!881 = !DILocation(line: 265, column: 11, scope: !880)
!882 = !DILocation(line: 265, column: 13, scope: !880)
!883 = !DILocation(line: 265, column: 16, scope: !880)
!884 = !DILocation(line: 265, column: 21, scope: !880)
!885 = !DILocation(line: 265, column: 6, scope: !862)
!886 = !DILocalVariable(name: "iter", scope: !887, file: !1, line: 266, type: !255)
!887 = distinct !DILexicalBlock(scope: !880, file: !1, line: 265, column: 24)
!888 = !DILocation(line: 266, column: 10, scope: !887)
!889 = !DILocalVariable(name: "l_a", scope: !887, file: !1, line: 267, type: !108)
!890 = !DILocation(line: 267, column: 11, scope: !887)
!891 = !DILocalVariable(name: "l_b", scope: !887, file: !1, line: 267, type: !108)
!892 = !DILocation(line: 267, column: 17, scope: !887)
!893 = !DILocalVariable(name: "dot_best", scope: !887, file: !1, line: 268, type: !85)
!894 = !DILocation(line: 268, column: 9, scope: !887)
!895 = !DILocation(line: 270, column: 3, scope: !896)
!896 = distinct !DILexicalBlock(scope: !887, file: !1, line: 270, column: 3)
!897 = !DILocation(line: 270, column: 3, scope: !898)
!898 = distinct !DILexicalBlock(scope: !896, file: !1, line: 270, column: 3)
!899 = !DILocation(line: 271, column: 34, scope: !900)
!900 = distinct !DILexicalBlock(scope: !898, file: !1, line: 270, column: 52)
!901 = !DILocation(line: 271, column: 39, scope: !900)
!902 = !DILocation(line: 271, column: 42, scope: !900)
!903 = !DILocation(line: 271, column: 10, scope: !900)
!904 = !DILocation(line: 271, column: 8, scope: !900)
!905 = !DILocation(line: 272, column: 8, scope: !906)
!906 = distinct !DILexicalBlock(scope: !900, file: !1, line: 272, column: 8)
!907 = !DILocation(line: 272, column: 12, scope: !906)
!908 = !DILocation(line: 272, column: 16, scope: !906)
!909 = !DILocation(line: 272, column: 31, scope: !906)
!910 = !DILocation(line: 272, column: 55, scope: !906)
!911 = !DILocation(line: 272, column: 60, scope: !906)
!912 = !DILocation(line: 272, column: 35, scope: !906)
!913 = !DILocation(line: 272, column: 8, scope: !900)
!914 = !DILocation(line: 274, column: 9, scope: !915)
!915 = distinct !DILexicalBlock(scope: !916, file: !1, line: 274, column: 9)
!916 = distinct !DILexicalBlock(scope: !906, file: !1, line: 272, column: 67)
!917 = !DILocation(line: 274, column: 15, scope: !915)
!918 = !DILocation(line: 274, column: 9, scope: !916)
!919 = !DILocation(line: 275, column: 14, scope: !920)
!920 = distinct !DILexicalBlock(scope: !915, file: !1, line: 274, column: 24)
!921 = !DILocation(line: 275, column: 19, scope: !920)
!922 = !DILocation(line: 275, column: 12, scope: !920)
!923 = !DILocation(line: 276, column: 16, scope: !920)
!924 = !DILocation(line: 276, column: 14, scope: !920)
!925 = !DILocation(line: 277, column: 16, scope: !920)
!926 = !DILocation(line: 277, column: 14, scope: !920)
!927 = !DILocation(line: 278, column: 5, scope: !920)
!928 = !DILocalVariable(name: "dot", scope: !929, file: !1, line: 281, type: !85)
!929 = distinct !DILexicalBlock(scope: !915, file: !1, line: 279, column: 10)
!930 = !DILocation(line: 281, column: 12, scope: !929)
!931 = !DILocation(line: 282, column: 10, scope: !932)
!932 = distinct !DILexicalBlock(scope: !929, file: !1, line: 282, column: 10)
!933 = !DILocation(line: 282, column: 19, scope: !932)
!934 = !DILocation(line: 282, column: 10, scope: !929)
!935 = !DILocation(line: 283, column: 41, scope: !936)
!936 = distinct !DILexicalBlock(scope: !932, file: !1, line: 282, column: 29)
!937 = !DILocation(line: 283, column: 50, scope: !936)
!938 = !DILocation(line: 283, column: 18, scope: !936)
!939 = !DILocation(line: 283, column: 16, scope: !936)
!940 = !DILocation(line: 284, column: 6, scope: !936)
!941 = !DILocation(line: 286, column: 35, scope: !929)
!942 = !DILocation(line: 286, column: 40, scope: !929)
!943 = !DILocation(line: 286, column: 12, scope: !929)
!944 = !DILocation(line: 286, column: 10, scope: !929)
!945 = !DILocation(line: 287, column: 10, scope: !946)
!946 = distinct !DILexicalBlock(scope: !929, file: !1, line: 287, column: 10)
!947 = !DILocation(line: 287, column: 16, scope: !946)
!948 = !DILocation(line: 287, column: 14, scope: !946)
!949 = !DILocation(line: 287, column: 10, scope: !929)
!950 = !DILocation(line: 288, column: 18, scope: !951)
!951 = distinct !DILexicalBlock(scope: !946, file: !1, line: 287, column: 26)
!952 = !DILocation(line: 288, column: 16, scope: !951)
!953 = !DILocation(line: 290, column: 15, scope: !951)
!954 = !DILocation(line: 290, column: 20, scope: !951)
!955 = !DILocation(line: 290, column: 13, scope: !951)
!956 = !DILocation(line: 291, column: 17, scope: !951)
!957 = !DILocation(line: 291, column: 15, scope: !951)
!958 = !DILocation(line: 292, column: 17, scope: !951)
!959 = !DILocation(line: 292, column: 15, scope: !951)
!960 = !DILocation(line: 293, column: 6, scope: !951)
!961 = !DILocation(line: 295, column: 4, scope: !916)
!962 = !DILocation(line: 296, column: 3, scope: !900)
!963 = distinct !{!963, !895, !964}
!964 = !DILocation(line: 296, column: 3, scope: !896)
!965 = !DILocation(line: 297, column: 2, scope: !887)
!966 = !DILocation(line: 299, column: 11, scope: !862)
!967 = !DILocation(line: 299, column: 3, scope: !862)
!968 = !DILocation(line: 299, column: 9, scope: !862)
!969 = !DILocation(line: 300, column: 11, scope: !862)
!970 = !DILocation(line: 300, column: 3, scope: !862)
!971 = !DILocation(line: 300, column: 9, scope: !862)
!972 = !DILocation(line: 302, column: 9, scope: !862)
!973 = !DILocation(line: 302, column: 2, scope: !862)
!974 = distinct !DISubprogram(name: "bm_face_calc_split_dot", scope: !1, file: !1, line: 238, type: !975, scopeLine: 239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !177)
!975 = !DISubroutineType(types: !976)
!976 = !{!85, !108, !108}
!977 = !DILocalVariable(name: "l_a", arg: 1, scope: !974, file: !1, line: 238, type: !108)
!978 = !DILocation(line: 238, column: 45, scope: !974)
!979 = !DILocalVariable(name: "l_b", arg: 2, scope: !974, file: !1, line: 238, type: !108)
!980 = !DILocation(line: 238, column: 58, scope: !974)
!981 = !DILocalVariable(name: "no", scope: !974, file: !1, line: 240, type: !982)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 192, elements: !983)
!983 = !{!984, !122}
!984 = !DISubrange(count: 2)
!985 = !DILocation(line: 240, column: 8, scope: !974)
!986 = !DILocation(line: 242, column: 34, scope: !987)
!987 = distinct !DILexicalBlock(scope: !974, file: !1, line: 242, column: 6)
!988 = !DILocation(line: 242, column: 39, scope: !987)
!989 = !DILocation(line: 242, column: 44, scope: !987)
!990 = !DILocation(line: 242, column: 7, scope: !987)
!991 = !DILocation(line: 242, column: 51, scope: !987)
!992 = !DILocation(line: 242, column: 60, scope: !987)
!993 = !DILocation(line: 243, column: 34, scope: !987)
!994 = !DILocation(line: 243, column: 39, scope: !987)
!995 = !DILocation(line: 243, column: 44, scope: !987)
!996 = !DILocation(line: 243, column: 7, scope: !987)
!997 = !DILocation(line: 243, column: 51, scope: !987)
!998 = !DILocation(line: 242, column: 6, scope: !974)
!999 = !DILocation(line: 245, column: 19, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !987, file: !1, line: 244, column: 2)
!1001 = !DILocation(line: 245, column: 26, scope: !1000)
!1002 = !DILocation(line: 245, column: 10, scope: !1000)
!1003 = !DILocation(line: 245, column: 3, scope: !1000)
!1004 = !DILocation(line: 248, column: 3, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !987, file: !1, line: 247, column: 7)
!1006 = !DILocation(line: 250, column: 1, scope: !974)
!1007 = distinct !DISubprogram(name: "BM_vert_find_first_loop", scope: !1, file: !1, line: 310, type: !1008, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!108, !151}
!1010 = !DILocalVariable(name: "v", arg: 1, scope: !1007, file: !1, line: 310, type: !151)
!1011 = !DILocation(line: 310, column: 41, scope: !1007)
!1012 = !DILocalVariable(name: "e", scope: !1007, file: !1, line: 312, type: !167)
!1013 = !DILocation(line: 312, column: 10, scope: !1007)
!1014 = !DILocation(line: 314, column: 7, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1007, file: !1, line: 314, column: 6)
!1016 = !DILocation(line: 314, column: 10, scope: !1015)
!1017 = !DILocation(line: 314, column: 6, scope: !1007)
!1018 = !DILocation(line: 315, column: 3, scope: !1015)
!1019 = !DILocation(line: 317, column: 37, scope: !1007)
!1020 = !DILocation(line: 317, column: 40, scope: !1007)
!1021 = !DILocation(line: 317, column: 43, scope: !1007)
!1022 = !DILocation(line: 317, column: 6, scope: !1007)
!1023 = !DILocation(line: 317, column: 4, scope: !1007)
!1024 = !DILocation(line: 319, column: 7, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1007, file: !1, line: 319, column: 6)
!1026 = !DILocation(line: 319, column: 6, scope: !1007)
!1027 = !DILocation(line: 320, column: 3, scope: !1025)
!1028 = !DILocation(line: 322, column: 42, scope: !1007)
!1029 = !DILocation(line: 322, column: 45, scope: !1007)
!1030 = !DILocation(line: 322, column: 48, scope: !1007)
!1031 = !DILocation(line: 322, column: 9, scope: !1007)
!1032 = !DILocation(line: 322, column: 2, scope: !1007)
!1033 = !DILocation(line: 323, column: 1, scope: !1007)
!1034 = distinct !DISubprogram(name: "BM_verts_in_face_count", scope: !1, file: !1, line: 356, type: !1035, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!96, !86, !418, !96}
!1037 = !DILocalVariable(name: "f", arg: 1, scope: !1034, file: !1, line: 356, type: !86)
!1038 = !DILocation(line: 356, column: 36, scope: !1034)
!1039 = !DILocalVariable(name: "varr", arg: 2, scope: !1034, file: !1, line: 356, type: !418)
!1040 = !DILocation(line: 356, column: 48, scope: !1034)
!1041 = !DILocalVariable(name: "len", arg: 3, scope: !1034, file: !1, line: 356, type: !96)
!1042 = !DILocation(line: 356, column: 58, scope: !1034)
!1043 = !DILocalVariable(name: "l_iter", scope: !1034, file: !1, line: 358, type: !108)
!1044 = !DILocation(line: 358, column: 10, scope: !1034)
!1045 = !DILocalVariable(name: "l_first", scope: !1034, file: !1, line: 358, type: !108)
!1046 = !DILocation(line: 358, column: 19, scope: !1034)
!1047 = !DILocalVariable(name: "i", scope: !1034, file: !1, line: 364, type: !96)
!1048 = !DILocation(line: 364, column: 6, scope: !1034)
!1049 = !DILocalVariable(name: "count", scope: !1034, file: !1, line: 364, type: !96)
!1050 = !DILocation(line: 364, column: 9, scope: !1034)
!1051 = !DILocation(line: 366, column: 9, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1034, file: !1, line: 366, column: 2)
!1053 = !DILocation(line: 366, column: 7, scope: !1052)
!1054 = !DILocation(line: 366, column: 14, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1052, file: !1, line: 366, column: 2)
!1056 = !DILocation(line: 366, column: 18, scope: !1055)
!1057 = !DILocation(line: 366, column: 16, scope: !1055)
!1058 = !DILocation(line: 366, column: 2, scope: !1052)
!1059 = !DILocation(line: 367, column: 3, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 367, column: 3)
!1061 = distinct !DILexicalBlock(scope: !1055, file: !1, line: 366, column: 28)
!1062 = !DILocation(line: 368, column: 2, scope: !1061)
!1063 = !DILocation(line: 366, column: 24, scope: !1055)
!1064 = !DILocation(line: 366, column: 2, scope: !1055)
!1065 = distinct !{!1065, !1058, !1066}
!1066 = !DILocation(line: 368, column: 2, scope: !1052)
!1067 = !DILocation(line: 378, column: 22, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1034, file: !1, line: 373, column: 2)
!1069 = !DILocation(line: 378, column: 25, scope: !1068)
!1070 = !DILocation(line: 378, column: 20, scope: !1068)
!1071 = !DILocation(line: 378, column: 10, scope: !1068)
!1072 = !DILocation(line: 381, column: 3, scope: !1068)
!1073 = !DILocation(line: 382, column: 8, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !1, line: 382, column: 8)
!1075 = distinct !DILexicalBlock(scope: !1068, file: !1, line: 381, column: 6)
!1076 = !DILocation(line: 382, column: 8, scope: !1075)
!1077 = !DILocation(line: 383, column: 10, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 382, column: 57)
!1079 = !DILocation(line: 384, column: 4, scope: !1078)
!1080 = !DILocation(line: 386, column: 3, scope: !1075)
!1081 = !DILocation(line: 386, column: 22, scope: !1068)
!1082 = !DILocation(line: 386, column: 30, scope: !1068)
!1083 = !DILocation(line: 386, column: 20, scope: !1068)
!1084 = !DILocation(line: 386, column: 39, scope: !1068)
!1085 = !DILocation(line: 386, column: 36, scope: !1068)
!1086 = distinct !{!1086, !1072, !1087}
!1087 = !DILocation(line: 386, column: 46, scope: !1068)
!1088 = !DILocation(line: 389, column: 9, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1034, file: !1, line: 389, column: 2)
!1090 = !DILocation(line: 389, column: 7, scope: !1089)
!1091 = !DILocation(line: 389, column: 14, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1089, file: !1, line: 389, column: 2)
!1093 = !DILocation(line: 389, column: 18, scope: !1092)
!1094 = !DILocation(line: 389, column: 16, scope: !1092)
!1095 = !DILocation(line: 389, column: 2, scope: !1089)
!1096 = !DILocation(line: 390, column: 3, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !1, line: 390, column: 3)
!1098 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 389, column: 28)
!1099 = !DILocation(line: 391, column: 2, scope: !1098)
!1100 = !DILocation(line: 389, column: 24, scope: !1092)
!1101 = !DILocation(line: 389, column: 2, scope: !1092)
!1102 = distinct !{!1102, !1095, !1103}
!1103 = !DILocation(line: 391, column: 2, scope: !1089)
!1104 = !DILocation(line: 393, column: 9, scope: !1034)
!1105 = !DILocation(line: 393, column: 2, scope: !1034)
!1106 = distinct !DISubprogram(name: "BM_verts_in_face", scope: !1, file: !1, line: 400, type: !1107, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!656, !86, !418, !96}
!1109 = !DILocalVariable(name: "f", arg: 1, scope: !1106, file: !1, line: 400, type: !86)
!1110 = !DILocation(line: 400, column: 31, scope: !1106)
!1111 = !DILocalVariable(name: "varr", arg: 2, scope: !1106, file: !1, line: 400, type: !418)
!1112 = !DILocation(line: 400, column: 43, scope: !1106)
!1113 = !DILocalVariable(name: "len", arg: 3, scope: !1106, file: !1, line: 400, type: !96)
!1114 = !DILocation(line: 400, column: 53, scope: !1106)
!1115 = !DILocalVariable(name: "l_iter", scope: !1106, file: !1, line: 402, type: !108)
!1116 = !DILocation(line: 402, column: 10, scope: !1106)
!1117 = !DILocalVariable(name: "l_first", scope: !1106, file: !1, line: 402, type: !108)
!1118 = !DILocation(line: 402, column: 19, scope: !1106)
!1119 = !DILocalVariable(name: "i", scope: !1106, file: !1, line: 408, type: !96)
!1120 = !DILocation(line: 408, column: 6, scope: !1106)
!1121 = !DILocalVariable(name: "ok", scope: !1106, file: !1, line: 409, type: !656)
!1122 = !DILocation(line: 409, column: 7, scope: !1106)
!1123 = !DILocation(line: 412, column: 6, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 412, column: 6)
!1125 = !DILocation(line: 412, column: 9, scope: !1124)
!1126 = !DILocation(line: 412, column: 15, scope: !1124)
!1127 = !DILocation(line: 412, column: 13, scope: !1124)
!1128 = !DILocation(line: 412, column: 6, scope: !1106)
!1129 = !DILocation(line: 413, column: 3, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1124, file: !1, line: 412, column: 20)
!1131 = !DILocation(line: 416, column: 9, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 416, column: 2)
!1133 = !DILocation(line: 416, column: 7, scope: !1132)
!1134 = !DILocation(line: 416, column: 14, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1132, file: !1, line: 416, column: 2)
!1136 = !DILocation(line: 416, column: 18, scope: !1135)
!1137 = !DILocation(line: 416, column: 16, scope: !1135)
!1138 = !DILocation(line: 416, column: 2, scope: !1132)
!1139 = !DILocation(line: 417, column: 3, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !1, line: 417, column: 3)
!1141 = distinct !DILexicalBlock(scope: !1135, file: !1, line: 416, column: 28)
!1142 = !DILocation(line: 418, column: 2, scope: !1141)
!1143 = !DILocation(line: 416, column: 24, scope: !1135)
!1144 = !DILocation(line: 416, column: 2, scope: !1135)
!1145 = distinct !{!1145, !1138, !1146}
!1146 = !DILocation(line: 418, column: 2, scope: !1132)
!1147 = !DILocation(line: 428, column: 22, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 423, column: 2)
!1149 = !DILocation(line: 428, column: 25, scope: !1148)
!1150 = !DILocation(line: 428, column: 20, scope: !1148)
!1151 = !DILocation(line: 428, column: 10, scope: !1148)
!1152 = !DILocation(line: 431, column: 3, scope: !1148)
!1153 = !DILocation(line: 432, column: 8, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !1, line: 432, column: 8)
!1155 = distinct !DILexicalBlock(scope: !1148, file: !1, line: 431, column: 6)
!1156 = !DILocation(line: 432, column: 8, scope: !1155)
!1157 = !DILocation(line: 434, column: 4, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1154, file: !1, line: 432, column: 57)
!1159 = !DILocation(line: 436, column: 8, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1154, file: !1, line: 435, column: 9)
!1161 = !DILocation(line: 437, column: 5, scope: !1160)
!1162 = !DILocation(line: 440, column: 3, scope: !1155)
!1163 = !DILocation(line: 440, column: 22, scope: !1148)
!1164 = !DILocation(line: 440, column: 30, scope: !1148)
!1165 = !DILocation(line: 440, column: 20, scope: !1148)
!1166 = !DILocation(line: 440, column: 39, scope: !1148)
!1167 = !DILocation(line: 440, column: 36, scope: !1148)
!1168 = distinct !{!1168, !1152, !1169}
!1169 = !DILocation(line: 440, column: 46, scope: !1148)
!1170 = !DILocation(line: 443, column: 9, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 443, column: 2)
!1172 = !DILocation(line: 443, column: 7, scope: !1171)
!1173 = !DILocation(line: 443, column: 14, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1171, file: !1, line: 443, column: 2)
!1175 = !DILocation(line: 443, column: 18, scope: !1174)
!1176 = !DILocation(line: 443, column: 16, scope: !1174)
!1177 = !DILocation(line: 443, column: 2, scope: !1171)
!1178 = !DILocation(line: 444, column: 3, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !1, line: 444, column: 3)
!1180 = distinct !DILexicalBlock(scope: !1174, file: !1, line: 443, column: 28)
!1181 = !DILocation(line: 445, column: 2, scope: !1180)
!1182 = !DILocation(line: 443, column: 24, scope: !1174)
!1183 = !DILocation(line: 443, column: 2, scope: !1174)
!1184 = distinct !{!1184, !1177, !1185}
!1185 = !DILocation(line: 445, column: 2, scope: !1171)
!1186 = !DILocation(line: 447, column: 9, scope: !1106)
!1187 = !DILocation(line: 447, column: 2, scope: !1106)
!1188 = !DILocation(line: 448, column: 1, scope: !1106)
!1189 = distinct !DISubprogram(name: "BM_edge_in_face", scope: !1, file: !1, line: 453, type: !1190, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!656, !167, !86}
!1192 = !DILocalVariable(name: "e", arg: 1, scope: !1189, file: !1, line: 453, type: !167)
!1193 = !DILocation(line: 453, column: 30, scope: !1189)
!1194 = !DILocalVariable(name: "f", arg: 2, scope: !1189, file: !1, line: 453, type: !86)
!1195 = !DILocation(line: 453, column: 41, scope: !1189)
!1196 = !DILocation(line: 455, column: 6, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1189, file: !1, line: 455, column: 6)
!1198 = !DILocation(line: 455, column: 9, scope: !1197)
!1199 = !DILocation(line: 455, column: 6, scope: !1189)
!1200 = !DILocalVariable(name: "l_iter", scope: !1201, file: !1, line: 456, type: !108)
!1201 = distinct !DILexicalBlock(scope: !1197, file: !1, line: 455, column: 12)
!1202 = !DILocation(line: 456, column: 11, scope: !1201)
!1203 = !DILocalVariable(name: "l_first", scope: !1201, file: !1, line: 456, type: !108)
!1204 = !DILocation(line: 456, column: 20, scope: !1201)
!1205 = !DILocation(line: 458, column: 22, scope: !1201)
!1206 = !DILocation(line: 458, column: 25, scope: !1201)
!1207 = !DILocation(line: 458, column: 20, scope: !1201)
!1208 = !DILocation(line: 458, column: 10, scope: !1201)
!1209 = !DILocation(line: 459, column: 3, scope: !1201)
!1210 = !DILocation(line: 460, column: 8, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1212, file: !1, line: 460, column: 8)
!1212 = distinct !DILexicalBlock(scope: !1201, file: !1, line: 459, column: 6)
!1213 = !DILocation(line: 460, column: 16, scope: !1211)
!1214 = !DILocation(line: 460, column: 21, scope: !1211)
!1215 = !DILocation(line: 460, column: 18, scope: !1211)
!1216 = !DILocation(line: 460, column: 8, scope: !1212)
!1217 = !DILocation(line: 461, column: 5, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1211, file: !1, line: 460, column: 24)
!1219 = !DILocation(line: 463, column: 3, scope: !1212)
!1220 = !DILocation(line: 463, column: 22, scope: !1201)
!1221 = !DILocation(line: 463, column: 30, scope: !1201)
!1222 = !DILocation(line: 463, column: 20, scope: !1201)
!1223 = !DILocation(line: 463, column: 46, scope: !1201)
!1224 = !DILocation(line: 463, column: 43, scope: !1201)
!1225 = distinct !{!1225, !1209, !1226}
!1226 = !DILocation(line: 463, column: 53, scope: !1201)
!1227 = !DILocation(line: 464, column: 2, scope: !1201)
!1228 = !DILocation(line: 466, column: 2, scope: !1189)
!1229 = !DILocation(line: 467, column: 1, scope: !1189)
!1230 = distinct !DISubprogram(name: "BM_edge_other_loop", scope: !1, file: !1, line: 485, type: !1231, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!108, !167, !108}
!1233 = !DILocalVariable(name: "e", arg: 1, scope: !1230, file: !1, line: 485, type: !167)
!1234 = !DILocation(line: 485, column: 36, scope: !1230)
!1235 = !DILocalVariable(name: "l", arg: 2, scope: !1230, file: !1, line: 485, type: !108)
!1236 = !DILocation(line: 485, column: 47, scope: !1230)
!1237 = !DILocalVariable(name: "l_other", scope: !1230, file: !1, line: 487, type: !108)
!1238 = !DILocation(line: 487, column: 10, scope: !1230)
!1239 = !DILocation(line: 493, column: 13, scope: !1230)
!1240 = !DILocation(line: 493, column: 16, scope: !1230)
!1241 = !DILocation(line: 493, column: 21, scope: !1230)
!1242 = !DILocation(line: 493, column: 18, scope: !1230)
!1243 = !DILocation(line: 493, column: 12, scope: !1230)
!1244 = !DILocation(line: 493, column: 26, scope: !1230)
!1245 = !DILocation(line: 493, column: 30, scope: !1230)
!1246 = !DILocation(line: 493, column: 33, scope: !1230)
!1247 = !DILocation(line: 493, column: 10, scope: !1230)
!1248 = !DILocation(line: 494, column: 12, scope: !1230)
!1249 = !DILocation(line: 494, column: 21, scope: !1230)
!1250 = !DILocation(line: 494, column: 10, scope: !1230)
!1251 = !DILocation(line: 497, column: 6, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1230, file: !1, line: 497, column: 6)
!1253 = !DILocation(line: 497, column: 15, scope: !1252)
!1254 = !DILocation(line: 497, column: 20, scope: !1252)
!1255 = !DILocation(line: 497, column: 23, scope: !1252)
!1256 = !DILocation(line: 497, column: 17, scope: !1252)
!1257 = !DILocation(line: 497, column: 6, scope: !1230)
!1258 = !DILocation(line: 499, column: 2, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1252, file: !1, line: 497, column: 26)
!1260 = !DILocation(line: 500, column: 11, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1252, file: !1, line: 500, column: 11)
!1262 = !DILocation(line: 500, column: 20, scope: !1261)
!1263 = !DILocation(line: 500, column: 26, scope: !1261)
!1264 = !DILocation(line: 500, column: 31, scope: !1261)
!1265 = !DILocation(line: 500, column: 34, scope: !1261)
!1266 = !DILocation(line: 500, column: 28, scope: !1261)
!1267 = !DILocation(line: 500, column: 11, scope: !1252)
!1268 = !DILocation(line: 501, column: 13, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1261, file: !1, line: 500, column: 37)
!1270 = !DILocation(line: 501, column: 22, scope: !1269)
!1271 = !DILocation(line: 501, column: 11, scope: !1269)
!1272 = !DILocation(line: 502, column: 2, scope: !1269)
!1273 = !DILocation(line: 507, column: 9, scope: !1230)
!1274 = !DILocation(line: 507, column: 2, scope: !1230)
!1275 = distinct !DISubprogram(name: "BM_vert_step_fan_loop", scope: !1, file: !1, line: 535, type: !1276, scopeLine: 536, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !177)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!108, !108, !420}
!1278 = !DILocalVariable(name: "l", arg: 1, scope: !1275, file: !1, line: 535, type: !108)
!1279 = !DILocation(line: 535, column: 39, scope: !1275)
!1280 = !DILocalVariable(name: "e_step", arg: 2, scope: !1275, file: !1, line: 535, type: !420)
!1281 = !DILocation(line: 535, column: 51, scope: !1275)
!1282 = !DILocalVariable(name: "e_prev", scope: !1275, file: !1, line: 537, type: !167)
!1283 = !DILocation(line: 537, column: 10, scope: !1275)
!1284 = !DILocation(line: 537, column: 20, scope: !1275)
!1285 = !DILocation(line: 537, column: 19, scope: !1275)
!1286 = !DILocalVariable(name: "e_next", scope: !1275, file: !1, line: 538, type: !167)
!1287 = !DILocation(line: 538, column: 10, scope: !1275)
!1288 = !DILocation(line: 539, column: 6, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1275, file: !1, line: 539, column: 6)
!1290 = !DILocation(line: 539, column: 9, scope: !1289)
!1291 = !DILocation(line: 539, column: 14, scope: !1289)
!1292 = !DILocation(line: 539, column: 11, scope: !1289)
!1293 = !DILocation(line: 539, column: 6, scope: !1275)
!1294 = !DILocation(line: 540, column: 12, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1289, file: !1, line: 539, column: 22)
!1296 = !DILocation(line: 540, column: 15, scope: !1295)
!1297 = !DILocation(line: 540, column: 21, scope: !1295)
!1298 = !DILocation(line: 540, column: 10, scope: !1295)
!1299 = !DILocation(line: 541, column: 2, scope: !1295)
!1300 = !DILocation(line: 542, column: 11, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1289, file: !1, line: 542, column: 11)
!1302 = !DILocation(line: 542, column: 14, scope: !1301)
!1303 = !DILocation(line: 542, column: 20, scope: !1301)
!1304 = !DILocation(line: 542, column: 25, scope: !1301)
!1305 = !DILocation(line: 542, column: 22, scope: !1301)
!1306 = !DILocation(line: 542, column: 11, scope: !1289)
!1307 = !DILocation(line: 543, column: 12, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1301, file: !1, line: 542, column: 33)
!1309 = !DILocation(line: 543, column: 15, scope: !1308)
!1310 = !DILocation(line: 543, column: 10, scope: !1308)
!1311 = !DILocation(line: 544, column: 2, scope: !1308)
!1312 = !DILocation(line: 547, column: 3, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1301, file: !1, line: 545, column: 7)
!1314 = !DILocation(line: 550, column: 26, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1275, file: !1, line: 550, column: 6)
!1316 = !DILocation(line: 550, column: 6, scope: !1315)
!1317 = !DILocation(line: 550, column: 6, scope: !1275)
!1318 = !DILocation(line: 551, column: 40, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1315, file: !1, line: 550, column: 35)
!1320 = !DILocation(line: 551, column: 31, scope: !1319)
!1321 = !DILocation(line: 551, column: 38, scope: !1319)
!1322 = !DILocation(line: 551, column: 49, scope: !1319)
!1323 = !DILocation(line: 551, column: 10, scope: !1319)
!1324 = !DILocation(line: 551, column: 3, scope: !1319)
