; ModuleID = 'blender/source/blender/editors/object/object_group.c'
source_filename = "blender/source/blender/editors/object/object_group.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!4 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!7 = !DIEnumerator(name: "PROP_EDITABLE", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "PROP_LIB_EXCEPTION", value: 65536, isUnsigned: true)
!9 = !DIEnumerator(name: "PROP_ANIMATABLE", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_ICONS_CONSECUTIVE", value: 4096, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_HIDDEN", value: 524288, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_SKIP_SAVE", value: 268435456, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_REQUIRED", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_OUTPUT", value: 8, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_RNAPTR", value: 2048, isUnsigned: true)
!16 = !DIEnumerator(name: "PROP_PYFUNC_OPTIONAL", value: 1073741824, isUnsigned: true)
!17 = !DIEnumerator(name: "PROP_REGISTER", value: 16, isUnsigned: true)
!18 = !DIEnumerator(name: "PROP_REGISTER_OPTIONAL", value: 48, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_PROPORTIONAL", value: 67108864, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_ID_REFCOUNT", value: 64, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_ID_SELF_CHECK", value: 1048576, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_NEVER_NULL", value: 262144, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_NEVER_UNLINK", value: 33554432, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_ENUM_FLAG", value: 2097152, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_CONTEXT_UPDATE", value: 4194304, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_CONTEXT_PROPERTY_UPDATE", value: 138412032, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 351, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = !{!41, !42, !43, !44, !45, !46}
!41 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!44 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!45 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!46 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !39, line: 67, baseType: !5, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57}
!49 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!51 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!52 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!53 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!54 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!55 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!56 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!57 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !{i32 7, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{i32 1, !"wchar_size", i32 4}
!63 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!64 = distinct !DISubprogram(name: "GROUP_OT_objects_add_active", scope: !1, file: !1, line: 219, type: !65, scopeLine: 220, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1869)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !69, line: 568, baseType: !70)
!69 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !69, line: 508, size: 1536, elements: !71)
!71 = !{!72, !76, !77, !78, !79, !1795, !1799, !1805, !1809, !1810, !1814, !1815, !1816, !1817, !1821, !1822, !1837, !1838, !1842, !1868}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !69, line: 509, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !70, file: !69, line: 510, baseType: !73, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !70, file: !69, line: 511, baseType: !73, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !70, file: !69, line: 512, baseType: !73, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !70, file: !69, line: 518, baseType: !80, size: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !84, !86}
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !4, line: 44, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !39, line: 328, size: 1344, elements: !88)
!88 = !{!89, !90, !91, !95, !126, !128, !129, !130, !142, !1788, !1789, !1790, !1793, !1794}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !39, line: 329, baseType: !86, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !39, line: 329, baseType: !86, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !87, file: !39, line: 332, baseType: !92, size: 512, offset: 128)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !87, file: !39, line: 333, baseType: !96, size: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !98, line: 75, baseType: !99)
!98 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !98, line: 62, size: 1024, elements: !100)
!100 = !{!101, !103, !104, !105, !106, !108, !109, !110, !124, !125}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !98, line: 63, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !99, file: !98, line: 63, baseType: !102, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !98, line: 64, baseType: !75, size: 8, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !99, file: !98, line: 64, baseType: !75, size: 8, offset: 136)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !99, file: !98, line: 65, baseType: !107, size: 16, offset: 144)
!107 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !98, line: 66, baseType: !92, size: 512, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !99, file: !98, line: 67, baseType: !83, size: 32, offset: 672)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !99, file: !98, line: 69, baseType: !111, size: 256, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !98, line: 60, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !98, line: 48, size: 256, elements: !113)
!113 = !{!114, !115, !122, !123}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !112, file: !98, line: 49, baseType: !59, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !112, file: !98, line: 58, baseType: !116, size: 128, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !117, line: 71, baseType: !118)
!117 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !117, line: 69, size: 128, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !118, file: !117, line: 70, baseType: !59, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !118, file: !117, line: 70, baseType: !59, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !112, file: !98, line: 59, baseType: !83, size: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !112, file: !98, line: 59, baseType: !83, size: 32, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !99, file: !98, line: 70, baseType: !83, size: 32, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !99, file: !98, line: 74, baseType: !83, size: 32, offset: 992)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !39, line: 336, baseType: !127, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !87, file: !39, line: 337, baseType: !59, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !87, file: !39, line: 338, baseType: !59, size: 64, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !87, file: !39, line: 340, baseType: !131, size: 64, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !4, line: 55, size: 192, elements: !133)
!133 = !{!134, !138, !141}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !132, file: !4, line: 58, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !132, file: !4, line: 56, size: 64, elements: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !135, file: !4, line: 57, baseType: !59, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !4, line: 60, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !4, line: 41, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !132, file: !4, line: 61, baseType: !59, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !87, file: !39, line: 341, baseType: !143, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !39, line: 106, size: 320, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !144, file: !39, line: 107, baseType: !116, size: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !144, file: !39, line: 108, baseType: !83, size: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !144, file: !39, line: 109, baseType: !83, size: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !144, file: !39, line: 110, baseType: !83, size: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !144, file: !39, line: 110, baseType: !83, size: 32, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !144, file: !39, line: 111, baseType: !152, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !69, line: 490, size: 768, elements: !154)
!154 = !{!155, !156, !157, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !69, line: 491, baseType: !152, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !69, line: 491, baseType: !152, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !153, file: !69, line: 493, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !39, line: 169, size: 2048, elements: !160)
!160 = !{!161, !162, !163, !164, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1754, !1757, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !39, line: 170, baseType: !158, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !159, file: !39, line: 170, baseType: !158, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !159, file: !39, line: 172, baseType: !59, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !159, file: !39, line: 174, baseType: !165, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !167, line: 49, size: 1984, elements: !168)
!167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = !{!169, !205, !206, !207, !208, !209, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !167, line: 50, baseType: !170, size: 960)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !98, line: 130, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !98, line: 117, size: 960, elements: !172)
!172 = !{!173, !174, !175, !177, !196, !200, !201, !202, !203, !204}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !98, line: 118, baseType: !59, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !98, line: 118, baseType: !59, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !171, file: !98, line: 119, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !171, file: !98, line: 120, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !98, line: 136, size: 17600, elements: !180)
!180 = !{!181, !182, !184, !187, !191, !192, !193}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !179, file: !98, line: 137, baseType: !170, size: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !179, file: !98, line: 138, baseType: !183, size: 64, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !179, file: !98, line: 139, baseType: !185, size: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !98, line: 43, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !98, line: 140, baseType: !188, size: 8192, offset: 1088)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8192, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 1024)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !179, file: !98, line: 141, baseType: !188, size: 8192, offset: 9280)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !179, file: !98, line: 148, baseType: !178, size: 64, offset: 17472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !179, file: !98, line: 150, baseType: !194, size: 64, offset: 17536)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !98, line: 45, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !98, line: 121, baseType: !197, size: 528, offset: 256)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 528, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 66)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !98, line: 126, baseType: !107, size: 16, offset: 784)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !171, file: !98, line: 127, baseType: !83, size: 32, offset: 800)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !171, file: !98, line: 128, baseType: !83, size: 32, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !171, file: !98, line: 128, baseType: !83, size: 32, offset: 864)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !171, file: !98, line: 129, baseType: !96, size: 64, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !166, file: !167, line: 52, baseType: !116, size: 128, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !166, file: !167, line: 53, baseType: !116, size: 128, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !166, file: !167, line: 54, baseType: !116, size: 128, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !166, file: !167, line: 55, baseType: !116, size: 128, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !166, file: !167, line: 57, baseType: !210, size: 64, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !212, line: 1216, size: 39680, elements: !213)
!212 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!213 = !{!214, !215, !219, !517, !520, !521, !522, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !548, !619, !1047, !1262, !1265, !1554, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1576, !1577, !1578, !1579, !1580, !1588, !1655, !1662, !1663, !1670, !1671, !1672, !1673, !1674, !1675, !1676}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !211, file: !212, line: 1217, baseType: !170, size: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !211, file: !212, line: 1218, baseType: !216, size: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !218, line: 45, flags: DIFlagFwdDecl)
!218 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !211, file: !212, line: 1220, baseType: !220, size: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !222, line: 115, size: 11392, elements: !223)
!222 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!223 = !{!224, !225, !226, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !243, !255, !269, !270, !313, !314, !317, !318, !334, !335, !336, !337, !338, !339, !340, !344, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !360, !361, !362, !363, !364, !365, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !425, !426, !427, !428, !429, !430, !431, !432, !433, !436, !439, !448, !449, !450, !451, !452, !455, !458, !461, !462, !468, !469, !470, !471, !472, !473, !475, !478, !481, !485, !505, !506}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !221, file: !222, line: 116, baseType: !170, size: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !221, file: !222, line: 117, baseType: !216, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !221, file: !222, line: 119, baseType: !227, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !222, line: 57, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !222, line: 121, baseType: !107, size: 16, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !221, file: !222, line: 121, baseType: !107, size: 16, offset: 1104)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !221, file: !222, line: 122, baseType: !83, size: 32, offset: 1120)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !221, file: !222, line: 122, baseType: !83, size: 32, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !221, file: !222, line: 122, baseType: !83, size: 32, offset: 1184)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !221, file: !222, line: 123, baseType: !92, size: 512, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !221, file: !222, line: 124, baseType: !220, size: 64, offset: 1728)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !221, file: !222, line: 124, baseType: !220, size: 64, offset: 1792)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !221, file: !222, line: 127, baseType: !220, size: 64, offset: 1856)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !221, file: !222, line: 127, baseType: !220, size: 64, offset: 1920)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !221, file: !222, line: 127, baseType: !220, size: 64, offset: 1984)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !221, file: !222, line: 128, baseType: !241, size: 64, offset: 2048)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !218, line: 46, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !221, file: !222, line: 130, baseType: !244, size: 64, offset: 2112)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !222, line: 97, size: 832, elements: !246)
!246 = !{!247, !253, !254}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !245, file: !222, line: 98, baseType: !248, size: 768)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 768, elements: !250)
!249 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!250 = !{!251, !252}
!251 = !DISubrange(count: 8)
!252 = !DISubrange(count: 3)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !245, file: !222, line: 99, baseType: !83, size: 32, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !245, file: !222, line: 99, baseType: !83, size: 32, offset: 800)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !221, file: !222, line: 131, baseType: !256, size: 64, offset: 2176)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !258, line: 486, size: 1600, elements: !259)
!258 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !257, file: !258, line: 487, baseType: !170, size: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !257, file: !258, line: 489, baseType: !116, size: 128, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !257, file: !258, line: 490, baseType: !116, size: 128, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !257, file: !258, line: 491, baseType: !116, size: 128, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !257, file: !258, line: 492, baseType: !116, size: 128, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !257, file: !258, line: 494, baseType: !83, size: 32, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !257, file: !258, line: 495, baseType: !83, size: 32, offset: 1504)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !257, file: !258, line: 497, baseType: !83, size: 32, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !257, file: !258, line: 498, baseType: !83, size: 32, offset: 1568)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !221, file: !222, line: 132, baseType: !256, size: 64, offset: 2240)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !221, file: !222, line: 133, baseType: !271, size: 64, offset: 2304)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !258, line: 334, size: 1728, elements: !273)
!273 = !{!274, !275, !278, !279, !280, !281, !282, !283, !286, !287, !288, !289, !290, !291, !292, !312}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !272, file: !258, line: 335, baseType: !116, size: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !272, file: !258, line: 336, baseType: !276, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !258, line: 47, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !258, line: 338, baseType: !107, size: 16, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !272, file: !258, line: 338, baseType: !107, size: 16, offset: 208)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !272, file: !258, line: 339, baseType: !5, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !272, file: !258, line: 340, baseType: !83, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !272, file: !258, line: 342, baseType: !249, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !272, file: !258, line: 343, baseType: !284, size: 96, offset: 320)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 96, elements: !285)
!285 = !{!252}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !272, file: !258, line: 344, baseType: !284, size: 96, offset: 416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !272, file: !258, line: 347, baseType: !116, size: 128, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !272, file: !258, line: 349, baseType: !83, size: 32, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !272, file: !258, line: 350, baseType: !83, size: 32, offset: 672)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !272, file: !258, line: 351, baseType: !59, size: 64, offset: 704)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !272, file: !258, line: 352, baseType: !59, size: 64, offset: 768)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !272, file: !258, line: 354, baseType: !293, size: 384, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !258, line: 116, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !258, line: 94, size: 384, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !294, file: !258, line: 96, baseType: !83, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !294, file: !258, line: 96, baseType: !83, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !294, file: !258, line: 97, baseType: !83, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !294, file: !258, line: 97, baseType: !83, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !294, file: !258, line: 99, baseType: !107, size: 16, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !294, file: !258, line: 100, baseType: !107, size: 16, offset: 144)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !294, file: !258, line: 102, baseType: !107, size: 16, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !294, file: !258, line: 105, baseType: !107, size: 16, offset: 176)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !294, file: !258, line: 108, baseType: !107, size: 16, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !294, file: !258, line: 109, baseType: !107, size: 16, offset: 208)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !294, file: !258, line: 111, baseType: !107, size: 16, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !294, file: !258, line: 112, baseType: !107, size: 16, offset: 240)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !294, file: !258, line: 114, baseType: !83, size: 32, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !294, file: !258, line: 114, baseType: !83, size: 32, offset: 288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !294, file: !258, line: 115, baseType: !83, size: 32, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !294, file: !258, line: 115, baseType: !83, size: 32, offset: 352)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !272, file: !258, line: 355, baseType: !92, size: 512, offset: 1216)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !221, file: !222, line: 134, baseType: !59, size: 64, offset: 2368)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !221, file: !222, line: 136, baseType: !315, size: 64, offset: 2432)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !222, line: 58, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !221, file: !222, line: 138, baseType: !293, size: 384, offset: 2496)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !221, file: !222, line: 139, baseType: !319, size: 64, offset: 2880)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !258, line: 80, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !258, line: 72, size: 192, elements: !322)
!322 = !{!323, !330, !331, !332, !333}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !321, file: !258, line: 73, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !258, line: 59, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !258, line: 56, size: 128, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !326, file: !258, line: 57, baseType: !284, size: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !258, line: 58, baseType: !83, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !321, file: !258, line: 74, baseType: !83, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !321, file: !258, line: 76, baseType: !83, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !321, file: !258, line: 77, baseType: !83, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !321, file: !258, line: 79, baseType: !83, size: 32, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !221, file: !222, line: 141, baseType: !116, size: 128, offset: 2944)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !221, file: !222, line: 142, baseType: !116, size: 128, offset: 3072)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !221, file: !222, line: 143, baseType: !116, size: 128, offset: 3200)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !221, file: !222, line: 144, baseType: !116, size: 128, offset: 3328)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !221, file: !222, line: 146, baseType: !83, size: 32, offset: 3456)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !221, file: !222, line: 147, baseType: !83, size: 32, offset: 3488)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !221, file: !222, line: 150, baseType: !341, size: 64, offset: 3520)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !222, line: 50, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !221, file: !222, line: 151, baseType: !345, size: 64, offset: 3584)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !221, file: !222, line: 152, baseType: !83, size: 32, offset: 3648)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !221, file: !222, line: 153, baseType: !83, size: 32, offset: 3680)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !221, file: !222, line: 156, baseType: !284, size: 96, offset: 3712)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !221, file: !222, line: 156, baseType: !284, size: 96, offset: 3808)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !221, file: !222, line: 156, baseType: !284, size: 96, offset: 3904)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !221, file: !222, line: 157, baseType: !284, size: 96, offset: 4000)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !221, file: !222, line: 158, baseType: !284, size: 96, offset: 4096)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !221, file: !222, line: 159, baseType: !284, size: 96, offset: 4192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !221, file: !222, line: 160, baseType: !284, size: 96, offset: 4288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !221, file: !222, line: 160, baseType: !284, size: 96, offset: 4384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !221, file: !222, line: 161, baseType: !357, size: 128, offset: 4480)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 128, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 4)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !221, file: !222, line: 161, baseType: !357, size: 128, offset: 4608)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !221, file: !222, line: 162, baseType: !284, size: 96, offset: 4736)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !221, file: !222, line: 162, baseType: !284, size: 96, offset: 4832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !221, file: !222, line: 163, baseType: !249, size: 32, offset: 4928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !221, file: !222, line: 163, baseType: !249, size: 32, offset: 4960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !221, file: !222, line: 164, baseType: !366, size: 512, offset: 4992)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 512, elements: !367)
!367 = !{!359, !359}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !221, file: !222, line: 165, baseType: !366, size: 512, offset: 5504)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !221, file: !222, line: 166, baseType: !366, size: 512, offset: 6016)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !221, file: !222, line: 167, baseType: !366, size: 512, offset: 6528)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !221, file: !222, line: 176, baseType: !366, size: 512, offset: 7040)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !221, file: !222, line: 178, baseType: !5, size: 32, offset: 7552)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !222, line: 180, baseType: !107, size: 16, offset: 7584)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !221, file: !222, line: 181, baseType: !107, size: 16, offset: 7600)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !221, file: !222, line: 183, baseType: !107, size: 16, offset: 7616)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !221, file: !222, line: 183, baseType: !107, size: 16, offset: 7632)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !221, file: !222, line: 184, baseType: !107, size: 16, offset: 7648)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !221, file: !222, line: 184, baseType: !107, size: 16, offset: 7664)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !221, file: !222, line: 185, baseType: !107, size: 16, offset: 7680)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !221, file: !222, line: 186, baseType: !107, size: 16, offset: 7696)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !221, file: !222, line: 187, baseType: !107, size: 16, offset: 7712)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !221, file: !222, line: 188, baseType: !75, size: 8, offset: 7728)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !221, file: !222, line: 189, baseType: !75, size: 8, offset: 7736)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !221, file: !222, line: 192, baseType: !83, size: 32, offset: 7744)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !221, file: !222, line: 192, baseType: !83, size: 32, offset: 7776)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !221, file: !222, line: 192, baseType: !83, size: 32, offset: 7808)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !221, file: !222, line: 192, baseType: !83, size: 32, offset: 7840)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !221, file: !222, line: 194, baseType: !83, size: 32, offset: 7872)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !221, file: !222, line: 202, baseType: !249, size: 32, offset: 7904)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !221, file: !222, line: 202, baseType: !249, size: 32, offset: 7936)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !221, file: !222, line: 202, baseType: !249, size: 32, offset: 7968)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !221, file: !222, line: 211, baseType: !249, size: 32, offset: 8000)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !221, file: !222, line: 212, baseType: !249, size: 32, offset: 8032)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !221, file: !222, line: 213, baseType: !249, size: 32, offset: 8064)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !221, file: !222, line: 214, baseType: !249, size: 32, offset: 8096)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !221, file: !222, line: 215, baseType: !249, size: 32, offset: 8128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !221, file: !222, line: 216, baseType: !249, size: 32, offset: 8160)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !221, file: !222, line: 219, baseType: !249, size: 32, offset: 8192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !221, file: !222, line: 220, baseType: !249, size: 32, offset: 8224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !221, file: !222, line: 221, baseType: !249, size: 32, offset: 8256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !221, file: !222, line: 224, baseType: !402, size: 16, offset: 8288)
!402 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !221, file: !222, line: 224, baseType: !402, size: 16, offset: 8304)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !221, file: !222, line: 226, baseType: !107, size: 16, offset: 8320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !221, file: !222, line: 228, baseType: !75, size: 8, offset: 8336)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !221, file: !222, line: 229, baseType: !75, size: 8, offset: 8344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !221, file: !222, line: 231, baseType: !107, size: 16, offset: 8352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !221, file: !222, line: 232, baseType: !75, size: 8, offset: 8368)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !221, file: !222, line: 233, baseType: !75, size: 8, offset: 8376)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !221, file: !222, line: 234, baseType: !249, size: 32, offset: 8384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !221, file: !222, line: 235, baseType: !249, size: 32, offset: 8416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !221, file: !222, line: 237, baseType: !116, size: 128, offset: 8448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !221, file: !222, line: 238, baseType: !116, size: 128, offset: 8576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !221, file: !222, line: 239, baseType: !116, size: 128, offset: 8704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !221, file: !222, line: 240, baseType: !116, size: 128, offset: 8832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !221, file: !222, line: 242, baseType: !249, size: 32, offset: 8960)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !221, file: !222, line: 244, baseType: !107, size: 16, offset: 8992)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !221, file: !222, line: 245, baseType: !402, size: 16, offset: 9008)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !221, file: !222, line: 246, baseType: !357, size: 128, offset: 9024)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !221, file: !222, line: 248, baseType: !83, size: 32, offset: 9152)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !221, file: !222, line: 249, baseType: !83, size: 32, offset: 9184)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !221, file: !222, line: 251, baseType: !423, size: 64, offset: 9216)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !222, line: 251, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !221, file: !222, line: 253, baseType: !75, size: 8, offset: 9280)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !221, file: !222, line: 254, baseType: !75, size: 8, offset: 9288)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !221, file: !222, line: 255, baseType: !107, size: 16, offset: 9296)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !221, file: !222, line: 256, baseType: !284, size: 96, offset: 9312)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !221, file: !222, line: 258, baseType: !116, size: 128, offset: 9408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !221, file: !222, line: 259, baseType: !116, size: 128, offset: 9536)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !221, file: !222, line: 260, baseType: !116, size: 128, offset: 9664)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !221, file: !222, line: 261, baseType: !116, size: 128, offset: 9792)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !221, file: !222, line: 263, baseType: !434, size: 64, offset: 9920)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !222, line: 52, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !221, file: !222, line: 264, baseType: !437, size: 64, offset: 9984)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !222, line: 53, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !221, file: !222, line: 265, baseType: !440, size: 64, offset: 10048)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !442, line: 51, size: 1216, elements: !443)
!442 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!443 = !{!444, !445, !446, !447}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !441, file: !442, line: 52, baseType: !170, size: 960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !441, file: !442, line: 54, baseType: !116, size: 128, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !441, file: !442, line: 59, baseType: !5, size: 32, offset: 1088)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !441, file: !442, line: 60, baseType: !284, size: 96, offset: 1120)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !221, file: !222, line: 267, baseType: !75, size: 8, offset: 10112)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !221, file: !222, line: 268, baseType: !75, size: 8, offset: 10120)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !221, file: !222, line: 269, baseType: !107, size: 16, offset: 10128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !221, file: !222, line: 270, baseType: !249, size: 32, offset: 10144)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !221, file: !222, line: 272, baseType: !453, size: 64, offset: 10176)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !222, line: 54, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !221, file: !222, line: 275, baseType: !456, size: 64, offset: 10240)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !222, line: 275, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !221, file: !222, line: 277, baseType: !459, size: 64, offset: 10304)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !222, line: 56, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !221, file: !222, line: 277, baseType: !459, size: 64, offset: 10368)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !221, file: !222, line: 278, baseType: !463, size: 64, offset: 10432)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !464, line: 27, baseType: !465)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !466, line: 45, baseType: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!467 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !221, file: !222, line: 279, baseType: !463, size: 64, offset: 10496)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !221, file: !222, line: 280, baseType: !5, size: 32, offset: 10560)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !221, file: !222, line: 281, baseType: !5, size: 32, offset: 10592)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !221, file: !222, line: 283, baseType: !116, size: 128, offset: 10624)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !221, file: !222, line: 284, baseType: !116, size: 128, offset: 10752)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !221, file: !222, line: 285, baseType: !474, size: 64, offset: 10880)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !221, file: !222, line: 287, baseType: !476, size: 64, offset: 10944)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !222, line: 59, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !221, file: !222, line: 288, baseType: !479, size: 64, offset: 11008)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !222, line: 288, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !221, file: !222, line: 290, baseType: !482, size: 64, offset: 11072)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 64, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 2)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !221, file: !222, line: 291, baseType: !486, size: 64, offset: 11136)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !488, line: 65, baseType: !489)
!488 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !488, line: 50, size: 320, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !489, file: !488, line: 51, baseType: !210, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !489, file: !488, line: 53, baseType: !83, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !489, file: !488, line: 54, baseType: !83, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !489, file: !488, line: 55, baseType: !83, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !489, file: !488, line: 55, baseType: !83, size: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !489, file: !488, line: 56, baseType: !75, size: 8, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !489, file: !488, line: 56, baseType: !75, size: 8, offset: 200)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !489, file: !488, line: 57, baseType: !75, size: 8, offset: 208)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !489, file: !488, line: 57, baseType: !75, size: 8, offset: 216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !489, file: !488, line: 59, baseType: !107, size: 16, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !489, file: !488, line: 59, baseType: !107, size: 16, offset: 240)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !489, file: !488, line: 59, baseType: !107, size: 16, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !489, file: !488, line: 61, baseType: !107, size: 16, offset: 272)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !489, file: !488, line: 63, baseType: !83, size: 32, offset: 288)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !221, file: !222, line: 293, baseType: !116, size: 128, offset: 11200)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !221, file: !222, line: 294, baseType: !507, size: 64, offset: 11328)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !222, line: 113, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !222, line: 108, size: 256, elements: !510)
!510 = !{!511, !513, !514, !515, !516}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !222, line: 109, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !509, file: !222, line: 109, baseType: !512, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !509, file: !222, line: 110, baseType: !220, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !509, file: !222, line: 111, baseType: !83, size: 32, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !509, file: !222, line: 112, baseType: !249, size: 32, offset: 224)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !211, file: !212, line: 1221, baseType: !518, size: 64, offset: 1088)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !212, line: 52, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !211, file: !212, line: 1223, baseType: !210, size: 64, offset: 1152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !211, file: !212, line: 1225, baseType: !116, size: 128, offset: 1216)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !211, file: !212, line: 1226, baseType: !523, size: 64, offset: 1344)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !212, line: 69, size: 320, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !524, file: !212, line: 70, baseType: !523, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !524, file: !212, line: 70, baseType: !523, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !524, file: !212, line: 71, baseType: !5, size: 32, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !524, file: !212, line: 71, baseType: !5, size: 32, offset: 160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !212, line: 72, baseType: !83, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !524, file: !212, line: 73, baseType: !107, size: 16, offset: 224)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !524, file: !212, line: 73, baseType: !107, size: 16, offset: 240)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !524, file: !212, line: 74, baseType: !220, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !211, file: !212, line: 1227, baseType: !220, size: 64, offset: 1408)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !211, file: !212, line: 1229, baseType: !284, size: 96, offset: 1472)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !211, file: !212, line: 1230, baseType: !284, size: 96, offset: 1568)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !211, file: !212, line: 1231, baseType: !284, size: 96, offset: 1664)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !211, file: !212, line: 1231, baseType: !284, size: 96, offset: 1760)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !211, file: !212, line: 1233, baseType: !5, size: 32, offset: 1856)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !211, file: !212, line: 1234, baseType: !83, size: 32, offset: 1888)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !211, file: !212, line: 1235, baseType: !5, size: 32, offset: 1920)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !211, file: !212, line: 1237, baseType: !107, size: 16, offset: 1952)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !211, file: !212, line: 1239, baseType: !75, size: 8, offset: 1968)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !211, file: !212, line: 1240, baseType: !545, size: 8, offset: 1976)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 1)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !211, file: !212, line: 1242, baseType: !549, size: 64, offset: 1984)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !551, line: 328, size: 3456, elements: !552)
!551 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!552 = !{!553, !554, !555, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !585, !586, !587, !590, !595, !596, !599, !603, !607, !611, !615, !616, !617, !618}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !550, file: !551, line: 329, baseType: !170, size: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !550, file: !551, line: 330, baseType: !216, size: 64, offset: 960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !550, file: !551, line: 332, baseType: !556, size: 64, offset: 1024)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !551, line: 332, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !550, file: !551, line: 333, baseType: !92, size: 512, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !550, file: !551, line: 335, baseType: !139, size: 64, offset: 1600)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !550, file: !551, line: 337, baseType: !315, size: 64, offset: 1664)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !550, file: !551, line: 338, baseType: !482, size: 64, offset: 1728)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !550, file: !551, line: 340, baseType: !116, size: 128, offset: 1792)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !550, file: !551, line: 340, baseType: !116, size: 128, offset: 1920)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !550, file: !551, line: 342, baseType: !83, size: 32, offset: 2048)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !550, file: !551, line: 342, baseType: !83, size: 32, offset: 2080)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !550, file: !551, line: 343, baseType: !83, size: 32, offset: 2112)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !550, file: !551, line: 345, baseType: !83, size: 32, offset: 2144)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !550, file: !551, line: 346, baseType: !83, size: 32, offset: 2176)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !550, file: !551, line: 347, baseType: !107, size: 16, offset: 2208)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !550, file: !551, line: 348, baseType: !107, size: 16, offset: 2224)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !550, file: !551, line: 349, baseType: !83, size: 32, offset: 2240)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !550, file: !551, line: 351, baseType: !83, size: 32, offset: 2272)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !550, file: !551, line: 353, baseType: !107, size: 16, offset: 2304)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !550, file: !551, line: 354, baseType: !107, size: 16, offset: 2320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !550, file: !551, line: 355, baseType: !83, size: 32, offset: 2336)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !550, file: !551, line: 357, baseType: !577, size: 128, offset: 2368)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !578, line: 95, baseType: !579)
!578 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !578, line: 92, size: 128, elements: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !579, file: !578, line: 93, baseType: !249, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !579, file: !578, line: 93, baseType: !249, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !579, file: !578, line: 94, baseType: !249, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !579, file: !578, line: 94, baseType: !249, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !550, file: !551, line: 363, baseType: !116, size: 128, offset: 2496)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !550, file: !551, line: 363, baseType: !116, size: 128, offset: 2624)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !550, file: !551, line: 368, baseType: !588, size: 64, offset: 2752)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !551, line: 48, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !550, file: !551, line: 372, baseType: !591, size: 32, offset: 2816)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !551, line: 274, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !551, line: 271, size: 32, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !592, file: !551, line: 273, baseType: !5, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !550, file: !551, line: 373, baseType: !83, size: 32, offset: 2848)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !550, file: !551, line: 382, baseType: !597, size: 64, offset: 2880)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !551, line: 46, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !550, file: !551, line: 385, baseType: !600, size: 64, offset: 2944)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !59, !249}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !550, file: !551, line: 386, baseType: !604, size: 64, offset: 3008)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !59, !345}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !550, file: !551, line: 387, baseType: !608, size: 64, offset: 3072)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!83, !59}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !550, file: !551, line: 388, baseType: !612, size: 64, offset: 3136)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !59}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !550, file: !551, line: 389, baseType: !59, size: 64, offset: 3200)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !550, file: !551, line: 389, baseType: !59, size: 64, offset: 3264)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !550, file: !551, line: 389, baseType: !59, size: 64, offset: 3328)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !550, file: !551, line: 389, baseType: !59, size: 64, offset: 3392)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !211, file: !212, line: 1244, baseType: !620, size: 64, offset: 2048)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !622, line: 200, size: 17024, elements: !623)
!622 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!623 = !{!624, !625, !626, !627, !1040, !1041, !1042, !1043, !1044, !1045, !1046}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !621, file: !622, line: 201, baseType: !474, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !621, file: !622, line: 202, baseType: !116, size: 128, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !621, file: !622, line: 203, baseType: !116, size: 128, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !621, file: !622, line: 206, baseType: !628, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !622, line: 190, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !622, line: 126, size: 2816, elements: !631)
!631 = !{!632, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !730, !731, !732, !733, !1011, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1039}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !630, file: !622, line: 127, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !630, file: !622, line: 127, baseType: !633, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !630, file: !622, line: 128, baseType: !59, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !630, file: !622, line: 129, baseType: !59, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !630, file: !622, line: 130, baseType: !92, size: 512, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !630, file: !622, line: 132, baseType: !83, size: 32, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !630, file: !622, line: 132, baseType: !83, size: 32, offset: 800)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !630, file: !622, line: 133, baseType: !83, size: 32, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !630, file: !622, line: 134, baseType: !83, size: 32, offset: 864)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !630, file: !622, line: 134, baseType: !83, size: 32, offset: 896)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !630, file: !622, line: 134, baseType: !83, size: 32, offset: 928)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !630, file: !622, line: 135, baseType: !83, size: 32, offset: 960)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !630, file: !622, line: 135, baseType: !83, size: 32, offset: 992)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !630, file: !622, line: 136, baseType: !83, size: 32, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !630, file: !622, line: 136, baseType: !83, size: 32, offset: 1056)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !630, file: !622, line: 137, baseType: !83, size: 32, offset: 1088)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !630, file: !622, line: 137, baseType: !83, size: 32, offset: 1120)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !630, file: !622, line: 138, baseType: !249, size: 32, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !630, file: !622, line: 139, baseType: !249, size: 32, offset: 1184)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !630, file: !622, line: 139, baseType: !249, size: 32, offset: 1216)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !630, file: !622, line: 141, baseType: !107, size: 16, offset: 1248)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !630, file: !622, line: 142, baseType: !107, size: 16, offset: 1264)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !630, file: !622, line: 143, baseType: !83, size: 32, offset: 1280)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !630, file: !622, line: 144, baseType: !83, size: 32, offset: 1312)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !630, file: !622, line: 146, baseType: !658, size: 64, offset: 1344)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !622, line: 114, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !622, line: 99, size: 7232, elements: !661)
!661 = !{!662, !664, !665, !666, !667, !668, !669, !680, !684, !698, !707, !714, !724}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !622, line: 100, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !660, file: !622, line: 100, baseType: !663, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !660, file: !622, line: 101, baseType: !83, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !660, file: !622, line: 101, baseType: !83, size: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !660, file: !622, line: 102, baseType: !83, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !660, file: !622, line: 102, baseType: !83, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !660, file: !622, line: 103, baseType: !670, size: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !622, line: 59, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !622, line: 56, size: 2112, elements: !673)
!673 = !{!674, !678, !679}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !622, line: 57, baseType: !675, size: 2048)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 2048, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !672, file: !622, line: 58, baseType: !83, size: 32, offset: 2048)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !672, file: !622, line: 58, baseType: !83, size: 32, offset: 2080)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !660, file: !622, line: 106, baseType: !681, size: 6144, offset: 320)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 6144, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !660, file: !622, line: 107, baseType: !685, size: 64, offset: 6464)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !622, line: 97, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !622, line: 83, size: 8320, elements: !688)
!688 = !{!689, !690, !691, !694, !695, !696, !697}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !687, file: !622, line: 84, baseType: !681, size: 6144)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !687, file: !622, line: 87, baseType: !675, size: 2048, offset: 6144)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !687, file: !622, line: 88, baseType: !692, size: 64, offset: 8192)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !488, line: 41, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !687, file: !622, line: 90, baseType: !107, size: 16, offset: 8256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !687, file: !622, line: 92, baseType: !107, size: 16, offset: 8272)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !687, file: !622, line: 93, baseType: !107, size: 16, offset: 8288)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !687, file: !622, line: 95, baseType: !107, size: 16, offset: 8304)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !660, file: !622, line: 108, baseType: !699, size: 64, offset: 6528)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !622, line: 66, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !622, line: 61, size: 128, elements: !702)
!702 = !{!703, !704, !705, !706}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !701, file: !622, line: 62, baseType: !83, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !701, file: !622, line: 63, baseType: !83, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !701, file: !622, line: 64, baseType: !83, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !701, file: !622, line: 65, baseType: !83, size: 32, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !660, file: !622, line: 109, baseType: !708, size: 64, offset: 6592)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !622, line: 71, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !622, line: 68, size: 64, elements: !711)
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !710, file: !622, line: 69, baseType: !83, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !710, file: !622, line: 70, baseType: !83, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !660, file: !622, line: 110, baseType: !715, size: 64, offset: 6656)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !622, line: 81, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !622, line: 73, size: 352, elements: !718)
!718 = !{!719, !720, !721, !722, !723}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !717, file: !622, line: 74, baseType: !284, size: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !717, file: !622, line: 75, baseType: !284, size: 96, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !717, file: !622, line: 76, baseType: !284, size: 96, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !717, file: !622, line: 77, baseType: !83, size: 32, offset: 288)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !717, file: !622, line: 78, baseType: !83, size: 32, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !660, file: !622, line: 113, baseType: !725, size: 512, offset: 6720)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !726, line: 182, baseType: !727)
!726 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !726, line: 180, size: 512, elements: !728)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !727, file: !726, line: 181, baseType: !92, size: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !630, file: !622, line: 148, baseType: !241, size: 64, offset: 1408)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !630, file: !622, line: 151, baseType: !210, size: 64, offset: 1472)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !630, file: !622, line: 152, baseType: !220, size: 64, offset: 1536)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !630, file: !622, line: 153, baseType: !734, size: 64, offset: 1600)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !736, line: 64, size: 19136, elements: !737)
!736 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!737 = !{!738, !739, !740, !741, !742, !743, !745, !746, !747, !748, !751, !752, !997, !998, !1006, !1007, !1008, !1009, !1010}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !735, file: !736, line: 65, baseType: !170, size: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !735, file: !736, line: 66, baseType: !216, size: 64, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !735, file: !736, line: 68, baseType: !188, size: 8192, offset: 1024)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !735, file: !736, line: 70, baseType: !83, size: 32, offset: 9216)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !735, file: !736, line: 71, baseType: !83, size: 32, offset: 9248)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !735, file: !736, line: 72, baseType: !744, size: 64, offset: 9280)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !483)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !735, file: !736, line: 74, baseType: !249, size: 32, offset: 9344)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !735, file: !736, line: 74, baseType: !249, size: 32, offset: 9376)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !735, file: !736, line: 76, baseType: !692, size: 64, offset: 9408)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !735, file: !736, line: 77, baseType: !749, size: 64, offset: 9472)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !736, line: 77, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !735, file: !736, line: 78, baseType: !315, size: 64, offset: 9536)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !735, file: !736, line: 80, baseType: !753, size: 2624, offset: 9600)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !754, line: 340, size: 2624, elements: !755)
!754 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!755 = !{!756, !784, !802, !803, !804, !819, !877, !878, !977, !978, !979, !980, !986}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !753, file: !754, line: 341, baseType: !757, size: 576)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !754, line: 251, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !754, line: 207, size: 576, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !758, file: !754, line: 208, baseType: !83, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !758, file: !754, line: 211, baseType: !107, size: 16, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !758, file: !754, line: 212, baseType: !107, size: 16, offset: 48)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !758, file: !754, line: 213, baseType: !249, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !758, file: !754, line: 214, baseType: !107, size: 16, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !758, file: !754, line: 215, baseType: !107, size: 16, offset: 112)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !758, file: !754, line: 216, baseType: !107, size: 16, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !758, file: !754, line: 217, baseType: !107, size: 16, offset: 144)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !758, file: !754, line: 218, baseType: !107, size: 16, offset: 160)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !758, file: !754, line: 219, baseType: !107, size: 16, offset: 176)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !758, file: !754, line: 220, baseType: !249, size: 32, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !758, file: !754, line: 222, baseType: !107, size: 16, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !758, file: !754, line: 225, baseType: !107, size: 16, offset: 240)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !758, file: !754, line: 228, baseType: !83, size: 32, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !758, file: !754, line: 229, baseType: !83, size: 32, offset: 288)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !758, file: !754, line: 233, baseType: !83, size: 32, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !758, file: !754, line: 236, baseType: !107, size: 16, offset: 352)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !758, file: !754, line: 236, baseType: !107, size: 16, offset: 368)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !758, file: !754, line: 241, baseType: !249, size: 32, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !758, file: !754, line: 244, baseType: !83, size: 32, offset: 416)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !758, file: !754, line: 244, baseType: !83, size: 32, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !758, file: !754, line: 245, baseType: !249, size: 32, offset: 480)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !758, file: !754, line: 248, baseType: !249, size: 32, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !758, file: !754, line: 250, baseType: !83, size: 32, offset: 544)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !753, file: !754, line: 342, baseType: !785, size: 448, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !754, line: 79, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !754, line: 61, size: 448, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !786, file: !754, line: 62, baseType: !59, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !786, file: !754, line: 64, baseType: !107, size: 16, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !786, file: !754, line: 65, baseType: !107, size: 16, offset: 80)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !786, file: !754, line: 67, baseType: !249, size: 32, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !786, file: !754, line: 68, baseType: !249, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !786, file: !754, line: 69, baseType: !249, size: 32, offset: 160)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !786, file: !754, line: 70, baseType: !107, size: 16, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !786, file: !754, line: 71, baseType: !107, size: 16, offset: 208)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !786, file: !754, line: 72, baseType: !482, size: 64, offset: 224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !786, file: !754, line: 75, baseType: !249, size: 32, offset: 288)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !786, file: !754, line: 75, baseType: !249, size: 32, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !786, file: !754, line: 75, baseType: !249, size: 32, offset: 352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !786, file: !754, line: 78, baseType: !249, size: 32, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !786, file: !754, line: 78, baseType: !249, size: 32, offset: 416)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !753, file: !754, line: 343, baseType: !116, size: 128, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !753, file: !754, line: 344, baseType: !116, size: 128, offset: 1152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !753, file: !754, line: 345, baseType: !805, size: 192, offset: 1280)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !754, line: 278, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !754, line: 270, size: 192, elements: !807)
!807 = !{!808, !809, !810, !811, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !806, file: !754, line: 271, baseType: !83, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !806, file: !754, line: 273, baseType: !249, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !806, file: !754, line: 275, baseType: !83, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !806, file: !754, line: 276, baseType: !83, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !806, file: !754, line: 277, baseType: !813, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !754, line: 55, size: 576, elements: !815)
!815 = !{!816, !817, !818}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !814, file: !754, line: 56, baseType: !83, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !814, file: !754, line: 57, baseType: !249, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !814, file: !754, line: 58, baseType: !366, size: 512, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !753, file: !754, line: 346, baseType: !820, size: 384, offset: 1472)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !754, line: 268, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !754, line: 253, size: 384, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !871, !872, !873, !874, !875, !876}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !821, file: !754, line: 254, baseType: !83, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !821, file: !754, line: 255, baseType: !83, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !821, file: !754, line: 255, baseType: !83, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !821, file: !754, line: 258, baseType: !249, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !821, file: !754, line: 259, baseType: !828, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !754, line: 164, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !754, line: 108, size: 1664, elements: !831)
!831 = !{!832, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !754, line: 109, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !830, file: !754, line: 109, baseType: !833, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !754, line: 111, baseType: !92, size: 512, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !830, file: !754, line: 119, baseType: !482, size: 64, offset: 640)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !830, file: !754, line: 119, baseType: !482, size: 64, offset: 704)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !830, file: !754, line: 125, baseType: !482, size: 64, offset: 768)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !830, file: !754, line: 125, baseType: !482, size: 64, offset: 832)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !830, file: !754, line: 127, baseType: !482, size: 64, offset: 896)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !830, file: !754, line: 130, baseType: !83, size: 32, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !830, file: !754, line: 131, baseType: !83, size: 32, offset: 992)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !830, file: !754, line: 132, baseType: !844, size: 64, offset: 1024)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !754, line: 106, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !754, line: 81, size: 512, elements: !847)
!847 = !{!848, !849, !852, !853, !854, !855}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !846, file: !754, line: 82, baseType: !482, size: 64)
