; ModuleID = 'blender/source/blender/nodes/texture/nodes/node_texture_curves.c'
source_filename = "blender/source/blender/nodes/texture/nodes/node_texture_curves.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 72, type: !36, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_tex_curve_time", scope: !3, file: !3, line: 70, type: !4, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !35)
!3 = !DIFile(filename: "blender/source/blender/nodes/texture/nodes/node_texture_curves.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !29, globals: !31, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSizePreset", file: !23, line: 273, baseType: !10, size: 32, elements: !24)
!23 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "NODE_SIZE_DEFAULT", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "NODE_SIZE_SMALL", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "NODE_SIZE_MIDDLE", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "NODE_SIZE_LARGE", value: 3, isUnsigned: true)
!29 = !{!30}
!30 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!31 = !{!0, !32, !2251, !2254, !2256}
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "ntype", scope: !34, file: !3, line: 116, type: !36, isLocal: true, isDefinition: true)
!34 = distinct !DISubprogram(name: "register_node_type_tex_curve_rgb", scope: !3, file: !3, line: 114, type: !4, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !35)
!35 = !{}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeType", file: !23, line: 221, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !23, line: 144, size: 6016, elements: !38)
!38 = !{!39, !41, !42, !44, !49, !51, !52, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !2124, !2125, !2126, !2134, !2138, !2142, !2143, !2147, !2151, !2155, !2156, !2157, !2158, !2162, !2163, !2167, !2171, !2175, !2179, !2183, !2187, !2191, !2192, !2202, !2204, !2230, !2250}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !37, file: !23, line: 145, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !37, file: !23, line: 145, baseType: !40, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !37, file: !23, line: 146, baseType: !43, size: 16, offset: 128)
!43 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !37, file: !23, line: 148, baseType: !45, size: 512, offset: 144)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 512, elements: !47)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !{!48}
!48 = !DISubrange(count: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !37, file: !23, line: 149, baseType: !50, size: 32, offset: 672)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !37, file: !23, line: 151, baseType: !45, size: 512, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !37, file: !23, line: 152, baseType: !53, size: 2048, offset: 1216)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 2048, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !37, file: !23, line: 153, baseType: !50, size: 32, offset: 3264)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !37, file: !23, line: 155, baseType: !30, size: 32, offset: 3296)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !37, file: !23, line: 155, baseType: !30, size: 32, offset: 3328)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !37, file: !23, line: 155, baseType: !30, size: 32, offset: 3360)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !37, file: !23, line: 156, baseType: !30, size: 32, offset: 3392)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !37, file: !23, line: 156, baseType: !30, size: 32, offset: 3424)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !37, file: !23, line: 156, baseType: !30, size: 32, offset: 3456)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !37, file: !23, line: 157, baseType: !43, size: 16, offset: 3488)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !37, file: !23, line: 157, baseType: !43, size: 16, offset: 3504)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !37, file: !23, line: 157, baseType: !43, size: 16, offset: 3520)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !37, file: !23, line: 160, baseType: !67, size: 64, offset: 3584)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !23, line: 109, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !23, line: 98, size: 1408, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !2123}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !23, line: 99, baseType: !50, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !69, file: !23, line: 99, baseType: !50, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !23, line: 100, baseType: !45, size: 512, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !69, file: !23, line: 101, baseType: !30, size: 32, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !69, file: !23, line: 101, baseType: !30, size: 32, offset: 608)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !69, file: !23, line: 101, baseType: !30, size: 32, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !69, file: !23, line: 101, baseType: !30, size: 32, offset: 672)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !69, file: !23, line: 102, baseType: !30, size: 32, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !69, file: !23, line: 102, baseType: !30, size: 32, offset: 736)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !69, file: !23, line: 103, baseType: !50, size: 32, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !69, file: !23, line: 104, baseType: !50, size: 32, offset: 800)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !69, file: !23, line: 107, baseType: !83, size: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !85, line: 87, size: 2816, elements: !86)
!85 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!86 = !{!87, !88, !89, !90, !120, !121, !122, !123, !124, !125, !126, !127, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !85, line: 88, baseType: !83, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !84, file: !85, line: 88, baseType: !83, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !84, file: !85, line: 88, baseType: !83, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !84, file: !85, line: 90, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !93, line: 75, baseType: !94)
!93 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !93, line: 62, size: 1024, elements: !95)
!95 = !{!96, !98, !99, !100, !101, !102, !103, !104, !118, !119}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !93, line: 63, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !94, file: !93, line: 63, baseType: !97, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !93, line: 64, baseType: !46, size: 8, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !94, file: !93, line: 64, baseType: !46, size: 8, offset: 136)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !93, line: 65, baseType: !43, size: 16, offset: 144)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !93, line: 66, baseType: !45, size: 512, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !94, file: !93, line: 67, baseType: !50, size: 32, offset: 672)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !93, line: 69, baseType: !105, size: 256, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !93, line: 60, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !93, line: 48, size: 256, elements: !107)
!107 = !{!108, !109, !116, !117}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !106, file: !93, line: 49, baseType: !40, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !106, file: !93, line: 58, baseType: !110, size: 128, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !111, line: 71, baseType: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !111, line: 69, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !112, file: !111, line: 70, baseType: !40, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !112, file: !111, line: 70, baseType: !40, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !106, file: !93, line: 59, baseType: !50, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !106, file: !93, line: 59, baseType: !50, size: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !94, file: !93, line: 70, baseType: !50, size: 32, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !94, file: !93, line: 74, baseType: !50, size: 32, offset: 992)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !84, file: !85, line: 92, baseType: !45, size: 512, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !85, line: 94, baseType: !45, size: 512, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !84, file: !85, line: 99, baseType: !40, size: 64, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !85, line: 101, baseType: !43, size: 16, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !84, file: !85, line: 101, baseType: !43, size: 16, offset: 1360)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !84, file: !85, line: 102, baseType: !43, size: 16, offset: 1376)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !84, file: !85, line: 103, baseType: !43, size: 16, offset: 1392)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !84, file: !85, line: 104, baseType: !128, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !23, line: 114, size: 1600, elements: !130)
!130 = !{!131, !132, !155, !160, !164, !168, !2083, !2087, !2088, !2092, !2093, !2094, !2095}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !129, file: !23, line: 115, baseType: !45, size: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !129, file: !23, line: 117, baseType: !133, size: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !136, !139, !141, !141, !153}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !138, line: 60, flags: DIFlagFwdDecl)
!138 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !23, line: 73, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !143, line: 55, size: 192, elements: !144)
!143 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !{!145, !149, !152}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !142, file: !143, line: 58, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !142, file: !143, line: 56, size: 64, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !143, line: 57, baseType: !40, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !143, line: 60, baseType: !150, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !85, line: 335, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !143, line: 61, baseType: !40, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !129, file: !23, line: 118, baseType: !156, size: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !136, !141, !141, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !129, file: !23, line: 120, baseType: !161, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !136, !139, !141}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !129, file: !23, line: 121, baseType: !165, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !136, !141, !159}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !129, file: !23, line: 122, baseType: !169, size: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !172, !83, !150}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !85, line: 328, size: 3456, elements: !174)
!174 = !{!175, !211, !215, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2057, !2062, !2063, !2066, !2070, !2074, !2078, !2079, !2080, !2081, !2082}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !173, file: !85, line: 329, baseType: !176, size: 960)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !93, line: 130, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !93, line: 117, size: 960, elements: !178)
!178 = !{!179, !180, !181, !183, !202, !206, !207, !208, !209, !210}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !93, line: 118, baseType: !40, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !177, file: !93, line: 118, baseType: !40, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !177, file: !93, line: 119, baseType: !182, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !177, file: !93, line: 120, baseType: !184, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !93, line: 136, size: 17600, elements: !186)
!186 = !{!187, !188, !190, !193, !197, !198, !199}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !185, file: !93, line: 137, baseType: !176, size: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !185, file: !93, line: 138, baseType: !189, size: 64, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !185, file: !93, line: 139, baseType: !191, size: 64, offset: 1024)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !93, line: 43, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !93, line: 140, baseType: !194, size: 8192, offset: 1088)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8192, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !185, file: !93, line: 141, baseType: !194, size: 8192, offset: 9280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !185, file: !93, line: 148, baseType: !184, size: 64, offset: 17472)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !185, file: !93, line: 150, baseType: !200, size: 64, offset: 17536)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !93, line: 45, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !93, line: 121, baseType: !203, size: 528, offset: 256)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 528, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 66)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !93, line: 126, baseType: !43, size: 16, offset: 784)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !177, file: !93, line: 127, baseType: !50, size: 32, offset: 800)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !177, file: !93, line: 128, baseType: !50, size: 32, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !177, file: !93, line: 128, baseType: !50, size: 32, offset: 864)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !177, file: !93, line: 129, baseType: !91, size: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !173, file: !85, line: 330, baseType: !212, size: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !214, line: 48, flags: DIFlagFwdDecl)
!214 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!215 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !173, file: !85, line: 332, baseType: !216, size: 64, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !23, line: 283, size: 4096, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !228, !296, !1960, !1966, !1972, !1976, !1977, !1978, !1979, !1998, !1999}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !23, line: 284, baseType: !50, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !217, file: !23, line: 285, baseType: !45, size: 512, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !217, file: !23, line: 287, baseType: !45, size: 512, offset: 544)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !217, file: !23, line: 288, baseType: !53, size: 2048, offset: 1056)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !217, file: !23, line: 289, baseType: !50, size: 32, offset: 3104)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !217, file: !23, line: 292, baseType: !225, size: 64, offset: 3136)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !172}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !217, file: !23, line: 293, baseType: !229, size: 64, offset: 3200)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !172, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !85, line: 167, size: 3712, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !288, !289, !290, !291, !292, !293}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !85, line: 168, baseType: !232, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !233, file: !85, line: 168, baseType: !232, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !233, file: !85, line: 168, baseType: !232, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !233, file: !85, line: 170, baseType: !91, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !233, file: !85, line: 172, baseType: !240, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !233, file: !85, line: 173, baseType: !45, size: 512, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !85, line: 175, baseType: !45, size: 512, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !85, line: 176, baseType: !50, size: 32, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !85, line: 177, baseType: !43, size: 16, offset: 1376)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !233, file: !85, line: 177, baseType: !43, size: 16, offset: 1392)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !233, file: !85, line: 178, baseType: !43, size: 16, offset: 1408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !233, file: !85, line: 178, baseType: !43, size: 16, offset: 1424)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !233, file: !85, line: 179, baseType: !43, size: 16, offset: 1440)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !233, file: !85, line: 179, baseType: !43, size: 16, offset: 1456)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !233, file: !85, line: 180, baseType: !43, size: 16, offset: 1472)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !233, file: !85, line: 181, baseType: !43, size: 16, offset: 1488)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !233, file: !85, line: 182, baseType: !253, size: 96, offset: 1504)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 96, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 3)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !233, file: !85, line: 184, baseType: !110, size: 128, offset: 1600)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !233, file: !85, line: 184, baseType: !110, size: 128, offset: 1728)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !233, file: !85, line: 185, baseType: !232, size: 64, offset: 1856)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !233, file: !85, line: 186, baseType: !182, size: 64, offset: 1920)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !233, file: !85, line: 187, baseType: !40, size: 64, offset: 1984)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !233, file: !85, line: 188, baseType: !232, size: 64, offset: 2048)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !233, file: !85, line: 189, baseType: !110, size: 128, offset: 2112)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !233, file: !85, line: 191, baseType: !30, size: 32, offset: 2240)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !233, file: !85, line: 191, baseType: !30, size: 32, offset: 2272)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !233, file: !85, line: 192, baseType: !30, size: 32, offset: 2304)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !233, file: !85, line: 192, baseType: !30, size: 32, offset: 2336)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !233, file: !85, line: 193, baseType: !30, size: 32, offset: 2368)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !233, file: !85, line: 194, baseType: !30, size: 32, offset: 2400)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !233, file: !85, line: 194, baseType: !30, size: 32, offset: 2432)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !233, file: !85, line: 196, baseType: !50, size: 32, offset: 2464)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !233, file: !85, line: 198, baseType: !45, size: 512, offset: 2496)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !233, file: !85, line: 199, baseType: !43, size: 16, offset: 3008)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !233, file: !85, line: 199, baseType: !43, size: 16, offset: 3024)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !233, file: !85, line: 200, baseType: !30, size: 32, offset: 3040)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !233, file: !85, line: 200, baseType: !30, size: 32, offset: 3072)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !233, file: !85, line: 202, baseType: !43, size: 16, offset: 3104)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !233, file: !85, line: 202, baseType: !43, size: 16, offset: 3120)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !233, file: !85, line: 203, baseType: !40, size: 64, offset: 3136)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !233, file: !85, line: 204, baseType: !280, size: 128, offset: 3200)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !281, line: 95, baseType: !282)
!281 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !281, line: 92, size: 128, elements: !283)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !282, file: !281, line: 93, baseType: !30, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !282, file: !281, line: 93, baseType: !30, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !282, file: !281, line: 94, baseType: !30, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !282, file: !281, line: 94, baseType: !30, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !233, file: !85, line: 205, baseType: !280, size: 128, offset: 3328)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !233, file: !85, line: 206, baseType: !280, size: 128, offset: 3456)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !233, file: !85, line: 215, baseType: !43, size: 16, offset: 3584)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !233, file: !85, line: 215, baseType: !43, size: 16, offset: 3600)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !233, file: !85, line: 216, baseType: !50, size: 32, offset: 3616)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !233, file: !85, line: 217, baseType: !294, size: 64, offset: 3648)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !85, line: 51, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !217, file: !23, line: 294, baseType: !297, size: 64, offset: 3264)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300, !40, !1956}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !302, line: 1216, size: 39680, elements: !303)
!302 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!303 = !{!304, !305, !306, !1262, !1343, !1344, !1345, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1372, !1584, !1587, !1830, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1852, !1853, !1854, !1855, !1856, !1864, !1930, !1937, !1938, !1945, !1948, !1949, !1950, !1951, !1952, !1953}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !301, file: !302, line: 1217, baseType: !176, size: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !301, file: !302, line: 1218, baseType: !212, size: 64, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !301, file: !302, line: 1220, baseType: !307, size: 64, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !309, line: 115, size: 11392, elements: !310)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !{!311, !312, !313, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !339, !349, !363, !364, !405, !406, !409, !410, !426, !427, !428, !429, !430, !431, !432, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1209, !1212, !1213, !1214, !1215, !1216, !1217, !1220, !1223, !1226, !1227, !1233, !1234, !1235, !1236, !1237, !1238, !1240, !1243, !1246, !1247, !1250, !1251}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !308, file: !309, line: 116, baseType: !176, size: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !308, file: !309, line: 117, baseType: !212, size: 64, offset: 960)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !308, file: !309, line: 119, baseType: !314, size: 64, offset: 1024)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !309, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !309, line: 121, baseType: !43, size: 16, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !308, file: !309, line: 121, baseType: !43, size: 16, offset: 1104)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !308, file: !309, line: 122, baseType: !50, size: 32, offset: 1120)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !308, file: !309, line: 122, baseType: !50, size: 32, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !308, file: !309, line: 122, baseType: !50, size: 32, offset: 1184)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !308, file: !309, line: 123, baseType: !45, size: 512, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !309, line: 124, baseType: !307, size: 64, offset: 1728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !308, file: !309, line: 124, baseType: !307, size: 64, offset: 1792)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !308, file: !309, line: 127, baseType: !307, size: 64, offset: 1856)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !308, file: !309, line: 127, baseType: !307, size: 64, offset: 1920)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !308, file: !309, line: 127, baseType: !307, size: 64, offset: 1984)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !308, file: !309, line: 128, baseType: !328, size: 64, offset: 2048)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !330, line: 91, size: 1280, elements: !331)
!330 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ipo_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = !{!332, !333, !334, !335, !336, !337, !338}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !329, file: !330, line: 92, baseType: !176, size: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !329, file: !330, line: 94, baseType: !110, size: 128, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !329, file: !330, line: 95, baseType: !280, size: 128, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !329, file: !330, line: 97, baseType: !43, size: 16, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "showkey", scope: !329, file: !330, line: 97, baseType: !43, size: 16, offset: 1232)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "muteipo", scope: !329, file: !330, line: 98, baseType: !43, size: 16, offset: 1248)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !329, file: !330, line: 98, baseType: !43, size: 16, offset: 1264)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !308, file: !309, line: 130, baseType: !340, size: 64, offset: 2112)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !309, line: 97, size: 832, elements: !342)
!342 = !{!343, !347, !348}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !341, file: !309, line: 98, baseType: !344, size: 768)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 768, elements: !345)
!345 = !{!346, !255}
!346 = !DISubrange(count: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !309, line: 99, baseType: !50, size: 32, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !341, file: !309, line: 99, baseType: !50, size: 32, offset: 800)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !308, file: !309, line: 131, baseType: !350, size: 64, offset: 2176)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !352, line: 486, size: 1600, elements: !353)
!352 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !362}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !351, file: !352, line: 487, baseType: !176, size: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !351, file: !352, line: 489, baseType: !110, size: 128, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !351, file: !352, line: 490, baseType: !110, size: 128, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !351, file: !352, line: 491, baseType: !110, size: 128, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !351, file: !352, line: 492, baseType: !110, size: 128, offset: 1344)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !351, file: !352, line: 494, baseType: !50, size: 32, offset: 1472)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !351, file: !352, line: 495, baseType: !50, size: 32, offset: 1504)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !351, file: !352, line: 497, baseType: !50, size: 32, offset: 1536)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !351, file: !352, line: 498, baseType: !50, size: 32, offset: 1568)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !308, file: !309, line: 132, baseType: !350, size: 64, offset: 2240)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !308, file: !309, line: 133, baseType: !365, size: 64, offset: 2304)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !352, line: 334, size: 1728, elements: !367)
!367 = !{!368, !369, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !404}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !366, file: !352, line: 335, baseType: !110, size: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !366, file: !352, line: 336, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !214, line: 51, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !366, file: !352, line: 338, baseType: !43, size: 16, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !366, file: !352, line: 338, baseType: !43, size: 16, offset: 208)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !366, file: !352, line: 339, baseType: !10, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !366, file: !352, line: 340, baseType: !50, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !366, file: !352, line: 342, baseType: !30, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !366, file: !352, line: 343, baseType: !253, size: 96, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !366, file: !352, line: 344, baseType: !253, size: 96, offset: 416)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !366, file: !352, line: 347, baseType: !110, size: 128, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !366, file: !352, line: 349, baseType: !50, size: 32, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !366, file: !352, line: 350, baseType: !50, size: 32, offset: 672)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !366, file: !352, line: 351, baseType: !40, size: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !366, file: !352, line: 352, baseType: !40, size: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !366, file: !352, line: 354, baseType: !385, size: 384, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !352, line: 116, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !352, line: 94, size: 384, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !386, file: !352, line: 96, baseType: !50, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !386, file: !352, line: 96, baseType: !50, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !386, file: !352, line: 97, baseType: !50, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !386, file: !352, line: 97, baseType: !50, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !386, file: !352, line: 99, baseType: !43, size: 16, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !386, file: !352, line: 100, baseType: !43, size: 16, offset: 144)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !386, file: !352, line: 102, baseType: !43, size: 16, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !386, file: !352, line: 105, baseType: !43, size: 16, offset: 176)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !386, file: !352, line: 108, baseType: !43, size: 16, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !386, file: !352, line: 109, baseType: !43, size: 16, offset: 208)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !386, file: !352, line: 111, baseType: !43, size: 16, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !386, file: !352, line: 112, baseType: !43, size: 16, offset: 240)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !386, file: !352, line: 114, baseType: !50, size: 32, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !386, file: !352, line: 114, baseType: !50, size: 32, offset: 288)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !386, file: !352, line: 115, baseType: !50, size: 32, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !386, file: !352, line: 115, baseType: !50, size: 32, offset: 352)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !366, file: !352, line: 355, baseType: !45, size: 512, offset: 1216)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !309, line: 134, baseType: !40, size: 64, offset: 2368)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !308, file: !309, line: 136, baseType: !407, size: 64, offset: 2432)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !302, line: 61, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !308, file: !309, line: 138, baseType: !385, size: 384, offset: 2496)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !308, file: !309, line: 139, baseType: !411, size: 64, offset: 2880)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !352, line: 80, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !352, line: 72, size: 192, elements: !414)
!414 = !{!415, !422, !423, !424, !425}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !413, file: !352, line: 73, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !352, line: 59, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !352, line: 56, size: 128, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !418, file: !352, line: 57, baseType: !253, size: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !418, file: !352, line: 58, baseType: !50, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !413, file: !352, line: 74, baseType: !50, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !413, file: !352, line: 76, baseType: !50, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !413, file: !352, line: 77, baseType: !50, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !413, file: !352, line: 79, baseType: !50, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !308, file: !309, line: 141, baseType: !110, size: 128, offset: 2944)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !308, file: !309, line: 142, baseType: !110, size: 128, offset: 3072)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !308, file: !309, line: 143, baseType: !110, size: 128, offset: 3200)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !308, file: !309, line: 144, baseType: !110, size: 128, offset: 3328)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !308, file: !309, line: 146, baseType: !50, size: 32, offset: 3456)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !308, file: !309, line: 147, baseType: !50, size: 32, offset: 3488)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !308, file: !309, line: 150, baseType: !433, size: 64, offset: 3520)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !436, line: 93, size: 7552, elements: !437)
!436 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !486, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !555, !556, !557, !558, !559, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1122}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !435, file: !436, line: 94, baseType: !176, size: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !435, file: !436, line: 95, baseType: !212, size: 64, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !435, file: !436, line: 97, baseType: !43, size: 16, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !436, line: 97, baseType: !43, size: 16, offset: 1040)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !435, file: !436, line: 99, baseType: !30, size: 32, offset: 1056)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !435, file: !436, line: 99, baseType: !30, size: 32, offset: 1088)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !435, file: !436, line: 99, baseType: !30, size: 32, offset: 1120)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !435, file: !436, line: 100, baseType: !30, size: 32, offset: 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !435, file: !436, line: 100, baseType: !30, size: 32, offset: 1184)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !435, file: !436, line: 100, baseType: !30, size: 32, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !435, file: !436, line: 101, baseType: !30, size: 32, offset: 1248)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !435, file: !436, line: 101, baseType: !30, size: 32, offset: 1280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !435, file: !436, line: 101, baseType: !30, size: 32, offset: 1312)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !435, file: !436, line: 102, baseType: !30, size: 32, offset: 1344)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !435, file: !436, line: 102, baseType: !30, size: 32, offset: 1376)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !435, file: !436, line: 102, baseType: !30, size: 32, offset: 1408)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !435, file: !436, line: 103, baseType: !30, size: 32, offset: 1440)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !435, file: !436, line: 103, baseType: !30, size: 32, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !435, file: !436, line: 103, baseType: !30, size: 32, offset: 1504)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !435, file: !436, line: 103, baseType: !30, size: 32, offset: 1536)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !435, file: !436, line: 103, baseType: !30, size: 32, offset: 1568)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !435, file: !436, line: 104, baseType: !30, size: 32, offset: 1600)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !435, file: !436, line: 104, baseType: !30, size: 32, offset: 1632)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !435, file: !436, line: 104, baseType: !30, size: 32, offset: 1664)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !435, file: !436, line: 104, baseType: !30, size: 32, offset: 1696)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !435, file: !436, line: 104, baseType: !30, size: 32, offset: 1728)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !435, file: !436, line: 105, baseType: !30, size: 32, offset: 1760)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !435, file: !436, line: 108, baseType: !466, size: 704, offset: 1792)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !436, line: 53, size: 704, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !466, file: !436, line: 54, baseType: !30, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !466, file: !436, line: 55, baseType: !30, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !466, file: !436, line: 56, baseType: !30, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !466, file: !436, line: 57, baseType: !30, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !466, file: !436, line: 59, baseType: !253, size: 96, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !466, file: !436, line: 60, baseType: !253, size: 96, offset: 224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !466, file: !436, line: 61, baseType: !253, size: 96, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !466, file: !436, line: 63, baseType: !30, size: 32, offset: 416)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !466, file: !436, line: 64, baseType: !30, size: 32, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !466, file: !436, line: 65, baseType: !30, size: 32, offset: 480)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !466, file: !436, line: 67, baseType: !43, size: 16, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !466, file: !436, line: 68, baseType: !43, size: 16, offset: 528)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !466, file: !436, line: 69, baseType: !43, size: 16, offset: 544)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !466, file: !436, line: 70, baseType: !43, size: 16, offset: 560)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !466, file: !436, line: 72, baseType: !30, size: 32, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !466, file: !436, line: 73, baseType: !30, size: 32, offset: 608)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !466, file: !436, line: 74, baseType: !30, size: 32, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !466, file: !436, line: 75, baseType: !30, size: 32, offset: 672)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !435, file: !436, line: 109, baseType: !487, size: 128, offset: 2496)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !436, line: 79, size: 128, elements: !488)
!488 = !{!489, !490, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !487, file: !436, line: 80, baseType: !50, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !487, file: !436, line: 81, baseType: !50, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !487, file: !436, line: 82, baseType: !50, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !487, file: !436, line: 83, baseType: !50, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !435, file: !436, line: 111, baseType: !30, size: 32, offset: 2624)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !435, file: !436, line: 111, baseType: !30, size: 32, offset: 2656)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !435, file: !436, line: 112, baseType: !30, size: 32, offset: 2688)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !435, file: !436, line: 112, baseType: !30, size: 32, offset: 2720)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !435, file: !436, line: 113, baseType: !30, size: 32, offset: 2752)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !435, file: !436, line: 114, baseType: !30, size: 32, offset: 2784)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !435, file: !436, line: 114, baseType: !30, size: 32, offset: 2816)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !435, file: !436, line: 115, baseType: !43, size: 16, offset: 2848)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !435, file: !436, line: 115, baseType: !43, size: 16, offset: 2864)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !435, file: !436, line: 116, baseType: !43, size: 16, offset: 2880)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !435, file: !436, line: 117, baseType: !46, size: 8, offset: 2896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !435, file: !436, line: 117, baseType: !46, size: 8, offset: 2904)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !435, file: !436, line: 119, baseType: !30, size: 32, offset: 2912)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !435, file: !436, line: 119, baseType: !30, size: 32, offset: 2944)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !435, file: !436, line: 120, baseType: !43, size: 16, offset: 2976)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !435, file: !436, line: 120, baseType: !43, size: 16, offset: 2992)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !435, file: !436, line: 121, baseType: !30, size: 32, offset: 3008)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !435, file: !436, line: 121, baseType: !30, size: 32, offset: 3040)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !435, file: !436, line: 122, baseType: !30, size: 32, offset: 3072)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !435, file: !436, line: 123, baseType: !30, size: 32, offset: 3104)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !435, file: !436, line: 124, baseType: !43, size: 16, offset: 3136)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !435, file: !436, line: 125, baseType: !43, size: 16, offset: 3152)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !435, file: !436, line: 127, baseType: !50, size: 32, offset: 3168)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !435, file: !436, line: 127, baseType: !50, size: 32, offset: 3200)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !435, file: !436, line: 128, baseType: !50, size: 32, offset: 3232)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !435, file: !436, line: 128, baseType: !50, size: 32, offset: 3264)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !435, file: !436, line: 129, baseType: !43, size: 16, offset: 3296)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !435, file: !436, line: 129, baseType: !43, size: 16, offset: 3312)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !435, file: !436, line: 129, baseType: !43, size: 16, offset: 3328)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !435, file: !436, line: 129, baseType: !43, size: 16, offset: 3344)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !435, file: !436, line: 130, baseType: !30, size: 32, offset: 3360)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !435, file: !436, line: 130, baseType: !30, size: 32, offset: 3392)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !435, file: !436, line: 130, baseType: !30, size: 32, offset: 3424)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !435, file: !436, line: 130, baseType: !30, size: 32, offset: 3456)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !435, file: !436, line: 131, baseType: !30, size: 32, offset: 3488)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !435, file: !436, line: 131, baseType: !30, size: 32, offset: 3520)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !435, file: !436, line: 131, baseType: !30, size: 32, offset: 3552)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !435, file: !436, line: 131, baseType: !30, size: 32, offset: 3584)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !435, file: !436, line: 132, baseType: !30, size: 32, offset: 3616)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !435, file: !436, line: 132, baseType: !30, size: 32, offset: 3648)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !435, file: !436, line: 133, baseType: !45, size: 512, offset: 3680)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !435, file: !436, line: 135, baseType: !30, size: 32, offset: 4192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !435, file: !436, line: 136, baseType: !30, size: 32, offset: 4224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !435, file: !436, line: 137, baseType: !30, size: 32, offset: 4256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !435, file: !436, line: 138, baseType: !50, size: 32, offset: 4288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !435, file: !436, line: 141, baseType: !46, size: 8, offset: 4320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !435, file: !436, line: 141, baseType: !46, size: 8, offset: 4328)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !435, file: !436, line: 141, baseType: !46, size: 8, offset: 4336)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !435, file: !436, line: 141, baseType: !46, size: 8, offset: 4344)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !435, file: !436, line: 142, baseType: !43, size: 16, offset: 4352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !435, file: !436, line: 142, baseType: !43, size: 16, offset: 4368)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !435, file: !436, line: 142, baseType: !43, size: 16, offset: 4384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !435, file: !436, line: 145, baseType: !46, size: 8, offset: 4400)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !435, file: !436, line: 145, baseType: !46, size: 8, offset: 4408)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !435, file: !436, line: 148, baseType: !43, size: 16, offset: 4416)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !435, file: !436, line: 148, baseType: !43, size: 16, offset: 4432)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !435, file: !436, line: 149, baseType: !30, size: 32, offset: 4448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !435, file: !436, line: 149, baseType: !30, size: 32, offset: 4480)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !435, file: !436, line: 152, baseType: !552, size: 128, offset: 4512)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 4)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !435, file: !436, line: 153, baseType: !30, size: 32, offset: 4640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !435, file: !436, line: 154, baseType: !30, size: 32, offset: 4672)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !435, file: !436, line: 157, baseType: !43, size: 16, offset: 4704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !435, file: !436, line: 157, baseType: !43, size: 16, offset: 4720)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !435, file: !436, line: 160, baseType: !560, size: 64, offset: 4736)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !562, line: 113, size: 6208, elements: !563)
!562 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = !{!564, !565, !566, !567, !568, !569, !573}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !561, file: !562, line: 114, baseType: !43, size: 16)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !561, file: !562, line: 114, baseType: !43, size: 16, offset: 16)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !561, file: !562, line: 115, baseType: !46, size: 8, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !561, file: !562, line: 115, baseType: !46, size: 8, offset: 40)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !561, file: !562, line: 116, baseType: !46, size: 8, offset: 48)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !561, file: !562, line: 117, baseType: !570, size: 8, offset: 56)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 1)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !561, file: !562, line: 119, baseType: !574, size: 6144, offset: 64)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 6144, elements: !584)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !562, line: 109, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !562, line: 106, size: 192, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !576, file: !562, line: 107, baseType: !30, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !576, file: !562, line: 107, baseType: !30, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !576, file: !562, line: 107, baseType: !30, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !576, file: !562, line: 107, baseType: !30, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !576, file: !562, line: 107, baseType: !30, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !576, file: !562, line: 108, baseType: !50, size: 32, offset: 160)
!584 = !{!585}
!585 = !DISubrange(count: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !435, file: !436, line: 161, baseType: !560, size: 64, offset: 4800)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !435, file: !436, line: 162, baseType: !46, size: 8, offset: 4864)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !435, file: !436, line: 162, baseType: !46, size: 8, offset: 4872)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !435, file: !436, line: 163, baseType: !46, size: 8, offset: 4880)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !435, file: !436, line: 163, baseType: !46, size: 8, offset: 4888)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !435, file: !436, line: 164, baseType: !43, size: 16, offset: 4896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !435, file: !436, line: 164, baseType: !43, size: 16, offset: 4912)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !435, file: !436, line: 165, baseType: !30, size: 32, offset: 4928)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !435, file: !436, line: 165, baseType: !30, size: 32, offset: 4960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !435, file: !436, line: 167, baseType: !596, size: 1152, offset: 4992)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 1152, elements: !1080)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !562, line: 57, size: 2496, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !598, file: !562, line: 59, baseType: !43, size: 16)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !598, file: !562, line: 59, baseType: !43, size: 16, offset: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !598, file: !562, line: 59, baseType: !43, size: 16, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !598, file: !562, line: 59, baseType: !43, size: 16, offset: 48)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !598, file: !562, line: 60, baseType: !307, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !598, file: !562, line: 61, baseType: !606, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !562, line: 202, size: 3328, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !678, !679, !680, !824, !825, !920, !921, !990, !1011, !1019, !1020}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !607, file: !562, line: 203, baseType: !176, size: 960)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !607, file: !562, line: 204, baseType: !212, size: 64, offset: 960)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !607, file: !562, line: 206, baseType: !30, size: 32, offset: 1024)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !607, file: !562, line: 206, baseType: !30, size: 32, offset: 1056)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !607, file: !562, line: 207, baseType: !30, size: 32, offset: 1088)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !607, file: !562, line: 207, baseType: !30, size: 32, offset: 1120)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !607, file: !562, line: 207, baseType: !30, size: 32, offset: 1152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !607, file: !562, line: 207, baseType: !30, size: 32, offset: 1184)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !607, file: !562, line: 207, baseType: !30, size: 32, offset: 1216)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !607, file: !562, line: 207, baseType: !30, size: 32, offset: 1248)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !607, file: !562, line: 208, baseType: !30, size: 32, offset: 1280)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !607, file: !562, line: 208, baseType: !30, size: 32, offset: 1312)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !607, file: !562, line: 211, baseType: !30, size: 32, offset: 1344)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !607, file: !562, line: 211, baseType: !30, size: 32, offset: 1376)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !607, file: !562, line: 211, baseType: !30, size: 32, offset: 1408)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !607, file: !562, line: 211, baseType: !30, size: 32, offset: 1440)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !607, file: !562, line: 211, baseType: !30, size: 32, offset: 1472)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !607, file: !562, line: 214, baseType: !30, size: 32, offset: 1504)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !607, file: !562, line: 214, baseType: !30, size: 32, offset: 1536)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !607, file: !562, line: 217, baseType: !30, size: 32, offset: 1568)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !607, file: !562, line: 218, baseType: !30, size: 32, offset: 1600)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !607, file: !562, line: 219, baseType: !30, size: 32, offset: 1632)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !607, file: !562, line: 220, baseType: !30, size: 32, offset: 1664)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !607, file: !562, line: 221, baseType: !30, size: 32, offset: 1696)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !607, file: !562, line: 222, baseType: !43, size: 16, offset: 1728)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !607, file: !562, line: 222, baseType: !43, size: 16, offset: 1744)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !607, file: !562, line: 224, baseType: !43, size: 16, offset: 1760)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !607, file: !562, line: 224, baseType: !43, size: 16, offset: 1776)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !607, file: !562, line: 227, baseType: !43, size: 16, offset: 1792)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !607, file: !562, line: 227, baseType: !43, size: 16, offset: 1808)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !607, file: !562, line: 229, baseType: !43, size: 16, offset: 1824)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !607, file: !562, line: 229, baseType: !43, size: 16, offset: 1840)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !607, file: !562, line: 230, baseType: !43, size: 16, offset: 1856)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !607, file: !562, line: 230, baseType: !43, size: 16, offset: 1872)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !607, file: !562, line: 232, baseType: !30, size: 32, offset: 1888)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !607, file: !562, line: 232, baseType: !30, size: 32, offset: 1920)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !607, file: !562, line: 232, baseType: !30, size: 32, offset: 1952)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !607, file: !562, line: 232, baseType: !30, size: 32, offset: 1984)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !607, file: !562, line: 233, baseType: !50, size: 32, offset: 2016)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !607, file: !562, line: 234, baseType: !50, size: 32, offset: 2048)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !607, file: !562, line: 235, baseType: !43, size: 16, offset: 2080)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !607, file: !562, line: 235, baseType: !43, size: 16, offset: 2096)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !607, file: !562, line: 236, baseType: !43, size: 16, offset: 2112)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !607, file: !562, line: 239, baseType: !43, size: 16, offset: 2128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !607, file: !562, line: 240, baseType: !50, size: 32, offset: 2144)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !607, file: !562, line: 241, baseType: !50, size: 32, offset: 2176)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !607, file: !562, line: 241, baseType: !50, size: 32, offset: 2208)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !607, file: !562, line: 241, baseType: !50, size: 32, offset: 2240)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !607, file: !562, line: 243, baseType: !30, size: 32, offset: 2272)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !607, file: !562, line: 243, baseType: !30, size: 32, offset: 2304)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !607, file: !562, line: 244, baseType: !30, size: 32, offset: 2336)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !607, file: !562, line: 246, baseType: !661, size: 320, offset: 2368)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !662, line: 50, size: 320, elements: !663)
!662 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !661, file: !662, line: 51, baseType: !300, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !661, file: !662, line: 53, baseType: !50, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !661, file: !662, line: 54, baseType: !50, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !661, file: !662, line: 55, baseType: !50, size: 32, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !661, file: !662, line: 55, baseType: !50, size: 32, offset: 160)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !661, file: !662, line: 56, baseType: !46, size: 8, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !661, file: !662, line: 56, baseType: !46, size: 8, offset: 200)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !661, file: !662, line: 57, baseType: !46, size: 8, offset: 208)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !661, file: !662, line: 57, baseType: !46, size: 8, offset: 216)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !661, file: !662, line: 59, baseType: !43, size: 16, offset: 224)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !661, file: !662, line: 59, baseType: !43, size: 16, offset: 240)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !661, file: !662, line: 59, baseType: !43, size: 16, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !661, file: !662, line: 61, baseType: !43, size: 16, offset: 272)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !661, file: !662, line: 63, baseType: !50, size: 32, offset: 288)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !607, file: !562, line: 248, baseType: !172, size: 64, offset: 2688)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !607, file: !562, line: 249, baseType: !328, size: 64, offset: 2752)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !607, file: !562, line: 250, baseType: !681, size: 64, offset: 2816)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !662, line: 77, size: 15424, elements: !683)
!683 = !{!684, !685, !686, !689, !692, !695, !759, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !778, !779, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !813, !814, !818}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !682, file: !662, line: 78, baseType: !176, size: 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !682, file: !662, line: 80, baseType: !194, size: 8192, offset: 960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !682, file: !662, line: 82, baseType: !687, size: 64, offset: 9152)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !662, line: 43, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !682, file: !662, line: 83, baseType: !690, size: 64, offset: 9216)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !93, line: 46, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !682, file: !662, line: 86, baseType: !693, size: 64, offset: 9280)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !662, line: 41, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !682, file: !662, line: 87, baseType: !696, size: 64, offset: 9344)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !698, line: 110, size: 1152, elements: !699)
!698 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!699 = !{!700, !701, !702, !703, !704, !705, !706, !708, !709, !710, !718, !719, !720, !721, !723, !754, !755, !756, !757}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !698, line: 111, baseType: !696, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !697, file: !698, line: 111, baseType: !696, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !697, file: !698, line: 114, baseType: !50, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !697, file: !698, line: 114, baseType: !50, size: 32, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !697, file: !698, line: 115, baseType: !43, size: 16, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !697, file: !698, line: 115, baseType: !43, size: 16, offset: 208)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !697, file: !698, line: 118, baseType: !707, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !697, file: !698, line: 120, baseType: !159, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !697, file: !698, line: 122, baseType: !159, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !697, file: !698, line: 125, baseType: !711, size: 128, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !281, line: 89, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !281, line: 86, size: 128, elements: !713)
!713 = !{!714, !715, !716, !717}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !712, file: !281, line: 87, baseType: !50, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !712, file: !281, line: 87, baseType: !50, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !712, file: !281, line: 88, baseType: !50, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !712, file: !281, line: 88, baseType: !50, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !697, file: !698, line: 127, baseType: !50, size: 32, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !697, file: !698, line: 127, baseType: !50, size: 32, offset: 608)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !697, file: !698, line: 130, baseType: !110, size: 128, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !697, file: !698, line: 133, baseType: !722, size: 128, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !711)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !697, file: !698, line: 134, baseType: !724, size: 64, offset: 896)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !698, line: 108, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !698, line: 85, size: 1600, elements: !728)
!728 = !{!729, !731, !732, !736, !737, !738, !739, !740, !741, !742, !743, !746, !747, !748, !749, !750, !751, !752, !753}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !727, file: !698, line: 86, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !727, file: !698, line: 86, baseType: !730, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !727, file: !698, line: 89, baseType: !733, size: 592, offset: 128)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 592, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 74)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !727, file: !698, line: 90, baseType: !10, size: 32, offset: 736)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !727, file: !698, line: 90, baseType: !10, size: 32, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !727, file: !698, line: 90, baseType: !10, size: 32, offset: 800)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !727, file: !698, line: 91, baseType: !50, size: 32, offset: 832)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !727, file: !698, line: 91, baseType: !50, size: 32, offset: 864)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !727, file: !698, line: 91, baseType: !50, size: 32, offset: 896)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !727, file: !698, line: 93, baseType: !434, size: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !727, file: !698, line: 94, baseType: !744, size: 64, offset: 1024)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !436, line: 46, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !727, file: !698, line: 96, baseType: !159, size: 64, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !727, file: !698, line: 97, baseType: !159, size: 64, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !727, file: !698, line: 98, baseType: !159, size: 64, offset: 1216)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !727, file: !698, line: 99, baseType: !707, size: 64, offset: 1280)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !727, file: !698, line: 101, baseType: !50, size: 32, offset: 1344)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !727, file: !698, line: 101, baseType: !50, size: 32, offset: 1376)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !727, file: !698, line: 104, baseType: !40, size: 64, offset: 1408)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !727, file: !698, line: 106, baseType: !110, size: 128, offset: 1472)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !697, file: !698, line: 137, baseType: !50, size: 32, offset: 960)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !697, file: !698, line: 140, baseType: !50, size: 32, offset: 992)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !697, file: !698, line: 143, baseType: !50, size: 32, offset: 1024)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !697, file: !698, line: 146, baseType: !758, size: 64, offset: 1088)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !682, file: !662, line: 89, baseType: !760, size: 512, offset: 9408)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 512, elements: !761)
!761 = !{!346}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !682, file: !662, line: 90, baseType: !43, size: 16, offset: 9920)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !682, file: !662, line: 90, baseType: !43, size: 16, offset: 9936)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !682, file: !662, line: 92, baseType: !43, size: 16, offset: 9952)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !662, line: 92, baseType: !43, size: 16, offset: 9968)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !682, file: !662, line: 93, baseType: !43, size: 16, offset: 9984)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !682, file: !662, line: 93, baseType: !43, size: 16, offset: 10000)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !682, file: !662, line: 94, baseType: !50, size: 32, offset: 10016)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !682, file: !662, line: 97, baseType: !43, size: 16, offset: 10048)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !682, file: !662, line: 97, baseType: !43, size: 16, offset: 10064)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !682, file: !662, line: 98, baseType: !43, size: 16, offset: 10080)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !682, file: !662, line: 98, baseType: !43, size: 16, offset: 10096)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !682, file: !662, line: 99, baseType: !43, size: 16, offset: 10112)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !682, file: !662, line: 99, baseType: !43, size: 16, offset: 10128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !682, file: !662, line: 100, baseType: !10, size: 32, offset: 10144)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !682, file: !662, line: 101, baseType: !777, size: 64, offset: 10176)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !682, file: !662, line: 103, baseType: !200, size: 64, offset: 10240)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !682, file: !662, line: 104, baseType: !780, size: 64, offset: 10304)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !93, line: 159, size: 448, elements: !782)
!782 = !{!783, !787, !788, !790, !791, !793}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !781, file: !93, line: 161, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 2)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !781, file: !93, line: 162, baseType: !784, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !781, file: !93, line: 163, baseType: !789, size: 32, offset: 128)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 32, elements: !785)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !781, file: !93, line: 164, baseType: !789, size: 32, offset: 160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !781, file: !93, line: 165, baseType: !792, size: 128, offset: 192)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 128, elements: !785)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !781, file: !93, line: 166, baseType: !794, size: 128, offset: 320)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 128, elements: !785)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !682, file: !662, line: 107, baseType: !30, size: 32, offset: 10368)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !682, file: !662, line: 108, baseType: !50, size: 32, offset: 10400)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !682, file: !662, line: 109, baseType: !43, size: 16, offset: 10432)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !682, file: !662, line: 110, baseType: !43, size: 16, offset: 10448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !682, file: !662, line: 113, baseType: !50, size: 32, offset: 10464)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !682, file: !662, line: 113, baseType: !50, size: 32, offset: 10496)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !682, file: !662, line: 114, baseType: !46, size: 8, offset: 10528)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !682, file: !662, line: 114, baseType: !46, size: 8, offset: 10536)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !682, file: !662, line: 115, baseType: !43, size: 16, offset: 10544)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !682, file: !662, line: 116, baseType: !552, size: 128, offset: 10560)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !682, file: !662, line: 119, baseType: !30, size: 32, offset: 10688)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !682, file: !662, line: 119, baseType: !30, size: 32, offset: 10720)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !682, file: !662, line: 122, baseType: !808, size: 512, offset: 10752)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !809, line: 182, baseType: !810)
!809 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !809, line: 180, size: 512, elements: !811)
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !810, file: !809, line: 181, baseType: !45, size: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !682, file: !662, line: 123, baseType: !46, size: 8, offset: 11264)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !682, file: !662, line: 125, baseType: !815, size: 56, offset: 11272)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 56, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 7)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !682, file: !662, line: 126, baseType: !819, size: 4096, offset: 11328)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 4096, elements: !761)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !662, line: 69, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !662, line: 67, size: 512, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !662, line: 68, baseType: !45, size: 512)
