; ModuleID = 'blender/source/blender/nodes/shader/node_shader_util.c'
source_filename = "blender/source/blender/nodes/shader/node_shader_util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !39, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/nodes/shader/node_shader_util.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !17, !30}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !4, line: 69, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !18, line: 135, baseType: !19, size: 32, elements: !20)
!18 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29}
!21 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!22 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!23 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!24 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!25 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!26 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!27 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!28 = !DIEnumerator(name: "SOCK_INT", value: 6)
!29 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketFlag", file: !18, line: 154, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38}
!32 = !DIEnumerator(name: "SOCK_HIDDEN", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "SOCK_IN_USE", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "SOCK_UNAVAIL", value: 8, isUnsigned: true)
!35 = !DIEnumerator(name: "SOCK_COLLAPSED", value: 64, isUnsigned: true)
!36 = !DIEnumerator(name: "SOCK_HIDE_VALUE", value: 128, isUnsigned: true)
!37 = !DIEnumerator(name: "SOCK_AUTO_HIDDEN__DEPRECATED", value: 256, isUnsigned: true)
!38 = !DIEnumerator(name: "SOCK_NO_INTERNAL_LINK", value: 512, isUnsigned: true)
!39 = !{!40, !51, !2261, !656}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tex", file: !42, line: 261, baseType: !43)
!42 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !42, line: 202, size: 3328, elements: !44)
!44 = !{!45, !116, !119, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !2173, !2174, !2175, !2176, !2177, !2201, !2202, !2231, !2251, !2259, !2260}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !43, file: !42, line: 203, baseType: !46, size: 960)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !47, line: 130, baseType: !48)
!47 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !47, line: 117, size: 960, elements: !49)
!49 = !{!50, !52, !53, !55, !75, !79, !81, !82, !83, !84}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !47, line: 118, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !48, file: !47, line: 118, baseType: !51, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !48, file: !47, line: 119, baseType: !54, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !48, file: !47, line: 120, baseType: !56, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !47, line: 136, size: 17600, elements: !58)
!58 = !{!59, !60, !62, !65, !70, !71, !72}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !57, file: !47, line: 137, baseType: !46, size: 960)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !57, file: !47, line: 138, baseType: !61, size: 64, offset: 960)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !57, file: !47, line: 139, baseType: !63, size: 64, offset: 1024)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !47, line: 43, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !47, line: 140, baseType: !66, size: 8192, offset: 1088)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8192, elements: !68)
!67 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !{!69}
!69 = !DISubrange(count: 1024)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !57, file: !47, line: 141, baseType: !66, size: 8192, offset: 9280)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !57, file: !47, line: 148, baseType: !56, size: 64, offset: 17472)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !57, file: !47, line: 150, baseType: !73, size: 64, offset: 17536)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !47, line: 45, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !47, line: 121, baseType: !76, size: 528, offset: 256)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 528, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 66)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !48, file: !47, line: 126, baseType: !80, size: 16, offset: 784)
!80 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !48, file: !47, line: 127, baseType: !19, size: 32, offset: 800)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !48, file: !47, line: 128, baseType: !19, size: 32, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !48, file: !47, line: 128, baseType: !19, size: 32, offset: 864)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !48, file: !47, line: 129, baseType: !85, size: 64, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !47, line: 75, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !47, line: 62, size: 1024, elements: !88)
!88 = !{!89, !91, !92, !93, !94, !95, !99, !100, !114, !115}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !47, line: 63, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !47, line: 63, baseType: !90, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !47, line: 64, baseType: !67, size: 8, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !87, file: !47, line: 64, baseType: !67, size: 8, offset: 136)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !47, line: 65, baseType: !80, size: 16, offset: 144)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !47, line: 66, baseType: !96, size: 512, offset: 160)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 512, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !87, file: !47, line: 67, baseType: !19, size: 32, offset: 672)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !47, line: 69, baseType: !101, size: 256, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !47, line: 60, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !47, line: 48, size: 256, elements: !103)
!103 = !{!104, !105, !112, !113}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !102, file: !47, line: 49, baseType: !51, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !102, file: !47, line: 58, baseType: !106, size: 128, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !107, line: 71, baseType: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !107, line: 69, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !108, file: !107, line: 70, baseType: !51, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !108, file: !107, line: 70, baseType: !51, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !102, file: !47, line: 59, baseType: !19, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !102, file: !47, line: 59, baseType: !19, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !87, file: !47, line: 70, baseType: !19, size: 32, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !87, file: !47, line: 74, baseType: !19, size: 32, offset: 992)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !43, file: !42, line: 204, baseType: !117, size: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !42, line: 45, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !43, file: !42, line: 206, baseType: !120, size: 32, offset: 1024)
!120 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !43, file: !42, line: 206, baseType: !120, size: 32, offset: 1056)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !43, file: !42, line: 207, baseType: !120, size: 32, offset: 1088)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !43, file: !42, line: 207, baseType: !120, size: 32, offset: 1120)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !43, file: !42, line: 207, baseType: !120, size: 32, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !43, file: !42, line: 207, baseType: !120, size: 32, offset: 1184)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !43, file: !42, line: 207, baseType: !120, size: 32, offset: 1216)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !43, file: !42, line: 207, baseType: !120, size: 32, offset: 1248)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !43, file: !42, line: 208, baseType: !120, size: 32, offset: 1280)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !43, file: !42, line: 208, baseType: !120, size: 32, offset: 1312)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !43, file: !42, line: 211, baseType: !120, size: 32, offset: 1344)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !43, file: !42, line: 211, baseType: !120, size: 32, offset: 1376)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !43, file: !42, line: 211, baseType: !120, size: 32, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !43, file: !42, line: 211, baseType: !120, size: 32, offset: 1440)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !43, file: !42, line: 211, baseType: !120, size: 32, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !43, file: !42, line: 214, baseType: !120, size: 32, offset: 1504)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !43, file: !42, line: 214, baseType: !120, size: 32, offset: 1536)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !43, file: !42, line: 217, baseType: !120, size: 32, offset: 1568)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !43, file: !42, line: 218, baseType: !120, size: 32, offset: 1600)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !43, file: !42, line: 219, baseType: !120, size: 32, offset: 1632)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !43, file: !42, line: 220, baseType: !120, size: 32, offset: 1664)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !43, file: !42, line: 221, baseType: !120, size: 32, offset: 1696)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !43, file: !42, line: 222, baseType: !80, size: 16, offset: 1728)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !43, file: !42, line: 222, baseType: !80, size: 16, offset: 1744)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !43, file: !42, line: 224, baseType: !80, size: 16, offset: 1760)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !43, file: !42, line: 224, baseType: !80, size: 16, offset: 1776)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !43, file: !42, line: 227, baseType: !80, size: 16, offset: 1792)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !43, file: !42, line: 227, baseType: !80, size: 16, offset: 1808)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !43, file: !42, line: 229, baseType: !80, size: 16, offset: 1824)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !43, file: !42, line: 229, baseType: !80, size: 16, offset: 1840)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !42, line: 230, baseType: !80, size: 16, offset: 1856)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !43, file: !42, line: 230, baseType: !80, size: 16, offset: 1872)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !43, file: !42, line: 232, baseType: !120, size: 32, offset: 1888)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !43, file: !42, line: 232, baseType: !120, size: 32, offset: 1920)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !43, file: !42, line: 232, baseType: !120, size: 32, offset: 1952)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !43, file: !42, line: 232, baseType: !120, size: 32, offset: 1984)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !43, file: !42, line: 233, baseType: !19, size: 32, offset: 2016)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !43, file: !42, line: 234, baseType: !19, size: 32, offset: 2048)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !43, file: !42, line: 235, baseType: !80, size: 16, offset: 2080)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !43, file: !42, line: 235, baseType: !80, size: 16, offset: 2096)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !43, file: !42, line: 236, baseType: !80, size: 16, offset: 2112)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !43, file: !42, line: 239, baseType: !80, size: 16, offset: 2128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, file: !42, line: 240, baseType: !19, size: 32, offset: 2144)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !43, file: !42, line: 241, baseType: !19, size: 32, offset: 2176)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !43, file: !42, line: 241, baseType: !19, size: 32, offset: 2208)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !43, file: !42, line: 241, baseType: !19, size: 32, offset: 2240)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !43, file: !42, line: 243, baseType: !120, size: 32, offset: 2272)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !43, file: !42, line: 243, baseType: !120, size: 32, offset: 2304)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !43, file: !42, line: 244, baseType: !120, size: 32, offset: 2336)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !43, file: !42, line: 246, baseType: !170, size: 320, offset: 2368)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !171, line: 50, size: 320, elements: !172)
!171 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!172 = !{!173, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !170, file: !171, line: 51, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !176, line: 1216, size: 39680, elements: !177)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !{!178, !179, !180, !1426, !1507, !1508, !1509, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1536, !1749, !1752, !2034, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2056, !2057, !2058, !2059, !2060, !2068, !2134, !2141, !2142, !2149, !2152, !2153, !2154, !2155, !2156, !2157}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !175, file: !176, line: 1217, baseType: !46, size: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !175, file: !176, line: 1218, baseType: !117, size: 64, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !175, file: !176, line: 1220, baseType: !181, size: 64, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !183, line: 115, size: 11392, elements: !184)
!183 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!184 = !{!185, !186, !187, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !204, !215, !229, !230, !273, !274, !277, !278, !294, !295, !296, !297, !298, !299, !300, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1374, !1377, !1378, !1379, !1380, !1381, !1382, !1385, !1388, !1391, !1392, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1407, !1410, !1411, !1414, !1415}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !182, file: !183, line: 116, baseType: !46, size: 960)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !182, file: !183, line: 117, baseType: !117, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !182, file: !183, line: 119, baseType: !188, size: 64, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !183, line: 57, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !183, line: 121, baseType: !80, size: 16, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !182, file: !183, line: 121, baseType: !80, size: 16, offset: 1104)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !182, file: !183, line: 122, baseType: !19, size: 32, offset: 1120)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !182, file: !183, line: 122, baseType: !19, size: 32, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !182, file: !183, line: 122, baseType: !19, size: 32, offset: 1184)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !182, file: !183, line: 123, baseType: !96, size: 512, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !182, file: !183, line: 124, baseType: !181, size: 64, offset: 1728)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !182, file: !183, line: 124, baseType: !181, size: 64, offset: 1792)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !182, file: !183, line: 127, baseType: !181, size: 64, offset: 1856)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !182, file: !183, line: 127, baseType: !181, size: 64, offset: 1920)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !182, file: !183, line: 127, baseType: !181, size: 64, offset: 1984)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !182, file: !183, line: 128, baseType: !202, size: 64, offset: 2048)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !42, line: 46, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !182, file: !183, line: 130, baseType: !205, size: 64, offset: 2112)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !183, line: 97, size: 832, elements: !207)
!207 = !{!208, !213, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !206, file: !183, line: 98, baseType: !209, size: 768)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 768, elements: !210)
!210 = !{!211, !212}
!211 = !DISubrange(count: 8)
!212 = !DISubrange(count: 3)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !206, file: !183, line: 99, baseType: !19, size: 32, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !206, file: !183, line: 99, baseType: !19, size: 32, offset: 800)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !182, file: !183, line: 131, baseType: !216, size: 64, offset: 2176)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !218, line: 486, size: 1600, elements: !219)
!218 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !217, file: !218, line: 487, baseType: !46, size: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !217, file: !218, line: 489, baseType: !106, size: 128, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !217, file: !218, line: 490, baseType: !106, size: 128, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !217, file: !218, line: 491, baseType: !106, size: 128, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !217, file: !218, line: 492, baseType: !106, size: 128, offset: 1344)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !217, file: !218, line: 494, baseType: !19, size: 32, offset: 1472)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !217, file: !218, line: 495, baseType: !19, size: 32, offset: 1504)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !217, file: !218, line: 497, baseType: !19, size: 32, offset: 1536)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !217, file: !218, line: 498, baseType: !19, size: 32, offset: 1568)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !182, file: !183, line: 132, baseType: !216, size: 64, offset: 2240)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !182, file: !183, line: 133, baseType: !231, size: 64, offset: 2304)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !218, line: 334, size: 1728, elements: !233)
!233 = !{!234, !235, !238, !239, !240, !241, !242, !243, !246, !247, !248, !249, !250, !251, !252, !272}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !232, file: !218, line: 335, baseType: !106, size: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !232, file: !218, line: 336, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !218, line: 47, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !232, file: !218, line: 338, baseType: !80, size: 16, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !232, file: !218, line: 338, baseType: !80, size: 16, offset: 208)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !232, file: !218, line: 339, baseType: !5, size: 32, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !232, file: !218, line: 340, baseType: !19, size: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !232, file: !218, line: 342, baseType: !120, size: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !232, file: !218, line: 343, baseType: !244, size: 96, offset: 320)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !245)
!245 = !{!212}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !232, file: !218, line: 344, baseType: !244, size: 96, offset: 416)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !232, file: !218, line: 347, baseType: !106, size: 128, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !232, file: !218, line: 349, baseType: !19, size: 32, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !232, file: !218, line: 350, baseType: !19, size: 32, offset: 672)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !232, file: !218, line: 351, baseType: !51, size: 64, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !232, file: !218, line: 352, baseType: !51, size: 64, offset: 768)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !232, file: !218, line: 354, baseType: !253, size: 384, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !218, line: 116, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !218, line: 94, size: 384, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !254, file: !218, line: 96, baseType: !19, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !254, file: !218, line: 96, baseType: !19, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !254, file: !218, line: 97, baseType: !19, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !254, file: !218, line: 97, baseType: !19, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !254, file: !218, line: 99, baseType: !80, size: 16, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !254, file: !218, line: 100, baseType: !80, size: 16, offset: 144)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !254, file: !218, line: 102, baseType: !80, size: 16, offset: 160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !254, file: !218, line: 105, baseType: !80, size: 16, offset: 176)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !254, file: !218, line: 108, baseType: !80, size: 16, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !254, file: !218, line: 109, baseType: !80, size: 16, offset: 208)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !254, file: !218, line: 111, baseType: !80, size: 16, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !254, file: !218, line: 112, baseType: !80, size: 16, offset: 240)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !254, file: !218, line: 114, baseType: !19, size: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !254, file: !218, line: 114, baseType: !19, size: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !254, file: !218, line: 115, baseType: !19, size: 32, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !254, file: !218, line: 115, baseType: !19, size: 32, offset: 352)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !232, file: !218, line: 355, baseType: !96, size: 512, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !183, line: 134, baseType: !51, size: 64, offset: 2368)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !182, file: !183, line: 136, baseType: !275, size: 64, offset: 2432)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !176, line: 61, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !182, file: !183, line: 138, baseType: !253, size: 384, offset: 2496)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !182, file: !183, line: 139, baseType: !279, size: 64, offset: 2880)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !218, line: 80, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !218, line: 72, size: 192, elements: !282)
!282 = !{!283, !290, !291, !292, !293}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !281, file: !218, line: 73, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !218, line: 59, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !218, line: 56, size: 128, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !286, file: !218, line: 57, baseType: !244, size: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !218, line: 58, baseType: !19, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !281, file: !218, line: 74, baseType: !19, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !281, file: !218, line: 76, baseType: !19, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !281, file: !218, line: 77, baseType: !19, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !281, file: !218, line: 79, baseType: !19, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !182, file: !183, line: 141, baseType: !106, size: 128, offset: 2944)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !182, file: !183, line: 142, baseType: !106, size: 128, offset: 3072)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !182, file: !183, line: 143, baseType: !106, size: 128, offset: 3200)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !182, file: !183, line: 144, baseType: !106, size: 128, offset: 3328)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !182, file: !183, line: 146, baseType: !19, size: 32, offset: 3456)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !182, file: !183, line: 147, baseType: !19, size: 32, offset: 3488)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !182, file: !183, line: 150, baseType: !301, size: 64, offset: 3520)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !304, line: 93, size: 7552, elements: !305)
!304 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !354, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !423, !424, !425, !426, !427, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !538, !1117, !1118, !1122, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1166, !1285}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !303, file: !304, line: 94, baseType: !46, size: 960)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !303, file: !304, line: 95, baseType: !117, size: 64, offset: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !303, file: !304, line: 97, baseType: !80, size: 16, offset: 1024)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !304, line: 97, baseType: !80, size: 16, offset: 1040)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !303, file: !304, line: 99, baseType: !120, size: 32, offset: 1056)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !303, file: !304, line: 99, baseType: !120, size: 32, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !303, file: !304, line: 99, baseType: !120, size: 32, offset: 1120)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !303, file: !304, line: 100, baseType: !120, size: 32, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !303, file: !304, line: 100, baseType: !120, size: 32, offset: 1184)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !303, file: !304, line: 100, baseType: !120, size: 32, offset: 1216)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !303, file: !304, line: 101, baseType: !120, size: 32, offset: 1248)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !303, file: !304, line: 101, baseType: !120, size: 32, offset: 1280)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !303, file: !304, line: 101, baseType: !120, size: 32, offset: 1312)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !303, file: !304, line: 102, baseType: !120, size: 32, offset: 1344)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !303, file: !304, line: 102, baseType: !120, size: 32, offset: 1376)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !303, file: !304, line: 102, baseType: !120, size: 32, offset: 1408)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !303, file: !304, line: 103, baseType: !120, size: 32, offset: 1440)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !303, file: !304, line: 103, baseType: !120, size: 32, offset: 1472)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !303, file: !304, line: 103, baseType: !120, size: 32, offset: 1504)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !303, file: !304, line: 103, baseType: !120, size: 32, offset: 1536)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !303, file: !304, line: 103, baseType: !120, size: 32, offset: 1568)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !303, file: !304, line: 104, baseType: !120, size: 32, offset: 1600)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !303, file: !304, line: 104, baseType: !120, size: 32, offset: 1632)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !303, file: !304, line: 104, baseType: !120, size: 32, offset: 1664)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !303, file: !304, line: 104, baseType: !120, size: 32, offset: 1696)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !303, file: !304, line: 104, baseType: !120, size: 32, offset: 1728)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !303, file: !304, line: 105, baseType: !120, size: 32, offset: 1760)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !303, file: !304, line: 108, baseType: !334, size: 704, offset: 1792)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !304, line: 53, size: 704, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !334, file: !304, line: 54, baseType: !120, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !334, file: !304, line: 55, baseType: !120, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !334, file: !304, line: 56, baseType: !120, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !334, file: !304, line: 57, baseType: !120, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !334, file: !304, line: 59, baseType: !244, size: 96, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !334, file: !304, line: 60, baseType: !244, size: 96, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !334, file: !304, line: 61, baseType: !244, size: 96, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !334, file: !304, line: 63, baseType: !120, size: 32, offset: 416)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !334, file: !304, line: 64, baseType: !120, size: 32, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !334, file: !304, line: 65, baseType: !120, size: 32, offset: 480)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !334, file: !304, line: 67, baseType: !80, size: 16, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !334, file: !304, line: 68, baseType: !80, size: 16, offset: 528)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !334, file: !304, line: 69, baseType: !80, size: 16, offset: 544)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !334, file: !304, line: 70, baseType: !80, size: 16, offset: 560)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !334, file: !304, line: 72, baseType: !120, size: 32, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !334, file: !304, line: 73, baseType: !120, size: 32, offset: 608)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !334, file: !304, line: 74, baseType: !120, size: 32, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !334, file: !304, line: 75, baseType: !120, size: 32, offset: 672)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !303, file: !304, line: 109, baseType: !355, size: 128, offset: 2496)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !304, line: 79, size: 128, elements: !356)
!356 = !{!357, !358, !359, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !355, file: !304, line: 80, baseType: !19, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !355, file: !304, line: 81, baseType: !19, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !355, file: !304, line: 82, baseType: !19, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !355, file: !304, line: 83, baseType: !19, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !303, file: !304, line: 111, baseType: !120, size: 32, offset: 2624)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !303, file: !304, line: 111, baseType: !120, size: 32, offset: 2656)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !303, file: !304, line: 112, baseType: !120, size: 32, offset: 2688)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !303, file: !304, line: 112, baseType: !120, size: 32, offset: 2720)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !303, file: !304, line: 113, baseType: !120, size: 32, offset: 2752)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !303, file: !304, line: 114, baseType: !120, size: 32, offset: 2784)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !303, file: !304, line: 114, baseType: !120, size: 32, offset: 2816)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !303, file: !304, line: 115, baseType: !80, size: 16, offset: 2848)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !303, file: !304, line: 115, baseType: !80, size: 16, offset: 2864)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !303, file: !304, line: 116, baseType: !80, size: 16, offset: 2880)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !303, file: !304, line: 117, baseType: !67, size: 8, offset: 2896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !303, file: !304, line: 117, baseType: !67, size: 8, offset: 2904)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !303, file: !304, line: 119, baseType: !120, size: 32, offset: 2912)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !303, file: !304, line: 119, baseType: !120, size: 32, offset: 2944)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !303, file: !304, line: 120, baseType: !80, size: 16, offset: 2976)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !303, file: !304, line: 120, baseType: !80, size: 16, offset: 2992)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !303, file: !304, line: 121, baseType: !120, size: 32, offset: 3008)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !303, file: !304, line: 121, baseType: !120, size: 32, offset: 3040)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !303, file: !304, line: 122, baseType: !120, size: 32, offset: 3072)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !303, file: !304, line: 123, baseType: !120, size: 32, offset: 3104)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !303, file: !304, line: 124, baseType: !80, size: 16, offset: 3136)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !303, file: !304, line: 125, baseType: !80, size: 16, offset: 3152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !303, file: !304, line: 127, baseType: !19, size: 32, offset: 3168)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !303, file: !304, line: 127, baseType: !19, size: 32, offset: 3200)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !303, file: !304, line: 128, baseType: !19, size: 32, offset: 3232)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !303, file: !304, line: 128, baseType: !19, size: 32, offset: 3264)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !303, file: !304, line: 129, baseType: !80, size: 16, offset: 3296)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !303, file: !304, line: 129, baseType: !80, size: 16, offset: 3312)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !303, file: !304, line: 129, baseType: !80, size: 16, offset: 3328)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !303, file: !304, line: 129, baseType: !80, size: 16, offset: 3344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !303, file: !304, line: 130, baseType: !120, size: 32, offset: 3360)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !303, file: !304, line: 130, baseType: !120, size: 32, offset: 3392)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !303, file: !304, line: 130, baseType: !120, size: 32, offset: 3424)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !303, file: !304, line: 130, baseType: !120, size: 32, offset: 3456)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !303, file: !304, line: 131, baseType: !120, size: 32, offset: 3488)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !303, file: !304, line: 131, baseType: !120, size: 32, offset: 3520)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !303, file: !304, line: 131, baseType: !120, size: 32, offset: 3552)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !303, file: !304, line: 131, baseType: !120, size: 32, offset: 3584)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !303, file: !304, line: 132, baseType: !120, size: 32, offset: 3616)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !303, file: !304, line: 132, baseType: !120, size: 32, offset: 3648)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !303, file: !304, line: 133, baseType: !96, size: 512, offset: 3680)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !303, file: !304, line: 135, baseType: !120, size: 32, offset: 4192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !303, file: !304, line: 136, baseType: !120, size: 32, offset: 4224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !303, file: !304, line: 137, baseType: !120, size: 32, offset: 4256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !303, file: !304, line: 138, baseType: !19, size: 32, offset: 4288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !303, file: !304, line: 141, baseType: !67, size: 8, offset: 4320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !303, file: !304, line: 141, baseType: !67, size: 8, offset: 4328)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !303, file: !304, line: 141, baseType: !67, size: 8, offset: 4336)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !303, file: !304, line: 141, baseType: !67, size: 8, offset: 4344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !303, file: !304, line: 142, baseType: !80, size: 16, offset: 4352)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !303, file: !304, line: 142, baseType: !80, size: 16, offset: 4368)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !303, file: !304, line: 142, baseType: !80, size: 16, offset: 4384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !303, file: !304, line: 145, baseType: !67, size: 8, offset: 4400)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !303, file: !304, line: 145, baseType: !67, size: 8, offset: 4408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !303, file: !304, line: 148, baseType: !80, size: 16, offset: 4416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !303, file: !304, line: 148, baseType: !80, size: 16, offset: 4432)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !303, file: !304, line: 149, baseType: !120, size: 32, offset: 4448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !303, file: !304, line: 149, baseType: !120, size: 32, offset: 4480)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !303, file: !304, line: 152, baseType: !420, size: 128, offset: 4512)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 4)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !303, file: !304, line: 153, baseType: !120, size: 32, offset: 4640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !303, file: !304, line: 154, baseType: !120, size: 32, offset: 4672)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !303, file: !304, line: 157, baseType: !80, size: 16, offset: 4704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !303, file: !304, line: 157, baseType: !80, size: 16, offset: 4720)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !303, file: !304, line: 160, baseType: !428, size: 64, offset: 4736)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !42, line: 113, size: 6208, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !440}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !429, file: !42, line: 114, baseType: !80, size: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !429, file: !42, line: 114, baseType: !80, size: 16, offset: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !429, file: !42, line: 115, baseType: !67, size: 8, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !429, file: !42, line: 115, baseType: !67, size: 8, offset: 40)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !429, file: !42, line: 116, baseType: !67, size: 8, offset: 48)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !429, file: !42, line: 117, baseType: !437, size: 8, offset: 56)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 1)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !429, file: !42, line: 119, baseType: !441, size: 6144, offset: 64)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 6144, elements: !451)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !42, line: 109, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !42, line: 106, size: 192, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !443, file: !42, line: 107, baseType: !120, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !443, file: !42, line: 107, baseType: !120, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !443, file: !42, line: 107, baseType: !120, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !443, file: !42, line: 107, baseType: !120, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !443, file: !42, line: 107, baseType: !120, size: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !443, file: !42, line: 108, baseType: !19, size: 32, offset: 160)
!451 = !{!452}
!452 = !DISubrange(count: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !303, file: !304, line: 161, baseType: !428, size: 64, offset: 4800)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !303, file: !304, line: 162, baseType: !67, size: 8, offset: 4864)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !303, file: !304, line: 162, baseType: !67, size: 8, offset: 4872)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !303, file: !304, line: 163, baseType: !67, size: 8, offset: 4880)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !303, file: !304, line: 163, baseType: !67, size: 8, offset: 4888)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !303, file: !304, line: 164, baseType: !80, size: 16, offset: 4896)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !303, file: !304, line: 164, baseType: !80, size: 16, offset: 4912)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !303, file: !304, line: 165, baseType: !120, size: 32, offset: 4928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !303, file: !304, line: 165, baseType: !120, size: 32, offset: 4960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !303, file: !304, line: 167, baseType: !463, size: 1152, offset: 4992)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 1152, elements: !536)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !42, line: 57, size: 2496, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !465, file: !42, line: 59, baseType: !80, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !465, file: !42, line: 59, baseType: !80, size: 16, offset: 16)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !465, file: !42, line: 59, baseType: !80, size: 16, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !465, file: !42, line: 59, baseType: !80, size: 16, offset: 48)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !465, file: !42, line: 60, baseType: !181, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !465, file: !42, line: 61, baseType: !473, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !465, file: !42, line: 62, baseType: !96, size: 512, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !465, file: !42, line: 64, baseType: !67, size: 8, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !465, file: !42, line: 64, baseType: !67, size: 8, offset: 712)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !465, file: !42, line: 64, baseType: !67, size: 8, offset: 720)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !465, file: !42, line: 64, baseType: !67, size: 8, offset: 728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !465, file: !42, line: 65, baseType: !244, size: 96, offset: 736)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !465, file: !42, line: 65, baseType: !244, size: 96, offset: 832)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !465, file: !42, line: 65, baseType: !120, size: 32, offset: 928)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !465, file: !42, line: 67, baseType: !80, size: 16, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !465, file: !42, line: 67, baseType: !80, size: 16, offset: 976)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !465, file: !42, line: 67, baseType: !80, size: 16, offset: 992)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !465, file: !42, line: 67, baseType: !80, size: 16, offset: 1008)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !465, file: !42, line: 68, baseType: !80, size: 16, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !465, file: !42, line: 68, baseType: !80, size: 16, offset: 1040)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !465, file: !42, line: 69, baseType: !67, size: 8, offset: 1056)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !42, line: 69, baseType: !490, size: 56, offset: 1064)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 56, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 7)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !465, file: !42, line: 70, baseType: !120, size: 32, offset: 1120)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !465, file: !42, line: 70, baseType: !120, size: 32, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !465, file: !42, line: 70, baseType: !120, size: 32, offset: 1184)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !465, file: !42, line: 70, baseType: !120, size: 32, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !465, file: !42, line: 71, baseType: !120, size: 32, offset: 1248)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !465, file: !42, line: 71, baseType: !120, size: 32, offset: 1280)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !465, file: !42, line: 74, baseType: !120, size: 32, offset: 1312)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !465, file: !42, line: 74, baseType: !120, size: 32, offset: 1344)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !465, file: !42, line: 77, baseType: !120, size: 32, offset: 1376)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !465, file: !42, line: 77, baseType: !120, size: 32, offset: 1408)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !465, file: !42, line: 77, baseType: !120, size: 32, offset: 1440)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !465, file: !42, line: 78, baseType: !120, size: 32, offset: 1472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !465, file: !42, line: 78, baseType: !120, size: 32, offset: 1504)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !465, file: !42, line: 78, baseType: !120, size: 32, offset: 1536)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !465, file: !42, line: 79, baseType: !120, size: 32, offset: 1568)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !465, file: !42, line: 79, baseType: !120, size: 32, offset: 1600)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !465, file: !42, line: 79, baseType: !120, size: 32, offset: 1632)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !465, file: !42, line: 79, baseType: !120, size: 32, offset: 1664)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !465, file: !42, line: 80, baseType: !120, size: 32, offset: 1696)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !465, file: !42, line: 80, baseType: !120, size: 32, offset: 1728)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !465, file: !42, line: 80, baseType: !120, size: 32, offset: 1760)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !465, file: !42, line: 81, baseType: !120, size: 32, offset: 1792)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !465, file: !42, line: 81, baseType: !120, size: 32, offset: 1824)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !465, file: !42, line: 81, baseType: !120, size: 32, offset: 1856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !465, file: !42, line: 82, baseType: !120, size: 32, offset: 1888)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !465, file: !42, line: 82, baseType: !120, size: 32, offset: 1920)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !465, file: !42, line: 82, baseType: !120, size: 32, offset: 1952)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !465, file: !42, line: 85, baseType: !120, size: 32, offset: 1984)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !465, file: !42, line: 85, baseType: !120, size: 32, offset: 2016)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !465, file: !42, line: 85, baseType: !120, size: 32, offset: 2048)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !465, file: !42, line: 85, baseType: !120, size: 32, offset: 2080)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !465, file: !42, line: 86, baseType: !120, size: 32, offset: 2112)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !465, file: !42, line: 86, baseType: !120, size: 32, offset: 2144)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !465, file: !42, line: 86, baseType: !120, size: 32, offset: 2176)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !465, file: !42, line: 86, baseType: !120, size: 32, offset: 2208)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !465, file: !42, line: 87, baseType: !120, size: 32, offset: 2240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !465, file: !42, line: 87, baseType: !120, size: 32, offset: 2272)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !465, file: !42, line: 87, baseType: !120, size: 32, offset: 2304)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !465, file: !42, line: 87, baseType: !120, size: 32, offset: 2336)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !465, file: !42, line: 90, baseType: !120, size: 32, offset: 2368)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !465, file: !42, line: 93, baseType: !120, size: 32, offset: 2400)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !465, file: !42, line: 93, baseType: !120, size: 32, offset: 2432)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !465, file: !42, line: 93, baseType: !120, size: 32, offset: 2464)
!536 = !{!537}
!537 = !DISubrange(count: 18)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !303, file: !304, line: 168, baseType: !539, size: 64, offset: 6144)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !18, line: 328, size: 3456, elements: !541)
!541 = !{!542, !543, !544, !1056, !1057, !1058, !1059, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1100, !1104, !1108, !1112, !1113, !1114, !1115, !1116}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !540, file: !18, line: 329, baseType: !46, size: 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !540, file: !18, line: 330, baseType: !117, size: 64, offset: 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !540, file: !18, line: 332, baseType: !545, size: 64, offset: 1024)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !547, line: 283, size: 4096, elements: !548)
!547 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!548 = !{!549, !550, !551, !552, !556, !557, !561, !1025, !1033, !1037, !1043, !1047, !1048, !1049, !1050, !1054, !1055}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !546, file: !547, line: 284, baseType: !19, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !546, file: !547, line: 285, baseType: !96, size: 512, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !546, file: !547, line: 287, baseType: !96, size: 512, offset: 544)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !546, file: !547, line: 288, baseType: !553, size: 2048, offset: 1056)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 2048, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !546, file: !547, line: 289, baseType: !19, size: 32, offset: 3104)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !546, file: !547, line: 292, baseType: !558, size: 64, offset: 3136)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !539}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !546, file: !547, line: 293, baseType: !562, size: 64, offset: 3200)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !539, !565}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !18, line: 167, size: 3712, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1017, !1018, !1019, !1020, !1021, !1022}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !566, file: !18, line: 168, baseType: !565, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !566, file: !18, line: 168, baseType: !565, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !566, file: !18, line: 168, baseType: !565, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !566, file: !18, line: 170, baseType: !85, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !566, file: !18, line: 172, baseType: !573, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !547, line: 144, size: 6016, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !756, !757, !758, !772, !776, !780, !781, !862, !867, !871, !872, !873, !874, !878, !879, !883, !887, !891, !895, !899, !903, !907, !908, !925, !927, !953, !973}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !574, file: !547, line: 145, baseType: !51, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !574, file: !547, line: 145, baseType: !51, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !574, file: !547, line: 146, baseType: !80, size: 16, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !574, file: !547, line: 148, baseType: !96, size: 512, offset: 144)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !574, file: !547, line: 149, baseType: !19, size: 32, offset: 672)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !574, file: !547, line: 151, baseType: !96, size: 512, offset: 704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !574, file: !547, line: 152, baseType: !553, size: 2048, offset: 1216)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !574, file: !547, line: 153, baseType: !19, size: 32, offset: 3264)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !574, file: !547, line: 155, baseType: !120, size: 32, offset: 3296)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !574, file: !547, line: 155, baseType: !120, size: 32, offset: 3328)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !574, file: !547, line: 155, baseType: !120, size: 32, offset: 3360)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !574, file: !547, line: 156, baseType: !120, size: 32, offset: 3392)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !574, file: !547, line: 156, baseType: !120, size: 32, offset: 3424)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !574, file: !547, line: 156, baseType: !120, size: 32, offset: 3456)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !574, file: !547, line: 157, baseType: !80, size: 16, offset: 3488)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !574, file: !547, line: 157, baseType: !80, size: 16, offset: 3504)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !574, file: !547, line: 157, baseType: !80, size: 16, offset: 3520)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !574, file: !547, line: 160, baseType: !594, size: 64, offset: 3584)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !547, line: 109, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !547, line: 98, size: 1408, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !755}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !596, file: !547, line: 99, baseType: !19, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !596, file: !547, line: 99, baseType: !19, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !547, line: 100, baseType: !96, size: 512, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !596, file: !547, line: 101, baseType: !120, size: 32, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !596, file: !547, line: 101, baseType: !120, size: 32, offset: 608)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !596, file: !547, line: 101, baseType: !120, size: 32, offset: 640)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !596, file: !547, line: 101, baseType: !120, size: 32, offset: 672)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !596, file: !547, line: 102, baseType: !120, size: 32, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !596, file: !547, line: 102, baseType: !120, size: 32, offset: 736)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !596, file: !547, line: 103, baseType: !19, size: 32, offset: 768)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !596, file: !547, line: 104, baseType: !19, size: 32, offset: 800)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !596, file: !547, line: 107, baseType: !610, size: 64, offset: 832)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !18, line: 87, size: 2816, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !737}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !18, line: 88, baseType: !610, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !611, file: !18, line: 88, baseType: !610, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !611, file: !18, line: 88, baseType: !610, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !611, file: !18, line: 90, baseType: !85, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !611, file: !18, line: 92, baseType: !96, size: 512, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !18, line: 94, baseType: !96, size: 512, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !611, file: !18, line: 99, baseType: !51, size: 64, offset: 1280)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !611, file: !18, line: 101, baseType: !80, size: 16, offset: 1344)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !611, file: !18, line: 101, baseType: !80, size: 16, offset: 1360)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !611, file: !18, line: 102, baseType: !80, size: 16, offset: 1376)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !611, file: !18, line: 103, baseType: !80, size: 16, offset: 1392)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !611, file: !18, line: 104, baseType: !625, size: 64, offset: 1408)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !547, line: 114, size: 1600, elements: !627)
!627 = !{!628, !629, !652, !657, !661, !665, !669, !673, !674, !678, !707, !708, !709}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !626, file: !547, line: 115, baseType: !96, size: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !626, file: !547, line: 117, baseType: !630, size: 64, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !633, !636, !638, !638, !650}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !635, line: 60, flags: DIFlagFwdDecl)
!635 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !547, line: 73, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !640, line: 55, size: 192, elements: !641)
!640 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!641 = !{!642, !646, !649}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !639, file: !640, line: 58, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !639, file: !640, line: 56, size: 64, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !643, file: !640, line: 57, baseType: !51, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !639, file: !640, line: 60, baseType: !647, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !18, line: 335, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !639, file: !640, line: 61, baseType: !51, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !626, file: !547, line: 118, baseType: !653, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !633, !638, !638, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !626, file: !547, line: 120, baseType: !658, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !633, !636, !638}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !626, file: !547, line: 121, baseType: !662, size: 64, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !633, !638, !656}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !626, file: !547, line: 122, baseType: !666, size: 64, offset: 768)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !539, !610, !647}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !626, file: !547, line: 123, baseType: !670, size: 64, offset: 832)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !539, !610, !565, !610, !650}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !626, file: !547, line: 124, baseType: !670, size: 64, offset: 896)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !626, file: !547, line: 125, baseType: !675, size: 64, offset: 960)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !539, !610, !565, !610}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !626, file: !547, line: 128, baseType: !679, size: 256, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !640, line: 436, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !640, line: 430, size: 256, elements: !681)
!681 = !{!682, !683, !686, !702}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !680, file: !640, line: 431, baseType: !51, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !680, file: !640, line: 432, baseType: !684, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !640, line: 417, baseType: !648)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !680, file: !640, line: 433, baseType: !687, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !640, line: 408, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!19, !633, !638, !691, !693}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !640, line: 38, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !640, line: 348, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !640, line: 337, size: 256, elements: !696)
!696 = !{!697, !698, !699, !700, !701}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !695, file: !640, line: 339, baseType: !51, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !695, file: !640, line: 342, baseType: !691, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !695, file: !640, line: 345, baseType: !19, size: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !695, file: !640, line: 347, baseType: !19, size: 32, offset: 160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !695, file: !640, line: 347, baseType: !19, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !680, file: !640, line: 434, baseType: !703, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !640, line: 409, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !51}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !626, file: !547, line: 129, baseType: !679, size: 256, offset: 1280)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !626, file: !547, line: 132, baseType: !19, size: 32, offset: 1536)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !626, file: !547, line: 132, baseType: !19, size: 32, offset: 1568)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !611, file: !18, line: 105, baseType: !96, size: 512, offset: 1472)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !611, file: !18, line: 107, baseType: !120, size: 32, offset: 1984)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !611, file: !18, line: 107, baseType: !120, size: 32, offset: 2016)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !611, file: !18, line: 109, baseType: !51, size: 64, offset: 2048)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !611, file: !18, line: 112, baseType: !80, size: 16, offset: 2112)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !611, file: !18, line: 114, baseType: !80, size: 16, offset: 2128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !611, file: !18, line: 115, baseType: !19, size: 32, offset: 2144)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !611, file: !18, line: 117, baseType: !51, size: 64, offset: 2176)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !611, file: !18, line: 122, baseType: !19, size: 32, offset: 2240)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !611, file: !18, line: 124, baseType: !19, size: 32, offset: 2272)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !611, file: !18, line: 126, baseType: !610, size: 64, offset: 2304)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !611, file: !18, line: 128, baseType: !722, size: 64, offset: 2368)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !18, line: 298, size: 448, elements: !724)
!724 = !{!725, !726, !727, !730, !731, !734, !735, !736}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !18, line: 299, baseType: !722, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !723, file: !18, line: 299, baseType: !722, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !723, file: !18, line: 301, baseType: !728, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !18, line: 218, baseType: !566)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !723, file: !18, line: 301, baseType: !728, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !723, file: !18, line: 302, baseType: !732, size: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !18, line: 132, baseType: !611)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !723, file: !18, line: 302, baseType: !732, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !723, file: !18, line: 304, baseType: !19, size: 32, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !723, file: !18, line: 305, baseType: !19, size: 32, offset: 416)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !611, file: !18, line: 131, baseType: !738, size: 384, offset: 2432)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !18, line: 73, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !18, line: 62, size: 384, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !739, file: !18, line: 63, baseType: !420, size: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !739, file: !18, line: 64, baseType: !120, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !739, file: !18, line: 64, baseType: !120, size: 32, offset: 160)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !739, file: !18, line: 65, baseType: !51, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !739, file: !18, line: 66, baseType: !80, size: 16, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !739, file: !18, line: 67, baseType: !80, size: 16, offset: 272)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !739, file: !18, line: 68, baseType: !80, size: 16, offset: 288)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !739, file: !18, line: 69, baseType: !80, size: 16, offset: 304)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !739, file: !18, line: 70, baseType: !80, size: 16, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !739, file: !18, line: 71, baseType: !80, size: 16, offset: 336)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !739, file: !18, line: 72, baseType: !752, size: 32, offset: 352)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 32, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 2)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !596, file: !547, line: 108, baseType: !96, size: 512, offset: 896)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !574, file: !547, line: 160, baseType: !594, size: 64, offset: 3648)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !574, file: !547, line: 162, baseType: !96, size: 512, offset: 3712)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !574, file: !547, line: 165, baseType: !759, size: 64, offset: 4224)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !762, !764, !766, !539, !565, !768}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !547, line: 81, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !18, line: 43, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !18, line: 274, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !18, line: 271, size: 32, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !769, file: !18, line: 273, baseType: !5, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !574, file: !547, line: 168, baseType: !773, size: 64, offset: 4288)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !762, !539, !565}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !574, file: !547, line: 171, baseType: !777, size: 64, offset: 4352)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !636, !633, !638}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !574, file: !547, line: 173, baseType: !777, size: 64, offset: 4416)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !574, file: !547, line: 176, baseType: !782, size: 64, offset: 4480)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !766, !785, !565, !19, !19}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !787, line: 70, size: 19840, elements: !788)
!787 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!788 = !{!789, !790, !791, !792, !793, !795, !796, !797, !798, !800, !801, !804, !805, !806, !807, !808, !810, !812, !813, !814, !818, !819, !820, !821, !822, !825, !826, !827, !828, !829, !832, !833, !835, !836, !837, !840, !841, !842, !845, !846, !855}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !786, file: !787, line: 71, baseType: !785, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !786, file: !787, line: 71, baseType: !785, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !786, file: !787, line: 74, baseType: !19, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !786, file: !787, line: 74, baseType: !19, size: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !786, file: !787, line: 79, baseType: !794, size: 8, offset: 192)
!794 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !786, file: !787, line: 80, baseType: !19, size: 32, offset: 224)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !786, file: !787, line: 83, baseType: !19, size: 32, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !786, file: !787, line: 84, baseType: !19, size: 32, offset: 288)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !786, file: !787, line: 87, baseType: !799, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !786, file: !787, line: 88, baseType: !656, size: 64, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !786, file: !787, line: 93, baseType: !802, size: 128, offset: 448)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 128, elements: !753)
!803 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !786, file: !787, line: 96, baseType: !19, size: 32, offset: 576)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !786, file: !787, line: 96, baseType: !19, size: 32, offset: 608)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !786, file: !787, line: 97, baseType: !19, size: 32, offset: 640)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !786, file: !787, line: 97, baseType: !19, size: 32, offset: 672)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !786, file: !787, line: 98, baseType: !809, size: 64, offset: 704)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !786, file: !787, line: 101, baseType: !811, size: 64, offset: 768)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !786, file: !787, line: 102, baseType: !656, size: 64, offset: 832)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !786, file: !787, line: 105, baseType: !120, size: 32, offset: 896)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !786, file: !787, line: 108, baseType: !815, size: 1280, offset: 960)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 1280, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 20)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !786, file: !787, line: 109, baseType: !19, size: 32, offset: 2240)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !786, file: !787, line: 109, baseType: !19, size: 32, offset: 2272)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !786, file: !787, line: 112, baseType: !19, size: 32, offset: 2304)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !786, file: !787, line: 113, baseType: !19, size: 32, offset: 2336)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !786, file: !787, line: 114, baseType: !823, size: 64, offset: 2368)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !787, line: 50, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !786, file: !787, line: 115, baseType: !51, size: 64, offset: 2432)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !786, file: !787, line: 118, baseType: !19, size: 32, offset: 2496)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !787, line: 119, baseType: !66, size: 8192, offset: 2528)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !786, file: !787, line: 120, baseType: !66, size: 8192, offset: 10720)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !786, file: !787, line: 123, baseType: !830, size: 64, offset: 18944)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !787, line: 123, flags: DIFlagFwdDecl)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !786, file: !787, line: 124, baseType: !19, size: 32, offset: 19008)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !786, file: !787, line: 127, baseType: !834, size: 64, offset: 19072)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !786, file: !787, line: 128, baseType: !5, size: 32, offset: 19136)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !786, file: !787, line: 129, baseType: !5, size: 32, offset: 19168)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !786, file: !787, line: 132, baseType: !838, size: 64, offset: 19200)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !176, line: 63, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !786, file: !787, line: 133, baseType: !838, size: 64, offset: 19264)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !786, file: !787, line: 134, baseType: !799, size: 64, offset: 19328)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !786, file: !787, line: 135, baseType: !843, size: 64, offset: 19392)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
