; ModuleID = 'blender/source/blender/editors/space_time/space_time.c'
source_filename = "blender/source/blender/editors/space_time/space_time.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!272 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Gridlines", file: !55, line: 92, baseType: !5, size: 32, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280}
!274 = !DIEnumerator(name: "V2D_HORIZONTAL_LINES", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "V2D_VERTICAL_LINES", value: 2, isUnsigned: true)
!276 = !DIEnumerator(name: "V2D_HORIZONTAL_AXIS", value: 4, isUnsigned: true)
!277 = !DIEnumerator(name: "V2D_VERTICAL_AXIS", value: 8, isUnsigned: true)
!278 = !DIEnumerator(name: "V2D_HORIZONTAL_FINELINES", value: 16, isUnsigned: true)
!279 = !DIEnumerator(name: "V2D_GRIDLINES_MAJOR", value: 15, isUnsigned: true)
!280 = !DIEnumerator(name: "V2D_GRIDLINES_ALL", value: 31, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimEditDraw_CurrentFrame", file: !282, line: 508, baseType: !5, size: 32, elements: !283)
!282 = !DIFile(filename: "blender/source/blender/editors/include/ED_anim_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!283 = !{!284, !285, !286, !287}
!284 = !DIEnumerator(name: "DRAWCFRA_PLAIN", value: 0, isUnsigned: true)
!285 = !DIEnumerator(name: "DRAWCFRA_SHOW_NUMBOX", value: 1, isUnsigned: true)
!286 = !DIEnumerator(name: "DRAWCFRA_UNIT_SECONDS", value: 2, isUnsigned: true)
!287 = !DIEnumerator(name: "DRAWCFRA_WIDE", value: 4, isUnsigned: true)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !289, line: 666, baseType: !5, size: 32, elements: !290)
!289 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298}
!291 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!292 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!294 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!295 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!296 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!297 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!298 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDopeSheet_FilterFlag", file: !300, line: 535, baseType: !5, size: 32, elements: !301)
!300 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!302 = !DIEnumerator(name: "ADS_FILTER_ONLYSEL", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "ADS_FILTER_ONLYDRIVERS", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "ADS_FILTER_ONLYNLA", value: 4, isUnsigned: true)
!305 = !DIEnumerator(name: "ADS_FILTER_SELEDIT", value: 8, isUnsigned: true)
!306 = !DIEnumerator(name: "ADS_FILTER_SUMMARY", value: 16, isUnsigned: true)
!307 = !DIEnumerator(name: "ADS_FILTER_ONLYOBGROUP", value: 32, isUnsigned: true)
!308 = !DIEnumerator(name: "ADS_FILTER_NOSHAPEKEYS", value: 64, isUnsigned: true)
!309 = !DIEnumerator(name: "ADS_FILTER_NOMESH", value: 128, isUnsigned: true)
!310 = !DIEnumerator(name: "ADS_FILTER_NOOBJ", value: 256, isUnsigned: true)
!311 = !DIEnumerator(name: "ADS_FILTER_NOLAT", value: 512, isUnsigned: true)
!312 = !DIEnumerator(name: "ADS_FILTER_NOCAM", value: 1024, isUnsigned: true)
!313 = !DIEnumerator(name: "ADS_FILTER_NOMAT", value: 2048, isUnsigned: true)
!314 = !DIEnumerator(name: "ADS_FILTER_NOLAM", value: 4096, isUnsigned: true)
!315 = !DIEnumerator(name: "ADS_FILTER_NOCUR", value: 8192, isUnsigned: true)
!316 = !DIEnumerator(name: "ADS_FILTER_NOWOR", value: 16384, isUnsigned: true)
!317 = !DIEnumerator(name: "ADS_FILTER_NOSCE", value: 32768, isUnsigned: true)
!318 = !DIEnumerator(name: "ADS_FILTER_NOPART", value: 65536, isUnsigned: true)
!319 = !DIEnumerator(name: "ADS_FILTER_NOMBA", value: 131072, isUnsigned: true)
!320 = !DIEnumerator(name: "ADS_FILTER_NOARM", value: 262144, isUnsigned: true)
!321 = !DIEnumerator(name: "ADS_FILTER_NONTREE", value: 524288, isUnsigned: true)
!322 = !DIEnumerator(name: "ADS_FILTER_NOTEX", value: 1048576, isUnsigned: true)
!323 = !DIEnumerator(name: "ADS_FILTER_NOSPK", value: 2097152, isUnsigned: true)
!324 = !DIEnumerator(name: "ADS_FILTER_NOLINESTYLE", value: 4194304, isUnsigned: true)
!325 = !DIEnumerator(name: "ADS_FILTER_NOMODIFIERS", value: 8388608, isUnsigned: true)
!326 = !DIEnumerator(name: "ADS_FILTER_NLA_NOACT", value: 33554432, isUnsigned: true)
!327 = !DIEnumerator(name: "ADS_FILTER_INCL_HIDDEN", value: 67108864, isUnsigned: true)
!328 = !DIEnumerator(name: "ADS_FILTER_BY_FCU_NAME", value: 134217728, isUnsigned: true)
!329 = !DIEnumerator(name: "ADS_FILTER_ONLY_ERRORS", value: 268435456, isUnsigned: true)
!330 = !DIEnumerator(name: "ADS_FILTER_NOOBDATA", value: 10828800, isUnsigned: true)
!331 = !{!332, !333, !355, !346, !449, !633, !2632, !2633, !2635}
!332 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !336)
!336 = !{!337, !339, !340, !348, !349, !350}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !335, file: !4, line: 86, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !335, file: !4, line: 86, baseType: !338, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !335, file: !4, line: 87, baseType: !341, size: 128, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !342, line: 71, baseType: !343)
!342 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !342, line: 69, size: 128, elements: !344)
!344 = !{!345, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !343, file: !342, line: 70, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !343, file: !342, line: 70, baseType: !346, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !335, file: !4, line: 88, baseType: !56, size: 32, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !335, file: !4, line: 89, baseType: !332, size: 32, offset: 288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !335, file: !4, line: 90, baseType: !351, size: 128, offset: 320)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 128, elements: !353)
!352 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!353 = !{!354}
!354 = !DISubrange(count: 8)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceTime", file: !4, line: 439, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceTime", file: !4, line: 427, size: 1792, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !2629, !2630, !2631}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !4, line: 428, baseType: !333, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !357, file: !4, line: 428, baseType: !333, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !357, file: !4, line: 429, baseType: !341, size: 128, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !357, file: !4, line: 430, baseType: !56, size: 32, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !357, file: !4, line: 431, baseType: !332, size: 32, offset: 288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !357, file: !4, line: 433, baseType: !365, size: 1280, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !366, line: 71, baseType: !367)
!366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !366, line: 40, size: 1280, elements: !368)
!368 = !{!369, !378, !379, !387, !388, !389, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !410, !411, !412, !415}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !367, file: !366, line: 41, baseType: !370, size: 128)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !371, line: 95, baseType: !372)
!371 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !371, line: 92, size: 128, elements: !373)
!373 = !{!374, !375, !376, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !372, file: !371, line: 93, baseType: !332, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !372, file: !371, line: 93, baseType: !332, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !372, file: !371, line: 94, baseType: !332, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !372, file: !371, line: 94, baseType: !332, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !367, file: !366, line: 41, baseType: !370, size: 128, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !367, file: !366, line: 42, baseType: !380, size: 128, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !371, line: 89, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !371, line: 86, size: 128, elements: !382)
!382 = !{!383, !384, !385, !386}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !381, file: !371, line: 87, baseType: !56, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !381, file: !371, line: 87, baseType: !56, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !381, file: !371, line: 88, baseType: !56, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !381, file: !371, line: 88, baseType: !56, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !367, file: !366, line: 42, baseType: !380, size: 128, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !367, file: !366, line: 43, baseType: !380, size: 128, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !367, file: !366, line: 45, baseType: !390, size: 64, offset: 640)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 64, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 2)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !367, file: !366, line: 45, baseType: !390, size: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !367, file: !366, line: 46, baseType: !332, size: 32, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !367, file: !366, line: 46, baseType: !332, size: 32, offset: 800)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !367, file: !366, line: 48, baseType: !352, size: 16, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !367, file: !366, line: 49, baseType: !352, size: 16, offset: 848)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !367, file: !366, line: 51, baseType: !352, size: 16, offset: 864)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !367, file: !366, line: 52, baseType: !352, size: 16, offset: 880)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !367, file: !366, line: 53, baseType: !352, size: 16, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !366, line: 55, baseType: !352, size: 16, offset: 912)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !367, file: !366, line: 56, baseType: !352, size: 16, offset: 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !367, file: !366, line: 58, baseType: !352, size: 16, offset: 944)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !367, file: !366, line: 58, baseType: !352, size: 16, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !367, file: !366, line: 59, baseType: !352, size: 16, offset: 976)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !367, file: !366, line: 59, baseType: !352, size: 16, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !367, file: !366, line: 61, baseType: !352, size: 16, offset: 1008)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !367, file: !366, line: 63, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !367, file: !366, line: 64, baseType: !56, size: 32, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !367, file: !366, line: 65, baseType: !56, size: 32, offset: 1120)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !367, file: !366, line: 68, baseType: !413, size: 64, offset: 1152)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !366, line: 68, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !367, file: !366, line: 69, baseType: !416, size: 64, offset: 1216)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !418, line: 490, size: 768, elements: !419)
!418 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!419 = !{!420, !421, !422, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !418, line: 491, baseType: !416, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !418, line: 491, baseType: !416, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !417, file: !418, line: 493, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !425, line: 169, size: 2048, elements: !426)
!425 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!426 = !{!427, !428, !429, !430, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2595, !2598, !2612, !2613, !2614, !2615, !2616, !2617, !2618, !2619}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !425, line: 170, baseType: !423, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !424, file: !425, line: 170, baseType: !423, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !424, file: !425, line: 172, baseType: !346, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !424, file: !425, line: 174, baseType: !431, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !30, line: 49, size: 1984, elements: !433)
!433 = !{!434, !497, !498, !499, !500, !501, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !432, file: !30, line: 50, baseType: !435, size: 960)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !436, line: 130, baseType: !437)
!436 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !436, line: 117, size: 960, elements: !438)
!438 = !{!439, !440, !441, !443, !463, !467, !468, !469, !470, !471}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !436, line: 118, baseType: !346, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !436, line: 118, baseType: !346, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !437, file: !436, line: 119, baseType: !442, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !437, file: !436, line: 120, baseType: !444, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !436, line: 136, size: 17600, elements: !446)
!446 = !{!447, !448, !450, !453, !458, !459, !460}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !445, file: !436, line: 137, baseType: !435, size: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !445, file: !436, line: 138, baseType: !449, size: 64, offset: 960)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !445, file: !436, line: 139, baseType: !451, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !436, line: 43, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !436, line: 140, baseType: !454, size: 8192, offset: 1088)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 8192, elements: !456)
!455 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!456 = !{!457}
!457 = !DISubrange(count: 1024)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !445, file: !436, line: 141, baseType: !454, size: 8192, offset: 9280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !445, file: !436, line: 148, baseType: !444, size: 64, offset: 17472)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !445, file: !436, line: 150, baseType: !461, size: 64, offset: 17536)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !436, line: 45, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !437, file: !436, line: 121, baseType: !464, size: 528, offset: 256)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 528, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 66)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !437, file: !436, line: 126, baseType: !352, size: 16, offset: 784)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !437, file: !436, line: 127, baseType: !56, size: 32, offset: 800)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !437, file: !436, line: 128, baseType: !56, size: 32, offset: 832)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !437, file: !436, line: 128, baseType: !56, size: 32, offset: 864)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !437, file: !436, line: 129, baseType: !472, size: 64, offset: 896)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !436, line: 75, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !436, line: 62, size: 1024, elements: !475)
!475 = !{!476, !478, !479, !480, !481, !482, !486, !487, !495, !496}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !436, line: 63, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !474, file: !436, line: 63, baseType: !477, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !474, file: !436, line: 64, baseType: !455, size: 8, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !474, file: !436, line: 64, baseType: !455, size: 8, offset: 136)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !436, line: 65, baseType: !352, size: 16, offset: 144)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !436, line: 66, baseType: !483, size: 512, offset: 160)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 512, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !474, file: !436, line: 67, baseType: !56, size: 32, offset: 672)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !436, line: 69, baseType: !488, size: 256, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !436, line: 60, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !436, line: 48, size: 256, elements: !490)
!490 = !{!491, !492, !493, !494}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !489, file: !436, line: 49, baseType: !346, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !489, file: !436, line: 58, baseType: !341, size: 128, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !489, file: !436, line: 59, baseType: !56, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !489, file: !436, line: 59, baseType: !56, size: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !474, file: !436, line: 70, baseType: !56, size: 32, offset: 960)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !474, file: !436, line: 74, baseType: !56, size: 32, offset: 992)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !432, file: !30, line: 52, baseType: !341, size: 128, offset: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !432, file: !30, line: 53, baseType: !341, size: 128, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !432, file: !30, line: 54, baseType: !341, size: 128, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !432, file: !30, line: 55, baseType: !341, size: 128, offset: 1344)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !432, file: !30, line: 57, baseType: !502, size: 64, offset: 1472)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !504, line: 1216, size: 39680, elements: !505)
!504 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!505 = !{!506, !507, !511, !1563, !1566, !1567, !1568, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1940, !2153, !2156, !2396, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2418, !2419, !2420, !2421, !2422, !2430, !2496, !2503, !2504, !2511, !2512, !2513, !2514, !2515, !2516, !2517}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !503, file: !504, line: 1217, baseType: !435, size: 960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !503, file: !504, line: 1218, baseType: !508, size: 64, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !510, line: 45, flags: DIFlagFwdDecl)
!510 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!511 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !503, file: !504, line: 1220, baseType: !512, size: 64, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !289, line: 115, size: 11392, elements: !514)
!514 = !{!515, !516, !517, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !534, !544, !557, !558, !601, !602, !605, !606, !622, !623, !624, !625, !626, !627, !628, !632, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !648, !649, !650, !651, !652, !653, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !745, !746, !747, !748, !749, !750, !751, !752, !753, !1173, !1515, !1516, !1517, !1518, !1519, !1520, !1523, !1526, !1529, !1530, !1534, !1535, !1536, !1537, !1538, !1539, !1541, !1544, !1547, !1548, !1551, !1552}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !513, file: !289, line: 116, baseType: !435, size: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !513, file: !289, line: 117, baseType: !508, size: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !513, file: !289, line: 119, baseType: !518, size: 64, offset: 1024)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !289, line: 57, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !513, file: !289, line: 121, baseType: !352, size: 16, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !513, file: !289, line: 121, baseType: !352, size: 16, offset: 1104)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !513, file: !289, line: 122, baseType: !56, size: 32, offset: 1120)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !513, file: !289, line: 122, baseType: !56, size: 32, offset: 1152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !513, file: !289, line: 122, baseType: !56, size: 32, offset: 1184)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !513, file: !289, line: 123, baseType: !483, size: 512, offset: 1216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !513, file: !289, line: 124, baseType: !512, size: 64, offset: 1728)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !513, file: !289, line: 124, baseType: !512, size: 64, offset: 1792)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !513, file: !289, line: 127, baseType: !512, size: 64, offset: 1856)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !513, file: !289, line: 127, baseType: !512, size: 64, offset: 1920)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !513, file: !289, line: 127, baseType: !512, size: 64, offset: 1984)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !513, file: !289, line: 128, baseType: !532, size: 64, offset: 2048)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !510, line: 46, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !513, file: !289, line: 130, baseType: !535, size: 64, offset: 2112)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !289, line: 97, size: 832, elements: !537)
!537 = !{!538, !542, !543}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !536, file: !289, line: 98, baseType: !539, size: 768)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 768, elements: !540)
!540 = !{!354, !541}
!541 = !DISubrange(count: 3)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !536, file: !289, line: 99, baseType: !56, size: 32, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !536, file: !289, line: 99, baseType: !56, size: 32, offset: 800)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !513, file: !289, line: 131, baseType: !545, size: 64, offset: 2176)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !300, line: 486, size: 1600, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !546, file: !300, line: 487, baseType: !435, size: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !546, file: !300, line: 489, baseType: !341, size: 128, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !546, file: !300, line: 490, baseType: !341, size: 128, offset: 1088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !546, file: !300, line: 491, baseType: !341, size: 128, offset: 1216)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !546, file: !300, line: 492, baseType: !341, size: 128, offset: 1344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !300, line: 494, baseType: !56, size: 32, offset: 1472)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !546, file: !300, line: 495, baseType: !56, size: 32, offset: 1504)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !546, file: !300, line: 497, baseType: !56, size: 32, offset: 1536)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !546, file: !300, line: 498, baseType: !56, size: 32, offset: 1568)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !513, file: !289, line: 132, baseType: !545, size: 64, offset: 2240)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !513, file: !289, line: 133, baseType: !559, size: 64, offset: 2304)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !300, line: 334, size: 1728, elements: !561)
!561 = !{!562, !563, !566, !567, !568, !569, !570, !571, !574, !575, !576, !577, !578, !579, !580, !600}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !560, file: !300, line: 335, baseType: !341, size: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !560, file: !300, line: 336, baseType: !564, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !300, line: 47, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !300, line: 338, baseType: !352, size: 16, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !560, file: !300, line: 338, baseType: !352, size: 16, offset: 208)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !560, file: !300, line: 339, baseType: !5, size: 32, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !560, file: !300, line: 340, baseType: !56, size: 32, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !560, file: !300, line: 342, baseType: !332, size: 32, offset: 288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !560, file: !300, line: 343, baseType: !572, size: 96, offset: 320)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 96, elements: !573)
!573 = !{!541}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !560, file: !300, line: 344, baseType: !572, size: 96, offset: 416)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !560, file: !300, line: 347, baseType: !341, size: 128, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !560, file: !300, line: 349, baseType: !56, size: 32, offset: 640)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !560, file: !300, line: 350, baseType: !56, size: 32, offset: 672)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !560, file: !300, line: 351, baseType: !346, size: 64, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !560, file: !300, line: 352, baseType: !346, size: 64, offset: 768)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !560, file: !300, line: 354, baseType: !581, size: 384, offset: 832)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !300, line: 116, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !300, line: 94, size: 384, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !582, file: !300, line: 96, baseType: !56, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !582, file: !300, line: 96, baseType: !56, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !582, file: !300, line: 97, baseType: !56, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !582, file: !300, line: 97, baseType: !56, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !582, file: !300, line: 99, baseType: !352, size: 16, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !582, file: !300, line: 100, baseType: !352, size: 16, offset: 144)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !582, file: !300, line: 102, baseType: !352, size: 16, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !582, file: !300, line: 105, baseType: !352, size: 16, offset: 176)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !582, file: !300, line: 108, baseType: !352, size: 16, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !582, file: !300, line: 109, baseType: !352, size: 16, offset: 208)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !582, file: !300, line: 111, baseType: !352, size: 16, offset: 224)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !582, file: !300, line: 112, baseType: !352, size: 16, offset: 240)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !582, file: !300, line: 114, baseType: !56, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !582, file: !300, line: 114, baseType: !56, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !582, file: !300, line: 115, baseType: !56, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !582, file: !300, line: 115, baseType: !56, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !560, file: !300, line: 355, baseType: !483, size: 512, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !513, file: !289, line: 134, baseType: !346, size: 64, offset: 2368)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !513, file: !289, line: 136, baseType: !603, size: 64, offset: 2432)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !289, line: 58, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !513, file: !289, line: 138, baseType: !581, size: 384, offset: 2496)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !513, file: !289, line: 139, baseType: !607, size: 64, offset: 2880)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !300, line: 80, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !300, line: 72, size: 192, elements: !610)
!610 = !{!611, !618, !619, !620, !621}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !609, file: !300, line: 73, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !300, line: 59, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !300, line: 56, size: 128, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !614, file: !300, line: 57, baseType: !572, size: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !614, file: !300, line: 58, baseType: !56, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !609, file: !300, line: 74, baseType: !56, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !609, file: !300, line: 76, baseType: !56, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !609, file: !300, line: 77, baseType: !56, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !609, file: !300, line: 79, baseType: !56, size: 32, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !513, file: !289, line: 141, baseType: !341, size: 128, offset: 2944)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !513, file: !289, line: 142, baseType: !341, size: 128, offset: 3072)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !513, file: !289, line: 143, baseType: !341, size: 128, offset: 3200)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !513, file: !289, line: 144, baseType: !341, size: 128, offset: 3328)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !513, file: !289, line: 146, baseType: !56, size: 32, offset: 3456)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !513, file: !289, line: 147, baseType: !56, size: 32, offset: 3488)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !513, file: !289, line: 150, baseType: !629, size: 64, offset: 3520)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !289, line: 50, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !513, file: !289, line: 151, baseType: !633, size: 64, offset: 3584)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !513, file: !289, line: 152, baseType: !56, size: 32, offset: 3648)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !513, file: !289, line: 153, baseType: !56, size: 32, offset: 3680)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !513, file: !289, line: 156, baseType: !572, size: 96, offset: 3712)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !513, file: !289, line: 156, baseType: !572, size: 96, offset: 3808)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !513, file: !289, line: 156, baseType: !572, size: 96, offset: 3904)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !513, file: !289, line: 157, baseType: !572, size: 96, offset: 4000)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !513, file: !289, line: 158, baseType: !572, size: 96, offset: 4096)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !513, file: !289, line: 159, baseType: !572, size: 96, offset: 4192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !513, file: !289, line: 160, baseType: !572, size: 96, offset: 4288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !513, file: !289, line: 160, baseType: !572, size: 96, offset: 4384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !513, file: !289, line: 161, baseType: !645, size: 128, offset: 4480)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 128, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 4)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !513, file: !289, line: 161, baseType: !645, size: 128, offset: 4608)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !513, file: !289, line: 162, baseType: !572, size: 96, offset: 4736)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !513, file: !289, line: 162, baseType: !572, size: 96, offset: 4832)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !513, file: !289, line: 163, baseType: !332, size: 32, offset: 4928)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !513, file: !289, line: 163, baseType: !332, size: 32, offset: 4960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !513, file: !289, line: 164, baseType: !654, size: 512, offset: 4992)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 512, elements: !655)
!655 = !{!647, !647}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !513, file: !289, line: 165, baseType: !654, size: 512, offset: 5504)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !513, file: !289, line: 166, baseType: !654, size: 512, offset: 6016)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !513, file: !289, line: 167, baseType: !654, size: 512, offset: 6528)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !513, file: !289, line: 176, baseType: !654, size: 512, offset: 7040)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !513, file: !289, line: 178, baseType: !5, size: 32, offset: 7552)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !513, file: !289, line: 180, baseType: !352, size: 16, offset: 7584)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !513, file: !289, line: 181, baseType: !352, size: 16, offset: 7600)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !513, file: !289, line: 183, baseType: !352, size: 16, offset: 7616)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !513, file: !289, line: 183, baseType: !352, size: 16, offset: 7632)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !513, file: !289, line: 184, baseType: !352, size: 16, offset: 7648)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !513, file: !289, line: 184, baseType: !352, size: 16, offset: 7664)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !513, file: !289, line: 185, baseType: !352, size: 16, offset: 7680)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !513, file: !289, line: 186, baseType: !352, size: 16, offset: 7696)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !513, file: !289, line: 187, baseType: !352, size: 16, offset: 7712)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !513, file: !289, line: 188, baseType: !455, size: 8, offset: 7728)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !513, file: !289, line: 189, baseType: !455, size: 8, offset: 7736)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !513, file: !289, line: 192, baseType: !56, size: 32, offset: 7744)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !513, file: !289, line: 192, baseType: !56, size: 32, offset: 7776)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !513, file: !289, line: 192, baseType: !56, size: 32, offset: 7808)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !513, file: !289, line: 192, baseType: !56, size: 32, offset: 7840)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !513, file: !289, line: 194, baseType: !56, size: 32, offset: 7872)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !513, file: !289, line: 202, baseType: !332, size: 32, offset: 7904)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !513, file: !289, line: 202, baseType: !332, size: 32, offset: 7936)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !513, file: !289, line: 202, baseType: !332, size: 32, offset: 7968)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !513, file: !289, line: 211, baseType: !332, size: 32, offset: 8000)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !513, file: !289, line: 212, baseType: !332, size: 32, offset: 8032)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !513, file: !289, line: 213, baseType: !332, size: 32, offset: 8064)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !513, file: !289, line: 214, baseType: !332, size: 32, offset: 8096)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !513, file: !289, line: 215, baseType: !332, size: 32, offset: 8128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !513, file: !289, line: 216, baseType: !332, size: 32, offset: 8160)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !513, file: !289, line: 219, baseType: !332, size: 32, offset: 8192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !513, file: !289, line: 220, baseType: !332, size: 32, offset: 8224)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !513, file: !289, line: 221, baseType: !332, size: 32, offset: 8256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !513, file: !289, line: 224, baseType: !690, size: 16, offset: 8288)
!690 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !513, file: !289, line: 224, baseType: !690, size: 16, offset: 8304)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !513, file: !289, line: 226, baseType: !352, size: 16, offset: 8320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !513, file: !289, line: 228, baseType: !455, size: 8, offset: 8336)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !513, file: !289, line: 229, baseType: !455, size: 8, offset: 8344)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !513, file: !289, line: 231, baseType: !352, size: 16, offset: 8352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !513, file: !289, line: 232, baseType: !455, size: 8, offset: 8368)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !513, file: !289, line: 233, baseType: !455, size: 8, offset: 8376)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !513, file: !289, line: 234, baseType: !332, size: 32, offset: 8384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !513, file: !289, line: 235, baseType: !332, size: 32, offset: 8416)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !513, file: !289, line: 237, baseType: !341, size: 128, offset: 8448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !513, file: !289, line: 238, baseType: !341, size: 128, offset: 8576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !513, file: !289, line: 239, baseType: !341, size: 128, offset: 8704)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !513, file: !289, line: 240, baseType: !341, size: 128, offset: 8832)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !513, file: !289, line: 242, baseType: !332, size: 32, offset: 8960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !513, file: !289, line: 244, baseType: !352, size: 16, offset: 8992)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !513, file: !289, line: 245, baseType: !690, size: 16, offset: 9008)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !513, file: !289, line: 246, baseType: !645, size: 128, offset: 9024)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !513, file: !289, line: 248, baseType: !56, size: 32, offset: 9152)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !513, file: !289, line: 249, baseType: !56, size: 32, offset: 9184)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !513, file: !289, line: 251, baseType: !711, size: 64, offset: 9216)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !713, line: 215, size: 960, elements: !714)
!713 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !712, file: !713, line: 216, baseType: !56, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !712, file: !713, line: 217, baseType: !332, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !712, file: !713, line: 218, baseType: !332, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !712, file: !713, line: 219, baseType: !332, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !712, file: !713, line: 221, baseType: !56, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !712, file: !713, line: 222, baseType: !56, size: 32, offset: 160)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !712, file: !713, line: 223, baseType: !56, size: 32, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !712, file: !713, line: 224, baseType: !56, size: 32, offset: 224)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !712, file: !713, line: 226, baseType: !332, size: 32, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !712, file: !713, line: 227, baseType: !332, size: 32, offset: 288)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !712, file: !713, line: 228, baseType: !332, size: 32, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !712, file: !713, line: 229, baseType: !332, size: 32, offset: 352)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !712, file: !713, line: 231, baseType: !332, size: 32, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !712, file: !713, line: 232, baseType: !332, size: 32, offset: 416)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !712, file: !713, line: 233, baseType: !332, size: 32, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !712, file: !713, line: 234, baseType: !332, size: 32, offset: 480)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !712, file: !713, line: 236, baseType: !332, size: 32, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !712, file: !713, line: 237, baseType: !332, size: 32, offset: 544)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !712, file: !713, line: 238, baseType: !332, size: 32, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !712, file: !713, line: 239, baseType: !332, size: 32, offset: 608)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !712, file: !713, line: 241, baseType: !332, size: 32, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !712, file: !713, line: 242, baseType: !332, size: 32, offset: 672)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !712, file: !713, line: 243, baseType: !332, size: 32, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !712, file: !713, line: 244, baseType: !332, size: 32, offset: 736)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !712, file: !713, line: 246, baseType: !332, size: 32, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !712, file: !713, line: 247, baseType: !332, size: 32, offset: 800)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !712, file: !713, line: 248, baseType: !56, size: 32, offset: 832)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !712, file: !713, line: 249, baseType: !56, size: 32, offset: 864)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !712, file: !713, line: 250, baseType: !332, size: 32, offset: 896)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !712, file: !713, line: 251, baseType: !332, size: 32, offset: 928)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !513, file: !289, line: 253, baseType: !455, size: 8, offset: 9280)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !513, file: !289, line: 254, baseType: !455, size: 8, offset: 9288)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !513, file: !289, line: 255, baseType: !352, size: 16, offset: 9296)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !513, file: !289, line: 256, baseType: !572, size: 96, offset: 9312)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !513, file: !289, line: 258, baseType: !341, size: 128, offset: 9408)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !513, file: !289, line: 259, baseType: !341, size: 128, offset: 9536)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !513, file: !289, line: 260, baseType: !341, size: 128, offset: 9664)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !513, file: !289, line: 261, baseType: !341, size: 128, offset: 9792)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !513, file: !289, line: 263, baseType: !754, size: 64, offset: 9920)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !713, line: 61, size: 1280, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !1167, !1170, !1171, !1172}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !755, file: !713, line: 62, baseType: !56, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !755, file: !713, line: 63, baseType: !352, size: 16, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !755, file: !713, line: 64, baseType: !352, size: 16, offset: 48)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !755, file: !713, line: 65, baseType: !352, size: 16, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !755, file: !713, line: 66, baseType: !352, size: 16, offset: 80)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !755, file: !713, line: 67, baseType: !352, size: 16, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !755, file: !713, line: 68, baseType: !352, size: 16, offset: 112)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !755, file: !713, line: 68, baseType: !352, size: 16, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !755, file: !713, line: 69, baseType: !352, size: 16, offset: 144)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !755, file: !713, line: 72, baseType: !332, size: 32, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !755, file: !713, line: 73, baseType: !332, size: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !755, file: !713, line: 74, baseType: !332, size: 32, offset: 224)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !755, file: !713, line: 77, baseType: !332, size: 32, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !755, file: !713, line: 80, baseType: !332, size: 32, offset: 288)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !755, file: !713, line: 81, baseType: !332, size: 32, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !755, file: !713, line: 82, baseType: !332, size: 32, offset: 352)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !755, file: !713, line: 83, baseType: !332, size: 32, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !755, file: !713, line: 84, baseType: !332, size: 32, offset: 416)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !755, file: !713, line: 85, baseType: !332, size: 32, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !755, file: !713, line: 88, baseType: !332, size: 32, offset: 480)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !755, file: !713, line: 89, baseType: !332, size: 32, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !755, file: !713, line: 90, baseType: !332, size: 32, offset: 544)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !755, file: !713, line: 91, baseType: !332, size: 32, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !755, file: !713, line: 92, baseType: !332, size: 32, offset: 608)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !755, file: !713, line: 93, baseType: !332, size: 32, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !755, file: !713, line: 95, baseType: !332, size: 32, offset: 672)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !755, file: !713, line: 98, baseType: !332, size: 32, offset: 704)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !755, file: !713, line: 99, baseType: !332, size: 32, offset: 736)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !755, file: !713, line: 100, baseType: !332, size: 32, offset: 768)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !755, file: !713, line: 103, baseType: !332, size: 32, offset: 800)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !755, file: !713, line: 103, baseType: !332, size: 32, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !755, file: !713, line: 104, baseType: !332, size: 32, offset: 864)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !755, file: !713, line: 104, baseType: !332, size: 32, offset: 896)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !755, file: !713, line: 104, baseType: !332, size: 32, offset: 928)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !755, file: !713, line: 104, baseType: !332, size: 32, offset: 960)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !755, file: !713, line: 107, baseType: !332, size: 32, offset: 992)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !755, file: !713, line: 108, baseType: !794, size: 64, offset: 1024)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !510, line: 202, size: 3328, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !866, !932, !933, !1013, !1039, !1067, !1068, !1136, !1157, !1165, !1166}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !795, file: !510, line: 203, baseType: !435, size: 960)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !795, file: !510, line: 204, baseType: !508, size: 64, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !795, file: !510, line: 206, baseType: !332, size: 32, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !795, file: !510, line: 206, baseType: !332, size: 32, offset: 1056)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !795, file: !510, line: 207, baseType: !332, size: 32, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !795, file: !510, line: 207, baseType: !332, size: 32, offset: 1120)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !795, file: !510, line: 207, baseType: !332, size: 32, offset: 1152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !795, file: !510, line: 207, baseType: !332, size: 32, offset: 1184)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !795, file: !510, line: 207, baseType: !332, size: 32, offset: 1216)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !795, file: !510, line: 207, baseType: !332, size: 32, offset: 1248)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !795, file: !510, line: 208, baseType: !332, size: 32, offset: 1280)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !795, file: !510, line: 208, baseType: !332, size: 32, offset: 1312)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !795, file: !510, line: 211, baseType: !332, size: 32, offset: 1344)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !795, file: !510, line: 211, baseType: !332, size: 32, offset: 1376)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !795, file: !510, line: 211, baseType: !332, size: 32, offset: 1408)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !795, file: !510, line: 211, baseType: !332, size: 32, offset: 1440)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !795, file: !510, line: 211, baseType: !332, size: 32, offset: 1472)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !795, file: !510, line: 214, baseType: !332, size: 32, offset: 1504)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !795, file: !510, line: 214, baseType: !332, size: 32, offset: 1536)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !795, file: !510, line: 217, baseType: !332, size: 32, offset: 1568)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !795, file: !510, line: 218, baseType: !332, size: 32, offset: 1600)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !795, file: !510, line: 219, baseType: !332, size: 32, offset: 1632)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !795, file: !510, line: 220, baseType: !332, size: 32, offset: 1664)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !795, file: !510, line: 221, baseType: !332, size: 32, offset: 1696)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !795, file: !510, line: 222, baseType: !352, size: 16, offset: 1728)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !795, file: !510, line: 222, baseType: !352, size: 16, offset: 1744)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !795, file: !510, line: 224, baseType: !352, size: 16, offset: 1760)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !795, file: !510, line: 224, baseType: !352, size: 16, offset: 1776)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !795, file: !510, line: 227, baseType: !352, size: 16, offset: 1792)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !795, file: !510, line: 227, baseType: !352, size: 16, offset: 1808)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !795, file: !510, line: 229, baseType: !352, size: 16, offset: 1824)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !795, file: !510, line: 229, baseType: !352, size: 16, offset: 1840)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !795, file: !510, line: 230, baseType: !352, size: 16, offset: 1856)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !795, file: !510, line: 230, baseType: !352, size: 16, offset: 1872)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !795, file: !510, line: 232, baseType: !332, size: 32, offset: 1888)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !795, file: !510, line: 232, baseType: !332, size: 32, offset: 1920)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !795, file: !510, line: 232, baseType: !332, size: 32, offset: 1952)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !795, file: !510, line: 232, baseType: !332, size: 32, offset: 1984)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !795, file: !510, line: 233, baseType: !56, size: 32, offset: 2016)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !795, file: !510, line: 234, baseType: !56, size: 32, offset: 2048)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !795, file: !510, line: 235, baseType: !352, size: 16, offset: 2080)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !795, file: !510, line: 235, baseType: !352, size: 16, offset: 2096)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !795, file: !510, line: 236, baseType: !352, size: 16, offset: 2112)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !795, file: !510, line: 239, baseType: !352, size: 16, offset: 2128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !795, file: !510, line: 240, baseType: !56, size: 32, offset: 2144)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !795, file: !510, line: 241, baseType: !56, size: 32, offset: 2176)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !795, file: !510, line: 241, baseType: !56, size: 32, offset: 2208)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !795, file: !510, line: 241, baseType: !56, size: 32, offset: 2240)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !795, file: !510, line: 243, baseType: !332, size: 32, offset: 2272)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !795, file: !510, line: 243, baseType: !332, size: 32, offset: 2304)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !795, file: !510, line: 244, baseType: !332, size: 32, offset: 2336)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !795, file: !510, line: 246, baseType: !849, size: 320, offset: 2368)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !850, line: 50, size: 320, elements: !851)
!850 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !849, file: !850, line: 51, baseType: !502, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !849, file: !850, line: 53, baseType: !56, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !849, file: !850, line: 54, baseType: !56, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !849, file: !850, line: 55, baseType: !56, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !849, file: !850, line: 55, baseType: !56, size: 32, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !849, file: !850, line: 56, baseType: !455, size: 8, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !849, file: !850, line: 56, baseType: !455, size: 8, offset: 200)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !849, file: !850, line: 57, baseType: !455, size: 8, offset: 208)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !849, file: !850, line: 57, baseType: !455, size: 8, offset: 216)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !849, file: !850, line: 59, baseType: !352, size: 16, offset: 224)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !849, file: !850, line: 59, baseType: !352, size: 16, offset: 240)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !849, file: !850, line: 59, baseType: !352, size: 16, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !849, file: !850, line: 61, baseType: !352, size: 16, offset: 272)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !849, file: !850, line: 63, baseType: !56, size: 32, offset: 288)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !795, file: !510, line: 248, baseType: !867, size: 64, offset: 2688)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !869, line: 328, size: 3456, elements: !870)
!869 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!870 = !{!871, !872, !873, !876, !877, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !903, !908, !909, !912, !916, !920, !924, !928, !929, !930, !931}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !868, file: !869, line: 329, baseType: !435, size: 960)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !868, file: !869, line: 330, baseType: !508, size: 64, offset: 960)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !868, file: !869, line: 332, baseType: !874, size: 64, offset: 1024)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !869, line: 332, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !868, file: !869, line: 333, baseType: !483, size: 512, offset: 1088)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !868, file: !869, line: 335, baseType: !878, size: 64, offset: 1600)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !880, line: 41, flags: DIFlagFwdDecl)
!880 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !868, file: !869, line: 337, baseType: !603, size: 64, offset: 1664)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !868, file: !869, line: 338, baseType: !390, size: 64, offset: 1728)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !868, file: !869, line: 340, baseType: !341, size: 128, offset: 1792)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !868, file: !869, line: 340, baseType: !341, size: 128, offset: 1920)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !868, file: !869, line: 342, baseType: !56, size: 32, offset: 2048)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !868, file: !869, line: 342, baseType: !56, size: 32, offset: 2080)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !868, file: !869, line: 343, baseType: !56, size: 32, offset: 2112)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !868, file: !869, line: 345, baseType: !56, size: 32, offset: 2144)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !868, file: !869, line: 346, baseType: !56, size: 32, offset: 2176)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !868, file: !869, line: 347, baseType: !352, size: 16, offset: 2208)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !868, file: !869, line: 348, baseType: !352, size: 16, offset: 2224)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !868, file: !869, line: 349, baseType: !56, size: 32, offset: 2240)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !868, file: !869, line: 351, baseType: !56, size: 32, offset: 2272)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !868, file: !869, line: 353, baseType: !352, size: 16, offset: 2304)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !868, file: !869, line: 354, baseType: !352, size: 16, offset: 2320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !868, file: !869, line: 355, baseType: !56, size: 32, offset: 2336)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !868, file: !869, line: 357, baseType: !370, size: 128, offset: 2368)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !868, file: !869, line: 363, baseType: !341, size: 128, offset: 2496)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !868, file: !869, line: 363, baseType: !341, size: 128, offset: 2624)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !868, file: !869, line: 368, baseType: !901, size: 64, offset: 2752)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !869, line: 48, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !868, file: !869, line: 372, baseType: !904, size: 32, offset: 2816)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !869, line: 274, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !869, line: 271, size: 32, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !905, file: !869, line: 273, baseType: !5, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !868, file: !869, line: 373, baseType: !56, size: 32, offset: 2848)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !868, file: !869, line: 382, baseType: !910, size: 64, offset: 2880)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !869, line: 46, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !868, file: !869, line: 385, baseType: !913, size: 64, offset: 2944)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !346, !332}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !868, file: !869, line: 386, baseType: !917, size: 64, offset: 3008)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !346, !633}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !868, file: !869, line: 387, baseType: !921, size: 64, offset: 3072)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!56, !346}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !868, file: !869, line: 388, baseType: !925, size: 64, offset: 3136)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !346}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !868, file: !869, line: 389, baseType: !346, size: 64, offset: 3200)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !868, file: !869, line: 389, baseType: !346, size: 64, offset: 3264)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !868, file: !869, line: 389, baseType: !346, size: 64, offset: 3328)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !868, file: !869, line: 389, baseType: !346, size: 64, offset: 3392)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !795, file: !510, line: 249, baseType: !532, size: 64, offset: 2752)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !795, file: !510, line: 250, baseType: !934, size: 64, offset: 2816)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !850, line: 77, size: 15424, elements: !936)
!936 = !{!937, !938, !939, !942, !945, !948, !951, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !969, !970, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !1002, !1003, !1007}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !935, file: !850, line: 78, baseType: !435, size: 960)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !850, line: 80, baseType: !454, size: 8192, offset: 960)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !935, file: !850, line: 82, baseType: !940, size: 64, offset: 9152)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !850, line: 43, flags: DIFlagFwdDecl)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !935, file: !850, line: 83, baseType: !943, size: 64, offset: 9216)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !436, line: 46, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !935, file: !850, line: 86, baseType: !946, size: 64, offset: 9280)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !850, line: 41, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !935, file: !850, line: 87, baseType: !949, size: 64, offset: 9344)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !850, line: 44, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !935, file: !850, line: 89, baseType: !952, size: 512, offset: 9408)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 512, elements: !353)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !935, file: !850, line: 90, baseType: !352, size: 16, offset: 9920)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !935, file: !850, line: 90, baseType: !352, size: 16, offset: 9936)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !935, file: !850, line: 92, baseType: !352, size: 16, offset: 9952)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !935, file: !850, line: 92, baseType: !352, size: 16, offset: 9968)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !935, file: !850, line: 93, baseType: !352, size: 16, offset: 9984)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !935, file: !850, line: 93, baseType: !352, size: 16, offset: 10000)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !935, file: !850, line: 94, baseType: !56, size: 32, offset: 10016)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !935, file: !850, line: 97, baseType: !352, size: 16, offset: 10048)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !935, file: !850, line: 97, baseType: !352, size: 16, offset: 10064)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !935, file: !850, line: 98, baseType: !352, size: 16, offset: 10080)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !935, file: !850, line: 98, baseType: !352, size: 16, offset: 10096)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !935, file: !850, line: 99, baseType: !352, size: 16, offset: 10112)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !935, file: !850, line: 99, baseType: !352, size: 16, offset: 10128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !935, file: !850, line: 100, baseType: !5, size: 32, offset: 10144)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !935, file: !850, line: 101, baseType: !968, size: 64, offset: 10176)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !935, file: !850, line: 103, baseType: !461, size: 64, offset: 10240)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !935, file: !850, line: 104, baseType: !971, size: 64, offset: 10304)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !436, line: 159, size: 448, elements: !973)
!973 = !{!974, !976, !977, !979, !980, !982}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !972, file: !436, line: 161, baseType: !975, size: 64)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !391)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !972, file: !436, line: 162, baseType: !975, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !972, file: !436, line: 163, baseType: !978, size: 32, offset: 128)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 32, elements: !391)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !972, file: !436, line: 164, baseType: !978, size: 32, offset: 160)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !972, file: !436, line: 165, baseType: !981, size: 128, offset: 192)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 128, elements: !391)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !972, file: !436, line: 166, baseType: !983, size: 128, offset: 320)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 128, elements: !391)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !935, file: !850, line: 107, baseType: !332, size: 32, offset: 10368)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !935, file: !850, line: 108, baseType: !56, size: 32, offset: 10400)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !935, file: !850, line: 109, baseType: !352, size: 16, offset: 10432)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !935, file: !850, line: 110, baseType: !352, size: 16, offset: 10448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !935, file: !850, line: 113, baseType: !56, size: 32, offset: 10464)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !935, file: !850, line: 113, baseType: !56, size: 32, offset: 10496)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !935, file: !850, line: 114, baseType: !455, size: 8, offset: 10528)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !935, file: !850, line: 114, baseType: !455, size: 8, offset: 10536)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !935, file: !850, line: 115, baseType: !352, size: 16, offset: 10544)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !935, file: !850, line: 116, baseType: !645, size: 128, offset: 10560)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !935, file: !850, line: 119, baseType: !332, size: 32, offset: 10688)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !935, file: !850, line: 119, baseType: !332, size: 32, offset: 10720)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !935, file: !850, line: 122, baseType: !997, size: 512, offset: 10752)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !998, line: 182, baseType: !999)
!998 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !998, line: 180, size: 512, elements: !1000)
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !999, file: !998, line: 181, baseType: !483, size: 512)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !935, file: !850, line: 123, baseType: !455, size: 8, offset: 11264)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !935, file: !850, line: 125, baseType: !1004, size: 56, offset: 11272)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 56, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 7)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !935, file: !850, line: 126, baseType: !1008, size: 4096, offset: 11328)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 4096, elements: !353)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !850, line: 69, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !850, line: 67, size: 512, elements: !1011)
!1011 = !{!1012}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !850, line: 68, baseType: !483, size: 512)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !795, file: !510, line: 251, baseType: !1014, size: 64, offset: 2880)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !510, line: 113, size: 6208, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1026}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1015, file: !510, line: 114, baseType: !352, size: 16)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1015, file: !510, line: 114, baseType: !352, size: 16, offset: 16)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1015, file: !510, line: 115, baseType: !455, size: 8, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1015, file: !510, line: 115, baseType: !455, size: 8, offset: 40)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1015, file: !510, line: 116, baseType: !455, size: 8, offset: 48)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1015, file: !510, line: 117, baseType: !1023, size: 8, offset: 56)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 8, elements: !1024)
!1024 = !{!1025}
!1025 = !DISubrange(count: 1)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1015, file: !510, line: 119, baseType: !1027, size: 6144, offset: 64)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 6144, elements: !1037)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !510, line: 109, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !510, line: 106, size: 192, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1029, file: !510, line: 107, baseType: !332, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1029, file: !510, line: 107, baseType: !332, size: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1029, file: !510, line: 107, baseType: !332, size: 32, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1029, file: !510, line: 107, baseType: !332, size: 32, offset: 96)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1029, file: !510, line: 107, baseType: !332, size: 32, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1029, file: !510, line: 108, baseType: !56, size: 32, offset: 160)
!1037 = !{!1038}
!1038 = !DISubrange(count: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !795, file: !510, line: 252, baseType: !1040, size: 64, offset: 2944)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !510, line: 122, size: 1600, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1051, !1052, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1041, file: !510, line: 123, baseType: !512, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !1041, file: !510, line: 124, baseType: !934, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !1041, file: !510, line: 125, baseType: !1046, size: 384, offset: 128)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1047, size: 384, elements: !1049)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !998, line: 136, flags: DIFlagFwdDecl)
!1049 = !{!1050}
!1050 = !DISubrange(count: 6)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1041, file: !510, line: 126, baseType: !654, size: 512, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !1041, file: !510, line: 127, baseType: !1053, size: 288, offset: 1024)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 288, elements: !1054)
!1054 = !{!541, !541}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1041, file: !510, line: 128, baseType: !352, size: 16, offset: 1312)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1041, file: !510, line: 128, baseType: !352, size: 16, offset: 1328)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !1041, file: !510, line: 129, baseType: !332, size: 32, offset: 1344)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !1041, file: !510, line: 129, baseType: !332, size: 32, offset: 1376)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !1041, file: !510, line: 130, baseType: !332, size: 32, offset: 1408)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !1041, file: !510, line: 131, baseType: !5, size: 32, offset: 1440)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !1041, file: !510, line: 132, baseType: !352, size: 16, offset: 1472)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1041, file: !510, line: 132, baseType: !352, size: 16, offset: 1488)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1041, file: !510, line: 133, baseType: !56, size: 32, offset: 1504)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1041, file: !510, line: 133, baseType: !56, size: 32, offset: 1536)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1041, file: !510, line: 134, baseType: !352, size: 16, offset: 1568)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1041, file: !510, line: 134, baseType: !352, size: 16, offset: 1584)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !795, file: !510, line: 253, baseType: !971, size: 64, offset: 3008)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !795, file: !510, line: 254, baseType: !1069, size: 64, offset: 3072)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !510, line: 137, size: 832, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1092, !1093, !1094, !1095, !1096, !1097}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1070, file: !510, line: 138, baseType: !352, size: 16)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !1070, file: !510, line: 140, baseType: !352, size: 16, offset: 16)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !1070, file: !510, line: 141, baseType: !332, size: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !1070, file: !510, line: 142, baseType: !332, size: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1070, file: !510, line: 143, baseType: !352, size: 16, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !1070, file: !510, line: 144, baseType: !352, size: 16, offset: 112)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !1070, file: !510, line: 145, baseType: !56, size: 32, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !1070, file: !510, line: 147, baseType: !56, size: 32, offset: 160)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1070, file: !510, line: 149, baseType: !512, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !1070, file: !510, line: 150, baseType: !56, size: 32, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !1070, file: !510, line: 151, baseType: !352, size: 16, offset: 288)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !1070, file: !510, line: 152, baseType: !352, size: 16, offset: 304)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !1070, file: !510, line: 154, baseType: !346, size: 64, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !1070, file: !510, line: 155, baseType: !409, size: 64, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !1070, file: !510, line: 157, baseType: !332, size: 32, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !1070, file: !510, line: 158, baseType: !352, size: 16, offset: 480)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !1070, file: !510, line: 159, baseType: !352, size: 16, offset: 496)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !1070, file: !510, line: 160, baseType: !352, size: 16, offset: 512)
