; ModuleID = 'blender/source/blender/editors/object/object_transform.c'
source_filename = "blender/source/blender/editors/object/object_transform.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prop_set_center_types", scope: !2, file: !3, line: 1015, type: !2579, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "OBJECT_OT_origin_set", scope: !3, file: !3, line: 1013, type: !4, scopeLine: 1014, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2321, retainedNodes: !2578)
!3 = !DIFile(filename: "blender/source/blender/editors/object/object_transform.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !2247, !2251, !2257, !2261, !2262, !2266, !2267, !2268, !2269, !2273, !2274, !2289, !2290, !2294, !2320}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !84, !2240, !2241, !2242, !2245, !2246}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !25, line: 41, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !86, file: !28, line: 107, baseType: !58, size: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !86, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !86, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !86, file: !28, line: 111, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !96)
!96 = !{!97, !98, !99, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !8, line: 491, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !8, line: 491, baseType: !94, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !95, file: !8, line: 493, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !102)
!102 = !{!103, !104, !105, !106, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2206, !2209, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !28, line: 170, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !28, line: 170, baseType: !100, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !101, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !101, file: !28, line: 174, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !109, line: 49, size: 1984, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !147, !148, !149, !150, !151, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !109, line: 50, baseType: !112, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !114)
!114 = !{!115, !116, !117, !119, !138, !142, !143, !144, !145, !146}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !39, line: 118, baseType: !56, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !113, file: !39, line: 119, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !113, file: !39, line: 120, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !122)
!122 = !{!123, !124, !126, !129, !133, !134, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !39, line: 137, baseType: !112, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !121, file: !39, line: 138, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !121, file: !39, line: 139, baseType: !127, size: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !39, line: 140, baseType: !130, size: 8192, offset: 1088)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !121, file: !39, line: 141, baseType: !130, size: 8192, offset: 9280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !39, line: 148, baseType: !120, size: 64, offset: 17472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !121, file: !39, line: 150, baseType: !136, size: 64, offset: 17536)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !39, line: 121, baseType: !139, size: 528, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 66)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !113, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !113, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !108, file: !109, line: 52, baseType: !58, size: 128, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !108, file: !109, line: 53, baseType: !58, size: 128, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !108, file: !109, line: 54, baseType: !58, size: 128, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !108, file: !109, line: 55, baseType: !58, size: 128, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !108, file: !109, line: 57, baseType: !152, size: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !154, line: 1216, size: 39680, elements: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !157, !228, !1045, !1048, !1049, !1050, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1076, !1147, !1493, !1716, !1719, !2007, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2029, !2030, !2031, !2032, !2033, !2041, !2107, !2114, !2115, !2122, !2123, !2124, !2125, !2126, !2127, !2128}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !154, line: 1217, baseType: !112, size: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !153, file: !154, line: 1218, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !160, line: 838, size: 768, elements: !161)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !{!162, !177, !178, !188, !189, !221, !222, !223, !224, !225, !226, !227}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !159, file: !160, line: 840, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !165, line: 499, baseType: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !165, line: 486, size: 1600, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !165, line: 487, baseType: !112, size: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !166, file: !165, line: 489, baseType: !58, size: 128, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !166, file: !165, line: 490, baseType: !58, size: 128, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !166, file: !165, line: 491, baseType: !58, size: 128, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !166, file: !165, line: 492, baseType: !58, size: 128, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !165, line: 494, baseType: !22, size: 32, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !166, file: !165, line: 495, baseType: !22, size: 32, offset: 1504)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !166, file: !165, line: 497, baseType: !22, size: 32, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !166, file: !165, line: 498, baseType: !22, size: 32, offset: 1568)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !159, file: !160, line: 844, baseType: !163, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !159, file: !160, line: 848, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !160, line: 549, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !160, line: 544, size: 320, elements: !182)
!182 = !{!183, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !160, line: 545, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !181, file: !160, line: 545, baseType: !184, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !181, file: !160, line: 547, baseType: !163, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !181, file: !160, line: 548, baseType: !58, size: 128, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !159, file: !160, line: 851, baseType: !58, size: 128, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !159, file: !160, line: 853, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !160, line: 594, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !160, line: 561, size: 1664, elements: !193)
!193 = !{!194, !196, !197, !198, !199, !200, !201, !202, !203, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !160, line: 562, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !160, line: 562, baseType: !195, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !192, file: !160, line: 564, baseType: !58, size: 128, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !192, file: !160, line: 565, baseType: !163, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !192, file: !160, line: 566, baseType: !179, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !192, file: !160, line: 568, baseType: !58, size: 128, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !192, file: !160, line: 569, baseType: !58, size: 128, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !160, line: 571, baseType: !33, size: 512, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !192, file: !160, line: 573, baseType: !204, size: 32, offset: 1152)
!204 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !192, file: !160, line: 574, baseType: !204, size: 32, offset: 1184)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !192, file: !160, line: 576, baseType: !204, size: 32, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !192, file: !160, line: 576, baseType: !204, size: 32, offset: 1248)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !192, file: !160, line: 577, baseType: !204, size: 32, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !192, file: !160, line: 577, baseType: !204, size: 32, offset: 1312)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !192, file: !160, line: 579, baseType: !204, size: 32, offset: 1344)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !192, file: !160, line: 580, baseType: !204, size: 32, offset: 1376)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !192, file: !160, line: 582, baseType: !204, size: 32, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !192, file: !160, line: 582, baseType: !204, size: 32, offset: 1440)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !192, file: !160, line: 583, baseType: !48, size: 16, offset: 1472)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !192, file: !160, line: 585, baseType: !48, size: 16, offset: 1488)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !192, file: !160, line: 586, baseType: !48, size: 16, offset: 1504)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !160, line: 588, baseType: !48, size: 16, offset: 1520)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !192, file: !160, line: 590, baseType: !56, size: 64, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !160, line: 592, baseType: !22, size: 32, offset: 1600)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !192, file: !160, line: 593, baseType: !22, size: 32, offset: 1632)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !159, file: !160, line: 858, baseType: !58, size: 128, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !159, file: !160, line: 859, baseType: !58, size: 128, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !160, line: 862, baseType: !22, size: 32, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !159, file: !160, line: 863, baseType: !22, size: 32, offset: 672)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !159, file: !160, line: 866, baseType: !48, size: 16, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !159, file: !160, line: 867, baseType: !48, size: 16, offset: 720)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !159, file: !160, line: 868, baseType: !204, size: 32, offset: 736)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !153, file: !154, line: 1220, baseType: !229, size: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !231, line: 115, size: 11392, elements: !232)
!231 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!232 = !{!233, !234, !235, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !253, !264, !266, !267, !311, !312, !315, !316, !332, !333, !334, !335, !336, !337, !338, !343, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !359, !360, !361, !362, !363, !364, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !424, !425, !426, !427, !428, !429, !430, !431, !432, !435, !438, !447, !448, !449, !450, !451, !454, !476, !992, !993, !999, !1000, !1001, !1002, !1003, !1004, !1006, !1009, !1012, !1014, !1033, !1034}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !230, file: !231, line: 116, baseType: !112, size: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !230, file: !231, line: 117, baseType: !158, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !230, file: !231, line: 119, baseType: !236, size: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !231, line: 57, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !230, file: !231, line: 121, baseType: !48, size: 16, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !230, file: !231, line: 121, baseType: !48, size: 16, offset: 1104)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !230, file: !231, line: 122, baseType: !22, size: 32, offset: 1120)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !230, file: !231, line: 122, baseType: !22, size: 32, offset: 1152)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !230, file: !231, line: 122, baseType: !22, size: 32, offset: 1184)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !230, file: !231, line: 123, baseType: !33, size: 512, offset: 1216)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !230, file: !231, line: 124, baseType: !229, size: 64, offset: 1728)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !230, file: !231, line: 124, baseType: !229, size: 64, offset: 1792)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !230, file: !231, line: 127, baseType: !229, size: 64, offset: 1856)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !230, file: !231, line: 127, baseType: !229, size: 64, offset: 1920)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !230, file: !231, line: 127, baseType: !229, size: 64, offset: 1984)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !230, file: !231, line: 128, baseType: !250, size: 64, offset: 2048)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !252, line: 46, flags: DIFlagFwdDecl)
!252 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !230, file: !231, line: 130, baseType: !254, size: 64, offset: 2112)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !231, line: 97, size: 832, elements: !256)
!256 = !{!257, !262, !263}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !255, file: !231, line: 98, baseType: !258, size: 768)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 768, elements: !259)
!259 = !{!260, !261}
!260 = !DISubrange(count: 8)
!261 = !DISubrange(count: 3)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !255, file: !231, line: 99, baseType: !22, size: 32, offset: 768)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !255, file: !231, line: 99, baseType: !22, size: 32, offset: 800)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !230, file: !231, line: 131, baseType: !265, size: 64, offset: 2176)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !230, file: !231, line: 132, baseType: !265, size: 64, offset: 2240)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !230, file: !231, line: 133, baseType: !268, size: 64, offset: 2304)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !165, line: 334, size: 1728, elements: !270)
!270 = !{!271, !272, !275, !276, !277, !279, !280, !281, !284, !285, !286, !287, !288, !289, !290, !310}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !269, file: !165, line: 335, baseType: !58, size: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !269, file: !165, line: 336, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !165, line: 47, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !165, line: 338, baseType: !48, size: 16, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !269, file: !165, line: 338, baseType: !48, size: 16, offset: 208)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !269, file: !165, line: 339, baseType: !278, size: 32, offset: 224)
!278 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !269, file: !165, line: 340, baseType: !22, size: 32, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !269, file: !165, line: 342, baseType: !204, size: 32, offset: 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !269, file: !165, line: 343, baseType: !282, size: 96, offset: 320)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 96, elements: !283)
!283 = !{!261}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !269, file: !165, line: 344, baseType: !282, size: 96, offset: 416)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !269, file: !165, line: 347, baseType: !58, size: 128, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !269, file: !165, line: 349, baseType: !22, size: 32, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !269, file: !165, line: 350, baseType: !22, size: 32, offset: 672)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !269, file: !165, line: 351, baseType: !56, size: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !269, file: !165, line: 352, baseType: !56, size: 64, offset: 768)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !269, file: !165, line: 354, baseType: !291, size: 384, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !165, line: 116, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !165, line: 94, size: 384, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !292, file: !165, line: 96, baseType: !22, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !292, file: !165, line: 96, baseType: !22, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !292, file: !165, line: 97, baseType: !22, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !292, file: !165, line: 97, baseType: !22, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !292, file: !165, line: 99, baseType: !48, size: 16, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !292, file: !165, line: 100, baseType: !48, size: 16, offset: 144)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !292, file: !165, line: 102, baseType: !48, size: 16, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !292, file: !165, line: 105, baseType: !48, size: 16, offset: 176)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !292, file: !165, line: 108, baseType: !48, size: 16, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !292, file: !165, line: 109, baseType: !48, size: 16, offset: 208)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !292, file: !165, line: 111, baseType: !48, size: 16, offset: 224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !292, file: !165, line: 112, baseType: !48, size: 16, offset: 240)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !292, file: !165, line: 114, baseType: !22, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !292, file: !165, line: 114, baseType: !22, size: 32, offset: 288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !292, file: !165, line: 115, baseType: !22, size: 32, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !292, file: !165, line: 115, baseType: !22, size: 32, offset: 352)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !269, file: !165, line: 355, baseType: !33, size: 512, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !231, line: 134, baseType: !56, size: 64, offset: 2368)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !230, file: !231, line: 136, baseType: !313, size: 64, offset: 2432)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !231, line: 58, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !230, file: !231, line: 138, baseType: !291, size: 384, offset: 2496)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !230, file: !231, line: 139, baseType: !317, size: 64, offset: 2880)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !165, line: 80, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !165, line: 72, size: 192, elements: !320)
!320 = !{!321, !328, !329, !330, !331}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !319, file: !165, line: 73, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !165, line: 59, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !165, line: 56, size: 128, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !324, file: !165, line: 57, baseType: !282, size: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !165, line: 58, baseType: !22, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !319, file: !165, line: 74, baseType: !22, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !319, file: !165, line: 76, baseType: !22, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !319, file: !165, line: 77, baseType: !22, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !319, file: !165, line: 79, baseType: !22, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !230, file: !231, line: 141, baseType: !58, size: 128, offset: 2944)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !230, file: !231, line: 142, baseType: !58, size: 128, offset: 3072)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !230, file: !231, line: 143, baseType: !58, size: 128, offset: 3200)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !230, file: !231, line: 144, baseType: !58, size: 128, offset: 3328)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !230, file: !231, line: 146, baseType: !22, size: 32, offset: 3456)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !230, file: !231, line: 147, baseType: !22, size: 32, offset: 3488)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !230, file: !231, line: 150, baseType: !339, size: 64, offset: 3520)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !342, line: 46, flags: DIFlagFwdDecl)
!342 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !230, file: !231, line: 151, baseType: !344, size: 64, offset: 3584)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !230, file: !231, line: 152, baseType: !22, size: 32, offset: 3648)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !230, file: !231, line: 153, baseType: !22, size: 32, offset: 3680)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !230, file: !231, line: 156, baseType: !282, size: 96, offset: 3712)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !230, file: !231, line: 156, baseType: !282, size: 96, offset: 3808)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !230, file: !231, line: 156, baseType: !282, size: 96, offset: 3904)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !230, file: !231, line: 157, baseType: !282, size: 96, offset: 4000)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !230, file: !231, line: 158, baseType: !282, size: 96, offset: 4096)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !230, file: !231, line: 159, baseType: !282, size: 96, offset: 4192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !230, file: !231, line: 160, baseType: !282, size: 96, offset: 4288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !230, file: !231, line: 160, baseType: !282, size: 96, offset: 4384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !230, file: !231, line: 161, baseType: !356, size: 128, offset: 4480)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 128, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 4)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !230, file: !231, line: 161, baseType: !356, size: 128, offset: 4608)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !230, file: !231, line: 162, baseType: !282, size: 96, offset: 4736)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !230, file: !231, line: 162, baseType: !282, size: 96, offset: 4832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !230, file: !231, line: 163, baseType: !204, size: 32, offset: 4928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !230, file: !231, line: 163, baseType: !204, size: 32, offset: 4960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !230, file: !231, line: 164, baseType: !365, size: 512, offset: 4992)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 512, elements: !366)
!366 = !{!358, !358}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !230, file: !231, line: 165, baseType: !365, size: 512, offset: 5504)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !230, file: !231, line: 166, baseType: !365, size: 512, offset: 6016)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !230, file: !231, line: 167, baseType: !365, size: 512, offset: 6528)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !230, file: !231, line: 176, baseType: !365, size: 512, offset: 7040)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !230, file: !231, line: 178, baseType: !278, size: 32, offset: 7552)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !230, file: !231, line: 180, baseType: !48, size: 16, offset: 7584)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !230, file: !231, line: 181, baseType: !48, size: 16, offset: 7600)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !230, file: !231, line: 183, baseType: !48, size: 16, offset: 7616)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !230, file: !231, line: 183, baseType: !48, size: 16, offset: 7632)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !230, file: !231, line: 184, baseType: !48, size: 16, offset: 7648)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !230, file: !231, line: 184, baseType: !48, size: 16, offset: 7664)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !230, file: !231, line: 185, baseType: !48, size: 16, offset: 7680)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !230, file: !231, line: 186, baseType: !48, size: 16, offset: 7696)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !230, file: !231, line: 187, baseType: !48, size: 16, offset: 7712)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !230, file: !231, line: 188, baseType: !14, size: 8, offset: 7728)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !230, file: !231, line: 189, baseType: !14, size: 8, offset: 7736)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !230, file: !231, line: 192, baseType: !22, size: 32, offset: 7744)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !230, file: !231, line: 192, baseType: !22, size: 32, offset: 7776)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !230, file: !231, line: 192, baseType: !22, size: 32, offset: 7808)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !230, file: !231, line: 192, baseType: !22, size: 32, offset: 7840)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !230, file: !231, line: 194, baseType: !22, size: 32, offset: 7872)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !230, file: !231, line: 202, baseType: !204, size: 32, offset: 7904)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !230, file: !231, line: 202, baseType: !204, size: 32, offset: 7936)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !230, file: !231, line: 202, baseType: !204, size: 32, offset: 7968)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !230, file: !231, line: 211, baseType: !204, size: 32, offset: 8000)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !230, file: !231, line: 212, baseType: !204, size: 32, offset: 8032)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !230, file: !231, line: 213, baseType: !204, size: 32, offset: 8064)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !230, file: !231, line: 214, baseType: !204, size: 32, offset: 8096)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !230, file: !231, line: 215, baseType: !204, size: 32, offset: 8128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !230, file: !231, line: 216, baseType: !204, size: 32, offset: 8160)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !230, file: !231, line: 219, baseType: !204, size: 32, offset: 8192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !230, file: !231, line: 220, baseType: !204, size: 32, offset: 8224)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !230, file: !231, line: 221, baseType: !204, size: 32, offset: 8256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !230, file: !231, line: 224, baseType: !401, size: 16, offset: 8288)
!401 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !230, file: !231, line: 224, baseType: !401, size: 16, offset: 8304)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !230, file: !231, line: 226, baseType: !48, size: 16, offset: 8320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !230, file: !231, line: 228, baseType: !14, size: 8, offset: 8336)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !230, file: !231, line: 229, baseType: !14, size: 8, offset: 8344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !230, file: !231, line: 231, baseType: !48, size: 16, offset: 8352)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !230, file: !231, line: 232, baseType: !14, size: 8, offset: 8368)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !230, file: !231, line: 233, baseType: !14, size: 8, offset: 8376)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !230, file: !231, line: 234, baseType: !204, size: 32, offset: 8384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !230, file: !231, line: 235, baseType: !204, size: 32, offset: 8416)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !230, file: !231, line: 237, baseType: !58, size: 128, offset: 8448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !230, file: !231, line: 238, baseType: !58, size: 128, offset: 8576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !230, file: !231, line: 239, baseType: !58, size: 128, offset: 8704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !230, file: !231, line: 240, baseType: !58, size: 128, offset: 8832)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !230, file: !231, line: 242, baseType: !204, size: 32, offset: 8960)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !230, file: !231, line: 244, baseType: !48, size: 16, offset: 8992)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !230, file: !231, line: 245, baseType: !401, size: 16, offset: 9008)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !230, file: !231, line: 246, baseType: !356, size: 128, offset: 9024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !230, file: !231, line: 248, baseType: !22, size: 32, offset: 9152)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !230, file: !231, line: 249, baseType: !22, size: 32, offset: 9184)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !230, file: !231, line: 251, baseType: !422, size: 64, offset: 9216)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !231, line: 251, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !230, file: !231, line: 253, baseType: !14, size: 8, offset: 9280)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !230, file: !231, line: 254, baseType: !14, size: 8, offset: 9288)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !230, file: !231, line: 255, baseType: !48, size: 16, offset: 9296)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !230, file: !231, line: 256, baseType: !282, size: 96, offset: 9312)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !230, file: !231, line: 258, baseType: !58, size: 128, offset: 9408)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !230, file: !231, line: 259, baseType: !58, size: 128, offset: 9536)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !230, file: !231, line: 260, baseType: !58, size: 128, offset: 9664)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !230, file: !231, line: 261, baseType: !58, size: 128, offset: 9792)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !230, file: !231, line: 263, baseType: !433, size: 64, offset: 9920)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !231, line: 52, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !230, file: !231, line: 264, baseType: !436, size: 64, offset: 9984)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !231, line: 53, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !230, file: !231, line: 265, baseType: !439, size: 64, offset: 10048)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !441, line: 51, size: 1216, elements: !442)
!441 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!442 = !{!443, !444, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !440, file: !441, line: 52, baseType: !112, size: 960)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !440, file: !441, line: 54, baseType: !58, size: 128, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !440, file: !441, line: 59, baseType: !278, size: 32, offset: 1088)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !440, file: !441, line: 60, baseType: !282, size: 96, offset: 1120)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !230, file: !231, line: 267, baseType: !14, size: 8, offset: 10112)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !230, file: !231, line: 268, baseType: !14, size: 8, offset: 10120)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !230, file: !231, line: 269, baseType: !48, size: 16, offset: 10128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !230, file: !231, line: 270, baseType: !204, size: 32, offset: 10144)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !230, file: !231, line: 272, baseType: !452, size: 64, offset: 10176)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !231, line: 54, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !230, file: !231, line: 275, baseType: !455, size: 64, offset: 10240)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !457, line: 49, size: 448, elements: !458)
!457 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!458 = !{!459, !460, !461, !462}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !456, file: !457, line: 50, baseType: !58, size: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !456, file: !457, line: 51, baseType: !58, size: 128, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !456, file: !457, line: 52, baseType: !58, size: 128, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !456, file: !457, line: 53, baseType: !463, size: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !342, line: 65, size: 128, elements: !465)
!465 = !{!466, !474, !475}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !464, file: !342, line: 66, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !342, line: 56, size: 320, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !468, file: !342, line: 57, baseType: !356, size: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !468, file: !342, line: 58, baseType: !356, size: 128, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !468, file: !342, line: 59, baseType: !204, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !468, file: !342, line: 59, baseType: !204, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !464, file: !342, line: 67, baseType: !22, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !464, file: !342, line: 68, baseType: !204, size: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !230, file: !231, line: 277, baseType: !477, size: 64, offset: 10304)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !479, line: 178, size: 13504, elements: !480)
!479 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!480 = !{!481, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !534, !537, !544, !545, !552, !553, !554, !555, !561, !566, !567, !571, !572, !573, !574, !575, !588, !600, !614, !618, !622, !626, !635, !647, !651, !655, !659, !663, !667, !668, !669, !670, !671, !672, !676, !677, !678, !679, !683, !684, !685, !686, !687, !692, !693, !694, !695, !696, !700, !701, !702, !703, !704, !711, !722, !727, !733, !743, !749, !764, !771, !778, !782, !787, !791, !796, !797, !798, !805, !811, !812, !813, !818, !819, !828, !949, !953, !961, !965, !969, !973, !981, !991}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !478, file: !479, line: 180, baseType: !482, size: 1600)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !483, line: 73, baseType: !484)
!483 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !483, line: 64, size: 1600, elements: !485)
!485 = !{!486, !501, !505, !506, !507, !508, !511}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !484, file: !483, line: 65, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !483, line: 53, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !483, line: 42, size: 832, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !483, line: 43, baseType: !22, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !489, file: !483, line: 44, baseType: !22, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !489, file: !483, line: 45, baseType: !22, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !489, file: !483, line: 46, baseType: !22, size: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !489, file: !483, line: 47, baseType: !22, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !489, file: !483, line: 48, baseType: !22, size: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !489, file: !483, line: 49, baseType: !22, size: 32, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !489, file: !483, line: 50, baseType: !22, size: 32, offset: 224)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !489, file: !483, line: 51, baseType: !33, size: 512, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !483, line: 52, baseType: !56, size: 64, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !484, file: !483, line: 66, baseType: !502, size: 1312, offset: 64)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1312, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 41)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !484, file: !483, line: 69, baseType: !22, size: 32, offset: 1376)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !484, file: !483, line: 69, baseType: !22, size: 32, offset: 1408)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !484, file: !483, line: 70, baseType: !22, size: 32, offset: 1440)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !484, file: !483, line: 71, baseType: !509, size: 64, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !483, line: 71, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !484, file: !483, line: 72, baseType: !512, size: 64, offset: 1536)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !483, line: 59, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !483, line: 57, size: 8192, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !514, file: !483, line: 58, baseType: !130, size: 8192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !478, file: !479, line: 180, baseType: !482, size: 1600, offset: 1600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !478, file: !479, line: 180, baseType: !482, size: 1600, offset: 3200)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !478, file: !479, line: 180, baseType: !482, size: 1600, offset: 4800)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !478, file: !479, line: 180, baseType: !482, size: 1600, offset: 6400)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !478, file: !479, line: 181, baseType: !22, size: 32, offset: 8000)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !478, file: !479, line: 181, baseType: !22, size: 32, offset: 8032)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !478, file: !479, line: 181, baseType: !22, size: 32, offset: 8064)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !478, file: !479, line: 181, baseType: !22, size: 32, offset: 8096)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !478, file: !479, line: 181, baseType: !22, size: 32, offset: 8128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !478, file: !479, line: 182, baseType: !22, size: 32, offset: 8160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !478, file: !479, line: 183, baseType: !22, size: 32, offset: 8192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !478, file: !479, line: 184, baseType: !529, size: 64, offset: 8256)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !530, line: 124, baseType: !531)
!530 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !533, line: 215, flags: DIFlagFwdDecl)
!533 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_object.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!534 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !478, file: !479, line: 185, baseType: !535, size: 64, offset: 8320)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !479, line: 97, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !479, line: 186, baseType: !538, size: 32, offset: 8384)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !479, line: 132, baseType: !539)
!539 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DerivedMeshType", file: !479, line: 128, baseType: !278, size: 32, elements: !540)
!540 = !{!541, !542, !543}
!541 = !DIEnumerator(name: "DM_TYPE_CDDM", value: 0, isUnsigned: true)
!542 = !DIEnumerator(name: "DM_TYPE_EDITBMESH", value: 1, isUnsigned: true)
!543 = !DIEnumerator(name: "DM_TYPE_CCGDM", value: 2, isUnsigned: true)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !478, file: !479, line: 187, baseType: !204, size: 32, offset: 8416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !478, file: !479, line: 188, baseType: !546, size: 32, offset: 8448)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !479, line: 175, baseType: !547)
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDirtyFlag", file: !479, line: 164, baseType: !278, size: 32, elements: !548)
!548 = !{!549, !550, !551}
!549 = !DIEnumerator(name: "DM_DIRTY_TESS_CDLAYERS", value: 1, isUnsigned: true)
!550 = !DIEnumerator(name: "DM_DIRTY_MCOL_UPDATE_DRAW", value: 2, isUnsigned: true)
!551 = !DIEnumerator(name: "DM_DIRTY_NORMALS", value: 4, isUnsigned: true)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !478, file: !479, line: 189, baseType: !22, size: 32, offset: 8480)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !478, file: !479, line: 190, baseType: !339, size: 64, offset: 8512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !478, file: !479, line: 193, baseType: !14, size: 8, offset: 8576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !478, file: !479, line: 196, baseType: !556, size: 64, offset: 8640)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !479, line: 177, baseType: !478)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !478, file: !479, line: 199, baseType: !562, size: 64, offset: 8704)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !559, !565}
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !478, file: !479, line: 202, baseType: !556, size: 64, offset: 8768)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !478, file: !479, line: 207, baseType: !568, size: 64, offset: 8832)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!22, !559}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !478, file: !479, line: 208, baseType: !568, size: 64, offset: 8896)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !478, file: !479, line: 209, baseType: !568, size: 64, offset: 8960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !478, file: !479, line: 210, baseType: !568, size: 64, offset: 9024)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !478, file: !479, line: 211, baseType: !568, size: 64, offset: 9088)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !478, file: !479, line: 218, baseType: !576, size: 64, offset: 9152)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !559, !22, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !581, line: 65, size: 160, elements: !582)
!581 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!582 = !{!583, !584, !586, !587}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !580, file: !581, line: 66, baseType: !282, size: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !580, file: !581, line: 67, baseType: !585, size: 48, offset: 96)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 48, elements: !283)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !580, file: !581, line: 68, baseType: !14, size: 8, offset: 144)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !580, file: !581, line: 68, baseType: !14, size: 8, offset: 152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !478, file: !479, line: 219, baseType: !589, size: 64, offset: 9216)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !559, !22, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !581, line: 48, size: 96, elements: !594)
!594 = !{!595, !596, !597, !598, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !593, file: !581, line: 49, baseType: !278, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !593, file: !581, line: 49, baseType: !278, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !593, file: !581, line: 50, baseType: !14, size: 8, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !593, file: !581, line: 50, baseType: !14, size: 8, offset: 72)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !593, file: !581, line: 51, baseType: !48, size: 16, offset: 80)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !478, file: !479, line: 220, baseType: !601, size: 64, offset: 9280)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !559, !22, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !581, line: 42, size: 160, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !605, file: !581, line: 43, baseType: !278, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !605, file: !581, line: 43, baseType: !278, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !605, file: !581, line: 43, baseType: !278, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !605, file: !581, line: 43, baseType: !278, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !605, file: !581, line: 44, baseType: !48, size: 16, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !605, file: !581, line: 45, baseType: !14, size: 8, offset: 144)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !605, file: !581, line: 45, baseType: !14, size: 8, offset: 152)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !478, file: !479, line: 227, baseType: !615, size: 64, offset: 9344)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!579, !559}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !478, file: !479, line: 228, baseType: !619, size: 64, offset: 9408)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!592, !559}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !478, file: !479, line: 229, baseType: !623, size: 64, offset: 9472)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!604, !559}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !478, file: !479, line: 230, baseType: !627, size: 64, offset: 9536)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!630, !559}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !581, line: 88, size: 64, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !631, file: !581, line: 89, baseType: !278, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !631, file: !581, line: 90, baseType: !278, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !478, file: !479, line: 231, baseType: !636, size: 64, offset: 9600)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!639, !559}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !581, line: 79, size: 96, elements: !641)
!641 = !{!642, !643, !644, !645, !646}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !640, file: !581, line: 81, baseType: !22, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !640, file: !581, line: 82, baseType: !22, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !640, file: !581, line: 83, baseType: !48, size: 16, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !640, file: !581, line: 84, baseType: !14, size: 8, offset: 80)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !640, file: !581, line: 84, baseType: !14, size: 8, offset: 88)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !478, file: !479, line: 236, baseType: !648, size: 64, offset: 9664)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !559, !579}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !478, file: !479, line: 237, baseType: !652, size: 64, offset: 9728)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !559, !592}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !478, file: !479, line: 238, baseType: !656, size: 64, offset: 9792)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !559, !604}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !478, file: !479, line: 239, baseType: !660, size: 64, offset: 9856)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !559, !630}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !478, file: !479, line: 240, baseType: !664, size: 64, offset: 9920)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !559, !639}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !478, file: !479, line: 245, baseType: !615, size: 64, offset: 9984)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !478, file: !479, line: 246, baseType: !619, size: 64, offset: 10048)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !478, file: !479, line: 247, baseType: !623, size: 64, offset: 10112)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !478, file: !479, line: 248, baseType: !627, size: 64, offset: 10176)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !478, file: !479, line: 249, baseType: !636, size: 64, offset: 10240)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !478, file: !479, line: 255, baseType: !673, size: 64, offset: 10304)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!56, !559, !22, !22}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !478, file: !479, line: 256, baseType: !673, size: 64, offset: 10368)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !478, file: !479, line: 257, baseType: !673, size: 64, offset: 10432)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !478, file: !479, line: 258, baseType: !673, size: 64, offset: 10496)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !478, file: !479, line: 264, baseType: !680, size: 64, offset: 10560)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!56, !559, !22}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !478, file: !479, line: 265, baseType: !680, size: 64, offset: 10624)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !478, file: !479, line: 266, baseType: !680, size: 64, offset: 10688)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !478, file: !479, line: 267, baseType: !680, size: 64, offset: 10752)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !478, file: !479, line: 268, baseType: !680, size: 64, offset: 10816)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !478, file: !479, line: 272, baseType: !688, size: 64, offset: 10880)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!691, !559}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !478, file: !479, line: 273, baseType: !688, size: 64, offset: 10944)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !478, file: !479, line: 274, baseType: !688, size: 64, offset: 11008)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !478, file: !479, line: 275, baseType: !688, size: 64, offset: 11072)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !478, file: !479, line: 276, baseType: !688, size: 64, offset: 11136)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !478, file: !479, line: 279, baseType: !697, size: 64, offset: 11200)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !559, !22, !691, !22}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !478, file: !479, line: 280, baseType: !697, size: 64, offset: 11264)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !478, file: !479, line: 281, baseType: !697, size: 64, offset: 11328)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !478, file: !479, line: 284, baseType: !568, size: 64, offset: 11392)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !478, file: !479, line: 285, baseType: !568, size: 64, offset: 11456)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !478, file: !479, line: 286, baseType: !705, size: 64, offset: 11520)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !559}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !479, line: 82, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !478, file: !479, line: 287, baseType: !712, size: 64, offset: 11584)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!715, !559}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !479, line: 120, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !479, line: 117, size: 256, elements: !718)
!718 = !{!719, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !717, file: !479, line: 118, baseType: !720, size: 128)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !357)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !717, file: !479, line: 119, baseType: !720, size: 128, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !478, file: !479, line: 288, baseType: !723, size: 64, offset: 11648)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!726, !559}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !478, file: !479, line: 289, baseType: !728, size: 64, offset: 11712)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !559, !731}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !479, line: 83, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !478, file: !479, line: 290, baseType: !734, size: 64, offset: 11776)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!737, !559}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !479, line: 126, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !479, line: 123, size: 32, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !739, file: !479, line: 124, baseType: !48, size: 16)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !739, file: !479, line: 125, baseType: !14, size: 8, offset: 16)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !478, file: !479, line: 291, baseType: !744, size: 64, offset: 11840)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!747, !559}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !478, file: !479, line: 299, baseType: !750, size: 64, offset: 11904)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !559, !753, !56, !759}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !56, !22, !756, !756, !757}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !479, line: 162, baseType: !760)
!760 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMForeachFlag", file: !479, line: 159, baseType: !278, size: 32, elements: !761)
!761 = !{!762, !763}
!762 = !DIEnumerator(name: "DM_FOREACH_NOP", value: 0, isUnsigned: true)
!763 = !DIEnumerator(name: "DM_FOREACH_USE_NORMAL", value: 1, isUnsigned: true)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !478, file: !479, line: 309, baseType: !765, size: 64, offset: 11968)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !559, !768, !56}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !56, !22, !756, !756}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !478, file: !479, line: 317, baseType: !772, size: 64, offset: 12032)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !559, !775, !56, !759}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !56, !22, !22, !756, !756}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !478, file: !479, line: 327, baseType: !779, size: 64, offset: 12096)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !559, !768, !56, !759}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !478, file: !479, line: 337, baseType: !783, size: 64, offset: 12160)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !559, !786, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !478, file: !479, line: 344, baseType: !788, size: 64, offset: 12224)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !559, !22, !786}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !478, file: !479, line: 347, baseType: !792, size: 64, offset: 12288)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !559, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !478, file: !479, line: 350, baseType: !788, size: 64, offset: 12352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !478, file: !479, line: 351, baseType: !788, size: 64, offset: 12416)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !478, file: !479, line: 355, baseType: !799, size: 64, offset: 12480)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!802, !229, !559}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !479, line: 355, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !478, file: !479, line: 359, baseType: !806, size: 64, offset: 12544)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!809, !229, !559}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !479, line: 100, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !478, file: !479, line: 364, baseType: !556, size: 64, offset: 12608)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !478, file: !479, line: 367, baseType: !556, size: 64, offset: 12672)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !478, file: !479, line: 373, baseType: !814, size: 64, offset: 12736)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !559, !817, !817}
!817 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !478, file: !479, line: 376, baseType: !556, size: 64, offset: 12800)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !478, file: !479, line: 385, baseType: !820, size: 64, offset: 12864)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !559, !823, !817, !824}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !479, line: 146, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!22, !22, !56}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !478, file: !479, line: 391, baseType: !829, size: 64, offset: 12928)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !559, !832, !938, !56, !942}
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !479, line: 150, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!836, !843, !937, !22}
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !479, line: 143, baseType: !837)
!837 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawOption", file: !479, line: 134, baseType: !278, size: 32, elements: !838)
!838 = !{!839, !840, !841, !842}
!839 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!840 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!841 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!842 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !581, line: 160, size: 384, elements: !845)
!845 = !{!846, !850, !932, !933, !934, !935, !936}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !844, file: !581, line: 161, baseType: !847, size: 256)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 256, elements: !848)
!848 = !{!358, !849}
!849 = !DISubrange(count: 2)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !844, file: !581, line: 162, baseType: !851, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !853, line: 77, size: 15424, elements: !854)
!853 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!854 = !{!855, !856, !857, !860, !863, !866, !869, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !921, !922, !926}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !852, file: !853, line: 78, baseType: !112, size: 960)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !852, file: !853, line: 80, baseType: !130, size: 8192, offset: 960)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !852, file: !853, line: 82, baseType: !858, size: 64, offset: 9152)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !853, line: 43, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !852, file: !853, line: 83, baseType: !861, size: 64, offset: 9216)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !39, line: 46, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !852, file: !853, line: 86, baseType: !864, size: 64, offset: 9280)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !853, line: 41, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !852, file: !853, line: 87, baseType: !867, size: 64, offset: 9344)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !853, line: 44, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !852, file: !853, line: 89, baseType: !870, size: 512, offset: 9408)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 512, elements: !871)
!871 = !{!260}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !852, file: !853, line: 90, baseType: !48, size: 16, offset: 9920)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !852, file: !853, line: 90, baseType: !48, size: 16, offset: 9936)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !852, file: !853, line: 92, baseType: !48, size: 16, offset: 9952)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !852, file: !853, line: 92, baseType: !48, size: 16, offset: 9968)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !852, file: !853, line: 93, baseType: !48, size: 16, offset: 9984)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !852, file: !853, line: 93, baseType: !48, size: 16, offset: 10000)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !852, file: !853, line: 94, baseType: !22, size: 32, offset: 10016)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !852, file: !853, line: 97, baseType: !48, size: 16, offset: 10048)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !852, file: !853, line: 97, baseType: !48, size: 16, offset: 10064)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !852, file: !853, line: 98, baseType: !48, size: 16, offset: 10080)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !852, file: !853, line: 98, baseType: !48, size: 16, offset: 10096)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !852, file: !853, line: 99, baseType: !48, size: 16, offset: 10112)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !852, file: !853, line: 99, baseType: !48, size: 16, offset: 10128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !852, file: !853, line: 100, baseType: !278, size: 32, offset: 10144)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !852, file: !853, line: 101, baseType: !748, size: 64, offset: 10176)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !852, file: !853, line: 103, baseType: !136, size: 64, offset: 10240)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !852, file: !853, line: 104, baseType: !889, size: 64, offset: 10304)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !39, line: 159, size: 448, elements: !891)
!891 = !{!892, !895, !896, !898, !899, !901}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !890, file: !39, line: 161, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 64, elements: !894)
!894 = !{!849}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !890, file: !39, line: 162, baseType: !893, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !890, file: !39, line: 163, baseType: !897, size: 32, offset: 128)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !894)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !890, file: !39, line: 164, baseType: !897, size: 32, offset: 160)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !890, file: !39, line: 165, baseType: !900, size: 128, offset: 192)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 128, elements: !894)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !890, file: !39, line: 166, baseType: !902, size: 128, offset: 320)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 128, elements: !894)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !852, file: !853, line: 107, baseType: !204, size: 32, offset: 10368)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !852, file: !853, line: 108, baseType: !22, size: 32, offset: 10400)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !852, file: !853, line: 109, baseType: !48, size: 16, offset: 10432)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !852, file: !853, line: 110, baseType: !48, size: 16, offset: 10448)
