; ModuleID = 'blender/source/blender/blenkernel/intern/camera.c'
source_filename = "blender/source/blender/blenkernel/intern/camera.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !40, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/camera.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !16, !30, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 95, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_camera_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15}
!7 = !DIEnumerator(name: "CAM_SHOWLIMITS", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "CAM_SHOWMIST", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "CAM_SHOWPASSEPARTOUT", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "CAM_SHOWTITLESAFE", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "CAM_SHOWNAME", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "CAM_ANGLETOGGLE", value: 32, isUnsigned: true)
!13 = !DIEnumerator(name: "CAM_DS_EXPAND", value: 64, isUnsigned: true)
!14 = !DIEnumerator(name: "CAM_PANORAMA", value: 128, isUnsigned: true)
!15 = !DIEnumerator(name: "CAM_SHOWSENSOR", value: 256, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 339, baseType: !5, size: 32, elements: !18)
!17 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!19 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!26 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!27 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!28 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!29 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 76, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34}
!32 = !DIEnumerator(name: "CAM_PERSP", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "CAM_ORTHO", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "CAM_PANO", value: 2, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 115, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "CAMERA_SENSOR_FIT_AUTO", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "CAMERA_SENSOR_FIT_HOR", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "CAMERA_SENSOR_FIT_VERT", value: 2, isUnsigned: true)
!40 = !{!41, !47, !112, !124, !1404}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !43, line: 130, baseType: !44)
!43 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !43, line: 117, size: 960, elements: !45)
!45 = !{!46, !48, !49, !51, !70, !74, !76, !78, !79, !80}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !43, line: 118, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !44, file: !43, line: 118, baseType: !47, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !44, file: !43, line: 119, baseType: !50, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !44, file: !43, line: 120, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !43, line: 136, size: 17600, elements: !54)
!54 = !{!55, !56, !57, !60, !65, !66, !67}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !53, file: !43, line: 137, baseType: !42, size: 960)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !53, file: !43, line: 138, baseType: !41, size: 64, offset: 960)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !53, file: !43, line: 139, baseType: !58, size: 64, offset: 1024)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !43, line: 43, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !53, file: !43, line: 140, baseType: !61, size: 8192, offset: 1088)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8192, elements: !63)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !{!64}
!64 = !DISubrange(count: 1024)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !53, file: !43, line: 141, baseType: !61, size: 8192, offset: 9280)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !53, file: !43, line: 148, baseType: !52, size: 64, offset: 17472)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !53, file: !43, line: 150, baseType: !68, size: 64, offset: 17536)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !43, line: 45, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !43, line: 121, baseType: !71, size: 528, offset: 256)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 528, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 66)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !44, file: !43, line: 126, baseType: !75, size: 16, offset: 784)
!75 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !44, file: !43, line: 127, baseType: !77, size: 32, offset: 800)
!77 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !44, file: !43, line: 128, baseType: !77, size: 32, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !44, file: !43, line: 128, baseType: !77, size: 32, offset: 864)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !44, file: !43, line: 129, baseType: !81, size: 64, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !43, line: 75, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !43, line: 62, size: 1024, elements: !84)
!84 = !{!85, !87, !88, !89, !90, !91, !95, !96, !110, !111}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !43, line: 63, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !83, file: !43, line: 63, baseType: !86, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !43, line: 64, baseType: !62, size: 8, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !83, file: !43, line: 64, baseType: !62, size: 8, offset: 136)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !83, file: !43, line: 65, baseType: !75, size: 16, offset: 144)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !83, file: !43, line: 66, baseType: !92, size: 512, offset: 160)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 512, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !83, file: !43, line: 67, baseType: !77, size: 32, offset: 672)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !43, line: 69, baseType: !97, size: 256, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !43, line: 60, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !43, line: 48, size: 256, elements: !99)
!99 = !{!100, !101, !108, !109}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !98, file: !43, line: 49, baseType: !47, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !98, file: !43, line: 58, baseType: !102, size: 128, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !103, line: 71, baseType: !104)
!103 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !103, line: 69, size: 128, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !104, file: !103, line: 70, baseType: !47, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !104, file: !103, line: 70, baseType: !47, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !98, file: !43, line: 59, baseType: !77, size: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !98, file: !43, line: 59, baseType: !77, size: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !83, file: !43, line: 70, baseType: !77, size: 32, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !83, file: !43, line: 74, baseType: !77, size: 32, offset: 992)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "Camera", file: !4, line: 71, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !4, line: 47, size: 1600, elements: !115)
!115 = !{!116, !117, !120, !121, !122, !123, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !138, !1402, !1403}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !114, file: !4, line: 48, baseType: !42, size: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !114, file: !4, line: 49, baseType: !118, size: 64, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !4, line: 44, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !4, line: 51, baseType: !62, size: 8, offset: 1024)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !114, file: !4, line: 52, baseType: !62, size: 8, offset: 1032)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !4, line: 53, baseType: !75, size: 16, offset: 1040)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "passepartalpha", scope: !114, file: !4, line: 54, baseType: !124, size: 32, offset: 1056)
!124 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !114, file: !4, line: 55, baseType: !124, size: 32, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !114, file: !4, line: 55, baseType: !124, size: 32, offset: 1120)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !114, file: !4, line: 56, baseType: !124, size: 32, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ortho_scale", scope: !114, file: !4, line: 56, baseType: !124, size: 32, offset: 1184)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "drawsize", scope: !114, file: !4, line: 56, baseType: !124, size: 32, offset: 1216)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_x", scope: !114, file: !4, line: 57, baseType: !124, size: 32, offset: 1248)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_y", scope: !114, file: !4, line: 57, baseType: !124, size: 32, offset: 1280)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "shiftx", scope: !114, file: !4, line: 58, baseType: !124, size: 32, offset: 1312)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "shifty", scope: !114, file: !4, line: 58, baseType: !124, size: 32, offset: 1344)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "YF_dofdist", scope: !114, file: !4, line: 63, baseType: !124, size: 32, offset: 1376)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !114, file: !4, line: 65, baseType: !136, size: 64, offset: 1408)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !4, line: 45, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dof_ob", scope: !114, file: !4, line: 67, baseType: !139, size: 64, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !17, line: 115, size: 11392, elements: !141)
!141 = !{!142, !143, !144, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !170, !184, !185, !228, !229, !232, !233, !249, !250, !251, !252, !253, !254, !255, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !275, !276, !277, !278, !279, !280, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !340, !341, !342, !343, !344, !345, !346, !347, !348, !351, !354, !357, !358, !359, !360, !361, !364, !367, !370, !371, !377, !378, !379, !380, !381, !382, !384, !387, !390, !394, !1390, !1391}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !140, file: !17, line: 116, baseType: !42, size: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !140, file: !17, line: 117, baseType: !118, size: 64, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !140, file: !17, line: 119, baseType: !145, size: 64, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !17, line: 57, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !140, file: !17, line: 121, baseType: !75, size: 16, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !140, file: !17, line: 121, baseType: !75, size: 16, offset: 1104)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !140, file: !17, line: 122, baseType: !77, size: 32, offset: 1120)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !140, file: !17, line: 122, baseType: !77, size: 32, offset: 1152)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !140, file: !17, line: 122, baseType: !77, size: 32, offset: 1184)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !140, file: !17, line: 123, baseType: !92, size: 512, offset: 1216)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !140, file: !17, line: 124, baseType: !139, size: 64, offset: 1728)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !140, file: !17, line: 124, baseType: !139, size: 64, offset: 1792)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !140, file: !17, line: 127, baseType: !139, size: 64, offset: 1856)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !140, file: !17, line: 127, baseType: !139, size: 64, offset: 1920)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !140, file: !17, line: 127, baseType: !139, size: 64, offset: 1984)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !140, file: !17, line: 128, baseType: !136, size: 64, offset: 2048)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !140, file: !17, line: 130, baseType: !160, size: 64, offset: 2112)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !17, line: 97, size: 832, elements: !162)
!162 = !{!163, !168, !169}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !161, file: !17, line: 98, baseType: !164, size: 768)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 768, elements: !165)
!165 = !{!166, !167}
!166 = !DISubrange(count: 8)
!167 = !DISubrange(count: 3)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !161, file: !17, line: 99, baseType: !77, size: 32, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !161, file: !17, line: 99, baseType: !77, size: 32, offset: 800)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !140, file: !17, line: 131, baseType: !171, size: 64, offset: 2176)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !173, line: 486, size: 1600, elements: !174)
!173 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !172, file: !173, line: 487, baseType: !42, size: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !172, file: !173, line: 489, baseType: !102, size: 128, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !172, file: !173, line: 490, baseType: !102, size: 128, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !172, file: !173, line: 491, baseType: !102, size: 128, offset: 1216)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !172, file: !173, line: 492, baseType: !102, size: 128, offset: 1344)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !172, file: !173, line: 494, baseType: !77, size: 32, offset: 1472)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !172, file: !173, line: 495, baseType: !77, size: 32, offset: 1504)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !172, file: !173, line: 497, baseType: !77, size: 32, offset: 1536)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !172, file: !173, line: 498, baseType: !77, size: 32, offset: 1568)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !140, file: !17, line: 132, baseType: !171, size: 64, offset: 2240)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !140, file: !17, line: 133, baseType: !186, size: 64, offset: 2304)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !173, line: 334, size: 1728, elements: !188)
!188 = !{!189, !190, !193, !194, !195, !196, !197, !198, !201, !202, !203, !204, !205, !206, !207, !227}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !187, file: !173, line: 335, baseType: !102, size: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !187, file: !173, line: 336, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !173, line: 47, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !187, file: !173, line: 338, baseType: !75, size: 16, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !187, file: !173, line: 338, baseType: !75, size: 16, offset: 208)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !187, file: !173, line: 339, baseType: !5, size: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !187, file: !173, line: 340, baseType: !77, size: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !187, file: !173, line: 342, baseType: !124, size: 32, offset: 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !187, file: !173, line: 343, baseType: !199, size: 96, offset: 320)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 96, elements: !200)
!200 = !{!167}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !187, file: !173, line: 344, baseType: !199, size: 96, offset: 416)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !187, file: !173, line: 347, baseType: !102, size: 128, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !187, file: !173, line: 349, baseType: !77, size: 32, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !187, file: !173, line: 350, baseType: !77, size: 32, offset: 672)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !187, file: !173, line: 351, baseType: !47, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !187, file: !173, line: 352, baseType: !47, size: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !187, file: !173, line: 354, baseType: !208, size: 384, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !173, line: 116, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !173, line: 94, size: 384, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !209, file: !173, line: 96, baseType: !77, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !209, file: !173, line: 96, baseType: !77, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !209, file: !173, line: 97, baseType: !77, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !209, file: !173, line: 97, baseType: !77, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !209, file: !173, line: 99, baseType: !75, size: 16, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !209, file: !173, line: 100, baseType: !75, size: 16, offset: 144)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !209, file: !173, line: 102, baseType: !75, size: 16, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !209, file: !173, line: 105, baseType: !75, size: 16, offset: 176)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !209, file: !173, line: 108, baseType: !75, size: 16, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !209, file: !173, line: 109, baseType: !75, size: 16, offset: 208)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !209, file: !173, line: 111, baseType: !75, size: 16, offset: 224)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !209, file: !173, line: 112, baseType: !75, size: 16, offset: 240)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !209, file: !173, line: 114, baseType: !77, size: 32, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !209, file: !173, line: 114, baseType: !77, size: 32, offset: 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !209, file: !173, line: 115, baseType: !77, size: 32, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !209, file: !173, line: 115, baseType: !77, size: 32, offset: 352)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !187, file: !173, line: 355, baseType: !92, size: 512, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !17, line: 134, baseType: !47, size: 64, offset: 2368)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !140, file: !17, line: 136, baseType: !230, size: 64, offset: 2432)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !17, line: 58, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !140, file: !17, line: 138, baseType: !208, size: 384, offset: 2496)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !140, file: !17, line: 139, baseType: !234, size: 64, offset: 2880)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !173, line: 80, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !173, line: 72, size: 192, elements: !237)
!237 = !{!238, !245, !246, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !236, file: !173, line: 73, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !173, line: 59, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !173, line: 56, size: 128, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !241, file: !173, line: 57, baseType: !199, size: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !241, file: !173, line: 58, baseType: !77, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !236, file: !173, line: 74, baseType: !77, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !236, file: !173, line: 76, baseType: !77, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !236, file: !173, line: 77, baseType: !77, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !173, line: 79, baseType: !77, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !140, file: !17, line: 141, baseType: !102, size: 128, offset: 2944)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !140, file: !17, line: 142, baseType: !102, size: 128, offset: 3072)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !140, file: !17, line: 143, baseType: !102, size: 128, offset: 3200)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !140, file: !17, line: 144, baseType: !102, size: 128, offset: 3328)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !140, file: !17, line: 146, baseType: !77, size: 32, offset: 3456)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !140, file: !17, line: 147, baseType: !77, size: 32, offset: 3488)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !140, file: !17, line: 150, baseType: !256, size: 64, offset: 3520)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !17, line: 50, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !140, file: !17, line: 151, baseType: !260, size: 64, offset: 3584)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !140, file: !17, line: 152, baseType: !77, size: 32, offset: 3648)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !140, file: !17, line: 153, baseType: !77, size: 32, offset: 3680)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !140, file: !17, line: 156, baseType: !199, size: 96, offset: 3712)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !140, file: !17, line: 156, baseType: !199, size: 96, offset: 3808)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !140, file: !17, line: 156, baseType: !199, size: 96, offset: 3904)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !140, file: !17, line: 157, baseType: !199, size: 96, offset: 4000)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !140, file: !17, line: 158, baseType: !199, size: 96, offset: 4096)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !140, file: !17, line: 159, baseType: !199, size: 96, offset: 4192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !140, file: !17, line: 160, baseType: !199, size: 96, offset: 4288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !140, file: !17, line: 160, baseType: !199, size: 96, offset: 4384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !140, file: !17, line: 161, baseType: !272, size: 128, offset: 4480)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 4)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !140, file: !17, line: 161, baseType: !272, size: 128, offset: 4608)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !140, file: !17, line: 162, baseType: !199, size: 96, offset: 4736)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !140, file: !17, line: 162, baseType: !199, size: 96, offset: 4832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !140, file: !17, line: 163, baseType: !124, size: 32, offset: 4928)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !140, file: !17, line: 163, baseType: !124, size: 32, offset: 4960)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !140, file: !17, line: 164, baseType: !281, size: 512, offset: 4992)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 512, elements: !282)
!282 = !{!274, !274}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !140, file: !17, line: 165, baseType: !281, size: 512, offset: 5504)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !140, file: !17, line: 166, baseType: !281, size: 512, offset: 6016)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !140, file: !17, line: 167, baseType: !281, size: 512, offset: 6528)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !140, file: !17, line: 176, baseType: !281, size: 512, offset: 7040)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !140, file: !17, line: 178, baseType: !5, size: 32, offset: 7552)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !17, line: 180, baseType: !75, size: 16, offset: 7584)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !140, file: !17, line: 181, baseType: !75, size: 16, offset: 7600)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !140, file: !17, line: 183, baseType: !75, size: 16, offset: 7616)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !140, file: !17, line: 183, baseType: !75, size: 16, offset: 7632)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !140, file: !17, line: 184, baseType: !75, size: 16, offset: 7648)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !140, file: !17, line: 184, baseType: !75, size: 16, offset: 7664)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !140, file: !17, line: 185, baseType: !75, size: 16, offset: 7680)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !140, file: !17, line: 186, baseType: !75, size: 16, offset: 7696)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !140, file: !17, line: 187, baseType: !75, size: 16, offset: 7712)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !140, file: !17, line: 188, baseType: !62, size: 8, offset: 7728)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !140, file: !17, line: 189, baseType: !62, size: 8, offset: 7736)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !140, file: !17, line: 192, baseType: !77, size: 32, offset: 7744)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !140, file: !17, line: 192, baseType: !77, size: 32, offset: 7776)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !140, file: !17, line: 192, baseType: !77, size: 32, offset: 7808)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !140, file: !17, line: 192, baseType: !77, size: 32, offset: 7840)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !140, file: !17, line: 194, baseType: !77, size: 32, offset: 7872)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !140, file: !17, line: 202, baseType: !124, size: 32, offset: 7904)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !140, file: !17, line: 202, baseType: !124, size: 32, offset: 7936)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !140, file: !17, line: 202, baseType: !124, size: 32, offset: 7968)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !140, file: !17, line: 211, baseType: !124, size: 32, offset: 8000)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !140, file: !17, line: 212, baseType: !124, size: 32, offset: 8032)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !140, file: !17, line: 213, baseType: !124, size: 32, offset: 8064)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !140, file: !17, line: 214, baseType: !124, size: 32, offset: 8096)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !140, file: !17, line: 215, baseType: !124, size: 32, offset: 8128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !140, file: !17, line: 216, baseType: !124, size: 32, offset: 8160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !140, file: !17, line: 219, baseType: !124, size: 32, offset: 8192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !140, file: !17, line: 220, baseType: !124, size: 32, offset: 8224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !140, file: !17, line: 221, baseType: !124, size: 32, offset: 8256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !140, file: !17, line: 224, baseType: !317, size: 16, offset: 8288)
!317 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !140, file: !17, line: 224, baseType: !317, size: 16, offset: 8304)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !140, file: !17, line: 226, baseType: !75, size: 16, offset: 8320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !140, file: !17, line: 228, baseType: !62, size: 8, offset: 8336)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !140, file: !17, line: 229, baseType: !62, size: 8, offset: 8344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !140, file: !17, line: 231, baseType: !75, size: 16, offset: 8352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !140, file: !17, line: 232, baseType: !62, size: 8, offset: 8368)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !140, file: !17, line: 233, baseType: !62, size: 8, offset: 8376)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !140, file: !17, line: 234, baseType: !124, size: 32, offset: 8384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !140, file: !17, line: 235, baseType: !124, size: 32, offset: 8416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !140, file: !17, line: 237, baseType: !102, size: 128, offset: 8448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !140, file: !17, line: 238, baseType: !102, size: 128, offset: 8576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !140, file: !17, line: 239, baseType: !102, size: 128, offset: 8704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !140, file: !17, line: 240, baseType: !102, size: 128, offset: 8832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !140, file: !17, line: 242, baseType: !124, size: 32, offset: 8960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !140, file: !17, line: 244, baseType: !75, size: 16, offset: 8992)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !140, file: !17, line: 245, baseType: !317, size: 16, offset: 9008)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !140, file: !17, line: 246, baseType: !272, size: 128, offset: 9024)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !140, file: !17, line: 248, baseType: !77, size: 32, offset: 9152)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !140, file: !17, line: 249, baseType: !77, size: 32, offset: 9184)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !140, file: !17, line: 251, baseType: !338, size: 64, offset: 9216)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !17, line: 251, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !140, file: !17, line: 253, baseType: !62, size: 8, offset: 9280)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !140, file: !17, line: 254, baseType: !62, size: 8, offset: 9288)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !140, file: !17, line: 255, baseType: !75, size: 16, offset: 9296)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !140, file: !17, line: 256, baseType: !199, size: 96, offset: 9312)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !140, file: !17, line: 258, baseType: !102, size: 128, offset: 9408)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !140, file: !17, line: 259, baseType: !102, size: 128, offset: 9536)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !140, file: !17, line: 260, baseType: !102, size: 128, offset: 9664)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !140, file: !17, line: 261, baseType: !102, size: 128, offset: 9792)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !140, file: !17, line: 263, baseType: !349, size: 64, offset: 9920)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !17, line: 52, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !140, file: !17, line: 264, baseType: !352, size: 64, offset: 9984)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !17, line: 53, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !140, file: !17, line: 265, baseType: !355, size: 64, offset: 10048)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !173, line: 46, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !140, file: !17, line: 267, baseType: !62, size: 8, offset: 10112)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !140, file: !17, line: 268, baseType: !62, size: 8, offset: 10120)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !140, file: !17, line: 269, baseType: !75, size: 16, offset: 10128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !140, file: !17, line: 270, baseType: !124, size: 32, offset: 10144)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !140, file: !17, line: 272, baseType: !362, size: 64, offset: 10176)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !17, line: 54, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !140, file: !17, line: 275, baseType: !365, size: 64, offset: 10240)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !17, line: 275, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !140, file: !17, line: 277, baseType: !368, size: 64, offset: 10304)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !17, line: 56, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !140, file: !17, line: 277, baseType: !368, size: 64, offset: 10368)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !140, file: !17, line: 278, baseType: !372, size: 64, offset: 10432)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !373, line: 27, baseType: !374)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !375, line: 45, baseType: !376)
!375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!376 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !140, file: !17, line: 279, baseType: !372, size: 64, offset: 10496)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !17, line: 280, baseType: !5, size: 32, offset: 10560)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !140, file: !17, line: 281, baseType: !5, size: 32, offset: 10592)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !140, file: !17, line: 283, baseType: !102, size: 128, offset: 10624)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !140, file: !17, line: 284, baseType: !102, size: 128, offset: 10752)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !140, file: !17, line: 285, baseType: !383, size: 64, offset: 10880)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !140, file: !17, line: 287, baseType: !385, size: 64, offset: 10944)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !17, line: 59, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !140, file: !17, line: 288, baseType: !388, size: 64, offset: 11008)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !17, line: 288, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !140, file: !17, line: 290, baseType: !391, size: 64, offset: 11072)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 64, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 2)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !140, file: !17, line: 291, baseType: !395, size: 64, offset: 11136)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !397, line: 65, baseType: !398)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !397, line: 50, size: 320, elements: !399)
!399 = !{!400, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !398, file: !397, line: 51, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !403, line: 1216, size: 39680, elements: !404)
!403 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!404 = !{!405, !406, !407, !408, !411, !412, !413, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !439, !443, !446, !742, !745, !1045, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1067, !1068, !1069, !1070, !1071, !1079, !1146, !1153, !1154, !1161, !1369, !1370, !1371, !1372, !1373, !1374}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !402, file: !403, line: 1217, baseType: !42, size: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !402, file: !403, line: 1218, baseType: !118, size: 64, offset: 960)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !402, file: !403, line: 1220, baseType: !139, size: 64, offset: 1024)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !402, file: !403, line: 1221, baseType: !409, size: 64, offset: 1088)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !403, line: 52, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !402, file: !403, line: 1223, baseType: !401, size: 64, offset: 1152)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !402, file: !403, line: 1225, baseType: !102, size: 128, offset: 1216)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !402, file: !403, line: 1226, baseType: !414, size: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !403, line: 69, size: 320, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !415, file: !403, line: 70, baseType: !414, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !415, file: !403, line: 70, baseType: !414, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !415, file: !403, line: 71, baseType: !5, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !415, file: !403, line: 71, baseType: !5, size: 32, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !403, line: 72, baseType: !77, size: 32, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !415, file: !403, line: 73, baseType: !75, size: 16, offset: 224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !415, file: !403, line: 73, baseType: !75, size: 16, offset: 240)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !415, file: !403, line: 74, baseType: !139, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !402, file: !403, line: 1227, baseType: !139, size: 64, offset: 1408)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !402, file: !403, line: 1229, baseType: !199, size: 96, offset: 1472)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !402, file: !403, line: 1230, baseType: !199, size: 96, offset: 1568)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !402, file: !403, line: 1231, baseType: !199, size: 96, offset: 1664)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !402, file: !403, line: 1231, baseType: !199, size: 96, offset: 1760)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !402, file: !403, line: 1233, baseType: !5, size: 32, offset: 1856)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !402, file: !403, line: 1234, baseType: !77, size: 32, offset: 1888)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !402, file: !403, line: 1235, baseType: !5, size: 32, offset: 1920)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !403, line: 1237, baseType: !75, size: 16, offset: 1952)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !402, file: !403, line: 1239, baseType: !62, size: 8, offset: 1968)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !403, line: 1240, baseType: !436, size: 8, offset: 1976)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 1)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !402, file: !403, line: 1242, baseType: !440, size: 64, offset: 1984)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !442, line: 43, flags: DIFlagFwdDecl)
!442 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lamp_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !402, file: !403, line: 1244, baseType: !444, size: 64, offset: 2048)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !403, line: 59, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !402, file: !403, line: 1246, baseType: !447, size: 64, offset: 2112)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !403, line: 1067, size: 5184, elements: !449)
!449 = !{!450, !481, !482, !497, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !519, !614, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !663, !664, !665, !666, !667, !668, !669, !670, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !725}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !448, file: !403, line: 1068, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !403, line: 934, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !403, line: 925, size: 576, elements: !454)
!454 = !{!455, !472, !473, !474, !475, !477, !480}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !453, file: !403, line: 926, baseType: !456, size: 320)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !403, line: 830, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !403, line: 813, size: 320, elements: !458)
!458 = !{!459, !462, !465, !466, !469, !470, !471}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !457, file: !403, line: 814, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !403, line: 51, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !457, file: !403, line: 815, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !403, line: 815, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !457, file: !403, line: 818, baseType: !47, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !457, file: !403, line: 819, baseType: !467, size: 32, offset: 192)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 32, elements: !273)
!468 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !457, file: !403, line: 822, baseType: !77, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !457, file: !403, line: 826, baseType: !77, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !457, file: !403, line: 829, baseType: !77, size: 32, offset: 288)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !403, line: 928, baseType: !75, size: 16, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !453, file: !403, line: 928, baseType: !75, size: 16, offset: 336)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !453, file: !403, line: 929, baseType: !77, size: 32, offset: 352)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !453, file: !403, line: 930, baseType: !476, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !453, file: !403, line: 931, baseType: !478, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !403, line: 931, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !453, file: !403, line: 933, baseType: !47, size: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !448, file: !403, line: 1069, baseType: !451, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !448, file: !403, line: 1070, baseType: !483, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !403, line: 916, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !403, line: 891, size: 704, elements: !486)
!486 = !{!487, !488, !489, !491, !492, !493, !494, !495, !496}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !485, file: !403, line: 892, baseType: !456, size: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !403, line: 896, baseType: !77, size: 32, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !485, file: !403, line: 900, baseType: !490, size: 96, offset: 352)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 96, elements: !200)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !485, file: !403, line: 903, baseType: !124, size: 32, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !485, file: !403, line: 906, baseType: !77, size: 32, offset: 480)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !485, file: !403, line: 909, baseType: !124, size: 32, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !485, file: !403, line: 912, baseType: !124, size: 32, offset: 544)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !485, file: !403, line: 914, baseType: !139, size: 64, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !485, file: !403, line: 915, baseType: !47, size: 64, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !448, file: !403, line: 1071, baseType: !498, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !403, line: 920, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !403, line: 918, size: 320, elements: !501)
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !500, file: !403, line: 919, baseType: !456, size: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !448, file: !403, line: 1075, baseType: !124, size: 32, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !448, file: !403, line: 1077, baseType: !124, size: 32, offset: 288)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !448, file: !403, line: 1078, baseType: !124, size: 32, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !448, file: !403, line: 1079, baseType: !75, size: 16, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !448, file: !403, line: 1082, baseType: !75, size: 16, offset: 368)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !448, file: !403, line: 1085, baseType: !62, size: 8, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !448, file: !403, line: 1086, baseType: !62, size: 8, offset: 392)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !448, file: !403, line: 1087, baseType: !62, size: 8, offset: 400)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !448, file: !403, line: 1088, baseType: !62, size: 8, offset: 408)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !448, file: !403, line: 1090, baseType: !124, size: 32, offset: 416)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !448, file: !403, line: 1093, baseType: !75, size: 16, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !448, file: !403, line: 1096, baseType: !62, size: 8, offset: 464)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !448, file: !403, line: 1098, baseType: !516, size: 40, offset: 472)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 40, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 5)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !448, file: !403, line: 1101, baseType: !520, size: 832, offset: 512)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !403, line: 836, size: 832, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !529, !530, !531, !610, !611, !612, !613}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !520, file: !403, line: 837, baseType: !456, size: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !520, file: !403, line: 839, baseType: !75, size: 16, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !520, file: !403, line: 839, baseType: !75, size: 16, offset: 336)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !520, file: !403, line: 842, baseType: !75, size: 16, offset: 352)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !520, file: !403, line: 842, baseType: !75, size: 16, offset: 368)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !520, file: !403, line: 843, baseType: !528, size: 32, offset: 384)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32, elements: !392)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !520, file: !403, line: 845, baseType: !77, size: 32, offset: 416)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !520, file: !403, line: 847, baseType: !47, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !520, file: !403, line: 848, baseType: !532, size: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !397, line: 77, size: 15424, elements: !534)
!534 = !{!535, !536, !537, !540, !543, !546, !549, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !599, !600, !604}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !533, file: !397, line: 78, baseType: !42, size: 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !397, line: 80, baseType: !61, size: 8192, offset: 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !533, file: !397, line: 82, baseType: !538, size: 64, offset: 9152)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !397, line: 43, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !533, file: !397, line: 83, baseType: !541, size: 64, offset: 9216)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !43, line: 46, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !533, file: !397, line: 86, baseType: !544, size: 64, offset: 9280)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !397, line: 41, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !533, file: !397, line: 87, baseType: !547, size: 64, offset: 9344)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !397, line: 44, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !533, file: !397, line: 89, baseType: !550, size: 512, offset: 9408)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 512, elements: !551)
!551 = !{!166}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !533, file: !397, line: 90, baseType: !75, size: 16, offset: 9920)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !533, file: !397, line: 90, baseType: !75, size: 16, offset: 9936)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !533, file: !397, line: 92, baseType: !75, size: 16, offset: 9952)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !533, file: !397, line: 92, baseType: !75, size: 16, offset: 9968)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !533, file: !397, line: 93, baseType: !75, size: 16, offset: 9984)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !533, file: !397, line: 93, baseType: !75, size: 16, offset: 10000)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !533, file: !397, line: 94, baseType: !77, size: 32, offset: 10016)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !533, file: !397, line: 97, baseType: !75, size: 16, offset: 10048)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !533, file: !397, line: 97, baseType: !75, size: 16, offset: 10064)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !533, file: !397, line: 98, baseType: !75, size: 16, offset: 10080)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !533, file: !397, line: 98, baseType: !75, size: 16, offset: 10096)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !533, file: !397, line: 99, baseType: !75, size: 16, offset: 10112)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !533, file: !397, line: 99, baseType: !75, size: 16, offset: 10128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !533, file: !397, line: 100, baseType: !5, size: 32, offset: 10144)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !533, file: !397, line: 101, baseType: !476, size: 64, offset: 10176)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !533, file: !397, line: 103, baseType: !68, size: 64, offset: 10240)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !533, file: !397, line: 104, baseType: !569, size: 64, offset: 10304)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !43, line: 159, size: 448, elements: !571)
!571 = !{!572, !574, !575, !576, !577, !579}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !570, file: !43, line: 161, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !392)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !570, file: !43, line: 162, baseType: !573, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !570, file: !43, line: 163, baseType: !528, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !570, file: !43, line: 164, baseType: !528, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !570, file: !43, line: 165, baseType: !578, size: 128, offset: 192)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 128, elements: !392)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !570, file: !43, line: 166, baseType: !580, size: 128, offset: 320)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 128, elements: !392)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !533, file: !397, line: 107, baseType: !124, size: 32, offset: 10368)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !533, file: !397, line: 108, baseType: !77, size: 32, offset: 10400)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !533, file: !397, line: 109, baseType: !75, size: 16, offset: 10432)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !533, file: !397, line: 110, baseType: !75, size: 16, offset: 10448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !533, file: !397, line: 113, baseType: !77, size: 32, offset: 10464)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !533, file: !397, line: 113, baseType: !77, size: 32, offset: 10496)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !533, file: !397, line: 114, baseType: !62, size: 8, offset: 10528)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !533, file: !397, line: 114, baseType: !62, size: 8, offset: 10536)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !533, file: !397, line: 115, baseType: !75, size: 16, offset: 10544)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !533, file: !397, line: 116, baseType: !272, size: 128, offset: 10560)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !533, file: !397, line: 119, baseType: !124, size: 32, offset: 10688)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !533, file: !397, line: 119, baseType: !124, size: 32, offset: 10720)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !533, file: !397, line: 122, baseType: !594, size: 512, offset: 10752)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !595, line: 182, baseType: !596)
!595 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !595, line: 180, size: 512, elements: !597)
!597 = !{!598}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !595, line: 181, baseType: !92, size: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !533, file: !397, line: 123, baseType: !62, size: 8, offset: 11264)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !533, file: !397, line: 125, baseType: !601, size: 56, offset: 11272)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 56, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 7)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !533, file: !397, line: 126, baseType: !605, size: 4096, offset: 11328)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 4096, elements: !551)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !397, line: 69, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !397, line: 67, size: 512, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !607, file: !397, line: 68, baseType: !92, size: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !520, file: !403, line: 849, baseType: !532, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !520, file: !403, line: 850, baseType: !532, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !520, file: !403, line: 851, baseType: !199, size: 96, offset: 704)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !520, file: !403, line: 852, baseType: !124, size: 32, offset: 800)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !448, file: !403, line: 1104, baseType: !615, size: 1344, offset: 1344)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !403, line: 867, size: 1344, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !615, file: !403, line: 868, baseType: !75, size: 16)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !615, file: !403, line: 869, baseType: !75, size: 16, offset: 16)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !615, file: !403, line: 870, baseType: !75, size: 16, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !615, file: !403, line: 871, baseType: !75, size: 16, offset: 48)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !615, file: !403, line: 873, baseType: !622, size: 896, offset: 64)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 896, elements: !602)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !403, line: 864, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !403, line: 859, size: 128, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !624, file: !403, line: 860, baseType: !75, size: 16)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !624, file: !403, line: 861, baseType: !75, size: 16, offset: 16)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !624, file: !403, line: 861, baseType: !75, size: 16, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !624, file: !403, line: 861, baseType: !75, size: 16, offset: 48)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !624, file: !403, line: 862, baseType: !77, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !624, file: !403, line: 863, baseType: !124, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !615, file: !403, line: 874, baseType: !47, size: 64, offset: 960)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !615, file: !403, line: 876, baseType: !124, size: 32, offset: 1024)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !615, file: !403, line: 876, baseType: !124, size: 32, offset: 1056)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !615, file: !403, line: 878, baseType: !77, size: 32, offset: 1088)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !615, file: !403, line: 879, baseType: !77, size: 32, offset: 1120)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !615, file: !403, line: 881, baseType: !77, size: 32, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !615, file: !403, line: 881, baseType: !77, size: 32, offset: 1184)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !615, file: !403, line: 883, baseType: !401, size: 64, offset: 1216)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !615, file: !403, line: 884, baseType: !139, size: 64, offset: 1280)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !448, file: !403, line: 1107, baseType: !124, size: 32, offset: 2688)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !448, file: !403, line: 1110, baseType: !124, size: 32, offset: 2720)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !448, file: !403, line: 1113, baseType: !75, size: 16, offset: 2752)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !448, file: !403, line: 1113, baseType: !75, size: 16, offset: 2768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !448, file: !403, line: 1116, baseType: !62, size: 8, offset: 2784)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !448, file: !403, line: 1117, baseType: !436, size: 8, offset: 2792)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !448, file: !403, line: 1120, baseType: !75, size: 16, offset: 2800)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !448, file: !403, line: 1121, baseType: !124, size: 32, offset: 2816)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !448, file: !403, line: 1122, baseType: !124, size: 32, offset: 2848)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !448, file: !403, line: 1123, baseType: !124, size: 32, offset: 2880)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !448, file: !403, line: 1124, baseType: !124, size: 32, offset: 2912)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !448, file: !403, line: 1125, baseType: !124, size: 32, offset: 2944)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !448, file: !403, line: 1126, baseType: !124, size: 32, offset: 2976)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !448, file: !403, line: 1127, baseType: !124, size: 32, offset: 3008)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !448, file: !403, line: 1128, baseType: !124, size: 32, offset: 3040)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !448, file: !403, line: 1129, baseType: !124, size: 32, offset: 3072)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !448, file: !403, line: 1130, baseType: !124, size: 32, offset: 3104)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !448, file: !403, line: 1131, baseType: !75, size: 16, offset: 3136)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !448, file: !403, line: 1132, baseType: !62, size: 8, offset: 3152)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !448, file: !403, line: 1133, baseType: !62, size: 8, offset: 3160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !448, file: !403, line: 1134, baseType: !662, size: 24, offset: 3168)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 24, elements: !200)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !448, file: !403, line: 1135, baseType: !62, size: 8, offset: 3192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !448, file: !403, line: 1138, baseType: !139, size: 64, offset: 3200)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !448, file: !403, line: 1139, baseType: !62, size: 8, offset: 3264)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !448, file: !403, line: 1140, baseType: !62, size: 8, offset: 3272)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !448, file: !403, line: 1141, baseType: !62, size: 8, offset: 3280)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !448, file: !403, line: 1142, baseType: !62, size: 8, offset: 3288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !448, file: !403, line: 1143, baseType: !62, size: 8, offset: 3296)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !448, file: !403, line: 1144, baseType: !671, size: 64, offset: 3304)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 64, elements: !551)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !448, file: !403, line: 1145, baseType: !671, size: 64, offset: 3368)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !448, file: !403, line: 1148, baseType: !62, size: 8, offset: 3432)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !448, file: !403, line: 1149, baseType: !62, size: 8, offset: 3440)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !448, file: !403, line: 1152, baseType: !62, size: 8, offset: 3448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !448, file: !403, line: 1152, baseType: !62, size: 8, offset: 3456)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !448, file: !403, line: 1153, baseType: !62, size: 8, offset: 3464)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !448, file: !403, line: 1154, baseType: !75, size: 16, offset: 3472)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !448, file: !403, line: 1154, baseType: !75, size: 16, offset: 3488)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !448, file: !403, line: 1155, baseType: !75, size: 16, offset: 3504)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !448, file: !403, line: 1155, baseType: !75, size: 16, offset: 3520)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !448, file: !403, line: 1156, baseType: !62, size: 8, offset: 3536)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !448, file: !403, line: 1157, baseType: !62, size: 8, offset: 3544)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !448, file: !403, line: 1159, baseType: !62, size: 8, offset: 3552)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !448, file: !403, line: 1160, baseType: !62, size: 8, offset: 3560)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !448, file: !403, line: 1161, baseType: !62, size: 8, offset: 3568)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !448, file: !403, line: 1162, baseType: !62, size: 8, offset: 3576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !448, file: !403, line: 1165, baseType: !77, size: 32, offset: 3584)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !448, file: !403, line: 1166, baseType: !77, size: 32, offset: 3616)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !448, file: !403, line: 1167, baseType: !77, size: 32, offset: 3648)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !448, file: !403, line: 1168, baseType: !77, size: 32, offset: 3680)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !448, file: !403, line: 1171, baseType: !75, size: 16, offset: 3712)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !448, file: !403, line: 1171, baseType: !75, size: 16, offset: 3728)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !448, file: !403, line: 1172, baseType: !77, size: 32, offset: 3744)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !448, file: !403, line: 1173, baseType: !124, size: 32, offset: 3776)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !448, file: !403, line: 1174, baseType: !124, size: 32, offset: 3808)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !448, file: !403, line: 1177, baseType: !698, size: 1024, offset: 3840)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !403, line: 963, size: 1024, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !723, !724}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !698, file: !403, line: 965, baseType: !77, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !698, file: !403, line: 968, baseType: !124, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !698, file: !403, line: 971, baseType: !124, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !698, file: !403, line: 974, baseType: !124, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !698, file: !403, line: 977, baseType: !199, size: 96, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !698, file: !403, line: 979, baseType: !199, size: 96, offset: 224)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !698, file: !403, line: 982, baseType: !77, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !698, file: !403, line: 987, baseType: !391, size: 64, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !698, file: !403, line: 989, baseType: !124, size: 32, offset: 416)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !698, file: !403, line: 994, baseType: !77, size: 32, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !698, file: !403, line: 995, baseType: !77, size: 32, offset: 480)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !698, file: !403, line: 997, baseType: !62, size: 8, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !698, file: !403, line: 998, baseType: !601, size: 56, offset: 520)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !698, file: !403, line: 1000, baseType: !124, size: 32, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !698, file: !403, line: 1003, baseType: !391, size: 64, offset: 608)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !698, file: !403, line: 1006, baseType: !77, size: 32, offset: 672)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !698, file: !403, line: 1009, baseType: !124, size: 32, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !698, file: !403, line: 1012, baseType: !391, size: 64, offset: 736)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !698, file: !403, line: 1015, baseType: !391, size: 64, offset: 800)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !698, file: !403, line: 1018, baseType: !77, size: 32, offset: 864)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !698, file: !403, line: 1019, baseType: !721, size: 64, offset: 896)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !403, line: 63, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !698, file: !403, line: 1023, baseType: !124, size: 32, offset: 960)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !698, file: !403, line: 1024, baseType: !77, size: 32, offset: 992)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !448, file: !403, line: 1179, baseType: !726, size: 320, offset: 4864)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !403, line: 1043, size: 320, elements: !727)
!727 = !{!728, !729, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !726, file: !403, line: 1044, baseType: !62, size: 8)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !726, file: !403, line: 1045, baseType: !730, size: 16, offset: 8)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 16, elements: !392)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !726, file: !403, line: 1048, baseType: !62, size: 8, offset: 24)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !726, file: !403, line: 1049, baseType: !124, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !726, file: !403, line: 1049, baseType: !124, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !726, file: !403, line: 1052, baseType: !124, size: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !726, file: !403, line: 1052, baseType: !124, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !726, file: !403, line: 1053, baseType: !62, size: 8, offset: 160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !726, file: !403, line: 1054, baseType: !662, size: 24, offset: 168)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !726, file: !403, line: 1057, baseType: !124, size: 32, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !726, file: !403, line: 1057, baseType: !124, size: 32, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !726, file: !403, line: 1060, baseType: !124, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !726, file: !403, line: 1060, baseType: !124, size: 32, offset: 288)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !402, file: !403, line: 1247, baseType: !743, size: 64, offset: 2176)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !403, line: 60, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !402, file: !403, line: 1251, baseType: !746, size: 31872, offset: 2240)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !403, line: 403, size: 31872, elements: !747)
!747 = !{!748, !831, !851, !860, !880, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1021, !1022, !1023, !1027, !1043, !1044}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !746, file: !403, line: 404, baseType: !749, size: 1984)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !403, line: 259, size: 1984, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !768, !826}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !749, file: !403, line: 260, baseType: !62, size: 8)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !749, file: !403, line: 263, baseType: !62, size: 8, offset: 8)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !749, file: !403, line: 266, baseType: !62, size: 8, offset: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !749, file: !403, line: 267, baseType: !62, size: 8, offset: 24)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !749, file: !403, line: 269, baseType: !62, size: 8, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !749, file: !403, line: 270, baseType: !62, size: 8, offset: 40)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !749, file: !403, line: 276, baseType: !62, size: 8, offset: 48)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !749, file: !403, line: 279, baseType: !62, size: 8, offset: 56)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !749, file: !403, line: 280, baseType: !75, size: 16, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !749, file: !403, line: 280, baseType: !75, size: 16, offset: 80)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !749, file: !403, line: 281, baseType: !124, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !749, file: !403, line: 284, baseType: !62, size: 8, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !749, file: !403, line: 285, baseType: !62, size: 8, offset: 136)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !749, file: !403, line: 287, baseType: !765, size: 48, offset: 144)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 48, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 6)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !749, file: !403, line: 290, baseType: !769, size: 1280, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !595, line: 174, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !595, line: 166, size: 1280, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !825}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !770, file: !595, line: 167, baseType: !77, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !770, file: !595, line: 167, baseType: !77, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !770, file: !595, line: 168, baseType: !92, size: 512, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !770, file: !595, line: 169, baseType: !92, size: 512, offset: 576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !770, file: !595, line: 170, baseType: !124, size: 32, offset: 1088)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !770, file: !595, line: 171, baseType: !124, size: 32, offset: 1120)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !770, file: !595, line: 172, baseType: !779, size: 64, offset: 1152)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !595, line: 72, size: 3072, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !795, !796, !821, !822, !823, !824}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !780, file: !595, line: 73, baseType: !77, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !780, file: !595, line: 73, baseType: !77, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !780, file: !595, line: 74, baseType: !77, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !780, file: !595, line: 75, baseType: !77, size: 32, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !780, file: !595, line: 77, baseType: !787, size: 128, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !788, line: 95, baseType: !789)
!788 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !788, line: 92, size: 128, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !789, file: !788, line: 93, baseType: !124, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !789, file: !788, line: 93, baseType: !124, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !789, file: !788, line: 94, baseType: !124, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !789, file: !788, line: 94, baseType: !124, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !780, file: !595, line: 77, baseType: !787, size: 128, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !780, file: !595, line: 79, baseType: !797, size: 2304, offset: 384)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 2304, elements: !273)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !595, line: 67, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !595, line: 55, size: 576, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !817, !818, !819, !820}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !799, file: !595, line: 56, baseType: !75, size: 16)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !799, file: !595, line: 56, baseType: !75, size: 16, offset: 16)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !799, file: !595, line: 58, baseType: !124, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !799, file: !595, line: 59, baseType: !124, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !799, file: !595, line: 59, baseType: !124, size: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !799, file: !595, line: 60, baseType: !391, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !799, file: !595, line: 60, baseType: !391, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !799, file: !595, line: 61, baseType: !809, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !595, line: 47, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !595, line: 44, size: 96, elements: !812)
!812 = !{!813, !814, !815, !816}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !811, file: !595, line: 45, baseType: !124, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !811, file: !595, line: 45, baseType: !124, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !811, file: !595, line: 46, baseType: !75, size: 16, offset: 64)
