; ModuleID = 'blender/source/blender/gpu/intern/gpu_material.c'
source_filename = "blender/source/blender/gpu/intern/gpu_material.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "builtins", scope: !2, file: !3, line: 2062, type: !3005, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "GPU_shader_export", scope: !3, file: !3, line: 2056, type: !4, scopeLine: 2057, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2709, retainedNodes: !2998)
!3 = !DIFile(filename: "blender/source/blender/gpu/intern/gpu_material.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !24, !220}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUShaderExport", file: !8, line: 239, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUShaderExport", file: !8, line: 234, size: 384, elements: !10)
!10 = !{!11, !19, !20, !23}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "uniforms", scope: !9, file: !8, line: 235, baseType: !12, size: 128)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !13, line: 71, baseType: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !13, line: 69, size: 128, elements: !15)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !14, file: !13, line: 70, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !14, file: !13, line: 70, baseType: !17, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !9, file: !8, line: 236, baseType: !12, size: 128, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "vertex", scope: !9, file: !8, line: 237, baseType: !21, size: 64, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !9, file: !8, line: 238, baseType: !21, size: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !26, line: 1216, size: 39680, elements: !27)
!26 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !92, !96, !2006, !2087, !2088, !2089, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2116, !2337, !2340, !2583, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2605, !2606, !2607, !2608, !2609, !2617, !2683, !2690, !2691, !2698, !2701, !2702, !2703, !2704, !2705, !2706}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !25, file: !26, line: 1217, baseType: !29, size: 960)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !30, line: 130, baseType: !31)
!30 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !30, line: 117, size: 960, elements: !32)
!32 = !{!33, !34, !35, !37, !56, !60, !62, !64, !65, !66}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !30, line: 118, baseType: !17, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !31, file: !30, line: 118, baseType: !17, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !31, file: !30, line: 119, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !31, file: !30, line: 120, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !30, line: 136, size: 17600, elements: !40)
!40 = !{!41, !42, !44, !47, !51, !52, !53}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !39, file: !30, line: 137, baseType: !29, size: 960)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !39, file: !30, line: 138, baseType: !43, size: 64, offset: 960)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !39, file: !30, line: 139, baseType: !45, size: 64, offset: 1024)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !30, line: 43, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !30, line: 140, baseType: !48, size: 8192, offset: 1088)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8192, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 1024)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !39, file: !30, line: 141, baseType: !48, size: 8192, offset: 9280)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !39, file: !30, line: 148, baseType: !38, size: 64, offset: 17472)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !39, file: !30, line: 150, baseType: !54, size: 64, offset: 17536)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !30, line: 45, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !31, file: !30, line: 121, baseType: !57, size: 528, offset: 256)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 528, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 66)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !31, file: !30, line: 126, baseType: !61, size: 16, offset: 784)
!61 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !31, file: !30, line: 127, baseType: !63, size: 32, offset: 800)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !31, file: !30, line: 128, baseType: !63, size: 32, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !31, file: !30, line: 128, baseType: !63, size: 32, offset: 864)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !31, file: !30, line: 129, baseType: !67, size: 64, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !30, line: 75, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !30, line: 62, size: 1024, elements: !70)
!70 = !{!71, !73, !74, !75, !76, !77, !81, !82, !90, !91}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !69, file: !30, line: 63, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !69, file: !30, line: 63, baseType: !72, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !30, line: 64, baseType: !22, size: 8, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !69, file: !30, line: 64, baseType: !22, size: 8, offset: 136)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !69, file: !30, line: 65, baseType: !61, size: 16, offset: 144)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !30, line: 66, baseType: !78, size: 512, offset: 160)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !69, file: !30, line: 67, baseType: !63, size: 32, offset: 672)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !69, file: !30, line: 69, baseType: !83, size: 256, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !30, line: 60, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !30, line: 48, size: 256, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !84, file: !30, line: 49, baseType: !17, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !84, file: !30, line: 58, baseType: !12, size: 128, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !84, file: !30, line: 59, baseType: !63, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !84, file: !30, line: 59, baseType: !63, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !69, file: !30, line: 70, baseType: !63, size: 32, offset: 960)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !69, file: !30, line: 74, baseType: !63, size: 32, offset: 992)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !25, file: !26, line: 1218, baseType: !93, size: 64, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !95, line: 42, flags: DIFlagFwdDecl)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lamp_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !25, file: !26, line: 1220, baseType: !97, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !99, line: 115, size: 11392, elements: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = !{!101, !102, !103, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !120, !132, !146, !147, !191, !192, !195, !196, !212, !213, !214, !215, !216, !217, !218, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1528, !1531, !1532, !1533, !1534, !1535, !1536, !1539, !1542, !1970, !1971, !1977, !1978, !1979, !1980, !1981, !1982, !1984, !1987, !1990, !1991, !1994, !1995}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !98, file: !99, line: 116, baseType: !29, size: 960)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !98, file: !99, line: 117, baseType: !93, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !98, file: !99, line: 119, baseType: !104, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !99, line: 57, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !99, line: 121, baseType: !61, size: 16, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !98, file: !99, line: 121, baseType: !61, size: 16, offset: 1104)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !98, file: !99, line: 122, baseType: !63, size: 32, offset: 1120)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !98, file: !99, line: 122, baseType: !63, size: 32, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !98, file: !99, line: 122, baseType: !63, size: 32, offset: 1184)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !98, file: !99, line: 123, baseType: !78, size: 512, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !98, file: !99, line: 124, baseType: !97, size: 64, offset: 1728)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !98, file: !99, line: 124, baseType: !97, size: 64, offset: 1792)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !98, file: !99, line: 127, baseType: !97, size: 64, offset: 1856)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !98, file: !99, line: 127, baseType: !97, size: 64, offset: 1920)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !98, file: !99, line: 127, baseType: !97, size: 64, offset: 1984)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !98, file: !99, line: 128, baseType: !118, size: 64, offset: 2048)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !95, line: 45, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !98, file: !99, line: 130, baseType: !121, size: 64, offset: 2112)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !99, line: 97, size: 832, elements: !123)
!123 = !{!124, !130, !131}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !122, file: !99, line: 98, baseType: !125, size: 768)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 768, elements: !127)
!126 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!127 = !{!128, !129}
!128 = !DISubrange(count: 8)
!129 = !DISubrange(count: 3)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !122, file: !99, line: 99, baseType: !63, size: 32, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !122, file: !99, line: 99, baseType: !63, size: 32, offset: 800)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !98, file: !99, line: 131, baseType: !133, size: 64, offset: 2176)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !135, line: 486, size: 1600, elements: !136)
!135 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !134, file: !135, line: 487, baseType: !29, size: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !134, file: !135, line: 489, baseType: !12, size: 128, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !134, file: !135, line: 490, baseType: !12, size: 128, offset: 1088)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !134, file: !135, line: 491, baseType: !12, size: 128, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !134, file: !135, line: 492, baseType: !12, size: 128, offset: 1344)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !135, line: 494, baseType: !63, size: 32, offset: 1472)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !134, file: !135, line: 495, baseType: !63, size: 32, offset: 1504)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !134, file: !135, line: 497, baseType: !63, size: 32, offset: 1536)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !134, file: !135, line: 498, baseType: !63, size: 32, offset: 1568)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !98, file: !99, line: 132, baseType: !133, size: 64, offset: 2240)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !98, file: !99, line: 133, baseType: !148, size: 64, offset: 2304)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !135, line: 334, size: 1728, elements: !150)
!150 = !{!151, !152, !155, !156, !157, !159, !160, !161, !164, !165, !166, !167, !168, !169, !170, !190}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !149, file: !135, line: 335, baseType: !12, size: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !149, file: !135, line: 336, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !135, line: 47, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !149, file: !135, line: 338, baseType: !61, size: 16, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !149, file: !135, line: 338, baseType: !61, size: 16, offset: 208)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !149, file: !135, line: 339, baseType: !158, size: 32, offset: 224)
!158 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !149, file: !135, line: 340, baseType: !63, size: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !149, file: !135, line: 342, baseType: !126, size: 32, offset: 288)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !149, file: !135, line: 343, baseType: !162, size: 96, offset: 320)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 96, elements: !163)
!163 = !{!129}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !149, file: !135, line: 344, baseType: !162, size: 96, offset: 416)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !149, file: !135, line: 347, baseType: !12, size: 128, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !149, file: !135, line: 349, baseType: !63, size: 32, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !149, file: !135, line: 350, baseType: !63, size: 32, offset: 672)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !149, file: !135, line: 351, baseType: !17, size: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !149, file: !135, line: 352, baseType: !17, size: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !149, file: !135, line: 354, baseType: !171, size: 384, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !135, line: 116, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !135, line: 94, size: 384, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !172, file: !135, line: 96, baseType: !63, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !172, file: !135, line: 96, baseType: !63, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !172, file: !135, line: 97, baseType: !63, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !172, file: !135, line: 97, baseType: !63, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !172, file: !135, line: 99, baseType: !61, size: 16, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !172, file: !135, line: 100, baseType: !61, size: 16, offset: 144)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !172, file: !135, line: 102, baseType: !61, size: 16, offset: 160)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !172, file: !135, line: 105, baseType: !61, size: 16, offset: 176)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !172, file: !135, line: 108, baseType: !61, size: 16, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !172, file: !135, line: 109, baseType: !61, size: 16, offset: 208)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !172, file: !135, line: 111, baseType: !61, size: 16, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !172, file: !135, line: 112, baseType: !61, size: 16, offset: 240)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !172, file: !135, line: 114, baseType: !63, size: 32, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !172, file: !135, line: 114, baseType: !63, size: 32, offset: 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !172, file: !135, line: 115, baseType: !63, size: 32, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !172, file: !135, line: 115, baseType: !63, size: 32, offset: 352)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !149, file: !135, line: 355, baseType: !78, size: 512, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !99, line: 134, baseType: !17, size: 64, offset: 2368)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !98, file: !99, line: 136, baseType: !193, size: 64, offset: 2432)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !99, line: 58, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !98, file: !99, line: 138, baseType: !171, size: 384, offset: 2496)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !98, file: !99, line: 139, baseType: !197, size: 64, offset: 2880)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !135, line: 80, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !135, line: 72, size: 192, elements: !200)
!200 = !{!201, !208, !209, !210, !211}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !199, file: !135, line: 73, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !135, line: 59, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !135, line: 56, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !204, file: !135, line: 57, baseType: !162, size: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !204, file: !135, line: 58, baseType: !63, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !199, file: !135, line: 74, baseType: !63, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !199, file: !135, line: 76, baseType: !63, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !199, file: !135, line: 77, baseType: !63, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !199, file: !135, line: 79, baseType: !63, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !98, file: !99, line: 141, baseType: !12, size: 128, offset: 2944)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !98, file: !99, line: 142, baseType: !12, size: 128, offset: 3072)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !98, file: !99, line: 143, baseType: !12, size: 128, offset: 3200)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !98, file: !99, line: 144, baseType: !12, size: 128, offset: 3328)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !98, file: !99, line: 146, baseType: !63, size: 32, offset: 3456)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !98, file: !99, line: 147, baseType: !63, size: 32, offset: 3488)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !98, file: !99, line: 150, baseType: !219, size: 64, offset: 3520)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !222, line: 93, size: 7552, elements: !223)
!222 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !272, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !341, !342, !343, !344, !345, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !1399, !1400, !1401, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1441}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !221, file: !222, line: 94, baseType: !29, size: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !221, file: !222, line: 95, baseType: !93, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !221, file: !222, line: 97, baseType: !61, size: 16, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !222, line: 97, baseType: !61, size: 16, offset: 1040)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !221, file: !222, line: 99, baseType: !126, size: 32, offset: 1056)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !221, file: !222, line: 99, baseType: !126, size: 32, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !221, file: !222, line: 99, baseType: !126, size: 32, offset: 1120)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !221, file: !222, line: 100, baseType: !126, size: 32, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !221, file: !222, line: 100, baseType: !126, size: 32, offset: 1184)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !221, file: !222, line: 100, baseType: !126, size: 32, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !221, file: !222, line: 101, baseType: !126, size: 32, offset: 1248)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !221, file: !222, line: 101, baseType: !126, size: 32, offset: 1280)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !221, file: !222, line: 101, baseType: !126, size: 32, offset: 1312)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !221, file: !222, line: 102, baseType: !126, size: 32, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !221, file: !222, line: 102, baseType: !126, size: 32, offset: 1376)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !221, file: !222, line: 102, baseType: !126, size: 32, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !221, file: !222, line: 103, baseType: !126, size: 32, offset: 1440)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !221, file: !222, line: 103, baseType: !126, size: 32, offset: 1472)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !221, file: !222, line: 103, baseType: !126, size: 32, offset: 1504)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !221, file: !222, line: 103, baseType: !126, size: 32, offset: 1536)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !221, file: !222, line: 103, baseType: !126, size: 32, offset: 1568)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !221, file: !222, line: 104, baseType: !126, size: 32, offset: 1600)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !221, file: !222, line: 104, baseType: !126, size: 32, offset: 1632)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !221, file: !222, line: 104, baseType: !126, size: 32, offset: 1664)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !221, file: !222, line: 104, baseType: !126, size: 32, offset: 1696)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !221, file: !222, line: 104, baseType: !126, size: 32, offset: 1728)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !221, file: !222, line: 105, baseType: !126, size: 32, offset: 1760)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !221, file: !222, line: 108, baseType: !252, size: 704, offset: 1792)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !222, line: 53, size: 704, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !252, file: !222, line: 54, baseType: !126, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !252, file: !222, line: 55, baseType: !126, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !252, file: !222, line: 56, baseType: !126, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !252, file: !222, line: 57, baseType: !126, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !252, file: !222, line: 59, baseType: !162, size: 96, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !252, file: !222, line: 60, baseType: !162, size: 96, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !252, file: !222, line: 61, baseType: !162, size: 96, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !252, file: !222, line: 63, baseType: !126, size: 32, offset: 416)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !252, file: !222, line: 64, baseType: !126, size: 32, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !252, file: !222, line: 65, baseType: !126, size: 32, offset: 480)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !252, file: !222, line: 67, baseType: !61, size: 16, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !252, file: !222, line: 68, baseType: !61, size: 16, offset: 528)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !252, file: !222, line: 69, baseType: !61, size: 16, offset: 544)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !252, file: !222, line: 70, baseType: !61, size: 16, offset: 560)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !252, file: !222, line: 72, baseType: !126, size: 32, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !252, file: !222, line: 73, baseType: !126, size: 32, offset: 608)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !252, file: !222, line: 74, baseType: !126, size: 32, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !252, file: !222, line: 75, baseType: !126, size: 32, offset: 672)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !221, file: !222, line: 109, baseType: !273, size: 128, offset: 2496)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !222, line: 79, size: 128, elements: !274)
!274 = !{!275, !276, !277, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !273, file: !222, line: 80, baseType: !63, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !273, file: !222, line: 81, baseType: !63, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !273, file: !222, line: 82, baseType: !63, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !273, file: !222, line: 83, baseType: !63, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !221, file: !222, line: 111, baseType: !126, size: 32, offset: 2624)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !221, file: !222, line: 111, baseType: !126, size: 32, offset: 2656)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !221, file: !222, line: 112, baseType: !126, size: 32, offset: 2688)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !221, file: !222, line: 112, baseType: !126, size: 32, offset: 2720)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !221, file: !222, line: 113, baseType: !126, size: 32, offset: 2752)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !221, file: !222, line: 114, baseType: !126, size: 32, offset: 2784)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !221, file: !222, line: 114, baseType: !126, size: 32, offset: 2816)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !221, file: !222, line: 115, baseType: !61, size: 16, offset: 2848)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !221, file: !222, line: 115, baseType: !61, size: 16, offset: 2864)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !221, file: !222, line: 116, baseType: !61, size: 16, offset: 2880)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !221, file: !222, line: 117, baseType: !22, size: 8, offset: 2896)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !221, file: !222, line: 117, baseType: !22, size: 8, offset: 2904)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !221, file: !222, line: 119, baseType: !126, size: 32, offset: 2912)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !221, file: !222, line: 119, baseType: !126, size: 32, offset: 2944)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !221, file: !222, line: 120, baseType: !61, size: 16, offset: 2976)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !221, file: !222, line: 120, baseType: !61, size: 16, offset: 2992)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !221, file: !222, line: 121, baseType: !126, size: 32, offset: 3008)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !221, file: !222, line: 121, baseType: !126, size: 32, offset: 3040)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !221, file: !222, line: 122, baseType: !126, size: 32, offset: 3072)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !221, file: !222, line: 123, baseType: !126, size: 32, offset: 3104)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !221, file: !222, line: 124, baseType: !61, size: 16, offset: 3136)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !221, file: !222, line: 125, baseType: !61, size: 16, offset: 3152)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !221, file: !222, line: 127, baseType: !63, size: 32, offset: 3168)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !221, file: !222, line: 127, baseType: !63, size: 32, offset: 3200)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !221, file: !222, line: 128, baseType: !63, size: 32, offset: 3232)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !221, file: !222, line: 128, baseType: !63, size: 32, offset: 3264)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !221, file: !222, line: 129, baseType: !61, size: 16, offset: 3296)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !221, file: !222, line: 129, baseType: !61, size: 16, offset: 3312)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !221, file: !222, line: 129, baseType: !61, size: 16, offset: 3328)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !221, file: !222, line: 129, baseType: !61, size: 16, offset: 3344)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !221, file: !222, line: 130, baseType: !126, size: 32, offset: 3360)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !221, file: !222, line: 130, baseType: !126, size: 32, offset: 3392)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !221, file: !222, line: 130, baseType: !126, size: 32, offset: 3424)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !221, file: !222, line: 130, baseType: !126, size: 32, offset: 3456)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !221, file: !222, line: 131, baseType: !126, size: 32, offset: 3488)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !221, file: !222, line: 131, baseType: !126, size: 32, offset: 3520)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !221, file: !222, line: 131, baseType: !126, size: 32, offset: 3552)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !221, file: !222, line: 131, baseType: !126, size: 32, offset: 3584)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !221, file: !222, line: 132, baseType: !126, size: 32, offset: 3616)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !221, file: !222, line: 132, baseType: !126, size: 32, offset: 3648)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !221, file: !222, line: 133, baseType: !78, size: 512, offset: 3680)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !221, file: !222, line: 135, baseType: !126, size: 32, offset: 4192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !221, file: !222, line: 136, baseType: !126, size: 32, offset: 4224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !221, file: !222, line: 137, baseType: !126, size: 32, offset: 4256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !221, file: !222, line: 138, baseType: !63, size: 32, offset: 4288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !221, file: !222, line: 141, baseType: !22, size: 8, offset: 4320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !221, file: !222, line: 141, baseType: !22, size: 8, offset: 4328)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !221, file: !222, line: 141, baseType: !22, size: 8, offset: 4336)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !221, file: !222, line: 141, baseType: !22, size: 8, offset: 4344)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !221, file: !222, line: 142, baseType: !61, size: 16, offset: 4352)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !221, file: !222, line: 142, baseType: !61, size: 16, offset: 4368)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !221, file: !222, line: 142, baseType: !61, size: 16, offset: 4384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !221, file: !222, line: 145, baseType: !22, size: 8, offset: 4400)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !221, file: !222, line: 145, baseType: !22, size: 8, offset: 4408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !221, file: !222, line: 148, baseType: !61, size: 16, offset: 4416)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !221, file: !222, line: 148, baseType: !61, size: 16, offset: 4432)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !221, file: !222, line: 149, baseType: !126, size: 32, offset: 4448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !221, file: !222, line: 149, baseType: !126, size: 32, offset: 4480)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !221, file: !222, line: 152, baseType: !338, size: 128, offset: 4512)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 4)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !221, file: !222, line: 153, baseType: !126, size: 32, offset: 4640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !221, file: !222, line: 154, baseType: !126, size: 32, offset: 4672)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !221, file: !222, line: 157, baseType: !61, size: 16, offset: 4704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !221, file: !222, line: 157, baseType: !61, size: 16, offset: 4720)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !221, file: !222, line: 160, baseType: !346, size: 64, offset: 4736)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !348, line: 113, size: 6208, elements: !349)
!348 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = !{!350, !351, !352, !353, !354, !355, !359}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !347, file: !348, line: 114, baseType: !61, size: 16)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !347, file: !348, line: 114, baseType: !61, size: 16, offset: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !347, file: !348, line: 115, baseType: !22, size: 8, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !347, file: !348, line: 115, baseType: !22, size: 8, offset: 40)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !347, file: !348, line: 116, baseType: !22, size: 8, offset: 48)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !347, file: !348, line: 117, baseType: !356, size: 8, offset: 56)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 1)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !348, line: 119, baseType: !360, size: 6144, offset: 64)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 6144, elements: !370)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !348, line: 109, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !348, line: 106, size: 192, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !362, file: !348, line: 107, baseType: !126, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !362, file: !348, line: 107, baseType: !126, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !362, file: !348, line: 107, baseType: !126, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !362, file: !348, line: 107, baseType: !126, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !362, file: !348, line: 107, baseType: !126, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !362, file: !348, line: 108, baseType: !63, size: 32, offset: 160)
!370 = !{!371}
!371 = !DISubrange(count: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !221, file: !222, line: 161, baseType: !346, size: 64, offset: 4800)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !221, file: !222, line: 162, baseType: !22, size: 8, offset: 4864)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !221, file: !222, line: 162, baseType: !22, size: 8, offset: 4872)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !221, file: !222, line: 163, baseType: !22, size: 8, offset: 4880)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !221, file: !222, line: 163, baseType: !22, size: 8, offset: 4888)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !221, file: !222, line: 164, baseType: !61, size: 16, offset: 4896)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !221, file: !222, line: 164, baseType: !61, size: 16, offset: 4912)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !221, file: !222, line: 165, baseType: !126, size: 32, offset: 4928)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !221, file: !222, line: 165, baseType: !126, size: 32, offset: 4960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !221, file: !222, line: 167, baseType: !382, size: 1152, offset: 4992)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 1152, elements: !1397)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !348, line: 57, size: 2496, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !384, file: !348, line: 59, baseType: !61, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !384, file: !348, line: 59, baseType: !61, size: 16, offset: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !384, file: !348, line: 59, baseType: !61, size: 16, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !384, file: !348, line: 59, baseType: !61, size: 16, offset: 48)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !384, file: !348, line: 60, baseType: !97, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !384, file: !348, line: 61, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !348, line: 202, size: 3328, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !464, !1131, !1132, !1209, !1210, !1238, !1239, !1307, !1328, !1336, !1337}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !393, file: !348, line: 203, baseType: !29, size: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !393, file: !348, line: 204, baseType: !93, size: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !393, file: !348, line: 206, baseType: !126, size: 32, offset: 1024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !393, file: !348, line: 206, baseType: !126, size: 32, offset: 1056)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !393, file: !348, line: 207, baseType: !126, size: 32, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !393, file: !348, line: 207, baseType: !126, size: 32, offset: 1120)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !393, file: !348, line: 207, baseType: !126, size: 32, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !393, file: !348, line: 207, baseType: !126, size: 32, offset: 1184)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !393, file: !348, line: 207, baseType: !126, size: 32, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !393, file: !348, line: 207, baseType: !126, size: 32, offset: 1248)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !393, file: !348, line: 208, baseType: !126, size: 32, offset: 1280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !393, file: !348, line: 208, baseType: !126, size: 32, offset: 1312)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !393, file: !348, line: 211, baseType: !126, size: 32, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !393, file: !348, line: 211, baseType: !126, size: 32, offset: 1376)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !393, file: !348, line: 211, baseType: !126, size: 32, offset: 1408)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !393, file: !348, line: 211, baseType: !126, size: 32, offset: 1440)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !393, file: !348, line: 211, baseType: !126, size: 32, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !393, file: !348, line: 214, baseType: !126, size: 32, offset: 1504)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !393, file: !348, line: 214, baseType: !126, size: 32, offset: 1536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !393, file: !348, line: 217, baseType: !126, size: 32, offset: 1568)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !393, file: !348, line: 218, baseType: !126, size: 32, offset: 1600)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !393, file: !348, line: 219, baseType: !126, size: 32, offset: 1632)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !393, file: !348, line: 220, baseType: !126, size: 32, offset: 1664)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !393, file: !348, line: 221, baseType: !126, size: 32, offset: 1696)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !393, file: !348, line: 222, baseType: !61, size: 16, offset: 1728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !393, file: !348, line: 222, baseType: !61, size: 16, offset: 1744)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !393, file: !348, line: 224, baseType: !61, size: 16, offset: 1760)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !393, file: !348, line: 224, baseType: !61, size: 16, offset: 1776)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !393, file: !348, line: 227, baseType: !61, size: 16, offset: 1792)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !393, file: !348, line: 227, baseType: !61, size: 16, offset: 1808)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !393, file: !348, line: 229, baseType: !61, size: 16, offset: 1824)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !348, line: 229, baseType: !61, size: 16, offset: 1840)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !393, file: !348, line: 230, baseType: !61, size: 16, offset: 1856)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !393, file: !348, line: 230, baseType: !61, size: 16, offset: 1872)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !393, file: !348, line: 232, baseType: !126, size: 32, offset: 1888)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !393, file: !348, line: 232, baseType: !126, size: 32, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !393, file: !348, line: 232, baseType: !126, size: 32, offset: 1952)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !393, file: !348, line: 232, baseType: !126, size: 32, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !393, file: !348, line: 233, baseType: !63, size: 32, offset: 2016)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !393, file: !348, line: 234, baseType: !63, size: 32, offset: 2048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !393, file: !348, line: 235, baseType: !61, size: 16, offset: 2080)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !393, file: !348, line: 235, baseType: !61, size: 16, offset: 2096)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !393, file: !348, line: 236, baseType: !61, size: 16, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !393, file: !348, line: 239, baseType: !61, size: 16, offset: 2128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !393, file: !348, line: 240, baseType: !63, size: 32, offset: 2144)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !393, file: !348, line: 241, baseType: !63, size: 32, offset: 2176)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !393, file: !348, line: 241, baseType: !63, size: 32, offset: 2208)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !393, file: !348, line: 241, baseType: !63, size: 32, offset: 2240)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !393, file: !348, line: 243, baseType: !126, size: 32, offset: 2272)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !393, file: !348, line: 243, baseType: !126, size: 32, offset: 2304)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !393, file: !348, line: 244, baseType: !126, size: 32, offset: 2336)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !393, file: !348, line: 246, baseType: !447, size: 320, offset: 2368)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !448, line: 50, size: 320, elements: !449)
!448 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !447, file: !448, line: 51, baseType: !24, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !447, file: !448, line: 53, baseType: !63, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !447, file: !448, line: 54, baseType: !63, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !447, file: !448, line: 55, baseType: !63, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !447, file: !448, line: 55, baseType: !63, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !447, file: !448, line: 56, baseType: !22, size: 8, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !447, file: !448, line: 56, baseType: !22, size: 8, offset: 200)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !447, file: !448, line: 57, baseType: !22, size: 8, offset: 208)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !447, file: !448, line: 57, baseType: !22, size: 8, offset: 216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !447, file: !448, line: 59, baseType: !61, size: 16, offset: 224)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !447, file: !448, line: 59, baseType: !61, size: 16, offset: 240)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !447, file: !448, line: 59, baseType: !61, size: 16, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !448, line: 61, baseType: !61, size: 16, offset: 272)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !447, file: !448, line: 63, baseType: !63, size: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !393, file: !348, line: 248, baseType: !465, size: 64, offset: 2688)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !467, line: 328, size: 3456, elements: !468)
!467 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!468 = !{!469, !470, !471, !1079, !1080, !1081, !1082, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1109, !1110, !1111, !1114, !1118, !1122, !1126, !1127, !1128, !1129, !1130}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !466, file: !467, line: 329, baseType: !29, size: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !466, file: !467, line: 330, baseType: !93, size: 64, offset: 960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !466, file: !467, line: 332, baseType: !472, size: 64, offset: 1024)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !474, line: 283, size: 4096, elements: !475)
!474 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!475 = !{!476, !477, !478, !479, !483, !484, !488, !1048, !1056, !1060, !1066, !1070, !1071, !1072, !1073, !1077, !1078}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !473, file: !474, line: 284, baseType: !63, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !473, file: !474, line: 285, baseType: !78, size: 512, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !473, file: !474, line: 287, baseType: !78, size: 512, offset: 544)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !473, file: !474, line: 288, baseType: !480, size: 2048, offset: 1056)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !473, file: !474, line: 289, baseType: !63, size: 32, offset: 3104)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !473, file: !474, line: 292, baseType: !485, size: 64, offset: 3136)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !465}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !473, file: !474, line: 293, baseType: !489, size: 64, offset: 3200)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !465, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !467, line: 167, size: 3712, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1040, !1041, !1042, !1043, !1044, !1045}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !467, line: 168, baseType: !492, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !493, file: !467, line: 168, baseType: !492, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !493, file: !467, line: 168, baseType: !492, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !493, file: !467, line: 170, baseType: !67, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !493, file: !467, line: 172, baseType: !500, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !474, line: 144, size: 6016, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !682, !683, !684, !698, !702, !706, !707, !788, !792, !796, !797, !798, !799, !803, !804, !808, !812, !816, !820, !824, !828, !832, !833, !840, !842, !851, !996}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !501, file: !474, line: 145, baseType: !17, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !501, file: !474, line: 145, baseType: !17, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !501, file: !474, line: 146, baseType: !61, size: 16, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !501, file: !474, line: 148, baseType: !78, size: 512, offset: 144)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !501, file: !474, line: 149, baseType: !63, size: 32, offset: 672)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !501, file: !474, line: 151, baseType: !78, size: 512, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !501, file: !474, line: 152, baseType: !480, size: 2048, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !501, file: !474, line: 153, baseType: !63, size: 32, offset: 3264)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !501, file: !474, line: 155, baseType: !126, size: 32, offset: 3296)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !501, file: !474, line: 155, baseType: !126, size: 32, offset: 3328)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !501, file: !474, line: 155, baseType: !126, size: 32, offset: 3360)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !501, file: !474, line: 156, baseType: !126, size: 32, offset: 3392)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !501, file: !474, line: 156, baseType: !126, size: 32, offset: 3424)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !501, file: !474, line: 156, baseType: !126, size: 32, offset: 3456)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !501, file: !474, line: 157, baseType: !61, size: 16, offset: 3488)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !474, line: 157, baseType: !61, size: 16, offset: 3504)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !501, file: !474, line: 157, baseType: !61, size: 16, offset: 3520)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !501, file: !474, line: 160, baseType: !521, size: 64, offset: 3584)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !474, line: 109, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !474, line: 98, size: 1408, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !681}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !523, file: !474, line: 99, baseType: !63, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !523, file: !474, line: 99, baseType: !63, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !523, file: !474, line: 100, baseType: !78, size: 512, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !523, file: !474, line: 101, baseType: !126, size: 32, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !523, file: !474, line: 101, baseType: !126, size: 32, offset: 608)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !523, file: !474, line: 101, baseType: !126, size: 32, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !523, file: !474, line: 101, baseType: !126, size: 32, offset: 672)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !523, file: !474, line: 102, baseType: !126, size: 32, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !523, file: !474, line: 102, baseType: !126, size: 32, offset: 736)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !523, file: !474, line: 103, baseType: !63, size: 32, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !523, file: !474, line: 104, baseType: !63, size: 32, offset: 800)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !523, file: !474, line: 107, baseType: !537, size: 64, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !467, line: 87, size: 2816, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !663}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !467, line: 88, baseType: !537, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !538, file: !467, line: 88, baseType: !537, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !538, file: !467, line: 88, baseType: !537, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !538, file: !467, line: 90, baseType: !67, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !538, file: !467, line: 92, baseType: !78, size: 512, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !538, file: !467, line: 94, baseType: !78, size: 512, offset: 768)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !538, file: !467, line: 99, baseType: !17, size: 64, offset: 1280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !538, file: !467, line: 101, baseType: !61, size: 16, offset: 1344)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !467, line: 101, baseType: !61, size: 16, offset: 1360)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !538, file: !467, line: 102, baseType: !61, size: 16, offset: 1376)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !538, file: !467, line: 103, baseType: !61, size: 16, offset: 1392)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !538, file: !467, line: 104, baseType: !552, size: 64, offset: 1408)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !474, line: 114, size: 1600, elements: !554)
!554 = !{!555, !556, !578, !583, !587, !591, !595, !599, !600, !604, !633, !634, !635}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !553, file: !474, line: 115, baseType: !78, size: 512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !553, file: !474, line: 117, baseType: !557, size: 64, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !560, !563, !565, !565, !576}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !562, line: 44, flags: DIFlagFwdDecl)
!562 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !474, line: 73, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !562, line: 55, size: 192, elements: !567)
!567 = !{!568, !572, !575}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !566, file: !562, line: 58, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !566, file: !562, line: 56, size: 64, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !569, file: !562, line: 57, baseType: !17, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !566, file: !562, line: 60, baseType: !573, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !467, line: 335, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !566, file: !562, line: 61, baseType: !17, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !553, file: !474, line: 118, baseType: !579, size: 64, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !560, !565, !565, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !553, file: !474, line: 120, baseType: !584, size: 64, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !560, !563, !565}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !553, file: !474, line: 121, baseType: !588, size: 64, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !560, !565, !582}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !553, file: !474, line: 122, baseType: !592, size: 64, offset: 768)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !465, !537, !573}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !553, file: !474, line: 123, baseType: !596, size: 64, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !465, !537, !492, !537, !576}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !553, file: !474, line: 124, baseType: !596, size: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !553, file: !474, line: 125, baseType: !601, size: 64, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !465, !537, !492, !537}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !553, file: !474, line: 128, baseType: !605, size: 256, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !562, line: 436, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !562, line: 430, size: 256, elements: !607)
!607 = !{!608, !609, !612, !628}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !606, file: !562, line: 431, baseType: !17, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !606, file: !562, line: 432, baseType: !610, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !562, line: 417, baseType: !574)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !606, file: !562, line: 433, baseType: !613, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !562, line: 408, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!63, !560, !565, !617, !619}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !562, line: 38, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !562, line: 348, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !562, line: 337, size: 256, elements: !622)
!622 = !{!623, !624, !625, !626, !627}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !621, file: !562, line: 339, baseType: !17, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !621, file: !562, line: 342, baseType: !617, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !621, file: !562, line: 345, baseType: !63, size: 32, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !621, file: !562, line: 347, baseType: !63, size: 32, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !621, file: !562, line: 347, baseType: !63, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !606, file: !562, line: 434, baseType: !629, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !562, line: 409, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !17}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !553, file: !474, line: 129, baseType: !605, size: 256, offset: 1280)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !474, line: 132, baseType: !63, size: 32, offset: 1536)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !553, file: !474, line: 132, baseType: !63, size: 32, offset: 1568)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !538, file: !467, line: 105, baseType: !78, size: 512, offset: 1472)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !538, file: !467, line: 107, baseType: !126, size: 32, offset: 1984)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !538, file: !467, line: 107, baseType: !126, size: 32, offset: 2016)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !538, file: !467, line: 109, baseType: !17, size: 64, offset: 2048)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !538, file: !467, line: 112, baseType: !61, size: 16, offset: 2112)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !538, file: !467, line: 114, baseType: !61, size: 16, offset: 2128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !538, file: !467, line: 115, baseType: !63, size: 32, offset: 2144)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !538, file: !467, line: 117, baseType: !17, size: 64, offset: 2176)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !538, file: !467, line: 122, baseType: !63, size: 32, offset: 2240)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !538, file: !467, line: 124, baseType: !63, size: 32, offset: 2272)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !538, file: !467, line: 126, baseType: !537, size: 64, offset: 2304)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !538, file: !467, line: 128, baseType: !648, size: 64, offset: 2368)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !467, line: 298, size: 448, elements: !650)
!650 = !{!651, !652, !653, !656, !657, !660, !661, !662}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !649, file: !467, line: 299, baseType: !648, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !649, file: !467, line: 299, baseType: !648, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !649, file: !467, line: 301, baseType: !654, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !467, line: 218, baseType: !493)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !649, file: !467, line: 301, baseType: !654, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !649, file: !467, line: 302, baseType: !658, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !467, line: 132, baseType: !538)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !649, file: !467, line: 302, baseType: !658, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !649, file: !467, line: 304, baseType: !63, size: 32, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !649, file: !467, line: 305, baseType: !63, size: 32, offset: 416)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !538, file: !467, line: 131, baseType: !664, size: 384, offset: 2432)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !467, line: 73, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !467, line: 62, size: 384, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !665, file: !467, line: 63, baseType: !338, size: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !665, file: !467, line: 64, baseType: !126, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !665, file: !467, line: 64, baseType: !126, size: 32, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !665, file: !467, line: 65, baseType: !17, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !665, file: !467, line: 66, baseType: !61, size: 16, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !665, file: !467, line: 67, baseType: !61, size: 16, offset: 272)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !665, file: !467, line: 68, baseType: !61, size: 16, offset: 288)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !665, file: !467, line: 69, baseType: !61, size: 16, offset: 304)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !665, file: !467, line: 70, baseType: !61, size: 16, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !665, file: !467, line: 71, baseType: !61, size: 16, offset: 336)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !665, file: !467, line: 72, baseType: !678, size: 32, offset: 352)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 2)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !523, file: !474, line: 108, baseType: !78, size: 512, offset: 896)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !501, file: !474, line: 160, baseType: !521, size: 64, offset: 3648)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !501, file: !474, line: 162, baseType: !78, size: 512, offset: 3712)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !501, file: !474, line: 165, baseType: !685, size: 64, offset: 4224)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !688, !690, !692, !465, !492, !694}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !474, line: 81, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !467, line: 43, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !467, line: 274, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !467, line: 271, size: 32, elements: !696)
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !695, file: !467, line: 273, baseType: !158, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !501, file: !474, line: 168, baseType: !699, size: 64, offset: 4288)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !688, !465, !492}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !501, file: !474, line: 171, baseType: !703, size: 64, offset: 4352)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !563, !560, !565}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !501, file: !474, line: 173, baseType: !703, size: 64, offset: 4416)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !501, file: !474, line: 176, baseType: !708, size: 64, offset: 4480)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !692, !711, !492, !63, !63}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !713, line: 70, size: 19840, elements: !714)
!713 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!714 = !{!715, !716, !717, !718, !719, !721, !722, !723, !724, !726, !727, !730, !731, !732, !733, !734, !736, !738, !739, !740, !744, !745, !746, !747, !748, !751, !752, !753, !754, !755, !758, !759, !761, !762, !763, !766, !767, !768, !771, !772, !781}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !713, line: 71, baseType: !711, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !712, file: !713, line: 71, baseType: !711, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !712, file: !713, line: 74, baseType: !63, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !712, file: !713, line: 74, baseType: !63, size: 32, offset: 160)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !712, file: !713, line: 79, baseType: !720, size: 8, offset: 192)
!720 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !712, file: !713, line: 80, baseType: !63, size: 32, offset: 224)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !712, file: !713, line: 83, baseType: !63, size: 32, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !712, file: !713, line: 84, baseType: !63, size: 32, offset: 288)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !712, file: !713, line: 87, baseType: !725, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !712, file: !713, line: 88, baseType: !582, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !712, file: !713, line: 93, baseType: !728, size: 128, offset: 448)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 128, elements: !679)
!729 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !712, file: !713, line: 96, baseType: !63, size: 32, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !712, file: !713, line: 96, baseType: !63, size: 32, offset: 608)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !712, file: !713, line: 97, baseType: !63, size: 32, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !712, file: !713, line: 97, baseType: !63, size: 32, offset: 672)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !712, file: !713, line: 98, baseType: !735, size: 64, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !712, file: !713, line: 101, baseType: !737, size: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !712, file: !713, line: 102, baseType: !582, size: 64, offset: 832)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !712, file: !713, line: 105, baseType: !126, size: 32, offset: 896)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !712, file: !713, line: 108, baseType: !741, size: 1280, offset: 960)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 1280, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 20)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !712, file: !713, line: 109, baseType: !63, size: 32, offset: 2240)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !712, file: !713, line: 109, baseType: !63, size: 32, offset: 2272)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !712, file: !713, line: 112, baseType: !63, size: 32, offset: 2304)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !712, file: !713, line: 113, baseType: !63, size: 32, offset: 2336)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !712, file: !713, line: 114, baseType: !749, size: 64, offset: 2368)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !713, line: 50, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !712, file: !713, line: 115, baseType: !17, size: 64, offset: 2432)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !712, file: !713, line: 118, baseType: !63, size: 32, offset: 2496)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !713, line: 119, baseType: !48, size: 8192, offset: 2528)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !712, file: !713, line: 120, baseType: !48, size: 8192, offset: 10720)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !712, file: !713, line: 123, baseType: !756, size: 64, offset: 18944)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !713, line: 123, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !712, file: !713, line: 124, baseType: !63, size: 32, offset: 19008)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !712, file: !713, line: 127, baseType: !760, size: 64, offset: 19072)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !712, file: !713, line: 128, baseType: !158, size: 32, offset: 19136)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !712, file: !713, line: 129, baseType: !158, size: 32, offset: 19168)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !712, file: !713, line: 132, baseType: !764, size: 64, offset: 19200)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !26, line: 63, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !712, file: !713, line: 133, baseType: !764, size: 64, offset: 19264)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !712, file: !713, line: 134, baseType: !725, size: 64, offset: 19328)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !712, file: !713, line: 135, baseType: !769, size: 64, offset: 19392)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !713, line: 135, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !712, file: !713, line: 136, baseType: !63, size: 32, offset: 19456)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !712, file: !713, line: 137, baseType: !773, size: 128, offset: 19488)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !774, line: 89, baseType: !775)
!774 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !774, line: 86, size: 128, elements: !776)
!776 = !{!777, !778, !779, !780}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !775, file: !774, line: 87, baseType: !63, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !775, file: !774, line: 87, baseType: !63, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !775, file: !774, line: 88, baseType: !63, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !775, file: !774, line: 88, baseType: !63, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !712, file: !713, line: 140, baseType: !782, size: 192, offset: 19648)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !713, line: 55, size: 192, elements: !783)
!783 = !{!784, !785, !786, !787}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !782, file: !713, line: 56, baseType: !158, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !782, file: !713, line: 57, baseType: !158, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !782, file: !713, line: 58, baseType: !760, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !782, file: !713, line: 59, baseType: !158, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !501, file: !474, line: 179, baseType: !789, size: 64, offset: 4544)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !465, !492, !21, !63}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !501, file: !474, line: 181, baseType: !793, size: 64, offset: 4608)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!63, !492, !63, !63}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !501, file: !474, line: 183, baseType: !793, size: 64, offset: 4672)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !501, file: !474, line: 185, baseType: !793, size: 64, offset: 4736)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !501, file: !474, line: 188, baseType: !489, size: 64, offset: 4800)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !501, file: !474, line: 190, baseType: !800, size: 64, offset: 4864)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !465, !492, !36}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !501, file: !474, line: 193, baseType: !489, size: 64, offset: 4928)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !501, file: !474, line: 195, baseType: !805, size: 64, offset: 4992)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !492}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !501, file: !474, line: 197, baseType: !809, size: 64, offset: 5056)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !465, !492, !492}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !501, file: !474, line: 200, baseType: !813, size: 64, offset: 5120)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !688, !565}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !501, file: !474, line: 201, baseType: !817, size: 64, offset: 5184)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !565}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !501, file: !474, line: 202, baseType: !821, size: 64, offset: 5248)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !565, !492}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !501, file: !474, line: 205, baseType: !825, size: 64, offset: 5312)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!63, !500, !465}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !501, file: !474, line: 207, baseType: !829, size: 64, offset: 5376)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!63, !492, !465}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !501, file: !474, line: 210, baseType: !489, size: 64, offset: 5440)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !501, file: !474, line: 213, baseType: !834, size: 64, offset: 5504)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !474, line: 135, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!17, !838, !492, !694}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !474, line: 62, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !501, file: !474, line: 214, baseType: !841, size: 64, offset: 5568)
