; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_camera_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_camera_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, {}*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!1 = distinct !DIGlobalVariable(name: "rna_Camera_type_items", scope: !2, file: !3, line: 1415, type: !1467, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !883, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_camera_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !{!57, !48, !141, !78, !163, !164, !165, !882}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "Camera", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_camera_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !59, line: 47, size: 1600, elements: !61)
!61 = !{!62, !133, !137, !138, !139, !140, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !155, !158, !159}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !60, file: !59, line: 48, baseType: !63, size: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !64, line: 130, baseType: !65)
!64 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !64, line: 117, size: 960, elements: !66)
!66 = !{!67, !69, !70, !72, !92, !96, !98, !99, !100, !101}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !64, line: 118, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !65, file: !64, line: 118, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !65, file: !64, line: 119, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !65, file: !64, line: 120, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !64, line: 136, size: 17600, elements: !75)
!75 = !{!76, !77, !79, !82, !87, !88, !89}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !64, line: 137, baseType: !63, size: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !74, file: !64, line: 138, baseType: !78, size: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !74, file: !64, line: 139, baseType: !80, size: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !64, line: 43, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !64, line: 140, baseType: !83, size: 8192, offset: 1088)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !74, file: !64, line: 141, baseType: !83, size: 8192, offset: 9280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !64, line: 148, baseType: !73, size: 64, offset: 17472)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !74, file: !64, line: 150, baseType: !90, size: 64, offset: 17536)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !64, line: 45, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !64, line: 121, baseType: !93, size: 528, offset: 256)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 528, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 66)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !64, line: 126, baseType: !97, size: 16, offset: 784)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !65, file: !64, line: 127, baseType: !48, size: 32, offset: 800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !65, file: !64, line: 129, baseType: !102, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !64, line: 75, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !64, line: 62, size: 1024, elements: !105)
!105 = !{!106, !108, !109, !110, !111, !112, !116, !117, !131, !132}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !64, line: 63, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !64, line: 63, baseType: !107, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 136)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !104, file: !64, line: 65, baseType: !97, size: 16, offset: 144)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !64, line: 66, baseType: !113, size: 512, offset: 160)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !104, file: !64, line: 67, baseType: !48, size: 32, offset: 672)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !64, line: 69, baseType: !118, size: 256, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !64, line: 60, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !64, line: 48, size: 256, elements: !120)
!120 = !{!121, !122, !129, !130}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !119, file: !64, line: 49, baseType: !68, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !119, file: !64, line: 58, baseType: !123, size: 128, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !124, line: 71, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !124, line: 69, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !125, file: !124, line: 70, baseType: !68, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !125, file: !124, line: 70, baseType: !68, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !104, file: !64, line: 70, baseType: !48, size: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !104, file: !64, line: 74, baseType: !48, size: 32, offset: 992)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !60, file: !59, line: 49, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !136, line: 58, flags: DIFlagFwdDecl)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !59, line: 51, baseType: !84, size: 8, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !60, file: !59, line: 52, baseType: !84, size: 8, offset: 1032)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !60, file: !59, line: 53, baseType: !97, size: 16, offset: 1040)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "passepartalpha", scope: !60, file: !59, line: 54, baseType: !141, size: 32, offset: 1056)
!141 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !60, file: !59, line: 55, baseType: !141, size: 32, offset: 1088)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !60, file: !59, line: 55, baseType: !141, size: 32, offset: 1120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !60, file: !59, line: 56, baseType: !141, size: 32, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ortho_scale", scope: !60, file: !59, line: 56, baseType: !141, size: 32, offset: 1184)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "drawsize", scope: !60, file: !59, line: 56, baseType: !141, size: 32, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_x", scope: !60, file: !59, line: 57, baseType: !141, size: 32, offset: 1248)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_y", scope: !60, file: !59, line: 57, baseType: !141, size: 32, offset: 1280)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "shiftx", scope: !60, file: !59, line: 58, baseType: !141, size: 32, offset: 1312)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "shifty", scope: !60, file: !59, line: 58, baseType: !141, size: 32, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "YF_dofdist", scope: !60, file: !59, line: 63, baseType: !141, size: 32, offset: 1376)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !60, file: !59, line: 65, baseType: !153, size: 64, offset: 1408)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !59, line: 45, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dof_ob", scope: !60, file: !59, line: 67, baseType: !156, size: 64, offset: 1472)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !136, line: 50, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_fit", scope: !60, file: !59, line: 69, baseType: !84, size: 8, offset: 1536)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !60, file: !59, line: 70, baseType: !160, size: 56, offset: 1544)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 56, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 7)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !136, line: 1216, size: 39680, elements: !168)
!168 = !{!169, !170, !171, !172, !175, !176, !177, !189, !190, !194, !195, !196, !197, !198, !199, !200, !201, !202, !206, !209, !212, !439, !442, !744, !756, !757, !758, !759, !760, !761, !762, !763, !766, !767, !768, !769, !770, !778, !845, !852, !855, !862, !865, !871, !872, !873, !874, !879}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !167, file: !136, line: 1217, baseType: !63, size: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !167, file: !136, line: 1218, baseType: !134, size: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !167, file: !136, line: 1220, baseType: !156, size: 64, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !167, file: !136, line: 1221, baseType: !173, size: 64, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !136, line: 52, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !167, file: !136, line: 1223, baseType: !166, size: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !136, line: 1225, baseType: !123, size: 128, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !167, file: !136, line: 1226, baseType: !178, size: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !136, line: 69, size: 320, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !136, line: 70, baseType: !178, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !136, line: 70, baseType: !178, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !179, file: !136, line: 71, baseType: !7, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !179, file: !136, line: 71, baseType: !7, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !136, line: 72, baseType: !48, size: 32, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !179, file: !136, line: 73, baseType: !97, size: 16, offset: 224)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !179, file: !136, line: 73, baseType: !97, size: 16, offset: 240)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !179, file: !136, line: 74, baseType: !156, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !167, file: !136, line: 1227, baseType: !156, size: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !167, file: !136, line: 1229, baseType: !191, size: 96, offset: 1472)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 96, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 3)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !167, file: !136, line: 1230, baseType: !191, size: 96, offset: 1568)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !167, file: !136, line: 1231, baseType: !191, size: 96, offset: 1664)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !167, file: !136, line: 1231, baseType: !191, size: 96, offset: 1760)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !167, file: !136, line: 1233, baseType: !7, size: 32, offset: 1856)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !167, file: !136, line: 1234, baseType: !48, size: 32, offset: 1888)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !167, file: !136, line: 1235, baseType: !7, size: 32, offset: 1920)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !167, file: !136, line: 1237, baseType: !97, size: 16, offset: 1952)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !167, file: !136, line: 1239, baseType: !84, size: 8, offset: 1968)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !167, file: !136, line: 1240, baseType: !203, size: 8, offset: 1976)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 1)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !167, file: !136, line: 1242, baseType: !207, size: 64, offset: 1984)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !136, line: 57, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !167, file: !136, line: 1244, baseType: !210, size: 64, offset: 2048)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !136, line: 59, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !167, file: !136, line: 1246, baseType: !213, size: 64, offset: 2112)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !136, line: 1067, size: 5184, elements: !215)
!215 = !{!216, !249, !250, !265, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !287, !308, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !357, !358, !359, !360, !361, !362, !363, !364, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !422}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !214, file: !136, line: 1068, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !136, line: 934, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !136, line: 925, size: 576, elements: !220)
!220 = !{!221, !240, !241, !242, !243, !245, !248}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !219, file: !136, line: 926, baseType: !222, size: 320)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !136, line: 830, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !136, line: 813, size: 320, elements: !224)
!224 = !{!225, !228, !231, !232, !237, !238, !239}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !223, file: !136, line: 814, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !136, line: 51, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !223, file: !136, line: 815, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !136, line: 815, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !223, file: !136, line: 818, baseType: !68, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !223, file: !136, line: 819, baseType: !233, size: 32, offset: 192)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 32, elements: !235)
!234 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!235 = !{!236}
!236 = !DISubrange(count: 4)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !136, line: 822, baseType: !48, size: 32, offset: 224)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !223, file: !136, line: 826, baseType: !48, size: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !223, file: !136, line: 829, baseType: !48, size: 32, offset: 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !219, file: !136, line: 928, baseType: !97, size: 16, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !219, file: !136, line: 928, baseType: !97, size: 16, offset: 336)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !219, file: !136, line: 929, baseType: !48, size: 32, offset: 352)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !219, file: !136, line: 930, baseType: !244, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !219, file: !136, line: 931, baseType: !246, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !136, line: 931, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !219, file: !136, line: 933, baseType: !68, size: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !214, file: !136, line: 1069, baseType: !217, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !214, file: !136, line: 1070, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !136, line: 916, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !136, line: 891, size: 704, elements: !254)
!254 = !{!255, !256, !257, !259, !260, !261, !262, !263, !264}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !253, file: !136, line: 892, baseType: !222, size: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !253, file: !136, line: 896, baseType: !48, size: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !253, file: !136, line: 900, baseType: !258, size: 96, offset: 352)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !253, file: !136, line: 903, baseType: !141, size: 32, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !253, file: !136, line: 906, baseType: !48, size: 32, offset: 480)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !253, file: !136, line: 909, baseType: !141, size: 32, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !253, file: !136, line: 912, baseType: !141, size: 32, offset: 544)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !253, file: !136, line: 914, baseType: !156, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !253, file: !136, line: 915, baseType: !68, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !214, file: !136, line: 1071, baseType: !266, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !136, line: 920, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !136, line: 918, size: 320, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !268, file: !136, line: 919, baseType: !222, size: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !214, file: !136, line: 1075, baseType: !141, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !214, file: !136, line: 1077, baseType: !141, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !214, file: !136, line: 1078, baseType: !141, size: 32, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !214, file: !136, line: 1079, baseType: !97, size: 16, offset: 352)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !214, file: !136, line: 1082, baseType: !97, size: 16, offset: 368)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !214, file: !136, line: 1085, baseType: !84, size: 8, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !214, file: !136, line: 1086, baseType: !84, size: 8, offset: 392)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !214, file: !136, line: 1087, baseType: !84, size: 8, offset: 400)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !214, file: !136, line: 1088, baseType: !84, size: 8, offset: 408)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !214, file: !136, line: 1090, baseType: !141, size: 32, offset: 416)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !214, file: !136, line: 1093, baseType: !97, size: 16, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !214, file: !136, line: 1096, baseType: !84, size: 8, offset: 464)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !214, file: !136, line: 1098, baseType: !284, size: 40, offset: 472)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 40, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 5)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !214, file: !136, line: 1101, baseType: !288, size: 832, offset: 512)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !136, line: 836, size: 832, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !299, !300, !301, !304, !305, !306, !307}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !288, file: !136, line: 837, baseType: !222, size: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !136, line: 839, baseType: !97, size: 16, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !288, file: !136, line: 839, baseType: !97, size: 16, offset: 336)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !288, file: !136, line: 842, baseType: !97, size: 16, offset: 352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !288, file: !136, line: 842, baseType: !97, size: 16, offset: 368)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !288, file: !136, line: 843, baseType: !296, size: 32, offset: 384)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 32, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !288, file: !136, line: 845, baseType: !48, size: 32, offset: 416)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !288, file: !136, line: 847, baseType: !68, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !288, file: !136, line: 848, baseType: !302, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !136, line: 54, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !288, file: !136, line: 849, baseType: !302, size: 64, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !288, file: !136, line: 850, baseType: !302, size: 64, offset: 640)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !288, file: !136, line: 851, baseType: !191, size: 96, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !288, file: !136, line: 852, baseType: !141, size: 32, offset: 800)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !214, file: !136, line: 1104, baseType: !309, size: 1344, offset: 1344)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !136, line: 867, size: 1344, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !309, file: !136, line: 868, baseType: !97, size: 16)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !309, file: !136, line: 869, baseType: !97, size: 16, offset: 16)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !309, file: !136, line: 870, baseType: !97, size: 16, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !309, file: !136, line: 871, baseType: !97, size: 16, offset: 48)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !309, file: !136, line: 873, baseType: !316, size: 896, offset: 64)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 896, elements: !161)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !136, line: 864, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !136, line: 859, size: 128, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !136, line: 860, baseType: !97, size: 16)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !318, file: !136, line: 861, baseType: !97, size: 16, offset: 16)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !318, file: !136, line: 861, baseType: !97, size: 16, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !318, file: !136, line: 861, baseType: !97, size: 16, offset: 48)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !136, line: 862, baseType: !48, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !318, file: !136, line: 863, baseType: !141, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !309, file: !136, line: 874, baseType: !68, size: 64, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !309, file: !136, line: 876, baseType: !141, size: 32, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !309, file: !136, line: 876, baseType: !141, size: 32, offset: 1056)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !309, file: !136, line: 878, baseType: !48, size: 32, offset: 1088)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !309, file: !136, line: 879, baseType: !48, size: 32, offset: 1120)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !309, file: !136, line: 881, baseType: !48, size: 32, offset: 1152)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !309, file: !136, line: 881, baseType: !48, size: 32, offset: 1184)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !309, file: !136, line: 883, baseType: !166, size: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !309, file: !136, line: 884, baseType: !156, size: 64, offset: 1280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !214, file: !136, line: 1107, baseType: !141, size: 32, offset: 2688)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !214, file: !136, line: 1110, baseType: !141, size: 32, offset: 2720)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !214, file: !136, line: 1113, baseType: !97, size: 16, offset: 2752)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !214, file: !136, line: 1113, baseType: !97, size: 16, offset: 2768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !214, file: !136, line: 1116, baseType: !84, size: 8, offset: 2784)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !214, file: !136, line: 1117, baseType: !203, size: 8, offset: 2792)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !214, file: !136, line: 1120, baseType: !97, size: 16, offset: 2800)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !214, file: !136, line: 1121, baseType: !141, size: 32, offset: 2816)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !214, file: !136, line: 1122, baseType: !141, size: 32, offset: 2848)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !214, file: !136, line: 1123, baseType: !141, size: 32, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !214, file: !136, line: 1124, baseType: !141, size: 32, offset: 2912)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !214, file: !136, line: 1125, baseType: !141, size: 32, offset: 2944)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !214, file: !136, line: 1126, baseType: !141, size: 32, offset: 2976)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !214, file: !136, line: 1127, baseType: !141, size: 32, offset: 3008)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !214, file: !136, line: 1128, baseType: !141, size: 32, offset: 3040)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !214, file: !136, line: 1129, baseType: !141, size: 32, offset: 3072)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !214, file: !136, line: 1130, baseType: !141, size: 32, offset: 3104)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !214, file: !136, line: 1131, baseType: !97, size: 16, offset: 3136)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !214, file: !136, line: 1132, baseType: !84, size: 8, offset: 3152)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !214, file: !136, line: 1133, baseType: !84, size: 8, offset: 3160)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !214, file: !136, line: 1134, baseType: !356, size: 24, offset: 3168)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 24, elements: !192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !214, file: !136, line: 1135, baseType: !84, size: 8, offset: 3192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !214, file: !136, line: 1138, baseType: !156, size: 64, offset: 3200)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !214, file: !136, line: 1139, baseType: !84, size: 8, offset: 3264)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !214, file: !136, line: 1140, baseType: !84, size: 8, offset: 3272)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !214, file: !136, line: 1141, baseType: !84, size: 8, offset: 3280)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !214, file: !136, line: 1142, baseType: !84, size: 8, offset: 3288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !214, file: !136, line: 1143, baseType: !84, size: 8, offset: 3296)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !214, file: !136, line: 1144, baseType: !365, size: 64, offset: 3304)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !214, file: !136, line: 1145, baseType: !365, size: 64, offset: 3368)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !214, file: !136, line: 1148, baseType: !84, size: 8, offset: 3432)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !214, file: !136, line: 1149, baseType: !84, size: 8, offset: 3440)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !214, file: !136, line: 1152, baseType: !84, size: 8, offset: 3448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !214, file: !136, line: 1152, baseType: !84, size: 8, offset: 3456)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !214, file: !136, line: 1153, baseType: !84, size: 8, offset: 3464)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !214, file: !136, line: 1154, baseType: !97, size: 16, offset: 3472)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !214, file: !136, line: 1154, baseType: !97, size: 16, offset: 3488)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !214, file: !136, line: 1155, baseType: !97, size: 16, offset: 3504)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !214, file: !136, line: 1155, baseType: !97, size: 16, offset: 3520)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !214, file: !136, line: 1156, baseType: !84, size: 8, offset: 3536)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !214, file: !136, line: 1157, baseType: !84, size: 8, offset: 3544)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !214, file: !136, line: 1159, baseType: !84, size: 8, offset: 3552)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !214, file: !136, line: 1160, baseType: !84, size: 8, offset: 3560)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !214, file: !136, line: 1161, baseType: !84, size: 8, offset: 3568)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !214, file: !136, line: 1162, baseType: !84, size: 8, offset: 3576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !214, file: !136, line: 1165, baseType: !48, size: 32, offset: 3584)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !214, file: !136, line: 1166, baseType: !48, size: 32, offset: 3616)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !214, file: !136, line: 1167, baseType: !48, size: 32, offset: 3648)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !214, file: !136, line: 1168, baseType: !48, size: 32, offset: 3680)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !214, file: !136, line: 1171, baseType: !97, size: 16, offset: 3712)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !214, file: !136, line: 1171, baseType: !97, size: 16, offset: 3728)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !214, file: !136, line: 1172, baseType: !48, size: 32, offset: 3744)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !214, file: !136, line: 1173, baseType: !141, size: 32, offset: 3776)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !214, file: !136, line: 1174, baseType: !141, size: 32, offset: 3808)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !214, file: !136, line: 1177, baseType: !394, size: 1024, offset: 3840)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !136, line: 963, size: 1024, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !420, !421}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !394, file: !136, line: 965, baseType: !48, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !394, file: !136, line: 968, baseType: !141, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !394, file: !136, line: 971, baseType: !141, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !394, file: !136, line: 974, baseType: !141, size: 32, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !394, file: !136, line: 977, baseType: !191, size: 96, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !394, file: !136, line: 979, baseType: !191, size: 96, offset: 224)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !394, file: !136, line: 982, baseType: !48, size: 32, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !394, file: !136, line: 987, baseType: !404, size: 64, offset: 352)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, elements: !297)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !394, file: !136, line: 989, baseType: !141, size: 32, offset: 416)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !394, file: !136, line: 994, baseType: !48, size: 32, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !394, file: !136, line: 995, baseType: !48, size: 32, offset: 480)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !394, file: !136, line: 997, baseType: !84, size: 8, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !394, file: !136, line: 998, baseType: !160, size: 56, offset: 520)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !394, file: !136, line: 1000, baseType: !141, size: 32, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !394, file: !136, line: 1003, baseType: !404, size: 64, offset: 608)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !394, file: !136, line: 1006, baseType: !48, size: 32, offset: 672)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !394, file: !136, line: 1009, baseType: !141, size: 32, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !394, file: !136, line: 1012, baseType: !404, size: 64, offset: 736)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !394, file: !136, line: 1015, baseType: !404, size: 64, offset: 800)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !394, file: !136, line: 1018, baseType: !48, size: 32, offset: 864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !394, file: !136, line: 1019, baseType: !418, size: 64, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !136, line: 63, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !394, file: !136, line: 1023, baseType: !141, size: 32, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !394, file: !136, line: 1024, baseType: !48, size: 32, offset: 992)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !214, file: !136, line: 1179, baseType: !423, size: 320, offset: 4864)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !136, line: 1043, size: 320, elements: !424)
!424 = !{!425, !426, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !423, file: !136, line: 1044, baseType: !84, size: 8)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !423, file: !136, line: 1045, baseType: !427, size: 16, offset: 8)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 16, elements: !297)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !423, file: !136, line: 1048, baseType: !84, size: 8, offset: 24)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !423, file: !136, line: 1049, baseType: !141, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !423, file: !136, line: 1049, baseType: !141, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !423, file: !136, line: 1052, baseType: !141, size: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !423, file: !136, line: 1052, baseType: !141, size: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !423, file: !136, line: 1053, baseType: !84, size: 8, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !423, file: !136, line: 1054, baseType: !356, size: 24, offset: 168)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !423, file: !136, line: 1057, baseType: !141, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !423, file: !136, line: 1057, baseType: !141, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !423, file: !136, line: 1060, baseType: !141, size: 32, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !423, file: !136, line: 1060, baseType: !141, size: 32, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !167, file: !136, line: 1247, baseType: !440, size: 64, offset: 2176)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !136, line: 60, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !167, file: !136, line: 1251, baseType: !443, size: 31872, offset: 2240)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !136, line: 403, size: 31872, elements: !444)
!444 = !{!445, !529, !549, !558, !578, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !692, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !720, !721, !722, !726, !742, !743}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !443, file: !136, line: 404, baseType: !446, size: 1984)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !136, line: 259, size: 1984, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !465, !524}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !446, file: !136, line: 260, baseType: !84, size: 8)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !446, file: !136, line: 263, baseType: !84, size: 8, offset: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !446, file: !136, line: 266, baseType: !84, size: 8, offset: 16)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !446, file: !136, line: 267, baseType: !84, size: 8, offset: 24)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !446, file: !136, line: 269, baseType: !84, size: 8, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !446, file: !136, line: 270, baseType: !84, size: 8, offset: 40)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !446, file: !136, line: 276, baseType: !84, size: 8, offset: 48)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !446, file: !136, line: 279, baseType: !84, size: 8, offset: 56)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !446, file: !136, line: 280, baseType: !97, size: 16, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !446, file: !136, line: 280, baseType: !97, size: 16, offset: 80)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !446, file: !136, line: 281, baseType: !141, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !446, file: !136, line: 284, baseType: !84, size: 8, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !446, file: !136, line: 285, baseType: !84, size: 8, offset: 136)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !446, file: !136, line: 287, baseType: !462, size: 48, offset: 144)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 6)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !446, file: !136, line: 290, baseType: !466, size: 1280, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !467, line: 174, baseType: !468)
!467 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !467, line: 166, size: 1280, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !523}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !468, file: !467, line: 167, baseType: !48, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !468, file: !467, line: 167, baseType: !48, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !468, file: !467, line: 168, baseType: !113, size: 512, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !468, file: !467, line: 169, baseType: !113, size: 512, offset: 576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !468, file: !467, line: 170, baseType: !141, size: 32, offset: 1088)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !468, file: !467, line: 171, baseType: !141, size: 32, offset: 1120)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !468, file: !467, line: 172, baseType: !477, size: 64, offset: 1152)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !467, line: 72, size: 3072, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !493, !494, !519, !520, !521, !522}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !478, file: !467, line: 73, baseType: !48, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !478, file: !467, line: 73, baseType: !48, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !478, file: !467, line: 74, baseType: !48, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !478, file: !467, line: 75, baseType: !48, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !478, file: !467, line: 77, baseType: !485, size: 128, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !486, line: 95, baseType: !487)
!486 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !486, line: 92, size: 128, elements: !488)
!488 = !{!489, !490, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !487, file: !486, line: 93, baseType: !141, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !487, file: !486, line: 93, baseType: !141, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !487, file: !486, line: 94, baseType: !141, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !487, file: !486, line: 94, baseType: !141, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !478, file: !467, line: 77, baseType: !485, size: 128, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !478, file: !467, line: 79, baseType: !495, size: 2304, offset: 384)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 2304, elements: !235)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !467, line: 67, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !467, line: 55, size: 576, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !515, !516, !517, !518}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !497, file: !467, line: 56, baseType: !97, size: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !497, file: !467, line: 56, baseType: !97, size: 16, offset: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !497, file: !467, line: 58, baseType: !141, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !497, file: !467, line: 59, baseType: !141, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !497, file: !467, line: 59, baseType: !141, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !497, file: !467, line: 60, baseType: !404, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !497, file: !467, line: 60, baseType: !404, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !497, file: !467, line: 61, baseType: !507, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !467, line: 47, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !467, line: 44, size: 96, elements: !510)
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !509, file: !467, line: 45, baseType: !141, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !509, file: !467, line: 45, baseType: !141, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !467, line: 46, baseType: !97, size: 16, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !509, file: !467, line: 46, baseType: !97, size: 16, offset: 80)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !497, file: !467, line: 62, baseType: !507, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !497, file: !467, line: 64, baseType: !507, size: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !497, file: !467, line: 65, baseType: !404, size: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !497, file: !467, line: 66, baseType: !404, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !478, file: !467, line: 80, baseType: !191, size: 96, offset: 2688)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !478, file: !467, line: 80, baseType: !191, size: 96, offset: 2784)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !478, file: !467, line: 81, baseType: !191, size: 96, offset: 2880)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !478, file: !467, line: 83, baseType: !191, size: 96, offset: 2976)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !468, file: !467, line: 173, baseType: !68, size: 64, offset: 1216)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !446, file: !136, line: 291, baseType: !525, size: 512, offset: 1472)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !467, line: 178, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !467, line: 176, size: 512, elements: !527)
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !526, file: !467, line: 177, baseType: !113, size: 512)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !443, file: !136, line: 406, baseType: !530, size: 64, offset: 1984)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !136, line: 80, size: 1472, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !531, file: !136, line: 81, baseType: !68, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !531, file: !136, line: 82, baseType: !68, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !531, file: !136, line: 83, baseType: !7, size: 32, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !531, file: !136, line: 84, baseType: !7, size: 32, offset: 160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !531, file: !136, line: 86, baseType: !7, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !531, file: !136, line: 87, baseType: !7, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !531, file: !136, line: 88, baseType: !7, size: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !531, file: !136, line: 89, baseType: !7, size: 32, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !531, file: !136, line: 90, baseType: !7, size: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !531, file: !136, line: 91, baseType: !7, size: 32, offset: 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !531, file: !136, line: 92, baseType: !7, size: 32, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !531, file: !136, line: 93, baseType: !7, size: 32, offset: 416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecname", scope: !531, file: !136, line: 95, baseType: !546, size: 1024, offset: 448)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1024, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecdata", scope: !443, file: !136, line: 407, baseType: !550, size: 64, offset: 2048)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecData", file: !136, line: 98, size: 1216, elements: !552)
!552 = !{!553, !554, !555, !556, !557}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cdParms", scope: !551, file: !136, line: 100, baseType: !68, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !551, file: !136, line: 101, baseType: !68, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cdSize", scope: !551, file: !136, line: 103, baseType: !7, size: 32, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !551, file: !136, line: 104, baseType: !7, size: 32, offset: 160)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecname", scope: !551, file: !136, line: 106, baseType: !546, size: 1024, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecsettings", scope: !443, file: !136, line: 408, baseType: !559, size: 512, offset: 2112)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecSettings", file: !136, line: 109, size: 512, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "codecType", scope: !559, file: !136, line: 111, baseType: !48, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "codecSpatialQuality", scope: !559, file: !136, line: 112, baseType: !48, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !559, file: !136, line: 115, baseType: !48, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "codecFlags", scope: !559, file: !136, line: 116, baseType: !48, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "colorDepth", scope: !559, file: !136, line: 117, baseType: !48, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "codecTemporalQuality", scope: !559, file: !136, line: 118, baseType: !48, size: 32, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "minSpatialQuality", scope: !559, file: !136, line: 119, baseType: !48, size: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "minTemporalQuality", scope: !559, file: !136, line: 120, baseType: !48, size: 32, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "keyFrameRate", scope: !559, file: !136, line: 121, baseType: !48, size: 32, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "bitRate", scope: !559, file: !136, line: 122, baseType: !48, size: 32, offset: 288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "audiocodecType", scope: !559, file: !136, line: 125, baseType: !48, size: 32, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "audioSampleRate", scope: !559, file: !136, line: 126, baseType: !48, size: 32, offset: 352)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitDepth", scope: !559, file: !136, line: 127, baseType: !97, size: 16, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "audioChannels", scope: !559, file: !136, line: 128, baseType: !97, size: 16, offset: 400)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "audioCodecFlags", scope: !559, file: !136, line: 129, baseType: !48, size: 32, offset: 416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitRate", scope: !559, file: !136, line: 130, baseType: !48, size: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !559, file: !136, line: 131, baseType: !48, size: 32, offset: 480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ffcodecdata", scope: !443, file: !136, line: 409, baseType: !579, size: 576, offset: 2624)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFMpegCodecData", file: !136, line: 134, size: 576, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !136, line: 135, baseType: !48, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !579, file: !136, line: 136, baseType: !48, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !579, file: !136, line: 137, baseType: !48, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "video_bitrate", scope: !579, file: !136, line: 138, baseType: !48, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "audio_bitrate", scope: !579, file: !136, line: 139, baseType: !48, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mixrate", scope: !579, file: !136, line: 140, baseType: !48, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "audio_channels", scope: !579, file: !136, line: 141, baseType: !48, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pad", scope: !579, file: !136, line: 142, baseType: !48, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "audio_volume", scope: !579, file: !136, line: 143, baseType: !141, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !579, file: !136, line: 144, baseType: !48, size: 32, offset: 288)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !579, file: !136, line: 145, baseType: !48, size: 32, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !579, file: !136, line: 147, baseType: !48, size: 32, offset: 352)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !579, file: !136, line: 148, baseType: !48, size: 32, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !579, file: !136, line: 149, baseType: !48, size: 32, offset: 416)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "mux_packet_size", scope: !579, file: !136, line: 150, baseType: !48, size: 32, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mux_rate", scope: !579, file: !136, line: 151, baseType: !48, size: 32, offset: 480)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !579, file: !136, line: 152, baseType: !102, size: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !443, file: !136, line: 411, baseType: !48, size: 32, offset: 3200)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !443, file: !136, line: 411, baseType: !48, size: 32, offset: 3232)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !443, file: !136, line: 411, baseType: !48, size: 32, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "subframe", scope: !443, file: !136, line: 412, baseType: !141, size: 32, offset: 3296)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "psfra", scope: !443, file: !136, line: 413, baseType: !48, size: 32, offset: 3328)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pefra", scope: !443, file: !136, line: 413, baseType: !48, size: 32, offset: 3360)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !443, file: !136, line: 415, baseType: !48, size: 32, offset: 3392)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "framapto", scope: !443, file: !136, line: 415, baseType: !48, size: 32, offset: 3424)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !443, file: !136, line: 416, baseType: !97, size: 16, offset: 3456)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !443, file: !136, line: 416, baseType: !97, size: 16, offset: 3472)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "framelen", scope: !443, file: !136, line: 418, baseType: !141, size: 32, offset: 3488)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "blurfac", scope: !443, file: !136, line: 418, baseType: !141, size: 32, offset: 3520)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "edgeR", scope: !443, file: !136, line: 421, baseType: !141, size: 32, offset: 3552)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "edgeG", scope: !443, file: !136, line: 421, baseType: !141, size: 32, offset: 3584)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "edgeB", scope: !443, file: !136, line: 421, baseType: !141, size: 32, offset: 3616)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fullscreen", scope: !443, file: !136, line: 425, baseType: !97, size: 16, offset: 3648)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "xplay", scope: !443, file: !136, line: 425, baseType: !97, size: 16, offset: 3664)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "yplay", scope: !443, file: !136, line: 425, baseType: !97, size: 16, offset: 3680)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "freqplay", scope: !443, file: !136, line: 426, baseType: !97, size: 16, offset: 3696)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !443, file: !136, line: 428, baseType: !97, size: 16, offset: 3712)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !443, file: !136, line: 428, baseType: !97, size: 16, offset: 3728)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_step", scope: !443, file: !136, line: 431, baseType: !48, size: 32, offset: 3744)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "stereomode", scope: !443, file: !136, line: 433, baseType: !97, size: 16, offset: 3776)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dimensionspreset", scope: !443, file: !136, line: 435, baseType: !97, size: 16, offset: 3792)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "filtertype", scope: !443, file: !136, line: 437, baseType: !97, size: 16, offset: 3808)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !443, file: !136, line: 439, baseType: !97, size: 16, offset: 3824)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "maximsize", scope: !443, file: !136, line: 441, baseType: !97, size: 16, offset: 3840)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !443, file: !136, line: 443, baseType: !97, size: 16, offset: 3856)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "xsch", scope: !443, file: !136, line: 449, baseType: !48, size: 32, offset: 3872)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ysch", scope: !443, file: !136, line: 453, baseType: !48, size: 32, offset: 3904)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "xparts", scope: !443, file: !136, line: 458, baseType: !97, size: 16, offset: 3936)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "yparts", scope: !443, file: !136, line: 462, baseType: !97, size: 16, offset: 3952)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !443, file: !136, line: 467, baseType: !48, size: 32, offset: 3968)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !443, file: !136, line: 467, baseType: !48, size: 32, offset: 4000)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !443, file: !136, line: 469, baseType: !97, size: 16, offset: 4032)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !443, file: !136, line: 469, baseType: !97, size: 16, offset: 4048)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "subimtype", scope: !443, file: !136, line: 469, baseType: !97, size: 16, offset: 4064)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !443, file: !136, line: 469, baseType: !97, size: 16, offset: 4080)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "displaymode", scope: !443, file: !136, line: 474, baseType: !97, size: 16, offset: 4096)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "use_lock_interface", scope: !443, file: !136, line: 475, baseType: !84, size: 8, offset: 4112)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !443, file: !136, line: 476, baseType: !84, size: 8, offset: 4120)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "scemode", scope: !443, file: !136, line: 481, baseType: !48, size: 32, offset: 4128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !443, file: !136, line: 486, baseType: !48, size: 32, offset: 4160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "raytrace_options", scope: !443, file: !136, line: 491, baseType: !48, size: 32, offset: 4192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "raytrace_structure", scope: !443, file: !136, line: 496, baseType: !97, size: 16, offset: 4224)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !443, file: !136, line: 498, baseType: !97, size: 16, offset: 4240)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ocres", scope: !443, file: !136, line: 501, baseType: !97, size: 16, offset: 4256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !443, file: !136, line: 502, baseType: !97, size: 16, offset: 4272)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "alphamode", scope: !443, file: !136, line: 508, baseType: !97, size: 16, offset: 4288)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !443, file: !136, line: 513, baseType: !97, size: 16, offset: 4304)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "frs_sec", scope: !443, file: !136, line: 515, baseType: !97, size: 16, offset: 4320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "edgeint", scope: !443, file: !136, line: 515, baseType: !97, size: 16, offset: 4336)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !443, file: !136, line: 519, baseType: !485, size: 128, offset: 4352)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "border", scope: !443, file: !136, line: 519, baseType: !485, size: 128, offset: 4480)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "disprect", scope: !443, file: !136, line: 520, baseType: !653, size: 128, offset: 4608)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !486, line: 89, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !486, line: 86, size: 128, elements: !655)
!655 = !{!656, !657, !658, !659}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !654, file: !486, line: 87, baseType: !48, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !654, file: !486, line: 87, baseType: !48, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !654, file: !486, line: 88, baseType: !48, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !654, file: !486, line: 88, baseType: !48, size: 32, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !443, file: !136, line: 523, baseType: !123, size: 128, offset: 4736)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "actlay", scope: !443, file: !136, line: 524, baseType: !97, size: 16, offset: 4864)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mblur_samples", scope: !443, file: !136, line: 527, baseType: !97, size: 16, offset: 4880)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "xasp", scope: !443, file: !136, line: 532, baseType: !141, size: 32, offset: 4896)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "yasp", scope: !443, file: !136, line: 532, baseType: !141, size: 32, offset: 4928)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "frs_sec_base", scope: !443, file: !136, line: 534, baseType: !141, size: 32, offset: 4960)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gauss", scope: !443, file: !136, line: 538, baseType: !141, size: 32, offset: 4992)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "color_mgt_flag", scope: !443, file: !136, line: 542, baseType: !48, size: 32, offset: 5024)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "postgamma", scope: !443, file: !136, line: 545, baseType: !141, size: 32, offset: 5056)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "posthue", scope: !443, file: !136, line: 545, baseType: !141, size: 32, offset: 5088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "postsat", scope: !443, file: !136, line: 545, baseType: !141, size: 32, offset: 5120)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dither_intensity", scope: !443, file: !136, line: 548, baseType: !141, size: 32, offset: 5152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bake_osa", scope: !443, file: !136, line: 551, baseType: !97, size: 16, offset: 5184)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bake_filter", scope: !443, file: !136, line: 551, baseType: !97, size: 16, offset: 5200)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bake_mode", scope: !443, file: !136, line: 551, baseType: !97, size: 16, offset: 5216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bake_flag", scope: !443, file: !136, line: 551, baseType: !97, size: 16, offset: 5232)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bake_normal_space", scope: !443, file: !136, line: 552, baseType: !97, size: 16, offset: 5248)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bake_quad_split", scope: !443, file: !136, line: 552, baseType: !97, size: 16, offset: 5264)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bake_maxdist", scope: !443, file: !136, line: 553, baseType: !141, size: 32, offset: 5280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bake_biasdist", scope: !443, file: !136, line: 553, baseType: !141, size: 32, offset: 5312)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bake_samples", scope: !443, file: !136, line: 554, baseType: !97, size: 16, offset: 5344)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bake_pad", scope: !443, file: !136, line: 554, baseType: !97, size: 16, offset: 5360)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bake_user_scale", scope: !443, file: !136, line: 555, baseType: !141, size: 32, offset: 5376)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bake_pad1", scope: !443, file: !136, line: 555, baseType: !141, size: 32, offset: 5408)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !443, file: !136, line: 558, baseType: !83, size: 8192, offset: 5440)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "stamp", scope: !443, file: !136, line: 561, baseType: !48, size: 32, offset: 13632)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_font_id", scope: !443, file: !136, line: 562, baseType: !97, size: 16, offset: 13664)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !443, file: !136, line: 562, baseType: !97, size: 16, offset: 13680)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_udata", scope: !443, file: !136, line: 565, baseType: !689, size: 6144, offset: 13696)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 6144, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fg_stamp", scope: !443, file: !136, line: 568, baseType: !693, size: 128, offset: 19840)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !235)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bg_stamp", scope: !443, file: !136, line: 569, baseType: !693, size: 128, offset: 19968)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "seq_prev_type", scope: !443, file: !136, line: 572, baseType: !84, size: 8, offset: 20096)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "seq_rend_type", scope: !443, file: !136, line: 573, baseType: !84, size: 8, offset: 20104)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "seq_flag", scope: !443, file: !136, line: 574, baseType: !84, size: 8, offset: 20112)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !443, file: !136, line: 575, baseType: !284, size: 40, offset: 20120)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_flag", scope: !443, file: !136, line: 578, baseType: !48, size: 32, offset: 20160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_subsurf", scope: !443, file: !136, line: 579, baseType: !97, size: 16, offset: 20192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_shadowsamples", scope: !443, file: !136, line: 580, baseType: !97, size: 16, offset: 20208)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_particles", scope: !443, file: !136, line: 581, baseType: !141, size: 32, offset: 20224)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_aosss", scope: !443, file: !136, line: 582, baseType: !141, size: 32, offset: 20256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cineonwhite", scope: !443, file: !136, line: 585, baseType: !97, size: 16, offset: 20288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cineonblack", scope: !443, file: !136, line: 585, baseType: !97, size: 16, offset: 20304)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "cineongamma", scope: !443, file: !136, line: 586, baseType: !141, size: 32, offset: 20320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_preset", scope: !443, file: !136, line: 589, baseType: !97, size: 16, offset: 20352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_depth", scope: !443, file: !136, line: 589, baseType: !97, size: 16, offset: 20368)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rpad3", scope: !443, file: !136, line: 590, baseType: !48, size: 32, offset: 20384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "domeres", scope: !443, file: !136, line: 593, baseType: !97, size: 16, offset: 20416)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "domemode", scope: !443, file: !136, line: 593, baseType: !97, size: 16, offset: 20432)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "domeangle", scope: !443, file: !136, line: 594, baseType: !97, size: 16, offset: 20448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dometilt", scope: !443, file: !136, line: 594, baseType: !97, size: 16, offset: 20464)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "domeresbuf", scope: !443, file: !136, line: 595, baseType: !141, size: 32, offset: 20480)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !443, file: !136, line: 596, baseType: !141, size: 32, offset: 20512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dometext", scope: !443, file: !136, line: 597, baseType: !717, size: 64, offset: 20544)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !719, line: 44, flags: DIFlagFwdDecl)
!719 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!720 = !DIDerivedType(tag: DW_TAG_member, name: "line_thickness_mode", scope: !443, file: !136, line: 600, baseType: !48, size: 32, offset: 20608)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "unit_line_thickness", scope: !443, file: !136, line: 601, baseType: !141, size: 32, offset: 20640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !443, file: !136, line: 604, baseType: !723, size: 256, offset: 20672)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bake", scope: !443, file: !136, line: 607, baseType: !727, size: 10880, offset: 20928)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BakeData", file: !136, line: 364, size: 10880, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !727, file: !136, line: 365, baseType: !446, size: 1984)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !727, file: !136, line: 367, baseType: !83, size: 8192, offset: 1984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !727, file: !136, line: 369, baseType: !97, size: 16, offset: 10176)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !727, file: !136, line: 369, baseType: !97, size: 16, offset: 10192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !727, file: !136, line: 370, baseType: !97, size: 16, offset: 10208)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !727, file: !136, line: 370, baseType: !97, size: 16, offset: 10224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "cage_extrusion", scope: !727, file: !136, line: 372, baseType: !141, size: 32, offset: 10240)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !727, file: !136, line: 373, baseType: !141, size: 32, offset: 10272)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "normal_swizzle", scope: !727, file: !136, line: 375, baseType: !356, size: 24, offset: 10304)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "normal_space", scope: !727, file: !136, line: 376, baseType: !84, size: 8, offset: 10328)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "save_mode", scope: !727, file: !136, line: 378, baseType: !84, size: 8, offset: 10336)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !727, file: !136, line: 379, baseType: !356, size: 24, offset: 10344)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "cage", scope: !727, file: !136, line: 381, baseType: !113, size: 512, offset: 10368)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "preview_start_resolution", scope: !443, file: !136, line: 609, baseType: !48, size: 32, offset: 31808)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !443, file: !136, line: 610, baseType: !48, size: 32, offset: 31840)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "audio", scope: !167, file: !136, line: 1252, baseType: !745, size: 256, offset: 34112)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioData", file: !136, line: 158, size: 256, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mixrate", scope: !745, file: !136, line: 159, baseType: !48, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !745, file: !136, line: 160, baseType: !141, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "speed_of_sound", scope: !745, file: !136, line: 161, baseType: !141, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "doppler_factor", scope: !745, file: !136, line: 162, baseType: !141, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "distance_model", scope: !745, file: !136, line: 163, baseType: !48, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !745, file: !136, line: 164, baseType: !97, size: 16, offset: 160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !745, file: !136, line: 165, baseType: !97, size: 16, offset: 176)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !745, file: !136, line: 166, baseType: !141, size: 32, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !745, file: !136, line: 167, baseType: !141, size: 32, offset: 224)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !167, file: !136, line: 1254, baseType: !123, size: 128, offset: 34368)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "transform_spaces", scope: !167, file: !136, line: 1255, baseType: !123, size: 128, offset: 34496)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sound_scene", scope: !167, file: !136, line: 1257, baseType: !68, size: 64, offset: 34624)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "sound_scene_handle", scope: !167, file: !136, line: 1258, baseType: !68, size: 64, offset: 34688)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sound_scrub_handle", scope: !167, file: !136, line: 1259, baseType: !68, size: 64, offset: 34752)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handles", scope: !167, file: !136, line: 1260, baseType: !68, size: 64, offset: 34816)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fps_info", scope: !167, file: !136, line: 1262, baseType: !68, size: 64, offset: 34880)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "theDag", scope: !167, file: !136, line: 1265, baseType: !764, size: 64, offset: 34944)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "DagForest", file: !136, line: 1265, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dagflags", scope: !167, file: !136, line: 1266, baseType: !97, size: 16, offset: 35008)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !167, file: !136, line: 1267, baseType: !97, size: 16, offset: 35024)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "active_keyingset", scope: !167, file: !136, line: 1270, baseType: !48, size: 32, offset: 35040)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "keyingsets", scope: !167, file: !136, line: 1271, baseType: !123, size: 128, offset: 35072)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "framing", scope: !167, file: !136, line: 1274, baseType: !771, size: 128, offset: 35200)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameFraming", file: !136, line: 650, size: 128, elements: !772)
!772 = !{!773, !774, !775, !776, !777}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !771, file: !136, line: 651, baseType: !191, size: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !136, line: 652, baseType: !84, size: 8, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !771, file: !136, line: 652, baseType: !84, size: 8, offset: 104)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !771, file: !136, line: 652, baseType: !84, size: 8, offset: 112)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !771, file: !136, line: 652, baseType: !84, size: 8, offset: 120)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "gm", scope: !167, file: !136, line: 1275, baseType: !779, size: 1472, offset: 35328)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameData", file: !136, line: 676, size: 1472, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !793, !803, !804, !805, !806, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "framing", scope: !779, file: !136, line: 679, baseType: !771, size: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "playerflag", scope: !779, file: !136, line: 680, baseType: !97, size: 16, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "xplay", scope: !779, file: !136, line: 680, baseType: !97, size: 16, offset: 144)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "yplay", scope: !779, file: !136, line: 680, baseType: !97, size: 16, offset: 160)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "freqplay", scope: !779, file: !136, line: 680, baseType: !97, size: 16, offset: 176)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !779, file: !136, line: 681, baseType: !97, size: 16, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !779, file: !136, line: 681, baseType: !97, size: 16, offset: 208)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rt1", scope: !779, file: !136, line: 681, baseType: !97, size: 16, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rt2", scope: !779, file: !136, line: 681, baseType: !97, size: 16, offset: 240)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "aasamples", scope: !779, file: !136, line: 682, baseType: !97, size: 16, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !779, file: !136, line: 682, baseType: !792, size: 48, offset: 272)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 48, elements: !192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dome", scope: !779, file: !136, line: 685, baseType: !794, size: 192, offset: 320)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameDome", file: !136, line: 633, size: 192, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "res", scope: !794, file: !136, line: 634, baseType: !97, size: 16)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !794, file: !136, line: 634, baseType: !97, size: 16, offset: 16)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !794, file: !136, line: 635, baseType: !97, size: 16, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tilt", scope: !794, file: !136, line: 635, baseType: !97, size: 16, offset: 48)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "resbuf", scope: !794, file: !136, line: 636, baseType: !141, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !794, file: !136, line: 636, baseType: !141, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "warptext", scope: !794, file: !136, line: 637, baseType: !717, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "stereoflag", scope: !779, file: !136, line: 686, baseType: !97, size: 16, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "stereomode", scope: !779, file: !136, line: 686, baseType: !97, size: 16, offset: 528)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "eyeseparation", scope: !779, file: !136, line: 687, baseType: !141, size: 32, offset: 544)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "recastData", scope: !779, file: !136, line: 688, baseType: !807, size: 448, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "RecastData", file: !136, line: 674, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RecastData", file: !136, line: 659, size: 448, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "cellsize", scope: !808, file: !136, line: 660, baseType: !141, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "cellheight", scope: !808, file: !136, line: 661, baseType: !141, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "agentmaxslope", scope: !808, file: !136, line: 662, baseType: !141, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "agentmaxclimb", scope: !808, file: !136, line: 663, baseType: !141, size: 32, offset: 96)
