; ModuleID = 'blender/source/blender/editors/gpencil/drawgpencil.c'
source_filename = "blender/source/blender/editors/gpencil/drawgpencil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }

!6 = !DIEnumerator(name: "GP_DRAWDATA_NOSTATUS", value: 1, isUnsigned: true)
!7 = !DIEnumerator(name: "GP_DRAWDATA_ONLY3D", value: 2, isUnsigned: true)
!8 = !DIEnumerator(name: "GP_DRAWDATA_ONLYV2D", value: 4, isUnsigned: true)
!9 = !DIEnumerator(name: "GP_DRAWDATA_ONLYI2D", value: 8, isUnsigned: true)
!10 = !DIEnumerator(name: "GP_DRAWDATA_IEDITHACK", value: 16, isUnsigned: true)
!11 = !DIEnumerator(name: "GP_DRAWDATA_NO_XRAY", value: 32, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !13, line: 1163, baseType: !4, size: 32, elements: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!15 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!26 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!27 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!28 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!29 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!30 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!31 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!32 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!33 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!34 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!35 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!36 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 123, baseType: !4, size: 32, elements: !39)
!38 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48}
!40 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!44 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!45 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!46 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!47 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!48 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!49 = !{!50, !51, !52}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!51 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !{i32 7, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 4}
!56 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!57 = distinct !DISubprogram(name: "ED_gpencil_draw_2dimage", scope: !1, file: !1, line: 679, type: !58, scopeLine: 680, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !66)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !63, line: 69, baseType: !64)
!63 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !65, line: 44, flags: DIFlagFwdDecl)
!65 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !{}
!67 = !DILocalVariable(name: "C", arg: 1, scope: !57, file: !1, line: 679, type: !60)
!68 = !DILocation(line: 679, column: 46, scope: !57)
!69 = !DILocalVariable(name: "sa", scope: !57, file: !1, line: 681, type: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrArea", file: !72, line: 228, baseType: !73)
!72 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !72, line: 203, size: 1280, elements: !74)
!74 = !{!75, !77, !78, !97, !98, !99, !100, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1418, !1419, !1420, !1421}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !73, file: !72, line: 204, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !73, file: !72, line: 204, baseType: !76, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !73, file: !72, line: 206, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !72, line: 87, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !72, line: 82, size: 256, elements: !82)
!82 = !{!83, !85, !86, !87, !95, !96}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !72, line: 83, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !81, file: !72, line: 83, baseType: !84, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !81, file: !72, line: 83, baseType: !84, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !81, file: !72, line: 84, baseType: !88, size: 32, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !89, line: 43, baseType: !90)
!89 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !89, line: 41, size: 32, elements: !91)
!91 = !{!92, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !90, file: !89, line: 42, baseType: !93, size: 16)
!93 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !90, file: !89, line: 42, baseType: !93, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !81, file: !72, line: 86, baseType: !93, size: 16, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !81, file: !72, line: 86, baseType: !93, size: 16, offset: 240)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !73, file: !72, line: 206, baseType: !79, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !73, file: !72, line: 206, baseType: !79, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !73, file: !72, line: 206, baseType: !79, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !73, file: !72, line: 207, baseType: !101, size: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !72, line: 80, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !72, line: 49, size: 1984, elements: !104)
!104 = !{!105, !174, !175, !176, !177, !178, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1403}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !103, file: !72, line: 50, baseType: !106, size: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !107, line: 130, baseType: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !107, line: 117, size: 960, elements: !109)
!109 = !{!110, !111, !112, !114, !134, !138, !139, !140, !141, !142}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !108, file: !107, line: 118, baseType: !50, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !108, file: !107, line: 118, baseType: !50, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !108, file: !107, line: 119, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !108, file: !107, line: 120, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !107, line: 136, size: 17600, elements: !117)
!117 = !{!118, !119, !121, !124, !129, !130, !131}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !116, file: !107, line: 137, baseType: !106, size: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !116, file: !107, line: 138, baseType: !120, size: 64, offset: 960)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !116, file: !107, line: 139, baseType: !122, size: 64, offset: 1024)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !107, line: 43, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !107, line: 140, baseType: !125, size: 8192, offset: 1088)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8192, elements: !127)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!127 = !{!128}
!128 = !DISubrange(count: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !116, file: !107, line: 141, baseType: !125, size: 8192, offset: 9280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !116, file: !107, line: 148, baseType: !115, size: 64, offset: 17472)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !116, file: !107, line: 150, baseType: !132, size: 64, offset: 17536)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !107, line: 45, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !107, line: 121, baseType: !135, size: 528, offset: 256)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 528, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 66)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !108, file: !107, line: 126, baseType: !93, size: 16, offset: 784)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !108, file: !107, line: 127, baseType: !52, size: 32, offset: 800)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !108, file: !107, line: 128, baseType: !52, size: 32, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !108, file: !107, line: 128, baseType: !52, size: 32, offset: 864)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !108, file: !107, line: 129, baseType: !143, size: 64, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !107, line: 75, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !107, line: 62, size: 1024, elements: !146)
!146 = !{!147, !149, !150, !151, !152, !153, !157, !158, !172, !173}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !107, line: 63, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !145, file: !107, line: 63, baseType: !148, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !107, line: 64, baseType: !126, size: 8, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !145, file: !107, line: 64, baseType: !126, size: 8, offset: 136)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !107, line: 65, baseType: !93, size: 16, offset: 144)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !107, line: 66, baseType: !154, size: 512, offset: 160)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !145, file: !107, line: 67, baseType: !52, size: 32, offset: 672)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !145, file: !107, line: 69, baseType: !159, size: 256, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !107, line: 60, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !107, line: 48, size: 256, elements: !161)
!161 = !{!162, !163, !170, !171}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !160, file: !107, line: 49, baseType: !50, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !160, file: !107, line: 58, baseType: !164, size: 128, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !165, line: 71, baseType: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !165, line: 69, size: 128, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !166, file: !165, line: 70, baseType: !50, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !166, file: !165, line: 70, baseType: !50, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !107, line: 59, baseType: !52, size: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !160, file: !107, line: 59, baseType: !52, size: 32, offset: 224)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !145, file: !107, line: 70, baseType: !52, size: 32, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !145, file: !107, line: 74, baseType: !52, size: 32, offset: 992)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !103, file: !72, line: 52, baseType: !164, size: 128, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !103, file: !72, line: 53, baseType: !164, size: 128, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !103, file: !72, line: 54, baseType: !164, size: 128, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !103, file: !72, line: 55, baseType: !164, size: 128, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !103, file: !72, line: 57, baseType: !179, size: 64, offset: 1472)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !181, line: 1216, size: 39680, elements: !182)
!181 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!182 = !{!183, !184, !187, !190, !193, !194, !195, !207, !208, !212, !213, !214, !215, !216, !217, !218, !219, !220, !224, !310, !747, !962, !965, !1254, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1276, !1277, !1278, !1279, !1280, !1288, !1355, !1362, !1363, !1370, !1371, !1377, !1378, !1379, !1380, !1381}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !180, file: !181, line: 1217, baseType: !106, size: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !180, file: !181, line: 1218, baseType: !185, size: 64, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !181, line: 58, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !180, file: !181, line: 1220, baseType: !188, size: 64, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !181, line: 50, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !180, file: !181, line: 1221, baseType: !191, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !181, line: 52, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !180, file: !181, line: 1223, baseType: !179, size: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !180, file: !181, line: 1225, baseType: !164, size: 128, offset: 1216)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !180, file: !181, line: 1226, baseType: !196, size: 64, offset: 1344)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !181, line: 69, size: 320, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !181, line: 70, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !197, file: !181, line: 70, baseType: !196, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !197, file: !181, line: 71, baseType: !4, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !197, file: !181, line: 71, baseType: !4, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !197, file: !181, line: 72, baseType: !52, size: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !197, file: !181, line: 73, baseType: !93, size: 16, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !197, file: !181, line: 73, baseType: !93, size: 16, offset: 240)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !197, file: !181, line: 74, baseType: !188, size: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !180, file: !181, line: 1227, baseType: !188, size: 64, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !180, file: !181, line: 1229, baseType: !209, size: 96, offset: 1472)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 96, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 3)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !180, file: !181, line: 1230, baseType: !209, size: 96, offset: 1568)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !180, file: !181, line: 1231, baseType: !209, size: 96, offset: 1664)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !180, file: !181, line: 1231, baseType: !209, size: 96, offset: 1760)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !180, file: !181, line: 1233, baseType: !4, size: 32, offset: 1856)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !180, file: !181, line: 1234, baseType: !52, size: 32, offset: 1888)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !180, file: !181, line: 1235, baseType: !4, size: 32, offset: 1920)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !180, file: !181, line: 1237, baseType: !93, size: 16, offset: 1952)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !180, file: !181, line: 1239, baseType: !126, size: 8, offset: 1968)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !180, file: !181, line: 1240, baseType: !221, size: 8, offset: 1976)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 1)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !180, file: !181, line: 1242, baseType: !225, size: 64, offset: 1984)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !227, line: 328, size: 3456, elements: !228)
!227 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = !{!229, !230, !231, !234, !235, !238, !249, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !275, !276, !277, !280, !285, !286, !289, !293, !298, !302, !306, !307, !308, !309}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !226, file: !227, line: 329, baseType: !106, size: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !226, file: !227, line: 330, baseType: !185, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !226, file: !227, line: 332, baseType: !232, size: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !227, line: 332, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !226, file: !227, line: 333, baseType: !154, size: 512, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !226, file: !227, line: 335, baseType: !236, size: 64, offset: 1600)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !227, line: 335, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !226, file: !227, line: 337, baseType: !239, size: 64, offset: 1664)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !241, line: 130, size: 1216, elements: !242)
!241 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !{!243, !244, !245, !246, !247, !248}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !240, file: !241, line: 131, baseType: !106, size: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !240, file: !241, line: 134, baseType: !164, size: 128, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !240, file: !241, line: 135, baseType: !52, size: 32, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !240, file: !241, line: 141, baseType: !93, size: 16, offset: 1120)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !240, file: !241, line: 142, baseType: !93, size: 16, offset: 1136)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !240, file: !241, line: 143, baseType: !50, size: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !226, file: !227, line: 338, baseType: !250, size: 64, offset: 1728)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 2)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !226, file: !227, line: 340, baseType: !164, size: 128, offset: 1792)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !226, file: !227, line: 340, baseType: !164, size: 128, offset: 1920)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !227, line: 342, baseType: !52, size: 32, offset: 2048)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !226, file: !227, line: 342, baseType: !52, size: 32, offset: 2080)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !226, file: !227, line: 343, baseType: !52, size: 32, offset: 2112)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !226, file: !227, line: 345, baseType: !52, size: 32, offset: 2144)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !226, file: !227, line: 346, baseType: !52, size: 32, offset: 2176)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !226, file: !227, line: 347, baseType: !93, size: 16, offset: 2208)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !226, file: !227, line: 348, baseType: !93, size: 16, offset: 2224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !226, file: !227, line: 349, baseType: !52, size: 32, offset: 2240)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !226, file: !227, line: 351, baseType: !52, size: 32, offset: 2272)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !226, file: !227, line: 353, baseType: !93, size: 16, offset: 2304)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !226, file: !227, line: 354, baseType: !93, size: 16, offset: 2320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !226, file: !227, line: 355, baseType: !52, size: 32, offset: 2336)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !226, file: !227, line: 357, baseType: !268, size: 128, offset: 2368)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !89, line: 95, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !89, line: 92, size: 128, elements: !270)
!270 = !{!271, !272, !273, !274}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !269, file: !89, line: 93, baseType: !51, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !269, file: !89, line: 93, baseType: !51, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !269, file: !89, line: 94, baseType: !51, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !269, file: !89, line: 94, baseType: !51, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !226, file: !227, line: 363, baseType: !164, size: 128, offset: 2496)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !226, file: !227, line: 363, baseType: !164, size: 128, offset: 2624)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !226, file: !227, line: 368, baseType: !278, size: 64, offset: 2752)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !227, line: 48, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !226, file: !227, line: 372, baseType: !281, size: 32, offset: 2816)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !227, line: 274, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !227, line: 271, size: 32, elements: !283)
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !282, file: !227, line: 273, baseType: !4, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !226, file: !227, line: 373, baseType: !52, size: 32, offset: 2848)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !226, file: !227, line: 382, baseType: !287, size: 64, offset: 2880)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !227, line: 46, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !226, file: !227, line: 385, baseType: !290, size: 64, offset: 2944)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !50, !51}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !226, file: !227, line: 386, baseType: !294, size: 64, offset: 3008)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !50, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !226, file: !227, line: 387, baseType: !299, size: 64, offset: 3072)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!52, !50}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !226, file: !227, line: 388, baseType: !303, size: 64, offset: 3136)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !50}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !226, file: !227, line: 389, baseType: !50, size: 64, offset: 3200)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !226, file: !227, line: 389, baseType: !50, size: 64, offset: 3264)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !226, file: !227, line: 389, baseType: !50, size: 64, offset: 3328)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !226, file: !227, line: 389, baseType: !50, size: 64, offset: 3392)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !180, file: !181, line: 1244, baseType: !311, size: 64, offset: 2048)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !313, line: 200, size: 17024, elements: !314)
!313 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = !{!315, !317, !318, !319, !740, !741, !742, !743, !744, !745, !746}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !312, file: !313, line: 201, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !312, file: !313, line: 202, baseType: !164, size: 128, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !312, file: !313, line: 203, baseType: !164, size: 128, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !312, file: !313, line: 206, baseType: !320, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !313, line: 190, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !313, line: 126, size: 2816, elements: !323)
!323 = !{!324, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !423, !426, !427, !428, !712, !715, !716, !717, !718, !719, !720, !721, !722, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !739}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !313, line: 127, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !322, file: !313, line: 127, baseType: !325, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !322, file: !313, line: 128, baseType: !50, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !322, file: !313, line: 129, baseType: !50, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !313, line: 130, baseType: !154, size: 512, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !313, line: 132, baseType: !52, size: 32, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !313, line: 132, baseType: !52, size: 32, offset: 800)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !322, file: !313, line: 133, baseType: !52, size: 32, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !322, file: !313, line: 134, baseType: !52, size: 32, offset: 864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !322, file: !313, line: 134, baseType: !52, size: 32, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !322, file: !313, line: 134, baseType: !52, size: 32, offset: 928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !322, file: !313, line: 135, baseType: !52, size: 32, offset: 960)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !322, file: !313, line: 135, baseType: !52, size: 32, offset: 992)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !322, file: !313, line: 136, baseType: !52, size: 32, offset: 1024)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !322, file: !313, line: 136, baseType: !52, size: 32, offset: 1056)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !322, file: !313, line: 137, baseType: !52, size: 32, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !322, file: !313, line: 137, baseType: !52, size: 32, offset: 1120)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !322, file: !313, line: 138, baseType: !51, size: 32, offset: 1152)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !322, file: !313, line: 139, baseType: !51, size: 32, offset: 1184)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !322, file: !313, line: 139, baseType: !51, size: 32, offset: 1216)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !322, file: !313, line: 141, baseType: !93, size: 16, offset: 1248)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !322, file: !313, line: 142, baseType: !93, size: 16, offset: 1264)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !322, file: !313, line: 143, baseType: !52, size: 32, offset: 1280)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !322, file: !313, line: 144, baseType: !52, size: 32, offset: 1312)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !322, file: !313, line: 146, baseType: !350, size: 64, offset: 1344)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !313, line: 114, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !313, line: 99, size: 7232, elements: !353)
!353 = !{!354, !356, !357, !358, !359, !360, !361, !372, !376, !391, !400, !407, !417}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !313, line: 100, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !352, file: !313, line: 100, baseType: !355, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !352, file: !313, line: 101, baseType: !52, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !352, file: !313, line: 101, baseType: !52, size: 32, offset: 160)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !352, file: !313, line: 102, baseType: !52, size: 32, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !352, file: !313, line: 102, baseType: !52, size: 32, offset: 224)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !352, file: !313, line: 103, baseType: !362, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !313, line: 59, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !313, line: 56, size: 2112, elements: !365)
!365 = !{!366, !370, !371}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !364, file: !313, line: 57, baseType: !367, size: 2048)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !364, file: !313, line: 58, baseType: !52, size: 32, offset: 2048)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !364, file: !313, line: 58, baseType: !52, size: 32, offset: 2080)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !352, file: !313, line: 106, baseType: !373, size: 6144, offset: 320)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 6144, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !352, file: !313, line: 107, baseType: !377, size: 64, offset: 6464)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !313, line: 97, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !313, line: 83, size: 8320, elements: !380)
!380 = !{!381, !382, !383, !387, !388, !389, !390}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !379, file: !313, line: 84, baseType: !373, size: 6144)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !379, file: !313, line: 87, baseType: !367, size: 2048, offset: 6144)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !379, file: !313, line: 88, baseType: !384, size: 64, offset: 8192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !386, line: 41, flags: DIFlagFwdDecl)
!386 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !379, file: !313, line: 90, baseType: !93, size: 16, offset: 8256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !379, file: !313, line: 92, baseType: !93, size: 16, offset: 8272)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !379, file: !313, line: 93, baseType: !93, size: 16, offset: 8288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !379, file: !313, line: 95, baseType: !93, size: 16, offset: 8304)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !352, file: !313, line: 108, baseType: !392, size: 64, offset: 6528)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !313, line: 66, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !313, line: 61, size: 128, elements: !395)
!395 = !{!396, !397, !398, !399}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !394, file: !313, line: 62, baseType: !52, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !394, file: !313, line: 63, baseType: !52, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !394, file: !313, line: 64, baseType: !52, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !394, file: !313, line: 65, baseType: !52, size: 32, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !352, file: !313, line: 109, baseType: !401, size: 64, offset: 6592)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !313, line: 71, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !313, line: 68, size: 64, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !403, file: !313, line: 69, baseType: !52, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !403, file: !313, line: 70, baseType: !52, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !352, file: !313, line: 110, baseType: !408, size: 64, offset: 6656)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !313, line: 81, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !313, line: 73, size: 352, elements: !411)
!411 = !{!412, !413, !414, !415, !416}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !410, file: !313, line: 74, baseType: !209, size: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !410, file: !313, line: 75, baseType: !209, size: 96, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !410, file: !313, line: 76, baseType: !209, size: 96, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !410, file: !313, line: 77, baseType: !52, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !410, file: !313, line: 78, baseType: !52, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !352, file: !313, line: 113, baseType: !418, size: 512, offset: 6720)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !419, line: 182, baseType: !420)
!419 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !419, line: 180, size: 512, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !420, file: !419, line: 181, baseType: !154, size: 512)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !322, file: !313, line: 148, baseType: !424, size: 64, offset: 1408)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !313, line: 49, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !322, file: !313, line: 151, baseType: !179, size: 64, offset: 1472)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !322, file: !313, line: 152, baseType: !188, size: 64, offset: 1536)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !322, file: !313, line: 153, baseType: !429, size: 64, offset: 1600)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !431, line: 64, size: 19136, elements: !432)
!431 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!432 = !{!433, !434, !435, !436, !437, !438, !440, !441, !442, !443, !446, !447, !698, !699, !707, !708, !709, !710, !711}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !430, file: !431, line: 65, baseType: !106, size: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !430, file: !431, line: 66, baseType: !185, size: 64, offset: 960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !430, file: !431, line: 68, baseType: !125, size: 8192, offset: 1024)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !430, file: !431, line: 70, baseType: !52, size: 32, offset: 9216)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !430, file: !431, line: 71, baseType: !52, size: 32, offset: 9248)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !430, file: !431, line: 72, baseType: !439, size: 64, offset: 9280)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !251)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !430, file: !431, line: 74, baseType: !51, size: 32, offset: 9344)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !430, file: !431, line: 74, baseType: !51, size: 32, offset: 9376)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !430, file: !431, line: 76, baseType: !384, size: 64, offset: 9408)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !430, file: !431, line: 77, baseType: !444, size: 64, offset: 9472)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !431, line: 77, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !430, file: !431, line: 78, baseType: !239, size: 64, offset: 9536)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !430, file: !431, line: 80, baseType: !448, size: 2624, offset: 9600)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !449, line: 340, size: 2624, elements: !450)
!449 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!450 = !{!451, !479, !497, !498, !499, !517, !575, !576, !678, !679, !680, !681, !687}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !448, file: !449, line: 341, baseType: !452, size: 576)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !449, line: 251, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !449, line: 207, size: 576, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !449, line: 208, baseType: !52, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !453, file: !449, line: 211, baseType: !93, size: 16, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !453, file: !449, line: 212, baseType: !93, size: 16, offset: 48)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !453, file: !449, line: 213, baseType: !51, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !453, file: !449, line: 214, baseType: !93, size: 16, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !453, file: !449, line: 215, baseType: !93, size: 16, offset: 112)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !453, file: !449, line: 216, baseType: !93, size: 16, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !453, file: !449, line: 217, baseType: !93, size: 16, offset: 144)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !453, file: !449, line: 218, baseType: !93, size: 16, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !453, file: !449, line: 219, baseType: !93, size: 16, offset: 176)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !453, file: !449, line: 220, baseType: !51, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !453, file: !449, line: 222, baseType: !93, size: 16, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !453, file: !449, line: 225, baseType: !93, size: 16, offset: 240)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !453, file: !449, line: 228, baseType: !52, size: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !453, file: !449, line: 229, baseType: !52, size: 32, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !453, file: !449, line: 233, baseType: !52, size: 32, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !453, file: !449, line: 236, baseType: !93, size: 16, offset: 352)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !453, file: !449, line: 236, baseType: !93, size: 16, offset: 368)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !453, file: !449, line: 241, baseType: !51, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !453, file: !449, line: 244, baseType: !52, size: 32, offset: 416)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !453, file: !449, line: 244, baseType: !52, size: 32, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !453, file: !449, line: 245, baseType: !51, size: 32, offset: 480)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !453, file: !449, line: 248, baseType: !51, size: 32, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !453, file: !449, line: 250, baseType: !52, size: 32, offset: 544)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !448, file: !449, line: 342, baseType: !480, size: 448, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !449, line: 79, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !449, line: 61, size: 448, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !481, file: !449, line: 62, baseType: !50, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !481, file: !449, line: 64, baseType: !93, size: 16, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !481, file: !449, line: 65, baseType: !93, size: 16, offset: 80)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !481, file: !449, line: 67, baseType: !51, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !481, file: !449, line: 68, baseType: !51, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !481, file: !449, line: 69, baseType: !51, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !481, file: !449, line: 70, baseType: !93, size: 16, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !481, file: !449, line: 71, baseType: !93, size: 16, offset: 208)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !481, file: !449, line: 72, baseType: !250, size: 64, offset: 224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !481, file: !449, line: 75, baseType: !51, size: 32, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !481, file: !449, line: 75, baseType: !51, size: 32, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !481, file: !449, line: 75, baseType: !51, size: 32, offset: 352)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !481, file: !449, line: 78, baseType: !51, size: 32, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !481, file: !449, line: 78, baseType: !51, size: 32, offset: 416)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !448, file: !449, line: 343, baseType: !164, size: 128, offset: 1024)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !448, file: !449, line: 344, baseType: !164, size: 128, offset: 1152)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !448, file: !449, line: 345, baseType: !500, size: 192, offset: 1280)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !449, line: 278, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !449, line: 270, size: 192, elements: !502)
!502 = !{!503, !504, !505, !506, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !449, line: 271, baseType: !52, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !501, file: !449, line: 273, baseType: !51, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !501, file: !449, line: 275, baseType: !52, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !501, file: !449, line: 276, baseType: !52, size: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !501, file: !449, line: 277, baseType: !508, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !449, line: 55, size: 576, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !509, file: !449, line: 56, baseType: !52, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !509, file: !449, line: 57, baseType: !51, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !509, file: !449, line: 58, baseType: !514, size: 512, offset: 64)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 512, elements: !515)
!515 = !{!516, !516}
!516 = !DISubrange(count: 4)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !448, file: !449, line: 346, baseType: !518, size: 384, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !449, line: 268, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !449, line: 253, size: 384, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !569, !570, !571, !572, !573, !574}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !519, file: !449, line: 254, baseType: !52, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !519, file: !449, line: 255, baseType: !52, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !519, file: !449, line: 255, baseType: !52, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !519, file: !449, line: 258, baseType: !51, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !519, file: !449, line: 259, baseType: !526, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !449, line: 164, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !449, line: 108, size: 1664, elements: !529)
!529 = !{!530, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !528, file: !449, line: 109, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !528, file: !449, line: 109, baseType: !531, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !449, line: 111, baseType: !154, size: 512, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !528, file: !449, line: 119, baseType: !250, size: 64, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !528, file: !449, line: 119, baseType: !250, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !528, file: !449, line: 125, baseType: !250, size: 64, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !528, file: !449, line: 125, baseType: !250, size: 64, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !528, file: !449, line: 127, baseType: !250, size: 64, offset: 896)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !528, file: !449, line: 130, baseType: !52, size: 32, offset: 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !528, file: !449, line: 131, baseType: !52, size: 32, offset: 992)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !528, file: !449, line: 132, baseType: !542, size: 64, offset: 1024)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !449, line: 106, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !449, line: 81, size: 512, elements: !545)
!545 = !{!546, !547, !550, !551, !552, !553}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !544, file: !449, line: 82, baseType: !250, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !544, file: !449, line: 97, baseType: !548, size: 256, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 256, elements: !549)
!549 = !{!516, !252}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !544, file: !449, line: 102, baseType: !250, size: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !544, file: !449, line: 102, baseType: !250, size: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !544, file: !449, line: 104, baseType: !52, size: 32, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !544, file: !449, line: 105, baseType: !52, size: 32, offset: 480)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !528, file: !449, line: 135, baseType: !209, size: 96, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !528, file: !449, line: 136, baseType: !51, size: 32, offset: 1184)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !528, file: !449, line: 139, baseType: !52, size: 32, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !528, file: !449, line: 139, baseType: !52, size: 32, offset: 1248)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !528, file: !449, line: 139, baseType: !52, size: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !528, file: !449, line: 140, baseType: !209, size: 96, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !528, file: !449, line: 143, baseType: !93, size: 16, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !528, file: !449, line: 144, baseType: !93, size: 16, offset: 1424)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !528, file: !449, line: 145, baseType: !93, size: 16, offset: 1440)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !528, file: !449, line: 148, baseType: !93, size: 16, offset: 1456)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !528, file: !449, line: 149, baseType: !52, size: 32, offset: 1472)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !528, file: !449, line: 150, baseType: !51, size: 32, offset: 1504)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !528, file: !449, line: 152, baseType: !239, size: 64, offset: 1536)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !528, file: !449, line: 163, baseType: !51, size: 32, offset: 1600)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !528, file: !449, line: 163, baseType: !51, size: 32, offset: 1632)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !519, file: !449, line: 261, baseType: !51, size: 32, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !519, file: !449, line: 261, baseType: !51, size: 32, offset: 224)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !519, file: !449, line: 261, baseType: !51, size: 32, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !519, file: !449, line: 263, baseType: !52, size: 32, offset: 288)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !519, file: !449, line: 266, baseType: !52, size: 32, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !519, file: !449, line: 267, baseType: !51, size: 32, offset: 352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !448, file: !449, line: 347, baseType: !526, size: 64, offset: 1856)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !448, file: !449, line: 348, baseType: !577, size: 64, offset: 1920)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !449, line: 205, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !449, line: 186, size: 1024, elements: !580)
!580 = !{!581, !583, !584, !585, !587, !588, !589, !597, !598, !599, !676, !677}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !579, file: !449, line: 187, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !579, file: !449, line: 187, baseType: !582, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !449, line: 189, baseType: !154, size: 512, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !579, file: !449, line: 191, baseType: !586, size: 64, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !579, file: !449, line: 193, baseType: !52, size: 32, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !579, file: !449, line: 193, baseType: !52, size: 32, offset: 736)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !579, file: !449, line: 195, baseType: !590, size: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !449, line: 184, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !449, line: 166, size: 320, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !592, file: !449, line: 180, baseType: !548, size: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !592, file: !449, line: 182, baseType: !52, size: 32, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !592, file: !449, line: 183, baseType: !52, size: 32, offset: 288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !579, file: !449, line: 196, baseType: !52, size: 32, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !579, file: !449, line: 198, baseType: !52, size: 32, offset: 864)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !579, file: !449, line: 200, baseType: !600, size: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !386, line: 77, size: 15424, elements: !602)
!602 = !{!603, !604, !605, !608, !611, !612, !615, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !635, !636, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !662, !663, !664, !665, !666, !670}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !601, file: !386, line: 78, baseType: !106, size: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !601, file: !386, line: 80, baseType: !125, size: 8192, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !601, file: !386, line: 82, baseType: !606, size: 64, offset: 9152)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !386, line: 43, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !601, file: !386, line: 83, baseType: !609, size: 64, offset: 9216)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !107, line: 46, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !601, file: !386, line: 86, baseType: !384, size: 64, offset: 9280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !601, file: !386, line: 87, baseType: !613, size: 64, offset: 9344)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !386, line: 44, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !601, file: !386, line: 89, baseType: !616, size: 512, offset: 9408)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 512, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 8)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !601, file: !386, line: 90, baseType: !93, size: 16, offset: 9920)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !601, file: !386, line: 90, baseType: !93, size: 16, offset: 9936)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !601, file: !386, line: 92, baseType: !93, size: 16, offset: 9952)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !386, line: 92, baseType: !93, size: 16, offset: 9968)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !601, file: !386, line: 93, baseType: !93, size: 16, offset: 9984)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !386, line: 93, baseType: !93, size: 16, offset: 10000)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !601, file: !386, line: 94, baseType: !52, size: 32, offset: 10016)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !601, file: !386, line: 97, baseType: !93, size: 16, offset: 10048)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !601, file: !386, line: 97, baseType: !93, size: 16, offset: 10064)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !601, file: !386, line: 98, baseType: !93, size: 16, offset: 10080)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !601, file: !386, line: 98, baseType: !93, size: 16, offset: 10096)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !601, file: !386, line: 99, baseType: !93, size: 16, offset: 10112)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !601, file: !386, line: 99, baseType: !93, size: 16, offset: 10128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !601, file: !386, line: 100, baseType: !4, size: 32, offset: 10144)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !601, file: !386, line: 101, baseType: !634, size: 64, offset: 10176)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !601, file: !386, line: 103, baseType: !132, size: 64, offset: 10240)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !601, file: !386, line: 104, baseType: !637, size: 64, offset: 10304)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !107, line: 159, size: 448, elements: !639)
!639 = !{!640, !642, !643, !645, !646, !648}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !638, file: !107, line: 161, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !251)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !638, file: !107, line: 162, baseType: !641, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !638, file: !107, line: 163, baseType: !644, size: 32, offset: 128)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !251)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !638, file: !107, line: 164, baseType: !644, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !638, file: !107, line: 165, baseType: !647, size: 128, offset: 192)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 128, elements: !251)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !638, file: !107, line: 166, baseType: !649, size: 128, offset: 320)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 128, elements: !251)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !601, file: !386, line: 107, baseType: !51, size: 32, offset: 10368)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !601, file: !386, line: 108, baseType: !52, size: 32, offset: 10400)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !601, file: !386, line: 109, baseType: !93, size: 16, offset: 10432)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !601, file: !386, line: 110, baseType: !93, size: 16, offset: 10448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !601, file: !386, line: 113, baseType: !52, size: 32, offset: 10464)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !601, file: !386, line: 113, baseType: !52, size: 32, offset: 10496)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !601, file: !386, line: 114, baseType: !126, size: 8, offset: 10528)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !601, file: !386, line: 114, baseType: !126, size: 8, offset: 10536)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !601, file: !386, line: 115, baseType: !93, size: 16, offset: 10544)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !601, file: !386, line: 116, baseType: !660, size: 128, offset: 10560)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, elements: !661)
!661 = !{!516}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !601, file: !386, line: 119, baseType: !51, size: 32, offset: 10688)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !601, file: !386, line: 119, baseType: !51, size: 32, offset: 10720)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !601, file: !386, line: 122, baseType: !418, size: 512, offset: 10752)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !601, file: !386, line: 123, baseType: !126, size: 8, offset: 11264)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !601, file: !386, line: 125, baseType: !667, size: 56, offset: 11272)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 56, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 7)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !601, file: !386, line: 126, baseType: !671, size: 4096, offset: 11328)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 4096, elements: !617)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !386, line: 69, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !386, line: 67, size: 512, elements: !674)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !673, file: !386, line: 68, baseType: !154, size: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !579, file: !449, line: 201, baseType: !51, size: 32, offset: 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !579, file: !449, line: 204, baseType: !52, size: 32, offset: 992)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !448, file: !449, line: 350, baseType: !164, size: 128, offset: 1984)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !448, file: !449, line: 351, baseType: !52, size: 32, offset: 2112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !448, file: !449, line: 351, baseType: !52, size: 32, offset: 2144)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !448, file: !449, line: 353, baseType: !682, size: 64, offset: 2176)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !449, line: 297, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !449, line: 295, size: 2048, elements: !685)
!685 = !{!686}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !684, file: !449, line: 296, baseType: !367, size: 2048)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !448, file: !449, line: 355, baseType: !688, size: 384, offset: 2240)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !449, line: 338, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !449, line: 322, size: 384, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !689, file: !449, line: 323, baseType: !52, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !689, file: !449, line: 325, baseType: !93, size: 16, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !689, file: !449, line: 326, baseType: !93, size: 16, offset: 48)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !689, file: !449, line: 331, baseType: !164, size: 128, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !689, file: !449, line: 334, baseType: !164, size: 128, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !689, file: !449, line: 335, baseType: !52, size: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !689, file: !449, line: 337, baseType: !52, size: 32, offset: 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !430, file: !431, line: 81, baseType: !50, size: 64, offset: 12224)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !430, file: !431, line: 85, baseType: !700, size: 6208, offset: 12288)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !431, line: 55, size: 6208, elements: !701)
!701 = !{!702, !703, !704, !705, !706}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !700, file: !431, line: 56, baseType: !373, size: 6144)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !700, file: !431, line: 58, baseType: !93, size: 16, offset: 6144)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !700, file: !431, line: 59, baseType: !93, size: 16, offset: 6160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !700, file: !431, line: 60, baseType: !93, size: 16, offset: 6176)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !700, file: !431, line: 61, baseType: !93, size: 16, offset: 6192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !430, file: !431, line: 86, baseType: !52, size: 32, offset: 18496)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !430, file: !431, line: 88, baseType: !52, size: 32, offset: 18528)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !430, file: !431, line: 90, baseType: !52, size: 32, offset: 18560)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !430, file: !431, line: 94, baseType: !52, size: 32, offset: 18592)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !430, file: !431, line: 100, baseType: !418, size: 512, offset: 18624)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !322, file: !313, line: 154, baseType: !713, size: 64, offset: 1664)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !313, line: 154, flags: DIFlagFwdDecl)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !322, file: !313, line: 156, baseType: !384, size: 64, offset: 1728)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !322, file: !313, line: 158, baseType: !51, size: 32, offset: 1792)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !322, file: !313, line: 159, baseType: !51, size: 32, offset: 1824)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !322, file: !313, line: 162, baseType: !325, size: 64, offset: 1856)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !322, file: !313, line: 162, baseType: !325, size: 64, offset: 1920)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !322, file: !313, line: 162, baseType: !325, size: 64, offset: 1984)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !322, file: !313, line: 164, baseType: !164, size: 128, offset: 2048)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !322, file: !313, line: 166, baseType: !723, size: 64, offset: 2176)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !313, line: 51, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !322, file: !313, line: 167, baseType: !50, size: 64, offset: 2240)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !322, file: !313, line: 168, baseType: !51, size: 32, offset: 2304)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !322, file: !313, line: 170, baseType: !51, size: 32, offset: 2336)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !322, file: !313, line: 170, baseType: !51, size: 32, offset: 2368)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !322, file: !313, line: 171, baseType: !51, size: 32, offset: 2400)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !322, file: !313, line: 173, baseType: !50, size: 64, offset: 2432)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !322, file: !313, line: 175, baseType: !52, size: 32, offset: 2496)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !322, file: !313, line: 176, baseType: !52, size: 32, offset: 2528)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !322, file: !313, line: 179, baseType: !52, size: 32, offset: 2560)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !322, file: !313, line: 180, baseType: !51, size: 32, offset: 2592)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !322, file: !313, line: 183, baseType: !52, size: 32, offset: 2624)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !322, file: !313, line: 185, baseType: !126, size: 8, offset: 2656)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !322, file: !313, line: 186, baseType: !738, size: 24, offset: 2664)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 24, elements: !210)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !322, file: !313, line: 189, baseType: !164, size: 128, offset: 2688)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !312, file: !313, line: 207, baseType: !125, size: 8192, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !312, file: !313, line: 208, baseType: !125, size: 8192, offset: 8576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !312, file: !313, line: 210, baseType: !52, size: 32, offset: 16768)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !312, file: !313, line: 210, baseType: !52, size: 32, offset: 16800)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !312, file: !313, line: 211, baseType: !52, size: 32, offset: 16832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !312, file: !313, line: 211, baseType: !52, size: 32, offset: 16864)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !312, file: !313, line: 212, baseType: !268, size: 128, offset: 16896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !180, file: !181, line: 1246, baseType: !748, size: 64, offset: 2112)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !181, line: 1067, size: 5184, elements: !750)
!750 = !{!751, !781, !782, !797, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !819, !835, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !945}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !749, file: !181, line: 1068, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !181, line: 934, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !181, line: 925, size: 576, elements: !755)
!755 = !{!756, !773, !774, !775, !776, !777, !780}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !754, file: !181, line: 926, baseType: !757, size: 320)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !181, line: 830, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !181, line: 813, size: 320, elements: !759)
!759 = !{!760, !763, !766, !767, !770, !771, !772}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !758, file: !181, line: 814, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !181, line: 51, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !758, file: !181, line: 815, baseType: !764, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !181, line: 815, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !758, file: !181, line: 818, baseType: !50, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !758, file: !181, line: 819, baseType: !768, size: 32, offset: 192)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 32, elements: !661)
!769 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !758, file: !181, line: 822, baseType: !52, size: 32, offset: 224)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !758, file: !181, line: 826, baseType: !52, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !758, file: !181, line: 829, baseType: !52, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !754, file: !181, line: 928, baseType: !93, size: 16, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !754, file: !181, line: 928, baseType: !93, size: 16, offset: 336)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !754, file: !181, line: 929, baseType: !52, size: 32, offset: 352)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !754, file: !181, line: 930, baseType: !634, size: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !754, file: !181, line: 931, baseType: !778, size: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !181, line: 931, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !754, file: !181, line: 933, baseType: !50, size: 64, offset: 512)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !749, file: !181, line: 1069, baseType: !752, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !749, file: !181, line: 1070, baseType: !783, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !181, line: 916, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !181, line: 891, size: 704, elements: !786)
!786 = !{!787, !788, !789, !791, !792, !793, !794, !795, !796}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !785, file: !181, line: 892, baseType: !757, size: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !785, file: !181, line: 896, baseType: !52, size: 32, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !785, file: !181, line: 900, baseType: !790, size: 96, offset: 352)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 96, elements: !210)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !785, file: !181, line: 903, baseType: !51, size: 32, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !785, file: !181, line: 906, baseType: !52, size: 32, offset: 480)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !785, file: !181, line: 909, baseType: !51, size: 32, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !785, file: !181, line: 912, baseType: !51, size: 32, offset: 544)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !785, file: !181, line: 914, baseType: !188, size: 64, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !785, file: !181, line: 915, baseType: !50, size: 64, offset: 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !749, file: !181, line: 1071, baseType: !798, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !181, line: 920, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !181, line: 918, size: 320, elements: !801)
!801 = !{!802}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !800, file: !181, line: 919, baseType: !757, size: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !749, file: !181, line: 1075, baseType: !51, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !749, file: !181, line: 1077, baseType: !51, size: 32, offset: 288)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !749, file: !181, line: 1078, baseType: !51, size: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !749, file: !181, line: 1079, baseType: !93, size: 16, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !749, file: !181, line: 1082, baseType: !93, size: 16, offset: 368)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !749, file: !181, line: 1085, baseType: !126, size: 8, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !749, file: !181, line: 1086, baseType: !126, size: 8, offset: 392)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !749, file: !181, line: 1087, baseType: !126, size: 8, offset: 400)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !749, file: !181, line: 1088, baseType: !126, size: 8, offset: 408)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !749, file: !181, line: 1090, baseType: !51, size: 32, offset: 416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !749, file: !181, line: 1093, baseType: !93, size: 16, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !749, file: !181, line: 1096, baseType: !126, size: 8, offset: 464)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !749, file: !181, line: 1098, baseType: !816, size: 40, offset: 472)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 40, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 5)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !749, file: !181, line: 1101, baseType: !820, size: 832, offset: 512)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !181, line: 836, size: 832, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !820, file: !181, line: 837, baseType: !757, size: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !820, file: !181, line: 839, baseType: !93, size: 16, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !820, file: !181, line: 839, baseType: !93, size: 16, offset: 336)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !820, file: !181, line: 842, baseType: !93, size: 16, offset: 352)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !820, file: !181, line: 842, baseType: !93, size: 16, offset: 368)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !820, file: !181, line: 843, baseType: !644, size: 32, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !820, file: !181, line: 845, baseType: !52, size: 32, offset: 416)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !820, file: !181, line: 847, baseType: !50, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !820, file: !181, line: 848, baseType: !600, size: 64, offset: 512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !820, file: !181, line: 849, baseType: !600, size: 64, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !820, file: !181, line: 850, baseType: !600, size: 64, offset: 640)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !820, file: !181, line: 851, baseType: !209, size: 96, offset: 704)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !820, file: !181, line: 852, baseType: !51, size: 32, offset: 800)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !749, file: !181, line: 1104, baseType: !836, size: 1344, offset: 1344)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !181, line: 867, size: 1344, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !836, file: !181, line: 868, baseType: !93, size: 16)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !836, file: !181, line: 869, baseType: !93, size: 16, offset: 16)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !836, file: !181, line: 870, baseType: !93, size: 16, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !836, file: !181, line: 871, baseType: !93, size: 16, offset: 48)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !836, file: !181, line: 873, baseType: !843, size: 896, offset: 64)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 896, elements: !668)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !181, line: 864, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !181, line: 859, size: 128, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !845, file: !181, line: 860, baseType: !93, size: 16)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !845, file: !181, line: 861, baseType: !93, size: 16, offset: 16)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !845, file: !181, line: 861, baseType: !93, size: 16, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !845, file: !181, line: 861, baseType: !93, size: 16, offset: 48)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !845, file: !181, line: 862, baseType: !52, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !845, file: !181, line: 863, baseType: !51, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !836, file: !181, line: 874, baseType: !50, size: 64, offset: 960)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !836, file: !181, line: 876, baseType: !51, size: 32, offset: 1024)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !836, file: !181, line: 876, baseType: !51, size: 32, offset: 1056)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !836, file: !181, line: 878, baseType: !52, size: 32, offset: 1088)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !836, file: !181, line: 879, baseType: !52, size: 32, offset: 1120)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !836, file: !181, line: 881, baseType: !52, size: 32, offset: 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !836, file: !181, line: 881, baseType: !52, size: 32, offset: 1184)
