; ModuleID = 'blender/source/blender/editors/space_file/file_draw.c'
source_filename = "blender/source/blender/editors/space_file/file_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!1152 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!1153 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!1154 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!1155 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!1156 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!1157 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!1158 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!1159 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!1160 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!1161 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!1162 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!1163 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!1164 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!1165 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!1166 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!1167 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!1168 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!1169 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!1170 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!1171 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!1172 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!1173 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!1174 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!1175 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!1176 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!1177 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!1178 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!1179 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!1180 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!1181 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!1182 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!1183 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDirEntry_SelectFlag", file: !88, line: 700, baseType: !5, size: 32, elements: !1184)
!1184 = !{!1185, !1186, !1187}
!1185 = !DIEnumerator(name: "HILITED_FILE", value: 4, isUnsigned: true)
!1186 = !DIEnumerator(name: "SELECTED_FILE", value: 8, isUnsigned: true)
!1187 = !DIEnumerator(name: "EDITING_FILE", value: 16, isUnsigned: true)
!1188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 787, baseType: !5, size: 32, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1194, !1195}
!1190 = !DIEnumerator(name: "UI_CNR_TOP_LEFT", value: 1, isUnsigned: true)
!1191 = !DIEnumerator(name: "UI_CNR_TOP_RIGHT", value: 2, isUnsigned: true)
!1192 = !DIEnumerator(name: "UI_CNR_BOTTOM_RIGHT", value: 4, isUnsigned: true)
!1193 = !DIEnumerator(name: "UI_CNR_BOTTOM_LEFT", value: 8, isUnsigned: true)
!1194 = !DIEnumerator(name: "UI_CNR_NONE", value: 0, isUnsigned: true)
!1195 = !DIEnumerator(name: "UI_CNR_ALL", value: 15, isUnsigned: true)
!1196 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFileSel_File_Types", file: !88, line: 682, baseType: !5, size: 32, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211}
!1198 = !DIEnumerator(name: "BLENDERFILE", value: 4, isUnsigned: true)
!1199 = !DIEnumerator(name: "BLENDERFILE_BACKUP", value: 8, isUnsigned: true)
!1200 = !DIEnumerator(name: "IMAGEFILE", value: 16, isUnsigned: true)
!1201 = !DIEnumerator(name: "MOVIEFILE", value: 32, isUnsigned: true)
!1202 = !DIEnumerator(name: "PYSCRIPTFILE", value: 64, isUnsigned: true)
!1203 = !DIEnumerator(name: "FTFONTFILE", value: 128, isUnsigned: true)
!1204 = !DIEnumerator(name: "SOUNDFILE", value: 256, isUnsigned: true)
!1205 = !DIEnumerator(name: "TEXTFILE", value: 512, isUnsigned: true)
!1206 = !DIEnumerator(name: "MOVIEFILE_ICON", value: 1024, isUnsigned: true)
!1207 = !DIEnumerator(name: "FOLDERFILE", value: 2048, isUnsigned: true)
!1208 = !DIEnumerator(name: "BTXFILE", value: 4096, isUnsigned: true)
!1209 = !DIEnumerator(name: "COLLADAFILE", value: 8192, isUnsigned: true)
!1210 = !DIEnumerator(name: "OPERATORFILE", value: 16384, isUnsigned: true)
!1211 = !DIEnumerator(name: "APPLICATIONBUNDLE", value: 32768, isUnsigned: true)
!1212 = !{!1213, !1214, !1215, !1216}
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1214 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1215 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceFile", file: !88, line: 622, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceFile", file: !88, line: 595, size: 832, elements: !1219)
!1219 = !{!1220, !1242, !1243, !1244, !1245, !1246, !1280, !1283, !1285, !1286, !2798, !2799, !2820, !2821, !2822, !2823}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1218, file: !88, line: 596, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !88, line: 91, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !88, line: 85, size: 448, elements: !1224)
!1224 = !{!1225, !1227, !1228, !1235, !1236, !1237}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1223, file: !88, line: 86, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1223, file: !88, line: 86, baseType: !1226, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1223, file: !88, line: 87, baseType: !1229, size: 128, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1230, line: 71, baseType: !1231)
!1230 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1230, line: 69, size: 128, elements: !1232)
!1232 = !{!1233, !1234}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1231, file: !1230, line: 70, baseType: !1213, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1231, file: !1230, line: 70, baseType: !1213, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1223, file: !88, line: 88, baseType: !1215, size: 32, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1223, file: !88, line: 89, baseType: !1214, size: 32, offset: 288)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1223, file: !88, line: 90, baseType: !1238, size: 128, offset: 320)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1239, size: 128, elements: !1240)
!1239 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1240 = !{!1241}
!1241 = !DISubrange(count: 8)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1218, file: !88, line: 596, baseType: !1221, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1218, file: !88, line: 597, baseType: !1229, size: 128, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1218, file: !88, line: 598, baseType: !1215, size: 32, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_offset", scope: !1218, file: !88, line: 600, baseType: !1215, size: 32, offset: 288)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !1218, file: !88, line: 602, baseType: !1247, size: 64, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileSelectParams", file: !88, line: 566, size: 16128, elements: !1249)
!1249 = !{!1250, !1255, !1259, !1263, !1264, !1265, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !1248, file: !88, line: 567, baseType: !1251, size: 768)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 768, elements: !1253)
!1252 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1253 = !{!1254}
!1254 = !DISubrange(count: 96)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1248, file: !88, line: 568, baseType: !1256, size: 8448, offset: 768)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 8448, elements: !1257)
!1257 = !{!1258}
!1258 = !DISubrange(count: 1056)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1248, file: !88, line: 570, baseType: !1260, size: 2048, offset: 9216)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 2048, elements: !1261)
!1261 = !{!1262}
!1262 = !DISubrange(count: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "renamefile", scope: !1248, file: !88, line: 571, baseType: !1260, size: 2048, offset: 11264)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "renameedit", scope: !1248, file: !88, line: 572, baseType: !1260, size: 2048, offset: 13312)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "filter_glob", scope: !1248, file: !88, line: 574, baseType: !1266, size: 512, offset: 15360)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 512, elements: !1267)
!1267 = !{!1268}
!1268 = !DISubrange(count: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "active_file", scope: !1248, file: !88, line: 576, baseType: !1215, size: 32, offset: 15872)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "sel_first", scope: !1248, file: !88, line: 577, baseType: !1215, size: 32, offset: 15904)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "sel_last", scope: !1248, file: !88, line: 578, baseType: !1215, size: 32, offset: 15936)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1248, file: !88, line: 581, baseType: !1239, size: 16, offset: 15968)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1248, file: !88, line: 582, baseType: !1239, size: 16, offset: 15984)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !1248, file: !88, line: 583, baseType: !1239, size: 16, offset: 16000)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1248, file: !88, line: 584, baseType: !1239, size: 16, offset: 16016)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1248, file: !88, line: 585, baseType: !1239, size: 16, offset: 16032)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "f_fp", scope: !1248, file: !88, line: 588, baseType: !1239, size: 16, offset: 16048)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "fp_str", scope: !1248, file: !88, line: 589, baseType: !1279, size: 64, offset: 16064)
!1279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 64, elements: !1240)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !1218, file: !88, line: 604, baseType: !1281, size: 64, offset: 384)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileList", file: !88, line: 62, flags: DIFlagFwdDecl)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "folders_prev", scope: !1218, file: !88, line: 606, baseType: !1284, size: 64, offset: 448)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "folders_next", scope: !1218, file: !88, line: 607, baseType: !1284, size: 64, offset: 512)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1218, file: !88, line: 614, baseType: !1287, size: 64, offset: 576)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !1289, line: 328, size: 1344, elements: !1290)
!1289 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1290 = !{!1291, !1292, !1293, !1294, !1318, !1471, !1472, !1473, !1474, !2791, !2792, !2793, !2796, !2797}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1288, file: !1289, line: 329, baseType: !1287, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1288, file: !1289, line: 329, baseType: !1287, size: 64, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1288, file: !1289, line: 332, baseType: !1266, size: 512, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1288, file: !1289, line: 333, baseType: !1295, size: 64, offset: 640)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1297, line: 75, baseType: !1298)
!1297 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1297, line: 62, size: 1024, elements: !1299)
!1299 = !{!1300, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1316, !1317}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1298, file: !1297, line: 63, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1298, file: !1297, line: 63, baseType: !1301, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1298, file: !1297, line: 64, baseType: !1252, size: 8, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1298, file: !1297, line: 64, baseType: !1252, size: 8, offset: 136)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1298, file: !1297, line: 65, baseType: !1239, size: 16, offset: 144)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1298, file: !1297, line: 66, baseType: !1266, size: 512, offset: 160)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1298, file: !1297, line: 67, baseType: !1215, size: 32, offset: 672)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1298, file: !1297, line: 69, baseType: !1309, size: 256, offset: 704)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1297, line: 60, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1297, line: 48, size: 256, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1310, file: !1297, line: 49, baseType: !1213, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1310, file: !1297, line: 58, baseType: !1229, size: 128, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1310, file: !1297, line: 59, baseType: !1215, size: 32, offset: 192)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1310, file: !1297, line: 59, baseType: !1215, size: 32, offset: 224)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1298, file: !1297, line: 70, baseType: !1215, size: 32, offset: 960)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1298, file: !1297, line: 74, baseType: !1215, size: 32, offset: 992)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1288, file: !1289, line: 336, baseType: !1319, size: 64, offset: 704)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !951, line: 508, size: 1536, elements: !1321)
!1321 = !{!1322, !1325, !1326, !1327, !1328, !1335, !1340, !1392, !1396, !1397, !1401, !1402, !1406, !1407, !1411, !1412, !1427, !1428, !1432, !1470}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1320, file: !951, line: 509, baseType: !1323, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1252)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1320, file: !951, line: 510, baseType: !1323, size: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1320, file: !951, line: 511, baseType: !1323, size: 64, offset: 128)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1320, file: !951, line: 512, baseType: !1323, size: 64, offset: 192)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1320, file: !951, line: 518, baseType: !1329, size: 64, offset: 256)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!1215, !1332, !1287}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1334, line: 37, flags: DIFlagFwdDecl)
!1334 = !DIFile(filename: "blender/source/blender/editors/include/BIF_glutil.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !1320, file: !951, line: 524, baseType: !1336, size: 64, offset: 320)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!1339, !1332, !1287}
!1339 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !1320, file: !951, line: 530, baseType: !1341, size: 64, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!1215, !1332, !1287, !1344}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !951, line: 421, size: 960, elements: !1347)
!1347 = !{!1348, !1350, !1351, !1352, !1353, !1354, !1355, !1359, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1388, !1389, !1390, !1391}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1346, file: !951, line: 422, baseType: !1349, size: 64)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1346, file: !951, line: 422, baseType: !1349, size: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1346, file: !951, line: 424, baseType: !1239, size: 16, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1346, file: !951, line: 425, baseType: !1239, size: 16, offset: 144)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1346, file: !951, line: 426, baseType: !1215, size: 32, offset: 160)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1346, file: !951, line: 426, baseType: !1215, size: 32, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !1346, file: !951, line: 427, baseType: !1356, size: 64, offset: 224)
!1356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 64, elements: !1357)
!1357 = !{!1358}
!1358 = !DISubrange(count: 2)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !1346, file: !951, line: 428, baseType: !1360, size: 48, offset: 288)
!1360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 48, elements: !1361)
!1361 = !{!1362}
!1362 = !DISubrange(count: 6)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !1346, file: !951, line: 431, baseType: !1252, size: 8, offset: 336)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1346, file: !951, line: 432, baseType: !1252, size: 8, offset: 344)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !1346, file: !951, line: 435, baseType: !1239, size: 16, offset: 352)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !1346, file: !951, line: 436, baseType: !1239, size: 16, offset: 368)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !1346, file: !951, line: 437, baseType: !1215, size: 32, offset: 384)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !1346, file: !951, line: 437, baseType: !1215, size: 32, offset: 416)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !1346, file: !951, line: 438, baseType: !1370, size: 64, offset: 448)
!1370 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !1346, file: !951, line: 439, baseType: !1215, size: 32, offset: 512)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !1346, file: !951, line: 439, baseType: !1215, size: 32, offset: 544)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1346, file: !951, line: 442, baseType: !1239, size: 16, offset: 576)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !1346, file: !951, line: 442, baseType: !1239, size: 16, offset: 592)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1346, file: !951, line: 442, baseType: !1239, size: 16, offset: 608)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !1346, file: !951, line: 442, baseType: !1239, size: 16, offset: 624)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !1346, file: !951, line: 443, baseType: !1239, size: 16, offset: 640)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !1346, file: !951, line: 446, baseType: !1239, size: 16, offset: 656)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !1346, file: !951, line: 449, baseType: !1323, size: 64, offset: 704)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !1346, file: !951, line: 452, baseType: !1381, size: 64, offset: 768)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !951, line: 463, size: 128, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1382, file: !951, line: 464, baseType: !1215, size: 32)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1382, file: !951, line: 465, baseType: !1214, size: 32, offset: 32)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1382, file: !951, line: 466, baseType: !1214, size: 32, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1382, file: !951, line: 467, baseType: !1214, size: 32, offset: 96)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !1346, file: !951, line: 455, baseType: !1239, size: 16, offset: 832)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !1346, file: !951, line: 456, baseType: !1239, size: 16, offset: 848)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1346, file: !951, line: 457, baseType: !1215, size: 32, offset: 864)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1346, file: !951, line: 458, baseType: !1213, size: 64, offset: 896)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !1320, file: !951, line: 531, baseType: !1393, size: 64, offset: 448)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{null, !1332, !1287}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !1320, file: !951, line: 532, baseType: !1341, size: 64, offset: 512)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !1320, file: !951, line: 536, baseType: !1398, size: 64, offset: 576)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!1215, !1332}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !1320, file: !951, line: 539, baseType: !1393, size: 64, offset: 640)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1320, file: !951, line: 542, baseType: !1403, size: 64, offset: 704)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1405, line: 41, flags: DIFlagFwdDecl)
!1405 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !1320, file: !951, line: 545, baseType: !1301, size: 64, offset: 768)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1320, file: !951, line: 549, baseType: !1408, size: 64, offset: 832)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !1405, line: 333, baseType: !1410)
!1410 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !1405, line: 39, flags: DIFlagFwdDecl)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !1320, file: !951, line: 552, baseType: !1229, size: 128, offset: 896)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !1320, file: !951, line: 555, baseType: !1413, size: 64, offset: 1024)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !1289, line: 281, size: 1088, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1414, file: !1289, line: 282, baseType: !1413, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1414, file: !1289, line: 282, baseType: !1413, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !1414, file: !1289, line: 284, baseType: !1229, size: 128, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !1414, file: !1289, line: 285, baseType: !1229, size: 128, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1414, file: !1289, line: 287, baseType: !1266, size: 512, offset: 384)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !1414, file: !1289, line: 288, baseType: !1239, size: 16, offset: 896)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !1414, file: !1289, line: 289, baseType: !1239, size: 16, offset: 912)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1414, file: !1289, line: 291, baseType: !1239, size: 16, offset: 928)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !1414, file: !1289, line: 292, baseType: !1239, size: 16, offset: 944)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !1414, file: !1289, line: 295, baseType: !1398, size: 64, offset: 960)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !1414, file: !1289, line: 296, baseType: !1213, size: 64, offset: 1024)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !1320, file: !951, line: 559, baseType: !1213, size: 64, offset: 1088)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !1320, file: !951, line: 560, baseType: !1429, size: 64, offset: 1152)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!1215, !1332, !1319}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1320, file: !951, line: 563, baseType: !1433, size: 256, offset: 1216)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !1405, line: 436, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !1405, line: 430, size: 256, elements: !1435)
!1435 = !{!1436, !1437, !1440, !1465}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1434, file: !1405, line: 431, baseType: !1213, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1434, file: !1405, line: 432, baseType: !1438, size: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !1405, line: 417, baseType: !1404)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1434, file: !1405, line: 433, baseType: !1441, size: 64, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !1405, line: 408, baseType: !1442)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!1215, !1332, !1445, !1454, !1456}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !1405, line: 55, size: 192, elements: !1447)
!1447 = !{!1448, !1452, !1453}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1446, file: !1405, line: 58, baseType: !1449, size: 64)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1446, file: !1405, line: 56, size: 64, elements: !1450)
!1450 = !{!1451}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1449, file: !1405, line: 57, baseType: !1213, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1446, file: !1405, line: 60, baseType: !1403, size: 64, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1446, file: !1405, line: 61, baseType: !1213, size: 64, offset: 128)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1455 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !1405, line: 38, flags: DIFlagFwdDecl)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !1405, line: 348, baseType: !1458)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !1405, line: 337, size: 256, elements: !1459)
!1459 = !{!1460, !1461, !1462, !1463, !1464}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1458, file: !1405, line: 339, baseType: !1213, size: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1458, file: !1405, line: 342, baseType: !1454, size: 64, offset: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1458, file: !1405, line: 345, baseType: !1215, size: 32, offset: 128)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1458, file: !1405, line: 347, baseType: !1215, size: 32, offset: 160)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1458, file: !1405, line: 347, baseType: !1215, size: 32, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1434, file: !1405, line: 434, baseType: !1466, size: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !1405, line: 409, baseType: !1467)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{null, !1213}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1320, file: !951, line: 566, baseType: !1239, size: 16, offset: 1472)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1288, file: !1289, line: 337, baseType: !1213, size: 64, offset: 768)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !1288, file: !1289, line: 338, baseType: !1213, size: 64, offset: 832)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1288, file: !1289, line: 340, baseType: !1445, size: 64, offset: 896)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !1288, file: !1289, line: 341, baseType: !1475, size: 64, offset: 960)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !1289, line: 106, size: 320, elements: !1477)
!1477 = !{!1478, !1479, !1480, !1481, !1482, !1483}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1476, file: !1289, line: 107, baseType: !1229, size: 128)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !1476, file: !1289, line: 108, baseType: !1215, size: 32, offset: 128)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !1476, file: !1289, line: 109, baseType: !1215, size: 32, offset: 160)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1476, file: !1289, line: 110, baseType: !1215, size: 32, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1476, file: !1289, line: 110, baseType: !1215, size: 32, offset: 224)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !1476, file: !1289, line: 111, baseType: !1484, size: 64, offset: 256)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !951, line: 490, size: 768, elements: !1486)
!1486 = !{!1487, !1488, !1489, !2782, !2783, !2784, !2785, !2786, !2787, !2788, !2789, !2790}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1485, file: !951, line: 491, baseType: !1484, size: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1485, file: !951, line: 491, baseType: !1484, size: 64, offset: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1485, file: !951, line: 493, baseType: !1490, size: 64, offset: 128)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1289, line: 169, size: 2048, elements: !1492)
!1492 = !{!1493, !1494, !1495, !1496, !2739, !2740, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2748, !2749, !2750, !2751, !2752, !2753, !2754, !2755, !2756, !2757, !2760, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1491, file: !1289, line: 170, baseType: !1490, size: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1491, file: !1289, line: 170, baseType: !1490, size: 64, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1491, file: !1289, line: 172, baseType: !1213, size: 64, offset: 128)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1491, file: !1289, line: 174, baseType: !1497, size: 64, offset: 192)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !4, line: 49, size: 1984, elements: !1499)
!1499 = !{!1500, !1536, !1537, !1538, !1539, !1540, !2722, !2723, !2724, !2725, !2726, !2727, !2728, !2729, !2730, !2731, !2732, !2733, !2734, !2735, !2736, !2737, !2738}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1498, file: !4, line: 50, baseType: !1501, size: 960)
!1501 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1297, line: 130, baseType: !1502)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1297, line: 117, size: 960, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1508, !1527, !1531, !1532, !1533, !1534, !1535}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1502, file: !1297, line: 118, baseType: !1213, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1502, file: !1297, line: 118, baseType: !1213, size: 64, offset: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1502, file: !1297, line: 119, baseType: !1507, size: 64, offset: 128)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1502, file: !1297, line: 120, baseType: !1509, size: 64, offset: 192)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1297, line: 136, size: 17600, elements: !1511)
!1511 = !{!1512, !1513, !1515, !1518, !1522, !1523, !1524}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1510, file: !1297, line: 137, baseType: !1501, size: 960)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1510, file: !1297, line: 138, baseType: !1514, size: 64, offset: 960)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1510, file: !1297, line: 139, baseType: !1516, size: 64, offset: 1024)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64)
!1517 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1297, line: 43, flags: DIFlagFwdDecl)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1510, file: !1297, line: 140, baseType: !1519, size: 8192, offset: 1088)
!1519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 8192, elements: !1520)
!1520 = !{!1521}
!1521 = !DISubrange(count: 1024)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1510, file: !1297, line: 141, baseType: !1519, size: 8192, offset: 9280)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1510, file: !1297, line: 148, baseType: !1509, size: 64, offset: 17472)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1510, file: !1297, line: 150, baseType: !1525, size: 64, offset: 17536)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64)
!1526 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1297, line: 45, flags: DIFlagFwdDecl)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1502, file: !1297, line: 121, baseType: !1528, size: 528, offset: 256)
!1528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 528, elements: !1529)
!1529 = !{!1530}
!1530 = !DISubrange(count: 66)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1502, file: !1297, line: 126, baseType: !1239, size: 16, offset: 784)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1502, file: !1297, line: 127, baseType: !1215, size: 32, offset: 800)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1502, file: !1297, line: 128, baseType: !1215, size: 32, offset: 832)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1502, file: !1297, line: 128, baseType: !1215, size: 32, offset: 864)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1502, file: !1297, line: 129, baseType: !1295, size: 64, offset: 896)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1498, file: !4, line: 52, baseType: !1229, size: 128, offset: 960)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1498, file: !4, line: 53, baseType: !1229, size: 128, offset: 1088)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1498, file: !4, line: 54, baseType: !1229, size: 128, offset: 1216)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1498, file: !4, line: 55, baseType: !1229, size: 128, offset: 1344)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1498, file: !4, line: 57, baseType: !1541, size: 64, offset: 1472)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1543, line: 1216, size: 39680, elements: !1544)
!1543 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1544 = !{!1545, !1546, !1550, !1554, !1557, !1558, !1559, !1571, !1572, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1588, !1661, !2090, !2304, !2307, !2592, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2614, !2615, !2616, !2617, !2618, !2626, !2693, !2700, !2701, !2708, !2709, !2715, !2716, !2717, !2718, !2719}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1542, file: !1543, line: 1217, baseType: !1501, size: 960)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1542, file: !1543, line: 1218, baseType: !1547, size: 64, offset: 960)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64)
!1548 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1549, line: 45, flags: DIFlagFwdDecl)
!1549 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1542, file: !1543, line: 1220, baseType: !1551, size: 64, offset: 1024)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64)
!1552 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1553, line: 44, flags: DIFlagFwdDecl)
!1553 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1542, file: !1543, line: 1221, baseType: !1555, size: 64, offset: 1088)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64)
!1556 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1543, line: 52, flags: DIFlagFwdDecl)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1542, file: !1543, line: 1223, baseType: !1541, size: 64, offset: 1152)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1542, file: !1543, line: 1225, baseType: !1229, size: 128, offset: 1216)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1542, file: !1543, line: 1226, baseType: !1560, size: 64, offset: 1344)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1543, line: 69, size: 320, elements: !1562)
!1562 = !{!1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1561, file: !1543, line: 70, baseType: !1560, size: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1561, file: !1543, line: 70, baseType: !1560, size: 64, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1561, file: !1543, line: 71, baseType: !5, size: 32, offset: 128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1561, file: !1543, line: 71, baseType: !5, size: 32, offset: 160)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1561, file: !1543, line: 72, baseType: !1215, size: 32, offset: 192)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1561, file: !1543, line: 73, baseType: !1239, size: 16, offset: 224)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1561, file: !1543, line: 73, baseType: !1239, size: 16, offset: 240)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1561, file: !1543, line: 74, baseType: !1551, size: 64, offset: 256)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1542, file: !1543, line: 1227, baseType: !1551, size: 64, offset: 1408)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1542, file: !1543, line: 1229, baseType: !1573, size: 96, offset: 1472)
!1573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 96, elements: !1574)
!1574 = !{!1575}
!1575 = !DISubrange(count: 3)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1542, file: !1543, line: 1230, baseType: !1573, size: 96, offset: 1568)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1542, file: !1543, line: 1231, baseType: !1573, size: 96, offset: 1664)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1542, file: !1543, line: 1231, baseType: !1573, size: 96, offset: 1760)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1542, file: !1543, line: 1233, baseType: !5, size: 32, offset: 1856)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1542, file: !1543, line: 1234, baseType: !1215, size: 32, offset: 1888)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1542, file: !1543, line: 1235, baseType: !5, size: 32, offset: 1920)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1542, file: !1543, line: 1237, baseType: !1239, size: 16, offset: 1952)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1542, file: !1543, line: 1239, baseType: !1252, size: 8, offset: 1968)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1542, file: !1543, line: 1240, baseType: !1585, size: 8, offset: 1976)
!1585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 8, elements: !1586)
!1586 = !{!1587}
!1587 = !DISubrange(count: 1)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1542, file: !1543, line: 1242, baseType: !1589, size: 64, offset: 1984)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1591, line: 328, size: 3456, elements: !1592)
!1591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1592 = !{!1593, !1594, !1595, !1598, !1599, !1600, !1604, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1629, !1630, !1631, !1634, !1639, !1640, !1643, !1647, !1652, !1656, !1657, !1658, !1659, !1660}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1590, file: !1591, line: 329, baseType: !1501, size: 960)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1590, file: !1591, line: 330, baseType: !1547, size: 64, offset: 960)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1590, file: !1591, line: 332, baseType: !1596, size: 64, offset: 1024)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64)
!1597 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1591, line: 332, flags: DIFlagFwdDecl)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1590, file: !1591, line: 333, baseType: !1266, size: 512, offset: 1088)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1590, file: !1591, line: 335, baseType: !1403, size: 64, offset: 1600)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1590, file: !1591, line: 337, baseType: !1601, size: 64, offset: 1664)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64)
!1602 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1603, line: 45, flags: DIFlagFwdDecl)
!1603 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1590, file: !1591, line: 338, baseType: !1605, size: 64, offset: 1728)
!1605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 64, elements: !1357)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1590, file: !1591, line: 340, baseType: !1229, size: 128, offset: 1792)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1590, file: !1591, line: 340, baseType: !1229, size: 128, offset: 1920)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1590, file: !1591, line: 342, baseType: !1215, size: 32, offset: 2048)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1590, file: !1591, line: 342, baseType: !1215, size: 32, offset: 2080)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1590, file: !1591, line: 343, baseType: !1215, size: 32, offset: 2112)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1590, file: !1591, line: 345, baseType: !1215, size: 32, offset: 2144)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1590, file: !1591, line: 346, baseType: !1215, size: 32, offset: 2176)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1590, file: !1591, line: 347, baseType: !1239, size: 16, offset: 2208)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1590, file: !1591, line: 348, baseType: !1239, size: 16, offset: 2224)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1590, file: !1591, line: 349, baseType: !1215, size: 32, offset: 2240)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1590, file: !1591, line: 351, baseType: !1215, size: 32, offset: 2272)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1590, file: !1591, line: 353, baseType: !1239, size: 16, offset: 2304)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1590, file: !1591, line: 354, baseType: !1239, size: 16, offset: 2320)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1590, file: !1591, line: 355, baseType: !1215, size: 32, offset: 2336)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1590, file: !1591, line: 357, baseType: !1621, size: 128, offset: 2368)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1622, line: 95, baseType: !1623)
!1622 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1622, line: 92, size: 128, elements: !1624)
!1624 = !{!1625, !1626, !1627, !1628}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1623, file: !1622, line: 93, baseType: !1214, size: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1623, file: !1622, line: 93, baseType: !1214, size: 32, offset: 32)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1623, file: !1622, line: 94, baseType: !1214, size: 32, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1623, file: !1622, line: 94, baseType: !1214, size: 32, offset: 96)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1590, file: !1591, line: 363, baseType: !1229, size: 128, offset: 2496)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1590, file: !1591, line: 363, baseType: !1229, size: 128, offset: 2624)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1590, file: !1591, line: 368, baseType: !1632, size: 64, offset: 2752)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64)
!1633 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1591, line: 48, flags: DIFlagFwdDecl)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1590, file: !1591, line: 372, baseType: !1635, size: 32, offset: 2816)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1591, line: 274, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1591, line: 271, size: 32, elements: !1637)
!1637 = !{!1638}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1636, file: !1591, line: 273, baseType: !5, size: 32)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1590, file: !1591, line: 373, baseType: !1215, size: 32, offset: 2848)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1590, file: !1591, line: 382, baseType: !1641, size: 64, offset: 2880)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64)
!1642 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1591, line: 46, flags: DIFlagFwdDecl)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1590, file: !1591, line: 385, baseType: !1644, size: 64, offset: 2944)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{null, !1213, !1214}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1590, file: !1591, line: 386, baseType: !1648, size: 64, offset: 3008)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1213, !1651}
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1590, file: !1591, line: 387, baseType: !1653, size: 64, offset: 3072)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{!1215, !1213}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1590, file: !1591, line: 388, baseType: !1467, size: 64, offset: 3136)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1590, file: !1591, line: 389, baseType: !1213, size: 64, offset: 3200)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1590, file: !1591, line: 389, baseType: !1213, size: 64, offset: 3264)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1590, file: !1591, line: 389, baseType: !1213, size: 64, offset: 3328)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1590, file: !1591, line: 389, baseType: !1213, size: 64, offset: 3392)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1542, file: !1543, line: 1244, baseType: !1662, size: 64, offset: 2048)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64)
!1663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1664, line: 200, size: 17024, elements: !1665)
!1664 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1665 = !{!1666, !1667, !1668, !1669, !2083, !2084, !2085, !2086, !2087, !2088, !2089}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1663, file: !1664, line: 201, baseType: !1284, size: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1663, file: !1664, line: 202, baseType: !1229, size: 128, offset: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1663, file: !1664, line: 203, baseType: !1229, size: 128, offset: 192)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1663, file: !1664, line: 206, baseType: !1670, size: 64, offset: 320)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64)
!1671 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1664, line: 190, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1664, line: 126, size: 2816, elements: !1673)
!1673 = !{!1674, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1770, !1773, !1774, !1775, !2055, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2082}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1672, file: !1664, line: 127, baseType: !1675, size: 64)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1672, file: !1664, line: 127, baseType: !1675, size: 64, offset: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1672, file: !1664, line: 128, baseType: !1213, size: 64, offset: 128)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1672, file: !1664, line: 129, baseType: !1213, size: 64, offset: 192)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1672, file: !1664, line: 130, baseType: !1266, size: 512, offset: 256)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1672, file: !1664, line: 132, baseType: !1215, size: 32, offset: 768)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1672, file: !1664, line: 132, baseType: !1215, size: 32, offset: 800)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1672, file: !1664, line: 133, baseType: !1215, size: 32, offset: 832)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1672, file: !1664, line: 134, baseType: !1215, size: 32, offset: 864)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1672, file: !1664, line: 134, baseType: !1215, size: 32, offset: 896)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1672, file: !1664, line: 134, baseType: !1215, size: 32, offset: 928)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1672, file: !1664, line: 135, baseType: !1215, size: 32, offset: 960)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1672, file: !1664, line: 135, baseType: !1215, size: 32, offset: 992)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1672, file: !1664, line: 136, baseType: !1215, size: 32, offset: 1024)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1672, file: !1664, line: 136, baseType: !1215, size: 32, offset: 1056)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1672, file: !1664, line: 137, baseType: !1215, size: 32, offset: 1088)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1672, file: !1664, line: 137, baseType: !1215, size: 32, offset: 1120)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1672, file: !1664, line: 138, baseType: !1214, size: 32, offset: 1152)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1672, file: !1664, line: 139, baseType: !1214, size: 32, offset: 1184)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1672, file: !1664, line: 139, baseType: !1214, size: 32, offset: 1216)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1672, file: !1664, line: 141, baseType: !1239, size: 16, offset: 1248)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1672, file: !1664, line: 142, baseType: !1239, size: 16, offset: 1264)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1672, file: !1664, line: 143, baseType: !1215, size: 32, offset: 1280)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1672, file: !1664, line: 144, baseType: !1215, size: 32, offset: 1312)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1672, file: !1664, line: 146, baseType: !1700, size: 64, offset: 1344)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64)
!1701 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1664, line: 114, baseType: !1702)
!1702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1664, line: 99, size: 7232, elements: !1703)
!1703 = !{!1704, !1706, !1707, !1708, !1709, !1710, !1711, !1719, !1723, !1738, !1747, !1754, !1764}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1702, file: !1664, line: 100, baseType: !1705, size: 64)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1702, file: !1664, line: 100, baseType: !1705, size: 64, offset: 64)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1702, file: !1664, line: 101, baseType: !1215, size: 32, offset: 128)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1702, file: !1664, line: 101, baseType: !1215, size: 32, offset: 160)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1702, file: !1664, line: 102, baseType: !1215, size: 32, offset: 192)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1702, file: !1664, line: 102, baseType: !1215, size: 32, offset: 224)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1702, file: !1664, line: 103, baseType: !1712, size: 64, offset: 256)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64)
!1713 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1664, line: 59, baseType: !1714)
!1714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1664, line: 56, size: 2112, elements: !1715)
!1715 = !{!1716, !1717, !1718}
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1714, file: !1664, line: 57, baseType: !1260, size: 2048)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1714, file: !1664, line: 58, baseType: !1215, size: 32, offset: 2048)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1714, file: !1664, line: 58, baseType: !1215, size: 32, offset: 2080)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1702, file: !1664, line: 106, baseType: !1720, size: 6144, offset: 320)
!1720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 6144, elements: !1721)
!1721 = !{!1722}
!1722 = !DISubrange(count: 768)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1702, file: !1664, line: 107, baseType: !1724, size: 64, offset: 6464)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64)
!1725 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1664, line: 97, baseType: !1726)
!1726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1664, line: 83, size: 8320, elements: !1727)
!1727 = !{!1728, !1729, !1730, !1734, !1735, !1736, !1737}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1726, file: !1664, line: 84, baseType: !1720, size: 6144)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1726, file: !1664, line: 87, baseType: !1260, size: 2048, offset: 6144)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1726, file: !1664, line: 88, baseType: !1731, size: 64, offset: 8192)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64)
!1732 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1733, line: 41, flags: DIFlagFwdDecl)
!1733 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1726, file: !1664, line: 90, baseType: !1239, size: 16, offset: 8256)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1726, file: !1664, line: 92, baseType: !1239, size: 16, offset: 8272)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1726, file: !1664, line: 93, baseType: !1239, size: 16, offset: 8288)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1726, file: !1664, line: 95, baseType: !1239, size: 16, offset: 8304)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1702, file: !1664, line: 108, baseType: !1739, size: 64, offset: 6528)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64)
!1740 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1664, line: 66, baseType: !1741)
!1741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1664, line: 61, size: 128, elements: !1742)
!1742 = !{!1743, !1744, !1745, !1746}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1741, file: !1664, line: 62, baseType: !1215, size: 32)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1741, file: !1664, line: 63, baseType: !1215, size: 32, offset: 32)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1741, file: !1664, line: 64, baseType: !1215, size: 32, offset: 64)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1741, file: !1664, line: 65, baseType: !1215, size: 32, offset: 96)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1702, file: !1664, line: 109, baseType: !1748, size: 64, offset: 6592)
!1748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1749, size: 64)
!1749 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1664, line: 71, baseType: !1750)
!1750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1664, line: 68, size: 64, elements: !1751)
!1751 = !{!1752, !1753}
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1750, file: !1664, line: 69, baseType: !1215, size: 32)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1750, file: !1664, line: 70, baseType: !1215, size: 32, offset: 32)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1702, file: !1664, line: 110, baseType: !1755, size: 64, offset: 6656)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64)
!1756 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1664, line: 81, baseType: !1757)
!1757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1664, line: 73, size: 352, elements: !1758)
!1758 = !{!1759, !1760, !1761, !1762, !1763}
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1757, file: !1664, line: 74, baseType: !1573, size: 96)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1757, file: !1664, line: 75, baseType: !1573, size: 96, offset: 96)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1757, file: !1664, line: 76, baseType: !1573, size: 96, offset: 192)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1757, file: !1664, line: 77, baseType: !1215, size: 32, offset: 288)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1757, file: !1664, line: 78, baseType: !1215, size: 32, offset: 320)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1702, file: !1664, line: 113, baseType: !1765, size: 512, offset: 6720)
!1765 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1766, line: 182, baseType: !1767)
!1766 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1766, line: 180, size: 512, elements: !1768)
!1768 = !{!1769}
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1767, file: !1766, line: 181, baseType: !1266, size: 512)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1672, file: !1664, line: 148, baseType: !1771, size: 64, offset: 1408)
!1771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1772, size: 64)
!1772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1549, line: 46, flags: DIFlagFwdDecl)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1672, file: !1664, line: 151, baseType: !1541, size: 64, offset: 1472)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1672, file: !1664, line: 152, baseType: !1551, size: 64, offset: 1536)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1672, file: !1664, line: 153, baseType: !1776, size: 64, offset: 1600)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64)
!1777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1778, line: 64, size: 19136, elements: !1779)
!1778 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1779 = !{!1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1792, !1793, !2041, !2042, !2050, !2051, !2052, !2053, !2054}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1777, file: !1778, line: 65, baseType: !1501, size: 960)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1777, file: !1778, line: 66, baseType: !1547, size: 64, offset: 960)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1777, file: !1778, line: 68, baseType: !1519, size: 8192, offset: 1024)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1777, file: !1778, line: 70, baseType: !1215, size: 32, offset: 9216)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1777, file: !1778, line: 71, baseType: !1215, size: 32, offset: 9248)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1777, file: !1778, line: 72, baseType: !1356, size: 64, offset: 9280)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1777, file: !1778, line: 74, baseType: !1214, size: 32, offset: 9344)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1777, file: !1778, line: 74, baseType: !1214, size: 32, offset: 9376)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1777, file: !1778, line: 76, baseType: !1731, size: 64, offset: 9408)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1777, file: !1778, line: 77, baseType: !1790, size: 64, offset: 9472)
!1790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64)
!1791 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1778, line: 77, flags: DIFlagFwdDecl)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1777, file: !1778, line: 78, baseType: !1601, size: 64, offset: 9536)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1777, file: !1778, line: 80, baseType: !1794, size: 2624, offset: 9600)
!1794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1603, line: 340, size: 2624, elements: !1795)
!1795 = !{!1796, !1824, !1842, !1843, !1844, !1862, !1920, !1921, !2021, !2022, !2023, !2024, !2030}
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1794, file: !1603, line: 341, baseType: !1797, size: 576)
!1797 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1603, line: 251, baseType: !1798)
!1798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1603, line: 207, size: 576, elements: !1799)
!1799 = !{!1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823}
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1798, file: !1603, line: 208, baseType: !1215, size: 32)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1798, file: !1603, line: 211, baseType: !1239, size: 16, offset: 32)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1798, file: !1603, line: 212, baseType: !1239, size: 16, offset: 48)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1798, file: !1603, line: 213, baseType: !1214, size: 32, offset: 64)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1798, file: !1603, line: 214, baseType: !1239, size: 16, offset: 96)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1798, file: !1603, line: 215, baseType: !1239, size: 16, offset: 112)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1798, file: !1603, line: 216, baseType: !1239, size: 16, offset: 128)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1798, file: !1603, line: 217, baseType: !1239, size: 16, offset: 144)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1798, file: !1603, line: 218, baseType: !1239, size: 16, offset: 160)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1798, file: !1603, line: 219, baseType: !1239, size: 16, offset: 176)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1798, file: !1603, line: 220, baseType: !1214, size: 32, offset: 192)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1798, file: !1603, line: 222, baseType: !1239, size: 16, offset: 224)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1798, file: !1603, line: 225, baseType: !1239, size: 16, offset: 240)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1798, file: !1603, line: 228, baseType: !1215, size: 32, offset: 256)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1798, file: !1603, line: 229, baseType: !1215, size: 32, offset: 288)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1798, file: !1603, line: 233, baseType: !1215, size: 32, offset: 320)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1798, file: !1603, line: 236, baseType: !1239, size: 16, offset: 352)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1798, file: !1603, line: 236, baseType: !1239, size: 16, offset: 368)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1798, file: !1603, line: 241, baseType: !1214, size: 32, offset: 384)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1798, file: !1603, line: 244, baseType: !1215, size: 32, offset: 416)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1798, file: !1603, line: 244, baseType: !1215, size: 32, offset: 448)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1798, file: !1603, line: 245, baseType: !1214, size: 32, offset: 480)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1798, file: !1603, line: 248, baseType: !1214, size: 32, offset: 512)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1798, file: !1603, line: 250, baseType: !1215, size: 32, offset: 544)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1794, file: !1603, line: 342, baseType: !1825, size: 448, offset: 576)
!1825 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1603, line: 79, baseType: !1826)
!1826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1603, line: 61, size: 448, elements: !1827)
!1827 = !{!1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841}
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1826, file: !1603, line: 62, baseType: !1213, size: 64)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1826, file: !1603, line: 64, baseType: !1239, size: 16, offset: 64)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1826, file: !1603, line: 65, baseType: !1239, size: 16, offset: 80)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1826, file: !1603, line: 67, baseType: !1214, size: 32, offset: 96)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1826, file: !1603, line: 68, baseType: !1214, size: 32, offset: 128)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1826, file: !1603, line: 69, baseType: !1214, size: 32, offset: 160)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1826, file: !1603, line: 70, baseType: !1239, size: 16, offset: 192)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1826, file: !1603, line: 71, baseType: !1239, size: 16, offset: 208)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1826, file: !1603, line: 72, baseType: !1605, size: 64, offset: 224)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1826, file: !1603, line: 75, baseType: !1214, size: 32, offset: 288)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1826, file: !1603, line: 75, baseType: !1214, size: 32, offset: 320)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1826, file: !1603, line: 75, baseType: !1214, size: 32, offset: 352)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1826, file: !1603, line: 78, baseType: !1214, size: 32, offset: 384)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1826, file: !1603, line: 78, baseType: !1214, size: 32, offset: 416)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1794, file: !1603, line: 343, baseType: !1229, size: 128, offset: 1024)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1794, file: !1603, line: 344, baseType: !1229, size: 128, offset: 1152)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1794, file: !1603, line: 345, baseType: !1845, size: 192, offset: 1280)
!1845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1603, line: 278, baseType: !1846)
!1846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1603, line: 270, size: 192, elements: !1847)
!1847 = !{!1848, !1849, !1850, !1851, !1852}
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1846, file: !1603, line: 271, baseType: !1215, size: 32)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1846, file: !1603, line: 273, baseType: !1214, size: 32, offset: 32)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1846, file: !1603, line: 275, baseType: !1215, size: 32, offset: 64)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1846, file: !1603, line: 276, baseType: !1215, size: 32, offset: 96)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1846, file: !1603, line: 277, baseType: !1853, size: 64, offset: 128)
!1853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1854, size: 64)
!1854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1603, line: 55, size: 576, elements: !1855)
!1855 = !{!1856, !1857, !1858}
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1854, file: !1603, line: 56, baseType: !1215, size: 32)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1854, file: !1603, line: 57, baseType: !1214, size: 32, offset: 32)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1854, file: !1603, line: 58, baseType: !1859, size: 512, offset: 64)
!1859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 512, elements: !1860)
!1860 = !{!1861, !1861}
!1861 = !DISubrange(count: 4)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1794, file: !1603, line: 346, baseType: !1863, size: 384, offset: 1472)
!1863 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1603, line: 268, baseType: !1864)
!1864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1603, line: 253, size: 384, elements: !1865)
!1865 = !{!1866, !1867, !1868, !1869, !1870, !1914, !1915, !1916, !1917, !1918, !1919}
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1864, file: !1603, line: 254, baseType: !1215, size: 32)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1864, file: !1603, line: 255, baseType: !1215, size: 32, offset: 32)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1864, file: !1603, line: 255, baseType: !1215, size: 32, offset: 64)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1864, file: !1603, line: 258, baseType: !1214, size: 32, offset: 96)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1864, file: !1603, line: 259, baseType: !1871, size: 64, offset: 128)
!1871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1872, size: 64)
!1872 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1603, line: 164, baseType: !1873)
!1873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1603, line: 108, size: 1664, elements: !1874)
!1874 = !{!1875, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913}
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1873, file: !1603, line: 109, baseType: !1876, size: 64)
!1876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1873, size: 64)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1873, file: !1603, line: 109, baseType: !1876, size: 64, offset: 64)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1873, file: !1603, line: 111, baseType: !1266, size: 512, offset: 128)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1873, file: !1603, line: 119, baseType: !1605, size: 64, offset: 640)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1873, file: !1603, line: 119, baseType: !1605, size: 64, offset: 704)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1873, file: !1603, line: 125, baseType: !1605, size: 64, offset: 768)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1873, file: !1603, line: 125, baseType: !1605, size: 64, offset: 832)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1873, file: !1603, line: 127, baseType: !1605, size: 64, offset: 896)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1873, file: !1603, line: 130, baseType: !1215, size: 32, offset: 960)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1873, file: !1603, line: 131, baseType: !1215, size: 32, offset: 992)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1873, file: !1603, line: 132, baseType: !1887, size: 64, offset: 1024)
!1887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1888, size: 64)
!1888 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1603, line: 106, baseType: !1889)
!1889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1603, line: 81, size: 512, elements: !1890)
!1890 = !{!1891, !1892, !1895, !1896, !1897, !1898}
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1889, file: !1603, line: 82, baseType: !1605, size: 64)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1889, file: !1603, line: 97, baseType: !1893, size: 256, offset: 64)
!1893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 256, elements: !1894)
!1894 = !{!1861, !1358}
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1889, file: !1603, line: 102, baseType: !1605, size: 64, offset: 320)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1889, file: !1603, line: 102, baseType: !1605, size: 64, offset: 384)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1889, file: !1603, line: 104, baseType: !1215, size: 32, offset: 448)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1889, file: !1603, line: 105, baseType: !1215, size: 32, offset: 480)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1873, file: !1603, line: 135, baseType: !1573, size: 96, offset: 1088)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1873, file: !1603, line: 136, baseType: !1214, size: 32, offset: 1184)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1873, file: !1603, line: 139, baseType: !1215, size: 32, offset: 1216)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1873, file: !1603, line: 139, baseType: !1215, size: 32, offset: 1248)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1873, file: !1603, line: 139, baseType: !1215, size: 32, offset: 1280)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1873, file: !1603, line: 140, baseType: !1573, size: 96, offset: 1312)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1873, file: !1603, line: 143, baseType: !1239, size: 16, offset: 1408)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1873, file: !1603, line: 144, baseType: !1239, size: 16, offset: 1424)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1873, file: !1603, line: 145, baseType: !1239, size: 16, offset: 1440)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1873, file: !1603, line: 148, baseType: !1239, size: 16, offset: 1456)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1873, file: !1603, line: 149, baseType: !1215, size: 32, offset: 1472)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1873, file: !1603, line: 150, baseType: !1214, size: 32, offset: 1504)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1873, file: !1603, line: 152, baseType: !1601, size: 64, offset: 1536)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1873, file: !1603, line: 163, baseType: !1214, size: 32, offset: 1600)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1873, file: !1603, line: 163, baseType: !1214, size: 32, offset: 1632)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1864, file: !1603, line: 261, baseType: !1214, size: 32, offset: 192)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1864, file: !1603, line: 261, baseType: !1214, size: 32, offset: 224)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1864, file: !1603, line: 261, baseType: !1214, size: 32, offset: 256)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1864, file: !1603, line: 263, baseType: !1215, size: 32, offset: 288)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1864, file: !1603, line: 266, baseType: !1215, size: 32, offset: 320)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1864, file: !1603, line: 267, baseType: !1214, size: 32, offset: 352)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1794, file: !1603, line: 347, baseType: !1871, size: 64, offset: 1856)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1794, file: !1603, line: 348, baseType: !1922, size: 64, offset: 1920)
!1922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1923, size: 64)
!1923 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1603, line: 205, baseType: !1924)
!1924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1603, line: 186, size: 1024, elements: !1925)
!1925 = !{!1926, !1928, !1929, !1930, !1932, !1933, !1934, !1942, !1943, !1944, !2019, !2020}
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1924, file: !1603, line: 187, baseType: !1927, size: 64)
!1927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1924, size: 64)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1924, file: !1603, line: 187, baseType: !1927, size: 64, offset: 64)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1924, file: !1603, line: 189, baseType: !1266, size: 512, offset: 128)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1924, file: !1603, line: 191, baseType: !1931, size: 64, offset: 640)
!1931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1871, size: 64)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1924, file: !1603, line: 193, baseType: !1215, size: 32, offset: 704)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1924, file: !1603, line: 193, baseType: !1215, size: 32, offset: 736)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1924, file: !1603, line: 195, baseType: !1935, size: 64, offset: 768)
!1935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1936, size: 64)
!1936 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1603, line: 184, baseType: !1937)
!1937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1603, line: 166, size: 320, elements: !1938)
!1938 = !{!1939, !1940, !1941}
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1937, file: !1603, line: 180, baseType: !1893, size: 256)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1937, file: !1603, line: 182, baseType: !1215, size: 32, offset: 256)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1937, file: !1603, line: 183, baseType: !1215, size: 32, offset: 288)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1924, file: !1603, line: 196, baseType: !1215, size: 32, offset: 832)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1924, file: !1603, line: 198, baseType: !1215, size: 32, offset: 864)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1924, file: !1603, line: 200, baseType: !1945, size: 64, offset: 896)
!1945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1946, size: 64)
!1946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1733, line: 77, size: 15424, elements: !1947)
!1947 = !{!1948, !1949, !1950, !1953, !1956, !1957, !1960, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1978, !1979, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2005, !2006, !2007, !2008, !2009, !2013}
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1946, file: !1733, line: 78, baseType: !1501, size: 960)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1946, file: !1733, line: 80, baseType: !1519, size: 8192, offset: 960)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1946, file: !1733, line: 82, baseType: !1951, size: 64, offset: 9152)
!1951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1952, size: 64)
!1952 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1733, line: 43, flags: DIFlagFwdDecl)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1946, file: !1733, line: 83, baseType: !1954, size: 64, offset: 9216)
!1954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1955, size: 64)
!1955 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1297, line: 46, flags: DIFlagFwdDecl)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1946, file: !1733, line: 86, baseType: !1731, size: 64, offset: 9280)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1946, file: !1733, line: 87, baseType: !1958, size: 64, offset: 9344)
!1958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1959, size: 64)
!1959 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1733, line: 44, flags: DIFlagFwdDecl)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1946, file: !1733, line: 89, baseType: !1961, size: 512, offset: 9408)
!1961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1958, size: 512, elements: !1240)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1946, file: !1733, line: 90, baseType: !1239, size: 16, offset: 9920)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1946, file: !1733, line: 90, baseType: !1239, size: 16, offset: 9936)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1946, file: !1733, line: 92, baseType: !1239, size: 16, offset: 9952)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1946, file: !1733, line: 92, baseType: !1239, size: 16, offset: 9968)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1946, file: !1733, line: 93, baseType: !1239, size: 16, offset: 9984)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1946, file: !1733, line: 93, baseType: !1239, size: 16, offset: 10000)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1946, file: !1733, line: 94, baseType: !1215, size: 32, offset: 10016)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1946, file: !1733, line: 97, baseType: !1239, size: 16, offset: 10048)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1946, file: !1733, line: 97, baseType: !1239, size: 16, offset: 10064)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1946, file: !1733, line: 98, baseType: !1239, size: 16, offset: 10080)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1946, file: !1733, line: 98, baseType: !1239, size: 16, offset: 10096)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1946, file: !1733, line: 99, baseType: !1239, size: 16, offset: 10112)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1946, file: !1733, line: 99, baseType: !1239, size: 16, offset: 10128)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1946, file: !1733, line: 100, baseType: !5, size: 32, offset: 10144)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1946, file: !1733, line: 101, baseType: !1977, size: 64, offset: 10176)
!1977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1946, file: !1733, line: 103, baseType: !1525, size: 64, offset: 10240)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1946, file: !1733, line: 104, baseType: !1980, size: 64, offset: 10304)
!1980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1981, size: 64)
!1981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1297, line: 159, size: 448, elements: !1982)
!1982 = !{!1983, !1985, !1986, !1988, !1989, !1991}
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1981, file: !1297, line: 161, baseType: !1984, size: 64)
!1984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1357)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1981, file: !1297, line: 162, baseType: !1984, size: 64, offset: 64)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1981, file: !1297, line: 163, baseType: !1987, size: 32, offset: 128)
!1987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1239, size: 32, elements: !1357)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1981, file: !1297, line: 164, baseType: !1987, size: 32, offset: 160)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1981, file: !1297, line: 165, baseType: !1990, size: 128, offset: 192)
!1990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1977, size: 128, elements: !1357)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1981, file: !1297, line: 166, baseType: !1992, size: 128, offset: 320)
!1992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1954, size: 128, elements: !1357)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1946, file: !1733, line: 107, baseType: !1214, size: 32, offset: 10368)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1946, file: !1733, line: 108, baseType: !1215, size: 32, offset: 10400)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1946, file: !1733, line: 109, baseType: !1239, size: 16, offset: 10432)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1946, file: !1733, line: 110, baseType: !1239, size: 16, offset: 10448)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1946, file: !1733, line: 113, baseType: !1215, size: 32, offset: 10464)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1946, file: !1733, line: 113, baseType: !1215, size: 32, offset: 10496)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1946, file: !1733, line: 114, baseType: !1252, size: 8, offset: 10528)
