; ModuleID = 'blender/source/blender/editors/interface/interface_ops.c'
source_filename = "blender/source/blender/editors/interface/interface_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!933 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!934 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!935 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!936 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!937 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!938 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!939 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!940 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!941 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!942 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!943 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!944 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!945 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!946 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!947 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!948 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!949 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!950 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!951 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!952 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!953 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!954 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!955 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!956 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 426, baseType: !5, size: 32, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965}
!959 = !DIEnumerator(name: "UI_BLOCK_BOUNDS_NONE", value: 0, isUnsigned: true)
!960 = !DIEnumerator(name: "UI_BLOCK_BOUNDS", value: 1, isUnsigned: true)
!961 = !DIEnumerator(name: "UI_BLOCK_BOUNDS_TEXT", value: 2, isUnsigned: true)
!962 = !DIEnumerator(name: "UI_BLOCK_BOUNDS_POPUP_MOUSE", value: 3, isUnsigned: true)
!963 = !DIEnumerator(name: "UI_BLOCK_BOUNDS_POPUP_MENU", value: 4, isUnsigned: true)
!964 = !DIEnumerator(name: "UI_BLOCK_BOUNDS_POPUP_CENTER", value: 5, isUnsigned: true)
!965 = !DIEnumerator(name: "UI_BLOCK_BOUNDS_PIE_CENTER", value: 6, isUnsigned: true)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !967, line: 107, baseType: !5, size: 32, elements: !968)
!967 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997}
!969 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!970 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!971 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!972 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!973 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!974 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!975 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!976 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!977 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!978 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!979 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!980 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!981 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!982 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!983 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!984 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!985 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!986 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!987 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!988 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!989 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!990 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!991 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!992 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!993 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!994 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!995 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!996 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!997 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!998 = !{!999, !1010, !1011, !1013}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiDragColorHandle", file: !54, line: 944, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiDragColorHandle", file: !54, line: 941, size: 128, elements: !1002)
!1002 = !{!1003, !1008}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1001, file: !54, line: 942, baseType: !1004, size: 96)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 96, elements: !1006)
!1005 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1006 = !{!1007}
!1007 = !DISubrange(count: 3)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_corrected", scope: !1001, file: !54, line: 943, baseType: !1009, size: 8, offset: 96)
!1009 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1015 = !{i32 7, !"Dwarf Version", i32 4}
!1016 = !{i32 2, !"Debug Info Version", i32 3}
!1017 = !{i32 1, !"wchar_size", i32 4}
!1018 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1019 = distinct !DISubprogram(name: "UI_drop_color_poll", scope: !1, file: !1, line: 839, type: !1020, scopeLine: 840, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1104)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!1022, !1023, !1025, !1054}
!1022 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !967, line: 44, flags: DIFlagFwdDecl)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmDrag", file: !1027, line: 624, baseType: !1028)
!1027 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmDrag", file: !1027, line: 610, size: 10304, elements: !1029)
!1029 = !{!1030, !1032, !1033, !1034, !1035, !1036, !1040, !1042, !1046, !1047, !1048, !1049, !1053}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !1027, line: 611, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1028, file: !1027, line: 611, baseType: !1031, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !1028, file: !1027, line: 613, baseType: !1022, size: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1028, file: !1027, line: 613, baseType: !1022, size: 32, offset: 160)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !1028, file: !1027, line: 614, baseType: !1010, size: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1028, file: !1027, line: 615, baseType: !1037, size: 8192, offset: 256)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 8192, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 1024)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1028, file: !1027, line: 616, baseType: !1041, size: 64, offset: 8448)
!1041 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "imb", scope: !1028, file: !1027, line: 618, baseType: !1043, size: 64, offset: 8512)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !1045, line: 56, flags: DIFlagFwdDecl)
!1045 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1028, file: !1027, line: 619, baseType: !1005, size: 32, offset: 8576)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1028, file: !1027, line: 620, baseType: !1022, size: 32, offset: 8608)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1028, file: !1027, line: 620, baseType: !1022, size: 32, offset: 8640)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "opname", scope: !1028, file: !1027, line: 622, baseType: !1050, size: 1600, offset: 8672)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 1600, elements: !1051)
!1051 = !{!1052}
!1052 = !DISubrange(count: 200)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1028, file: !1027, line: 623, baseType: !5, size: 32, offset: 10272)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmEvent", file: !1027, line: 460, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !1027, line: 421, size: 960, elements: !1058)
!1058 = !{!1059, !1061, !1062, !1063, !1064, !1065, !1066, !1070, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1092, !1100, !1101, !1102, !1103}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1057, file: !1027, line: 422, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1057, file: !1027, line: 422, baseType: !1060, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1057, file: !1027, line: 424, baseType: !1014, size: 16, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1057, file: !1027, line: 425, baseType: !1014, size: 16, offset: 144)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1057, file: !1027, line: 426, baseType: !1022, size: 32, offset: 160)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1057, file: !1027, line: 426, baseType: !1022, size: 32, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !1057, file: !1027, line: 427, baseType: !1067, size: 64, offset: 224)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 64, elements: !1068)
!1068 = !{!1069}
!1069 = !DISubrange(count: 2)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !1057, file: !1027, line: 428, baseType: !1071, size: 48, offset: 288)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 48, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 6)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !1057, file: !1027, line: 431, baseType: !1012, size: 8, offset: 336)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1057, file: !1027, line: 432, baseType: !1012, size: 8, offset: 344)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !1057, file: !1027, line: 435, baseType: !1014, size: 16, offset: 352)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !1057, file: !1027, line: 436, baseType: !1014, size: 16, offset: 368)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !1057, file: !1027, line: 437, baseType: !1022, size: 32, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !1057, file: !1027, line: 437, baseType: !1022, size: 32, offset: 416)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !1057, file: !1027, line: 438, baseType: !1041, size: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !1057, file: !1027, line: 439, baseType: !1022, size: 32, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !1057, file: !1027, line: 439, baseType: !1022, size: 32, offset: 544)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1057, file: !1027, line: 442, baseType: !1014, size: 16, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !1057, file: !1027, line: 442, baseType: !1014, size: 16, offset: 592)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1057, file: !1027, line: 442, baseType: !1014, size: 16, offset: 608)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !1057, file: !1027, line: 442, baseType: !1014, size: 16, offset: 624)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !1057, file: !1027, line: 443, baseType: !1014, size: 16, offset: 640)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !1057, file: !1027, line: 446, baseType: !1014, size: 16, offset: 656)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !1057, file: !1027, line: 449, baseType: !1090, size: 64, offset: 704)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !1057, file: !1027, line: 452, baseType: !1093, size: 64, offset: 768)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !1027, line: 463, size: 128, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1094, file: !1027, line: 464, baseType: !1022, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1094, file: !1027, line: 465, baseType: !1005, size: 32, offset: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1094, file: !1027, line: 466, baseType: !1005, size: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1094, file: !1027, line: 467, baseType: !1005, size: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !1057, file: !1027, line: 455, baseType: !1014, size: 16, offset: 832)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !1057, file: !1027, line: 456, baseType: !1014, size: 16, offset: 848)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1057, file: !1027, line: 457, baseType: !1022, size: 32, offset: 864)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1057, file: !1027, line: 458, baseType: !1010, size: 64, offset: 896)
!1104 = !{}
!1105 = !DILocalVariable(name: "C", arg: 1, scope: !1019, file: !1, line: 839, type: !1023)
!1106 = !DILocation(line: 839, column: 41, scope: !1019)
!1107 = !DILocalVariable(name: "drag", arg: 2, scope: !1019, file: !1, line: 839, type: !1025)
!1108 = !DILocation(line: 839, column: 52, scope: !1019)
!1109 = !DILocalVariable(name: "UNUSED_event", arg: 3, scope: !1019, file: !1, line: 839, type: !1054)
!1110 = !DILocation(line: 839, column: 73, scope: !1019)
!1111 = !DILocation(line: 843, column: 6, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1019, file: !1, line: 843, column: 6)
!1113 = !DILocation(line: 843, column: 12, scope: !1112)
!1114 = !DILocation(line: 843, column: 17, scope: !1112)
!1115 = !DILocation(line: 843, column: 6, scope: !1019)
!1116 = !DILocalVariable(name: "sima", scope: !1117, file: !1, line: 844, type: !1118)
!1117 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 843, column: 35)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceImage", file: !4, line: 743, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceImage", file: !4, line: 710, size: 84672, elements: !1121)
!1121 = !{!1122, !1143, !1144, !1145, !1146, !1147, !1289, !2773, !2774, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1120, file: !4, line: 711, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !1126)
!1126 = !{!1127, !1129, !1130, !1137, !1138, !1139}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1125, file: !4, line: 86, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1125, file: !4, line: 86, baseType: !1128, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1125, file: !4, line: 87, baseType: !1131, size: 128, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1132, line: 71, baseType: !1133)
!1132 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1132, line: 69, size: 128, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1133, file: !1132, line: 70, baseType: !1010, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1133, file: !1132, line: 70, baseType: !1010, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1125, file: !4, line: 88, baseType: !1022, size: 32, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1125, file: !4, line: 89, baseType: !1005, size: 32, offset: 288)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1125, file: !4, line: 90, baseType: !1140, size: 128, offset: 320)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 128, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 8)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1120, file: !4, line: 711, baseType: !1123, size: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1120, file: !4, line: 712, baseType: !1131, size: 128, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1120, file: !4, line: 713, baseType: !1022, size: 32, offset: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1120, file: !4, line: 715, baseType: !1022, size: 32, offset: 288)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1120, file: !4, line: 717, baseType: !1148, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1150, line: 77, size: 15424, elements: !1151)
!1150 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1151 = !{!1152, !1211, !1212, !1215, !1218, !1221, !1224, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1242, !1243, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1270, !1271, !1272, !1278, !1279, !1283}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1149, file: !1150, line: 78, baseType: !1153, size: 960)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1154, line: 130, baseType: !1155)
!1154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1154, line: 117, size: 960, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1161, !1177, !1181, !1182, !1183, !1184, !1185}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1155, file: !1154, line: 118, baseType: !1010, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1155, file: !1154, line: 118, baseType: !1010, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1155, file: !1154, line: 119, baseType: !1160, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1155, file: !1154, line: 120, baseType: !1162, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1154, line: 136, size: 17600, elements: !1164)
!1164 = !{!1165, !1166, !1168, !1171, !1172, !1173, !1174}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1163, file: !1154, line: 137, baseType: !1153, size: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1163, file: !1154, line: 138, baseType: !1167, size: 64, offset: 960)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1163, file: !1154, line: 139, baseType: !1169, size: 64, offset: 1024)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1154, line: 43, flags: DIFlagFwdDecl)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1163, file: !1154, line: 140, baseType: !1037, size: 8192, offset: 1088)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1163, file: !1154, line: 141, baseType: !1037, size: 8192, offset: 9280)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1163, file: !1154, line: 148, baseType: !1162, size: 64, offset: 17472)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1163, file: !1154, line: 150, baseType: !1175, size: 64, offset: 17536)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1154, line: 45, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1155, file: !1154, line: 121, baseType: !1178, size: 528, offset: 256)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 528, elements: !1179)
!1179 = !{!1180}
!1180 = !DISubrange(count: 66)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1155, file: !1154, line: 126, baseType: !1014, size: 16, offset: 784)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1155, file: !1154, line: 127, baseType: !1022, size: 32, offset: 800)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1155, file: !1154, line: 128, baseType: !1022, size: 32, offset: 832)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1155, file: !1154, line: 128, baseType: !1022, size: 32, offset: 864)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1155, file: !1154, line: 129, baseType: !1186, size: 64, offset: 896)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1154, line: 75, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1154, line: 62, size: 1024, elements: !1189)
!1189 = !{!1190, !1192, !1193, !1194, !1195, !1196, !1200, !1201, !1209, !1210}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1188, file: !1154, line: 63, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1188, file: !1154, line: 63, baseType: !1191, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1188, file: !1154, line: 64, baseType: !1012, size: 8, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1188, file: !1154, line: 64, baseType: !1012, size: 8, offset: 136)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1188, file: !1154, line: 65, baseType: !1014, size: 16, offset: 144)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1188, file: !1154, line: 66, baseType: !1197, size: 512, offset: 160)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 512, elements: !1198)
!1198 = !{!1199}
!1199 = !DISubrange(count: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1188, file: !1154, line: 67, baseType: !1022, size: 32, offset: 672)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1188, file: !1154, line: 69, baseType: !1202, size: 256, offset: 704)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1154, line: 60, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1154, line: 48, size: 256, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1203, file: !1154, line: 49, baseType: !1010, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1203, file: !1154, line: 58, baseType: !1131, size: 128, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1203, file: !1154, line: 59, baseType: !1022, size: 32, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1203, file: !1154, line: 59, baseType: !1022, size: 32, offset: 224)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1188, file: !1154, line: 70, baseType: !1022, size: 32, offset: 960)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1188, file: !1154, line: 74, baseType: !1022, size: 32, offset: 992)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1149, file: !1150, line: 80, baseType: !1037, size: 8192, offset: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1149, file: !1150, line: 82, baseType: !1213, size: 64, offset: 9152)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1150, line: 43, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1149, file: !1150, line: 83, baseType: !1216, size: 64, offset: 9216)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1154, line: 46, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1149, file: !1150, line: 86, baseType: !1219, size: 64, offset: 9280)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1150, line: 41, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1149, file: !1150, line: 87, baseType: !1222, size: 64, offset: 9344)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1150, line: 44, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1149, file: !1150, line: 89, baseType: !1225, size: 512, offset: 9408)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 512, elements: !1141)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1149, file: !1150, line: 90, baseType: !1014, size: 16, offset: 9920)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1149, file: !1150, line: 90, baseType: !1014, size: 16, offset: 9936)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1149, file: !1150, line: 92, baseType: !1014, size: 16, offset: 9952)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1149, file: !1150, line: 92, baseType: !1014, size: 16, offset: 9968)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1149, file: !1150, line: 93, baseType: !1014, size: 16, offset: 9984)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1149, file: !1150, line: 93, baseType: !1014, size: 16, offset: 10000)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1149, file: !1150, line: 94, baseType: !1022, size: 32, offset: 10016)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1149, file: !1150, line: 97, baseType: !1014, size: 16, offset: 10048)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1149, file: !1150, line: 97, baseType: !1014, size: 16, offset: 10064)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1149, file: !1150, line: 98, baseType: !1014, size: 16, offset: 10080)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1149, file: !1150, line: 98, baseType: !1014, size: 16, offset: 10096)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1149, file: !1150, line: 99, baseType: !1014, size: 16, offset: 10112)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1149, file: !1150, line: 99, baseType: !1014, size: 16, offset: 10128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1149, file: !1150, line: 100, baseType: !5, size: 32, offset: 10144)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1149, file: !1150, line: 101, baseType: !1241, size: 64, offset: 10176)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1149, file: !1150, line: 103, baseType: !1175, size: 64, offset: 10240)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1149, file: !1150, line: 104, baseType: !1244, size: 64, offset: 10304)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1154, line: 159, size: 448, elements: !1246)
!1246 = !{!1247, !1249, !1250, !1252, !1253, !1255}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1245, file: !1154, line: 161, baseType: !1248, size: 64)
!1248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1068)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1245, file: !1154, line: 162, baseType: !1248, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1245, file: !1154, line: 163, baseType: !1251, size: 32, offset: 128)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 32, elements: !1068)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1245, file: !1154, line: 164, baseType: !1251, size: 32, offset: 160)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1245, file: !1154, line: 165, baseType: !1254, size: 128, offset: 192)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1241, size: 128, elements: !1068)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1245, file: !1154, line: 166, baseType: !1256, size: 128, offset: 320)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1216, size: 128, elements: !1068)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1149, file: !1150, line: 107, baseType: !1005, size: 32, offset: 10368)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1149, file: !1150, line: 108, baseType: !1022, size: 32, offset: 10400)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1149, file: !1150, line: 109, baseType: !1014, size: 16, offset: 10432)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1149, file: !1150, line: 110, baseType: !1014, size: 16, offset: 10448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1149, file: !1150, line: 113, baseType: !1022, size: 32, offset: 10464)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1149, file: !1150, line: 113, baseType: !1022, size: 32, offset: 10496)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1149, file: !1150, line: 114, baseType: !1012, size: 8, offset: 10528)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1149, file: !1150, line: 114, baseType: !1012, size: 8, offset: 10536)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1149, file: !1150, line: 115, baseType: !1014, size: 16, offset: 10544)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1149, file: !1150, line: 116, baseType: !1267, size: 128, offset: 10560)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 128, elements: !1268)
!1268 = !{!1269}
!1269 = !DISubrange(count: 4)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1149, file: !1150, line: 119, baseType: !1005, size: 32, offset: 10688)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1149, file: !1150, line: 119, baseType: !1005, size: 32, offset: 10720)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1149, file: !1150, line: 122, baseType: !1273, size: 512, offset: 10752)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1274, line: 182, baseType: !1275)
!1274 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1274, line: 180, size: 512, elements: !1276)
!1276 = !{!1277}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1275, file: !1274, line: 181, baseType: !1197, size: 512)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1149, file: !1150, line: 123, baseType: !1012, size: 8, offset: 11264)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1149, file: !1150, line: 125, baseType: !1280, size: 56, offset: 11272)
!1280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 56, elements: !1281)
!1281 = !{!1282}
!1282 = !DISubrange(count: 7)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1149, file: !1150, line: 126, baseType: !1284, size: 4096, offset: 11328)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1285, size: 4096, elements: !1141)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1150, line: 69, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1150, line: 67, size: 512, elements: !1287)
!1287 = !{!1288}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1286, file: !1150, line: 68, baseType: !1197, size: 512)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1120, file: !4, line: 718, baseType: !1290, size: 320, offset: 384)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1150, line: 50, size: 320, elements: !1291)
!1291 = !{!1292, !2760, !2761, !2762, !2763, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1290, file: !1150, line: 51, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1295, line: 1216, size: 39680, elements: !1296)
!1295 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1296 = !{!1297, !1298, !1302, !1305, !1308, !1309, !1310, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1336, !1413, !1763, !2356, !2359, !2631, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2653, !2654, !2655, !2656, !2657, !2665, !2731, !2738, !2739, !2746, !2747, !2753, !2754, !2755, !2756, !2757}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1294, file: !1295, line: 1217, baseType: !1153, size: 960)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1294, file: !1295, line: 1218, baseType: !1299, size: 64, offset: 960)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1301, line: 45, flags: DIFlagFwdDecl)
!1301 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1294, file: !1295, line: 1220, baseType: !1303, size: 64, offset: 1024)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1045, line: 44, flags: DIFlagFwdDecl)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1294, file: !1295, line: 1221, baseType: !1306, size: 64, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1295, line: 52, flags: DIFlagFwdDecl)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1294, file: !1295, line: 1223, baseType: !1293, size: 64, offset: 1152)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1294, file: !1295, line: 1225, baseType: !1131, size: 128, offset: 1216)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1294, file: !1295, line: 1226, baseType: !1311, size: 64, offset: 1344)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1295, line: 69, size: 320, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1312, file: !1295, line: 70, baseType: !1311, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1312, file: !1295, line: 70, baseType: !1311, size: 64, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1312, file: !1295, line: 71, baseType: !5, size: 32, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1312, file: !1295, line: 71, baseType: !5, size: 32, offset: 160)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1312, file: !1295, line: 72, baseType: !1022, size: 32, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1312, file: !1295, line: 73, baseType: !1014, size: 16, offset: 224)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1312, file: !1295, line: 73, baseType: !1014, size: 16, offset: 240)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1312, file: !1295, line: 74, baseType: !1303, size: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1294, file: !1295, line: 1227, baseType: !1303, size: 64, offset: 1408)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1294, file: !1295, line: 1229, baseType: !1004, size: 96, offset: 1472)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1294, file: !1295, line: 1230, baseType: !1004, size: 96, offset: 1568)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1294, file: !1295, line: 1231, baseType: !1004, size: 96, offset: 1664)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1294, file: !1295, line: 1231, baseType: !1004, size: 96, offset: 1760)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1294, file: !1295, line: 1233, baseType: !5, size: 32, offset: 1856)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1294, file: !1295, line: 1234, baseType: !1022, size: 32, offset: 1888)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1294, file: !1295, line: 1235, baseType: !5, size: 32, offset: 1920)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1294, file: !1295, line: 1237, baseType: !1014, size: 16, offset: 1952)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1294, file: !1295, line: 1239, baseType: !1012, size: 8, offset: 1968)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1294, file: !1295, line: 1240, baseType: !1333, size: 8, offset: 1976)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 8, elements: !1334)
!1334 = !{!1335}
!1335 = !DISubrange(count: 1)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1294, file: !1295, line: 1242, baseType: !1337, size: 64, offset: 1984)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1339, line: 328, size: 3456, elements: !1340)
!1339 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1340 = !{!1341, !1342, !1343, !1346, !1347, !1350, !1354, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1379, !1380, !1381, !1384, !1389, !1390, !1393, !1397, !1401, !1405, !1409, !1410, !1411, !1412}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1338, file: !1339, line: 329, baseType: !1153, size: 960)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1338, file: !1339, line: 330, baseType: !1299, size: 64, offset: 960)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1338, file: !1339, line: 332, baseType: !1344, size: 64, offset: 1024)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1339, line: 332, flags: DIFlagFwdDecl)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1338, file: !1339, line: 333, baseType: !1197, size: 512, offset: 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1338, file: !1339, line: 335, baseType: !1348, size: 64, offset: 1600)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !967, line: 41, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1338, file: !1339, line: 337, baseType: !1351, size: 64, offset: 1664)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1353, line: 45, flags: DIFlagFwdDecl)
!1353 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1338, file: !1339, line: 338, baseType: !1355, size: 64, offset: 1728)
!1355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 64, elements: !1068)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1338, file: !1339, line: 340, baseType: !1131, size: 128, offset: 1792)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1338, file: !1339, line: 340, baseType: !1131, size: 128, offset: 1920)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1338, file: !1339, line: 342, baseType: !1022, size: 32, offset: 2048)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1338, file: !1339, line: 342, baseType: !1022, size: 32, offset: 2080)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1338, file: !1339, line: 343, baseType: !1022, size: 32, offset: 2112)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1338, file: !1339, line: 345, baseType: !1022, size: 32, offset: 2144)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1338, file: !1339, line: 346, baseType: !1022, size: 32, offset: 2176)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1338, file: !1339, line: 347, baseType: !1014, size: 16, offset: 2208)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1338, file: !1339, line: 348, baseType: !1014, size: 16, offset: 2224)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1338, file: !1339, line: 349, baseType: !1022, size: 32, offset: 2240)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1338, file: !1339, line: 351, baseType: !1022, size: 32, offset: 2272)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1338, file: !1339, line: 353, baseType: !1014, size: 16, offset: 2304)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1338, file: !1339, line: 354, baseType: !1014, size: 16, offset: 2320)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1338, file: !1339, line: 355, baseType: !1022, size: 32, offset: 2336)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1338, file: !1339, line: 357, baseType: !1371, size: 128, offset: 2368)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1372, line: 95, baseType: !1373)
!1372 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1372, line: 92, size: 128, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1378}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1373, file: !1372, line: 93, baseType: !1005, size: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1373, file: !1372, line: 93, baseType: !1005, size: 32, offset: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1373, file: !1372, line: 94, baseType: !1005, size: 32, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1373, file: !1372, line: 94, baseType: !1005, size: 32, offset: 96)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1338, file: !1339, line: 363, baseType: !1131, size: 128, offset: 2496)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1338, file: !1339, line: 363, baseType: !1131, size: 128, offset: 2624)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1338, file: !1339, line: 368, baseType: !1382, size: 64, offset: 2752)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1339, line: 48, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1338, file: !1339, line: 372, baseType: !1385, size: 32, offset: 2816)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1339, line: 274, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1339, line: 271, size: 32, elements: !1387)
!1387 = !{!1388}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1386, file: !1339, line: 273, baseType: !5, size: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1338, file: !1339, line: 373, baseType: !1022, size: 32, offset: 2848)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1338, file: !1339, line: 382, baseType: !1391, size: 64, offset: 2880)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1339, line: 46, flags: DIFlagFwdDecl)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1338, file: !1339, line: 385, baseType: !1394, size: 64, offset: 2944)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{null, !1010, !1005}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1338, file: !1339, line: 386, baseType: !1398, size: 64, offset: 3008)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{null, !1010, !1011}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1338, file: !1339, line: 387, baseType: !1402, size: 64, offset: 3072)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!1022, !1010}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1338, file: !1339, line: 388, baseType: !1406, size: 64, offset: 3136)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{null, !1010}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1338, file: !1339, line: 389, baseType: !1010, size: 64, offset: 3200)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1338, file: !1339, line: 389, baseType: !1010, size: 64, offset: 3264)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1338, file: !1339, line: 389, baseType: !1010, size: 64, offset: 3328)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1338, file: !1339, line: 389, baseType: !1010, size: 64, offset: 3392)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1294, file: !1295, line: 1244, baseType: !1414, size: 64, offset: 2048)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1416, line: 200, size: 17024, elements: !1417)
!1416 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1417 = !{!1418, !1420, !1421, !1422, !1756, !1757, !1758, !1759, !1760, !1761, !1762}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1415, file: !1416, line: 201, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1415, file: !1416, line: 202, baseType: !1131, size: 128, offset: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1415, file: !1416, line: 203, baseType: !1131, size: 128, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1415, file: !1416, line: 206, baseType: !1423, size: 64, offset: 320)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1416, line: 190, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1416, line: 126, size: 2816, elements: !1426)
!1426 = !{!1427, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1518, !1521, !1522, !1523, !1728, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1755}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1425, file: !1416, line: 127, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1425, file: !1416, line: 127, baseType: !1428, size: 64, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1425, file: !1416, line: 128, baseType: !1010, size: 64, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1425, file: !1416, line: 129, baseType: !1010, size: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1425, file: !1416, line: 130, baseType: !1197, size: 512, offset: 256)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1425, file: !1416, line: 132, baseType: !1022, size: 32, offset: 768)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1425, file: !1416, line: 132, baseType: !1022, size: 32, offset: 800)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1425, file: !1416, line: 133, baseType: !1022, size: 32, offset: 832)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1425, file: !1416, line: 134, baseType: !1022, size: 32, offset: 864)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1425, file: !1416, line: 134, baseType: !1022, size: 32, offset: 896)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1425, file: !1416, line: 134, baseType: !1022, size: 32, offset: 928)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1425, file: !1416, line: 135, baseType: !1022, size: 32, offset: 960)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1425, file: !1416, line: 135, baseType: !1022, size: 32, offset: 992)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1425, file: !1416, line: 136, baseType: !1022, size: 32, offset: 1024)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1425, file: !1416, line: 136, baseType: !1022, size: 32, offset: 1056)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1425, file: !1416, line: 137, baseType: !1022, size: 32, offset: 1088)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1425, file: !1416, line: 137, baseType: !1022, size: 32, offset: 1120)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1425, file: !1416, line: 138, baseType: !1005, size: 32, offset: 1152)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1425, file: !1416, line: 139, baseType: !1005, size: 32, offset: 1184)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1425, file: !1416, line: 139, baseType: !1005, size: 32, offset: 1216)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1425, file: !1416, line: 141, baseType: !1014, size: 16, offset: 1248)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1425, file: !1416, line: 142, baseType: !1014, size: 16, offset: 1264)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1425, file: !1416, line: 143, baseType: !1022, size: 32, offset: 1280)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1425, file: !1416, line: 144, baseType: !1022, size: 32, offset: 1312)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1425, file: !1416, line: 146, baseType: !1453, size: 64, offset: 1344)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1416, line: 114, baseType: !1455)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1416, line: 99, size: 7232, elements: !1456)
!1456 = !{!1457, !1459, !1460, !1461, !1462, !1463, !1464, !1475, !1479, !1491, !1500, !1507, !1517}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1455, file: !1416, line: 100, baseType: !1458, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1455, file: !1416, line: 100, baseType: !1458, size: 64, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1455, file: !1416, line: 101, baseType: !1022, size: 32, offset: 128)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1455, file: !1416, line: 101, baseType: !1022, size: 32, offset: 160)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1455, file: !1416, line: 102, baseType: !1022, size: 32, offset: 192)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1455, file: !1416, line: 102, baseType: !1022, size: 32, offset: 224)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1455, file: !1416, line: 103, baseType: !1465, size: 64, offset: 256)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1416, line: 59, baseType: !1467)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1416, line: 56, size: 2112, elements: !1468)
!1468 = !{!1469, !1473, !1474}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1467, file: !1416, line: 57, baseType: !1470, size: 2048)
!1470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 2048, elements: !1471)
!1471 = !{!1472}
!1472 = !DISubrange(count: 256)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1467, file: !1416, line: 58, baseType: !1022, size: 32, offset: 2048)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1467, file: !1416, line: 58, baseType: !1022, size: 32, offset: 2080)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1455, file: !1416, line: 106, baseType: !1476, size: 6144, offset: 320)
!1476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 6144, elements: !1477)
!1477 = !{!1478}
!1478 = !DISubrange(count: 768)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1455, file: !1416, line: 107, baseType: !1480, size: 64, offset: 6464)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64)
!1481 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1416, line: 97, baseType: !1482)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1416, line: 83, size: 8320, elements: !1483)
!1483 = !{!1484, !1485, !1486, !1487, !1488, !1489, !1490}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1482, file: !1416, line: 84, baseType: !1476, size: 6144)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1482, file: !1416, line: 87, baseType: !1470, size: 2048, offset: 6144)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1482, file: !1416, line: 88, baseType: !1219, size: 64, offset: 8192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1482, file: !1416, line: 90, baseType: !1014, size: 16, offset: 8256)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1482, file: !1416, line: 92, baseType: !1014, size: 16, offset: 8272)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1482, file: !1416, line: 93, baseType: !1014, size: 16, offset: 8288)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1482, file: !1416, line: 95, baseType: !1014, size: 16, offset: 8304)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1455, file: !1416, line: 108, baseType: !1492, size: 64, offset: 6528)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64)
!1493 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1416, line: 66, baseType: !1494)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1416, line: 61, size: 128, elements: !1495)
!1495 = !{!1496, !1497, !1498, !1499}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1494, file: !1416, line: 62, baseType: !1022, size: 32)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1494, file: !1416, line: 63, baseType: !1022, size: 32, offset: 32)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1494, file: !1416, line: 64, baseType: !1022, size: 32, offset: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1494, file: !1416, line: 65, baseType: !1022, size: 32, offset: 96)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1455, file: !1416, line: 109, baseType: !1501, size: 64, offset: 6592)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1416, line: 71, baseType: !1503)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1416, line: 68, size: 64, elements: !1504)
!1504 = !{!1505, !1506}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1503, file: !1416, line: 69, baseType: !1022, size: 32)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1503, file: !1416, line: 70, baseType: !1022, size: 32, offset: 32)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1455, file: !1416, line: 110, baseType: !1508, size: 64, offset: 6656)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1416, line: 81, baseType: !1510)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1416, line: 73, size: 352, elements: !1511)
!1511 = !{!1512, !1513, !1514, !1515, !1516}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1510, file: !1416, line: 74, baseType: !1004, size: 96)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1510, file: !1416, line: 75, baseType: !1004, size: 96, offset: 96)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1510, file: !1416, line: 76, baseType: !1004, size: 96, offset: 192)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1510, file: !1416, line: 77, baseType: !1022, size: 32, offset: 288)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1510, file: !1416, line: 78, baseType: !1022, size: 32, offset: 320)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1455, file: !1416, line: 113, baseType: !1273, size: 512, offset: 6720)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1425, file: !1416, line: 148, baseType: !1519, size: 64, offset: 1408)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64)
!1520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1301, line: 46, flags: DIFlagFwdDecl)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1425, file: !1416, line: 151, baseType: !1293, size: 64, offset: 1472)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1425, file: !1416, line: 152, baseType: !1303, size: 64, offset: 1536)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1425, file: !1416, line: 153, baseType: !1524, size: 64, offset: 1600)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1526, line: 64, size: 19136, elements: !1527)
!1526 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1527 = !{!1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1540, !1541, !1714, !1715, !1723, !1724, !1725, !1726, !1727}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1525, file: !1526, line: 65, baseType: !1153, size: 960)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1525, file: !1526, line: 66, baseType: !1299, size: 64, offset: 960)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1525, file: !1526, line: 68, baseType: !1037, size: 8192, offset: 1024)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1525, file: !1526, line: 70, baseType: !1022, size: 32, offset: 9216)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1525, file: !1526, line: 71, baseType: !1022, size: 32, offset: 9248)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1525, file: !1526, line: 72, baseType: !1067, size: 64, offset: 9280)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1525, file: !1526, line: 74, baseType: !1005, size: 32, offset: 9344)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1525, file: !1526, line: 74, baseType: !1005, size: 32, offset: 9376)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1525, file: !1526, line: 76, baseType: !1219, size: 64, offset: 9408)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1525, file: !1526, line: 77, baseType: !1538, size: 64, offset: 9472)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1539 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1526, line: 77, flags: DIFlagFwdDecl)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1525, file: !1526, line: 78, baseType: !1351, size: 64, offset: 9536)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1525, file: !1526, line: 80, baseType: !1542, size: 2624, offset: 9600)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1353, line: 340, size: 2624, elements: !1543)
!1543 = !{!1544, !1572, !1590, !1591, !1592, !1609, !1667, !1668, !1694, !1695, !1696, !1697, !1703}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1542, file: !1353, line: 341, baseType: !1545, size: 576)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1353, line: 251, baseType: !1546)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1353, line: 207, size: 576, elements: !1547)
!1547 = !{!1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1546, file: !1353, line: 208, baseType: !1022, size: 32)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1546, file: !1353, line: 211, baseType: !1014, size: 16, offset: 32)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1546, file: !1353, line: 212, baseType: !1014, size: 16, offset: 48)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1546, file: !1353, line: 213, baseType: !1005, size: 32, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1546, file: !1353, line: 214, baseType: !1014, size: 16, offset: 96)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1546, file: !1353, line: 215, baseType: !1014, size: 16, offset: 112)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1546, file: !1353, line: 216, baseType: !1014, size: 16, offset: 128)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1546, file: !1353, line: 217, baseType: !1014, size: 16, offset: 144)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1546, file: !1353, line: 218, baseType: !1014, size: 16, offset: 160)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1546, file: !1353, line: 219, baseType: !1014, size: 16, offset: 176)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1546, file: !1353, line: 220, baseType: !1005, size: 32, offset: 192)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1546, file: !1353, line: 222, baseType: !1014, size: 16, offset: 224)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1546, file: !1353, line: 225, baseType: !1014, size: 16, offset: 240)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1546, file: !1353, line: 228, baseType: !1022, size: 32, offset: 256)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1546, file: !1353, line: 229, baseType: !1022, size: 32, offset: 288)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1546, file: !1353, line: 233, baseType: !1022, size: 32, offset: 320)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1546, file: !1353, line: 236, baseType: !1014, size: 16, offset: 352)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1546, file: !1353, line: 236, baseType: !1014, size: 16, offset: 368)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1546, file: !1353, line: 241, baseType: !1005, size: 32, offset: 384)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1546, file: !1353, line: 244, baseType: !1022, size: 32, offset: 416)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1546, file: !1353, line: 244, baseType: !1022, size: 32, offset: 448)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1546, file: !1353, line: 245, baseType: !1005, size: 32, offset: 480)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1546, file: !1353, line: 248, baseType: !1005, size: 32, offset: 512)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1546, file: !1353, line: 250, baseType: !1022, size: 32, offset: 544)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1542, file: !1353, line: 342, baseType: !1573, size: 448, offset: 576)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1353, line: 79, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1353, line: 61, size: 448, elements: !1575)
!1575 = !{!1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1574, file: !1353, line: 62, baseType: !1010, size: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1574, file: !1353, line: 64, baseType: !1014, size: 16, offset: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1574, file: !1353, line: 65, baseType: !1014, size: 16, offset: 80)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1574, file: !1353, line: 67, baseType: !1005, size: 32, offset: 96)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1574, file: !1353, line: 68, baseType: !1005, size: 32, offset: 128)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1574, file: !1353, line: 69, baseType: !1005, size: 32, offset: 160)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1574, file: !1353, line: 70, baseType: !1014, size: 16, offset: 192)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1574, file: !1353, line: 71, baseType: !1014, size: 16, offset: 208)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1574, file: !1353, line: 72, baseType: !1355, size: 64, offset: 224)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1574, file: !1353, line: 75, baseType: !1005, size: 32, offset: 288)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1574, file: !1353, line: 75, baseType: !1005, size: 32, offset: 320)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1574, file: !1353, line: 75, baseType: !1005, size: 32, offset: 352)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1574, file: !1353, line: 78, baseType: !1005, size: 32, offset: 384)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1574, file: !1353, line: 78, baseType: !1005, size: 32, offset: 416)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1542, file: !1353, line: 343, baseType: !1131, size: 128, offset: 1024)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1542, file: !1353, line: 344, baseType: !1131, size: 128, offset: 1152)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1542, file: !1353, line: 345, baseType: !1593, size: 192, offset: 1280)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1353, line: 278, baseType: !1594)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1353, line: 270, size: 192, elements: !1595)
!1595 = !{!1596, !1597, !1598, !1599, !1600}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1594, file: !1353, line: 271, baseType: !1022, size: 32)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1594, file: !1353, line: 273, baseType: !1005, size: 32, offset: 32)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1594, file: !1353, line: 275, baseType: !1022, size: 32, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1594, file: !1353, line: 276, baseType: !1022, size: 32, offset: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1594, file: !1353, line: 277, baseType: !1601, size: 64, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1353, line: 55, size: 576, elements: !1603)
!1603 = !{!1604, !1605, !1606}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1602, file: !1353, line: 56, baseType: !1022, size: 32)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1602, file: !1353, line: 57, baseType: !1005, size: 32, offset: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1602, file: !1353, line: 58, baseType: !1607, size: 512, offset: 64)
!1607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 512, elements: !1608)
!1608 = !{!1269, !1269}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1542, file: !1353, line: 346, baseType: !1610, size: 384, offset: 1472)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1353, line: 268, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1353, line: 253, size: 384, elements: !1612)
!1612 = !{!1613, !1614, !1615, !1616, !1617, !1661, !1662, !1663, !1664, !1665, !1666}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1611, file: !1353, line: 254, baseType: !1022, size: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1611, file: !1353, line: 255, baseType: !1022, size: 32, offset: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1611, file: !1353, line: 255, baseType: !1022, size: 32, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1611, file: !1353, line: 258, baseType: !1005, size: 32, offset: 96)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1611, file: !1353, line: 259, baseType: !1618, size: 64, offset: 128)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64)
!1619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1353, line: 164, baseType: !1620)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1353, line: 108, size: 1664, elements: !1621)
!1621 = !{!1622, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1620, file: !1353, line: 109, baseType: !1623, size: 64)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1620, file: !1353, line: 109, baseType: !1623, size: 64, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1620, file: !1353, line: 111, baseType: !1197, size: 512, offset: 128)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1620, file: !1353, line: 119, baseType: !1355, size: 64, offset: 640)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1620, file: !1353, line: 119, baseType: !1355, size: 64, offset: 704)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1620, file: !1353, line: 125, baseType: !1355, size: 64, offset: 768)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1620, file: !1353, line: 125, baseType: !1355, size: 64, offset: 832)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1620, file: !1353, line: 127, baseType: !1355, size: 64, offset: 896)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1620, file: !1353, line: 130, baseType: !1022, size: 32, offset: 960)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1620, file: !1353, line: 131, baseType: !1022, size: 32, offset: 992)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1620, file: !1353, line: 132, baseType: !1634, size: 64, offset: 1024)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1353, line: 106, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1353, line: 81, size: 512, elements: !1637)
!1637 = !{!1638, !1639, !1642, !1643, !1644, !1645}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1636, file: !1353, line: 82, baseType: !1355, size: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1636, file: !1353, line: 97, baseType: !1640, size: 256, offset: 64)
!1640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 256, elements: !1641)
!1641 = !{!1269, !1069}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1636, file: !1353, line: 102, baseType: !1355, size: 64, offset: 320)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1636, file: !1353, line: 102, baseType: !1355, size: 64, offset: 384)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1636, file: !1353, line: 104, baseType: !1022, size: 32, offset: 448)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1636, file: !1353, line: 105, baseType: !1022, size: 32, offset: 480)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1620, file: !1353, line: 135, baseType: !1004, size: 96, offset: 1088)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1620, file: !1353, line: 136, baseType: !1005, size: 32, offset: 1184)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1620, file: !1353, line: 139, baseType: !1022, size: 32, offset: 1216)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1620, file: !1353, line: 139, baseType: !1022, size: 32, offset: 1248)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1620, file: !1353, line: 139, baseType: !1022, size: 32, offset: 1280)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1620, file: !1353, line: 140, baseType: !1004, size: 96, offset: 1312)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1620, file: !1353, line: 143, baseType: !1014, size: 16, offset: 1408)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1620, file: !1353, line: 144, baseType: !1014, size: 16, offset: 1424)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1620, file: !1353, line: 145, baseType: !1014, size: 16, offset: 1440)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1620, file: !1353, line: 148, baseType: !1014, size: 16, offset: 1456)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1620, file: !1353, line: 149, baseType: !1022, size: 32, offset: 1472)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1620, file: !1353, line: 150, baseType: !1005, size: 32, offset: 1504)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1620, file: !1353, line: 152, baseType: !1351, size: 64, offset: 1536)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1620, file: !1353, line: 163, baseType: !1005, size: 32, offset: 1600)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1620, file: !1353, line: 163, baseType: !1005, size: 32, offset: 1632)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1611, file: !1353, line: 261, baseType: !1005, size: 32, offset: 192)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1611, file: !1353, line: 261, baseType: !1005, size: 32, offset: 224)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1611, file: !1353, line: 261, baseType: !1005, size: 32, offset: 256)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1611, file: !1353, line: 263, baseType: !1022, size: 32, offset: 288)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1611, file: !1353, line: 266, baseType: !1022, size: 32, offset: 320)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1611, file: !1353, line: 267, baseType: !1005, size: 32, offset: 352)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1542, file: !1353, line: 347, baseType: !1618, size: 64, offset: 1856)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1542, file: !1353, line: 348, baseType: !1669, size: 64, offset: 1920)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1353, line: 205, baseType: !1671)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1353, line: 186, size: 1024, elements: !1672)
!1672 = !{!1673, !1675, !1676, !1677, !1679, !1680, !1681, !1689, !1690, !1691, !1692, !1693}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1671, file: !1353, line: 187, baseType: !1674, size: 64)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1671, file: !1353, line: 187, baseType: !1674, size: 64, offset: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1671, file: !1353, line: 189, baseType: !1197, size: 512, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1671, file: !1353, line: 191, baseType: !1678, size: 64, offset: 640)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1671, file: !1353, line: 193, baseType: !1022, size: 32, offset: 704)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1671, file: !1353, line: 193, baseType: !1022, size: 32, offset: 736)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1671, file: !1353, line: 195, baseType: !1682, size: 64, offset: 768)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64)
!1683 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1353, line: 184, baseType: !1684)
!1684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1353, line: 166, size: 320, elements: !1685)
!1685 = !{!1686, !1687, !1688}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1684, file: !1353, line: 180, baseType: !1640, size: 256)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1684, file: !1353, line: 182, baseType: !1022, size: 32, offset: 256)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1684, file: !1353, line: 183, baseType: !1022, size: 32, offset: 288)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1671, file: !1353, line: 196, baseType: !1022, size: 32, offset: 832)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1671, file: !1353, line: 198, baseType: !1022, size: 32, offset: 864)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1671, file: !1353, line: 200, baseType: !1148, size: 64, offset: 896)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1671, file: !1353, line: 201, baseType: !1005, size: 32, offset: 960)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1671, file: !1353, line: 204, baseType: !1022, size: 32, offset: 992)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1542, file: !1353, line: 350, baseType: !1131, size: 128, offset: 1984)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1542, file: !1353, line: 351, baseType: !1022, size: 32, offset: 2112)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1542, file: !1353, line: 351, baseType: !1022, size: 32, offset: 2144)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1542, file: !1353, line: 353, baseType: !1698, size: 64, offset: 2176)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64)
!1699 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !1353, line: 297, baseType: !1700)
!1700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !1353, line: 295, size: 2048, elements: !1701)
!1701 = !{!1702}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1700, file: !1353, line: 296, baseType: !1470, size: 2048)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1542, file: !1353, line: 355, baseType: !1704, size: 384, offset: 2240)
!1704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !1353, line: 338, baseType: !1705)
!1705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !1353, line: 322, size: 384, elements: !1706)
!1706 = !{!1707, !1708, !1709, !1710, !1711, !1712, !1713}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1705, file: !1353, line: 323, baseType: !1022, size: 32)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1705, file: !1353, line: 325, baseType: !1014, size: 16, offset: 32)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1705, file: !1353, line: 326, baseType: !1014, size: 16, offset: 48)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1705, file: !1353, line: 331, baseType: !1131, size: 128, offset: 64)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1705, file: !1353, line: 334, baseType: !1131, size: 128, offset: 192)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1705, file: !1353, line: 335, baseType: !1022, size: 32, offset: 320)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1705, file: !1353, line: 337, baseType: !1022, size: 32, offset: 352)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1525, file: !1526, line: 81, baseType: !1010, size: 64, offset: 12224)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1525, file: !1526, line: 85, baseType: !1716, size: 6208, offset: 12288)
!1716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1526, line: 55, size: 6208, elements: !1717)
!1717 = !{!1718, !1719, !1720, !1721, !1722}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1716, file: !1526, line: 56, baseType: !1476, size: 6144)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1716, file: !1526, line: 58, baseType: !1014, size: 16, offset: 6144)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1716, file: !1526, line: 59, baseType: !1014, size: 16, offset: 6160)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1716, file: !1526, line: 60, baseType: !1014, size: 16, offset: 6176)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1716, file: !1526, line: 61, baseType: !1014, size: 16, offset: 6192)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1525, file: !1526, line: 86, baseType: !1022, size: 32, offset: 18496)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1525, file: !1526, line: 88, baseType: !1022, size: 32, offset: 18528)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1525, file: !1526, line: 90, baseType: !1022, size: 32, offset: 18560)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1525, file: !1526, line: 94, baseType: !1022, size: 32, offset: 18592)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1525, file: !1526, line: 100, baseType: !1273, size: 512, offset: 18624)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1425, file: !1416, line: 154, baseType: !1729, size: 64, offset: 1664)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64)
!1730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1045, line: 264, flags: DIFlagFwdDecl)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1425, file: !1416, line: 156, baseType: !1219, size: 64, offset: 1728)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1425, file: !1416, line: 158, baseType: !1005, size: 32, offset: 1792)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1425, file: !1416, line: 159, baseType: !1005, size: 32, offset: 1824)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1425, file: !1416, line: 162, baseType: !1428, size: 64, offset: 1856)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1425, file: !1416, line: 162, baseType: !1428, size: 64, offset: 1920)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1425, file: !1416, line: 162, baseType: !1428, size: 64, offset: 1984)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1425, file: !1416, line: 164, baseType: !1131, size: 128, offset: 2048)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1425, file: !1416, line: 166, baseType: !1739, size: 64, offset: 2176)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64)
!1740 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1416, line: 51, flags: DIFlagFwdDecl)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1425, file: !1416, line: 167, baseType: !1010, size: 64, offset: 2240)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1425, file: !1416, line: 168, baseType: !1005, size: 32, offset: 2304)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1425, file: !1416, line: 170, baseType: !1005, size: 32, offset: 2336)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !1425, file: !1416, line: 170, baseType: !1005, size: 32, offset: 2368)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !1425, file: !1416, line: 171, baseType: !1005, size: 32, offset: 2400)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !1425, file: !1416, line: 173, baseType: !1010, size: 64, offset: 2432)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !1425, file: !1416, line: 175, baseType: !1022, size: 32, offset: 2496)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !1425, file: !1416, line: 176, baseType: !1022, size: 32, offset: 2528)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !1425, file: !1416, line: 179, baseType: !1022, size: 32, offset: 2560)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !1425, file: !1416, line: 180, baseType: !1005, size: 32, offset: 2592)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1425, file: !1416, line: 183, baseType: !1022, size: 32, offset: 2624)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1425, file: !1416, line: 185, baseType: !1012, size: 8, offset: 2656)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1425, file: !1416, line: 186, baseType: !1754, size: 24, offset: 2664)
!1754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 24, elements: !1006)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1425, file: !1416, line: 189, baseType: !1131, size: 128, offset: 2688)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !1415, file: !1416, line: 207, baseType: !1037, size: 8192, offset: 384)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !1415, file: !1416, line: 208, baseType: !1037, size: 8192, offset: 8576)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !1415, file: !1416, line: 210, baseType: !1022, size: 32, offset: 16768)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !1415, file: !1416, line: 210, baseType: !1022, size: 32, offset: 16800)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !1415, file: !1416, line: 211, baseType: !1022, size: 32, offset: 16832)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1415, file: !1416, line: 211, baseType: !1022, size: 32, offset: 16864)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !1415, file: !1416, line: 212, baseType: !1371, size: 128, offset: 16896)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !1294, file: !1295, line: 1246, baseType: !1764, size: 64, offset: 2112)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64)
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !1295, line: 1067, size: 5184, elements: !1766)
!1766 = !{!1767, !2176, !2177, !2191, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2213, !2229, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2339}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1765, file: !1295, line: 1068, baseType: !1768, size: 64)
!1768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1769, size: 64)
!1769 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !1295, line: 934, baseType: !1770)
!1770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !1295, line: 925, size: 576, elements: !1771)
!1771 = !{!1772, !2168, !2169, !2170, !2171, !2172, !2175}
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1770, file: !1295, line: 926, baseType: !1773, size: 320)
!1773 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !1295, line: 830, baseType: !1774)
!1774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !1295, line: 813, size: 320, elements: !1775)
!1775 = !{!1776, !2153, !2162, !2163, !2165, !2166, !2167}
