; ModuleID = 'blender/source/blender/editors/mesh/mesh_ops.c'
source_filename = "blender/source/blender/editors/mesh/mesh_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!251 = !DILocation(line: 77, column: 2, scope: !220)
!252 = !DILocation(line: 78, column: 2, scope: !220)
!253 = !DILocation(line: 79, column: 2, scope: !220)
!254 = !DILocation(line: 80, column: 2, scope: !220)
!255 = !DILocation(line: 81, column: 2, scope: !220)
!256 = !DILocation(line: 82, column: 2, scope: !220)
!257 = !DILocation(line: 83, column: 2, scope: !220)
!258 = !DILocation(line: 85, column: 2, scope: !220)
!259 = !DILocation(line: 86, column: 2, scope: !220)
!260 = !DILocation(line: 87, column: 2, scope: !220)
!261 = !DILocation(line: 88, column: 2, scope: !220)
!262 = !DILocation(line: 90, column: 2, scope: !220)
!263 = !DILocation(line: 91, column: 2, scope: !220)
!264 = !DILocation(line: 92, column: 2, scope: !220)
!265 = !DILocation(line: 93, column: 2, scope: !220)
!266 = !DILocation(line: 94, column: 2, scope: !220)
!267 = !DILocation(line: 95, column: 2, scope: !220)
!268 = !DILocation(line: 96, column: 2, scope: !220)
!269 = !DILocation(line: 98, column: 2, scope: !220)
!270 = !DILocation(line: 99, column: 2, scope: !220)
!271 = !DILocation(line: 100, column: 2, scope: !220)
!272 = !DILocation(line: 101, column: 2, scope: !220)
!273 = !DILocation(line: 103, column: 2, scope: !220)
!274 = !DILocation(line: 104, column: 2, scope: !220)
!275 = !DILocation(line: 105, column: 2, scope: !220)
!276 = !DILocation(line: 106, column: 2, scope: !220)
!277 = !DILocation(line: 107, column: 2, scope: !220)
!278 = !DILocation(line: 108, column: 2, scope: !220)
!279 = !DILocation(line: 109, column: 2, scope: !220)
!280 = !DILocation(line: 110, column: 2, scope: !220)
!281 = !DILocation(line: 111, column: 2, scope: !220)
!282 = !DILocation(line: 112, column: 2, scope: !220)
!283 = !DILocation(line: 113, column: 2, scope: !220)
!284 = !DILocation(line: 114, column: 2, scope: !220)
!285 = !DILocation(line: 115, column: 2, scope: !220)
!286 = !DILocation(line: 116, column: 2, scope: !220)
!287 = !DILocation(line: 117, column: 2, scope: !220)
!288 = !DILocation(line: 118, column: 2, scope: !220)
!289 = !DILocation(line: 123, column: 2, scope: !220)
!290 = !DILocation(line: 124, column: 2, scope: !220)
!291 = !DILocation(line: 125, column: 2, scope: !220)
!292 = !DILocation(line: 127, column: 2, scope: !220)
!293 = !DILocation(line: 128, column: 2, scope: !220)
!294 = !DILocation(line: 129, column: 2, scope: !220)
!295 = !DILocation(line: 130, column: 2, scope: !220)
!296 = !DILocation(line: 131, column: 2, scope: !220)
!297 = !DILocation(line: 132, column: 2, scope: !220)
!298 = !DILocation(line: 133, column: 2, scope: !220)
!299 = !DILocation(line: 134, column: 2, scope: !220)
!300 = !DILocation(line: 135, column: 2, scope: !220)
!301 = !DILocation(line: 136, column: 2, scope: !220)
!302 = !DILocation(line: 137, column: 2, scope: !220)
!303 = !DILocation(line: 141, column: 2, scope: !220)
!304 = !DILocation(line: 142, column: 2, scope: !220)
!305 = !DILocation(line: 143, column: 2, scope: !220)
!306 = !DILocation(line: 144, column: 2, scope: !220)
!307 = !DILocation(line: 145, column: 2, scope: !220)
!308 = !DILocation(line: 146, column: 2, scope: !220)
!309 = !DILocation(line: 147, column: 2, scope: !220)
!310 = !DILocation(line: 148, column: 2, scope: !220)
!311 = !DILocation(line: 150, column: 2, scope: !220)
!312 = !DILocation(line: 151, column: 2, scope: !220)
!313 = !DILocation(line: 152, column: 2, scope: !220)
!314 = !DILocation(line: 153, column: 2, scope: !220)
!315 = !DILocation(line: 154, column: 2, scope: !220)
!316 = !DILocation(line: 155, column: 2, scope: !220)
!317 = !DILocation(line: 156, column: 2, scope: !220)
!318 = !DILocation(line: 158, column: 2, scope: !220)
!319 = !DILocation(line: 159, column: 2, scope: !220)
!320 = !DILocation(line: 161, column: 2, scope: !220)
!321 = !DILocation(line: 162, column: 2, scope: !220)
!322 = !DILocation(line: 163, column: 2, scope: !220)
!323 = !DILocation(line: 164, column: 2, scope: !220)
!324 = !DILocation(line: 165, column: 2, scope: !220)
!325 = !DILocation(line: 166, column: 2, scope: !220)
!326 = !DILocation(line: 168, column: 2, scope: !220)
!327 = !DILocation(line: 170, column: 2, scope: !220)
!328 = !DILocation(line: 172, column: 2, scope: !220)
!329 = !DILocation(line: 173, column: 2, scope: !220)
!330 = !DILocation(line: 174, column: 2, scope: !220)
!331 = !DILocation(line: 175, column: 2, scope: !220)
!332 = !DILocation(line: 176, column: 2, scope: !220)
!333 = !DILocation(line: 177, column: 2, scope: !220)
!334 = !DILocation(line: 178, column: 2, scope: !220)
!335 = !DILocation(line: 184, column: 2, scope: !220)
!336 = !DILocation(line: 185, column: 2, scope: !220)
!337 = !DILocation(line: 186, column: 2, scope: !220)
!338 = !DILocation(line: 195, column: 1, scope: !220)
!339 = distinct !DISubprogram(name: "ED_operatormacros_mesh", scope: !1, file: !1, line: 211, type: !221, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !223)
!340 = !DILocalVariable(name: "ot", scope: !339, file: !1, line: 213, type: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !343, line: 568, baseType: !344)
!343 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !343, line: 508, size: 1536, elements: !345)
!345 = !{!346, !350, !351, !352, !353, !1800, !1804, !1810, !1814, !1815, !1819, !1820, !1821, !1822, !1826, !1827, !1842, !1843, !1847, !1873}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !343, line: 509, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !344, file: !343, line: 510, baseType: !347, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !344, file: !343, line: 511, baseType: !347, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !344, file: !343, line: 512, baseType: !347, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !344, file: !343, line: 518, baseType: !354, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !358, !361}
!357 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !360, line: 44, flags: DIFlagFwdDecl)
!360 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !363, line: 328, size: 1344, elements: !364)
!363 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!364 = !{!365, !366, !367, !371, !403, !405, !406, !407, !419, !1793, !1794, !1795, !1798, !1799}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !363, line: 329, baseType: !361, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !362, file: !363, line: 329, baseType: !361, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !362, file: !363, line: 332, baseType: !368, size: 512, offset: 128)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 512, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !362, file: !363, line: 333, baseType: !372, size: 64, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !374, line: 75, baseType: !375)
!374 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !374, line: 62, size: 1024, elements: !376)
!376 = !{!377, !379, !380, !381, !382, !384, !385, !386, !401, !402}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !374, line: 63, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !375, file: !374, line: 63, baseType: !378, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !375, file: !374, line: 64, baseType: !349, size: 8, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !375, file: !374, line: 64, baseType: !349, size: 8, offset: 136)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !375, file: !374, line: 65, baseType: !383, size: 16, offset: 144)
!383 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !375, file: !374, line: 66, baseType: !368, size: 512, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !375, file: !374, line: 67, baseType: !357, size: 32, offset: 672)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !375, file: !374, line: 69, baseType: !387, size: 256, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !374, line: 60, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !374, line: 48, size: 256, elements: !389)
!389 = !{!390, !392, !399, !400}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !388, file: !374, line: 49, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !388, file: !374, line: 58, baseType: !393, size: 128, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !394, line: 71, baseType: !395)
!394 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !394, line: 69, size: 128, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !395, file: !394, line: 70, baseType: !391, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !395, file: !394, line: 70, baseType: !391, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !388, file: !374, line: 59, baseType: !357, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !388, file: !374, line: 59, baseType: !357, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !375, file: !374, line: 70, baseType: !357, size: 32, offset: 960)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !375, file: !374, line: 74, baseType: !357, size: 32, offset: 992)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !363, line: 336, baseType: !404, size: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !362, file: !363, line: 337, baseType: !391, size: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !362, file: !363, line: 338, baseType: !391, size: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !362, file: !363, line: 340, baseType: !408, size: 64, offset: 896)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !360, line: 55, size: 192, elements: !410)
!410 = !{!411, !415, !418}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !409, file: !360, line: 58, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !360, line: 56, size: 64, elements: !413)
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !412, file: !360, line: 57, baseType: !391, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !409, file: !360, line: 60, baseType: !416, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !360, line: 41, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !409, file: !360, line: 61, baseType: !391, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !362, file: !363, line: 341, baseType: !420, size: 64, offset: 960)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !363, line: 106, size: 320, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !421, file: !363, line: 107, baseType: !393, size: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !421, file: !363, line: 108, baseType: !357, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !421, file: !363, line: 109, baseType: !357, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !421, file: !363, line: 110, baseType: !357, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !421, file: !363, line: 110, baseType: !357, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !421, file: !363, line: 111, baseType: !429, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !343, line: 490, size: 768, elements: !431)
!431 = !{!432, !433, !434, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !430, file: !343, line: 491, baseType: !429, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !430, file: !343, line: 491, baseType: !429, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !430, file: !343, line: 493, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !363, line: 169, size: 2048, elements: !437)
!437 = !{!438, !439, !440, !441, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1759, !1762, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !436, file: !363, line: 170, baseType: !435, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !436, file: !363, line: 170, baseType: !435, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !436, file: !363, line: 172, baseType: !391, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !436, file: !363, line: 174, baseType: !442, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !444, line: 49, size: 1984, elements: !445)
!444 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!445 = !{!446, !482, !483, !484, !485, !486, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !443, file: !444, line: 50, baseType: !447, size: 960)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !374, line: 130, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !374, line: 117, size: 960, elements: !449)
!449 = !{!450, !451, !452, !454, !473, !477, !478, !479, !480, !481}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !448, file: !374, line: 118, baseType: !391, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !448, file: !374, line: 118, baseType: !391, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !448, file: !374, line: 119, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !448, file: !374, line: 120, baseType: !455, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !374, line: 136, size: 17600, elements: !457)
!457 = !{!458, !459, !461, !464, !468, !469, !470}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !456, file: !374, line: 137, baseType: !447, size: 960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !456, file: !374, line: 138, baseType: !460, size: 64, offset: 960)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !456, file: !374, line: 139, baseType: !462, size: 64, offset: 1024)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !374, line: 43, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !374, line: 140, baseType: !465, size: 8192, offset: 1088)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 8192, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !456, file: !374, line: 141, baseType: !465, size: 8192, offset: 9280)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !456, file: !374, line: 148, baseType: !455, size: 64, offset: 17472)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !456, file: !374, line: 150, baseType: !471, size: 64, offset: 17536)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !374, line: 45, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !448, file: !374, line: 121, baseType: !474, size: 528, offset: 256)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 528, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 66)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !448, file: !374, line: 126, baseType: !383, size: 16, offset: 784)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !448, file: !374, line: 127, baseType: !357, size: 32, offset: 800)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !448, file: !374, line: 128, baseType: !357, size: 32, offset: 832)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !448, file: !374, line: 128, baseType: !357, size: 32, offset: 864)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !448, file: !374, line: 129, baseType: !372, size: 64, offset: 896)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !443, file: !444, line: 52, baseType: !393, size: 128, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !443, file: !444, line: 53, baseType: !393, size: 128, offset: 1088)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !443, file: !444, line: 54, baseType: !393, size: 128, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !443, file: !444, line: 55, baseType: !393, size: 128, offset: 1344)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !443, file: !444, line: 57, baseType: !487, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !489, line: 1216, size: 39680, elements: !490)
!489 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!490 = !{!491, !492, !495, !498, !501, !502, !503, !515, !516, !521, !522, !523, !524, !525, !526, !527, !528, !529, !533, !610, !1047, !1262, !1265, !1554, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1576, !1577, !1578, !1579, !1580, !1588, !1655, !1662, !1663, !1670, !1671, !1677, !1678, !1679, !1680, !1681}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !488, file: !489, line: 1217, baseType: !447, size: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !488, file: !489, line: 1218, baseType: !493, size: 64, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !489, line: 58, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !488, file: !489, line: 1220, baseType: !496, size: 64, offset: 1024)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !489, line: 50, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !488, file: !489, line: 1221, baseType: !499, size: 64, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !489, line: 52, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !488, file: !489, line: 1223, baseType: !487, size: 64, offset: 1152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !488, file: !489, line: 1225, baseType: !393, size: 128, offset: 1216)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !488, file: !489, line: 1226, baseType: !504, size: 64, offset: 1344)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !489, line: 69, size: 320, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !489, line: 70, baseType: !504, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !505, file: !489, line: 70, baseType: !504, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !505, file: !489, line: 71, baseType: !5, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !505, file: !489, line: 71, baseType: !5, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !505, file: !489, line: 72, baseType: !357, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !505, file: !489, line: 73, baseType: !383, size: 16, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !505, file: !489, line: 73, baseType: !383, size: 16, offset: 240)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !505, file: !489, line: 74, baseType: !496, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !488, file: !489, line: 1227, baseType: !496, size: 64, offset: 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !488, file: !489, line: 1229, baseType: !517, size: 96, offset: 1472)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 96, elements: !519)
!518 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!519 = !{!520}
!520 = !DISubrange(count: 3)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !488, file: !489, line: 1230, baseType: !517, size: 96, offset: 1568)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !488, file: !489, line: 1231, baseType: !517, size: 96, offset: 1664)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !488, file: !489, line: 1231, baseType: !517, size: 96, offset: 1760)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !488, file: !489, line: 1233, baseType: !5, size: 32, offset: 1856)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !488, file: !489, line: 1234, baseType: !357, size: 32, offset: 1888)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !488, file: !489, line: 1235, baseType: !5, size: 32, offset: 1920)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !488, file: !489, line: 1237, baseType: !383, size: 16, offset: 1952)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !488, file: !489, line: 1239, baseType: !349, size: 8, offset: 1968)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !488, file: !489, line: 1240, baseType: !530, size: 8, offset: 1976)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 8, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 1)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !488, file: !489, line: 1242, baseType: !534, size: 64, offset: 1984)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !536, line: 328, size: 3456, elements: !537)
!536 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!537 = !{!538, !539, !540, !543, !544, !545, !548, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !575, !576, !577, !580, !585, !586, !589, !593, !598, !602, !606, !607, !608, !609}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !535, file: !536, line: 329, baseType: !447, size: 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !535, file: !536, line: 330, baseType: !493, size: 64, offset: 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !535, file: !536, line: 332, baseType: !541, size: 64, offset: 1024)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !536, line: 332, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !535, file: !536, line: 333, baseType: !368, size: 512, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !535, file: !536, line: 335, baseType: !416, size: 64, offset: 1600)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !535, file: !536, line: 337, baseType: !546, size: 64, offset: 1664)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !489, line: 61, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !535, file: !536, line: 338, baseType: !549, size: 64, offset: 1728)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 64, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 2)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !535, file: !536, line: 340, baseType: !393, size: 128, offset: 1792)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !535, file: !536, line: 340, baseType: !393, size: 128, offset: 1920)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !535, file: !536, line: 342, baseType: !357, size: 32, offset: 2048)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !535, file: !536, line: 342, baseType: !357, size: 32, offset: 2080)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !535, file: !536, line: 343, baseType: !357, size: 32, offset: 2112)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !535, file: !536, line: 345, baseType: !357, size: 32, offset: 2144)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !535, file: !536, line: 346, baseType: !357, size: 32, offset: 2176)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !535, file: !536, line: 347, baseType: !383, size: 16, offset: 2208)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !535, file: !536, line: 348, baseType: !383, size: 16, offset: 2224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !535, file: !536, line: 349, baseType: !357, size: 32, offset: 2240)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !535, file: !536, line: 351, baseType: !357, size: 32, offset: 2272)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !535, file: !536, line: 353, baseType: !383, size: 16, offset: 2304)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !535, file: !536, line: 354, baseType: !383, size: 16, offset: 2320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !535, file: !536, line: 355, baseType: !357, size: 32, offset: 2336)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !535, file: !536, line: 357, baseType: !567, size: 128, offset: 2368)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !568, line: 95, baseType: !569)
!568 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !568, line: 92, size: 128, elements: !570)
!570 = !{!571, !572, !573, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !569, file: !568, line: 93, baseType: !518, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !569, file: !568, line: 93, baseType: !518, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !569, file: !568, line: 94, baseType: !518, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !569, file: !568, line: 94, baseType: !518, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !535, file: !536, line: 363, baseType: !393, size: 128, offset: 2496)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !535, file: !536, line: 363, baseType: !393, size: 128, offset: 2624)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !535, file: !536, line: 368, baseType: !578, size: 64, offset: 2752)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !536, line: 48, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !535, file: !536, line: 372, baseType: !581, size: 32, offset: 2816)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !536, line: 274, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !536, line: 271, size: 32, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !582, file: !536, line: 273, baseType: !5, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !535, file: !536, line: 373, baseType: !357, size: 32, offset: 2848)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !535, file: !536, line: 382, baseType: !587, size: 64, offset: 2880)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !536, line: 46, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !535, file: !536, line: 385, baseType: !590, size: 64, offset: 2944)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !391, !518}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !535, file: !536, line: 386, baseType: !594, size: 64, offset: 3008)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !391, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !535, file: !536, line: 387, baseType: !599, size: 64, offset: 3072)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!357, !391}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !535, file: !536, line: 388, baseType: !603, size: 64, offset: 3136)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !391}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !535, file: !536, line: 389, baseType: !391, size: 64, offset: 3200)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !535, file: !536, line: 389, baseType: !391, size: 64, offset: 3264)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !535, file: !536, line: 389, baseType: !391, size: 64, offset: 3328)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !535, file: !536, line: 389, baseType: !391, size: 64, offset: 3392)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !488, file: !489, line: 1244, baseType: !611, size: 64, offset: 2048)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !613, line: 200, size: 17024, elements: !614)
!613 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!614 = !{!615, !617, !618, !619, !1040, !1041, !1042, !1043, !1044, !1045, !1046}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !612, file: !613, line: 201, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !612, file: !613, line: 202, baseType: !393, size: 128, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !612, file: !613, line: 203, baseType: !393, size: 128, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !612, file: !613, line: 206, baseType: !620, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !613, line: 190, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !613, line: 126, size: 2816, elements: !623)
!623 = !{!624, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !723, !726, !727, !728, !1012, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1039}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !622, file: !613, line: 127, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !622, file: !613, line: 127, baseType: !625, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !622, file: !613, line: 128, baseType: !391, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !622, file: !613, line: 129, baseType: !391, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !622, file: !613, line: 130, baseType: !368, size: 512, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !622, file: !613, line: 132, baseType: !357, size: 32, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !622, file: !613, line: 132, baseType: !357, size: 32, offset: 800)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !622, file: !613, line: 133, baseType: !357, size: 32, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !622, file: !613, line: 134, baseType: !357, size: 32, offset: 864)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !622, file: !613, line: 134, baseType: !357, size: 32, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !622, file: !613, line: 134, baseType: !357, size: 32, offset: 928)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !622, file: !613, line: 135, baseType: !357, size: 32, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !622, file: !613, line: 135, baseType: !357, size: 32, offset: 992)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !622, file: !613, line: 136, baseType: !357, size: 32, offset: 1024)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !622, file: !613, line: 136, baseType: !357, size: 32, offset: 1056)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !622, file: !613, line: 137, baseType: !357, size: 32, offset: 1088)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !622, file: !613, line: 137, baseType: !357, size: 32, offset: 1120)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !622, file: !613, line: 138, baseType: !518, size: 32, offset: 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !622, file: !613, line: 139, baseType: !518, size: 32, offset: 1184)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !622, file: !613, line: 139, baseType: !518, size: 32, offset: 1216)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !622, file: !613, line: 141, baseType: !383, size: 16, offset: 1248)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !622, file: !613, line: 142, baseType: !383, size: 16, offset: 1264)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !622, file: !613, line: 143, baseType: !357, size: 32, offset: 1280)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !622, file: !613, line: 144, baseType: !357, size: 32, offset: 1312)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !622, file: !613, line: 146, baseType: !650, size: 64, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !613, line: 114, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !613, line: 99, size: 7232, elements: !653)
!653 = !{!654, !656, !657, !658, !659, !660, !661, !672, !676, !691, !700, !707, !717}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !613, line: 100, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !652, file: !613, line: 100, baseType: !655, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !652, file: !613, line: 101, baseType: !357, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !652, file: !613, line: 101, baseType: !357, size: 32, offset: 160)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !652, file: !613, line: 102, baseType: !357, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !652, file: !613, line: 102, baseType: !357, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !652, file: !613, line: 103, baseType: !662, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !613, line: 59, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !613, line: 56, size: 2112, elements: !665)
!665 = !{!666, !670, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !613, line: 57, baseType: !667, size: 2048)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 2048, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !664, file: !613, line: 58, baseType: !357, size: 32, offset: 2048)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !664, file: !613, line: 58, baseType: !357, size: 32, offset: 2080)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !652, file: !613, line: 106, baseType: !673, size: 6144, offset: 320)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 6144, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !652, file: !613, line: 107, baseType: !677, size: 64, offset: 6464)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !613, line: 97, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !613, line: 83, size: 8320, elements: !680)
!680 = !{!681, !682, !683, !687, !688, !689, !690}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !679, file: !613, line: 84, baseType: !673, size: 6144)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !679, file: !613, line: 87, baseType: !667, size: 2048, offset: 6144)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !679, file: !613, line: 88, baseType: !684, size: 64, offset: 8192)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !686, line: 41, flags: DIFlagFwdDecl)
!686 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !679, file: !613, line: 90, baseType: !383, size: 16, offset: 8256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !679, file: !613, line: 92, baseType: !383, size: 16, offset: 8272)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !679, file: !613, line: 93, baseType: !383, size: 16, offset: 8288)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !679, file: !613, line: 95, baseType: !383, size: 16, offset: 8304)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !652, file: !613, line: 108, baseType: !692, size: 64, offset: 6528)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !613, line: 66, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !613, line: 61, size: 128, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !694, file: !613, line: 62, baseType: !357, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !694, file: !613, line: 63, baseType: !357, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !694, file: !613, line: 64, baseType: !357, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !694, file: !613, line: 65, baseType: !357, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !652, file: !613, line: 109, baseType: !701, size: 64, offset: 6592)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !613, line: 71, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !613, line: 68, size: 64, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !703, file: !613, line: 69, baseType: !357, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !703, file: !613, line: 70, baseType: !357, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !652, file: !613, line: 110, baseType: !708, size: 64, offset: 6656)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !613, line: 81, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !613, line: 73, size: 352, elements: !711)
!711 = !{!712, !713, !714, !715, !716}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !710, file: !613, line: 74, baseType: !517, size: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !710, file: !613, line: 75, baseType: !517, size: 96, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !710, file: !613, line: 76, baseType: !517, size: 96, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !710, file: !613, line: 77, baseType: !357, size: 32, offset: 288)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !710, file: !613, line: 78, baseType: !357, size: 32, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !652, file: !613, line: 113, baseType: !718, size: 512, offset: 6720)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !719, line: 182, baseType: !720)
!719 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !719, line: 180, size: 512, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !720, file: !719, line: 181, baseType: !368, size: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !622, file: !613, line: 148, baseType: !724, size: 64, offset: 1408)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !613, line: 49, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !622, file: !613, line: 151, baseType: !487, size: 64, offset: 1472)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !622, file: !613, line: 152, baseType: !496, size: 64, offset: 1536)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !622, file: !613, line: 153, baseType: !729, size: 64, offset: 1600)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !731, line: 64, size: 19136, elements: !732)
!731 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!732 = !{!733, !734, !735, !736, !737, !738, !740, !741, !742, !743, !746, !747, !998, !999, !1007, !1008, !1009, !1010, !1011}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !730, file: !731, line: 65, baseType: !447, size: 960)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !730, file: !731, line: 66, baseType: !493, size: 64, offset: 960)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !730, file: !731, line: 68, baseType: !465, size: 8192, offset: 1024)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !730, file: !731, line: 70, baseType: !357, size: 32, offset: 9216)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !730, file: !731, line: 71, baseType: !357, size: 32, offset: 9248)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !730, file: !731, line: 72, baseType: !739, size: 64, offset: 9280)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 64, elements: !550)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !730, file: !731, line: 74, baseType: !518, size: 32, offset: 9344)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !730, file: !731, line: 74, baseType: !518, size: 32, offset: 9376)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !730, file: !731, line: 76, baseType: !684, size: 64, offset: 9408)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !730, file: !731, line: 77, baseType: !744, size: 64, offset: 9472)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !731, line: 77, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !730, file: !731, line: 78, baseType: !546, size: 64, offset: 9536)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !730, file: !731, line: 80, baseType: !748, size: 2624, offset: 9600)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !749, line: 340, size: 2624, elements: !750)
!749 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!750 = !{!751, !779, !797, !798, !799, !817, !875, !876, !978, !979, !980, !981, !987}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !748, file: !749, line: 341, baseType: !752, size: 576)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !749, line: 251, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !749, line: 207, size: 576, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !753, file: !749, line: 208, baseType: !357, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !753, file: !749, line: 211, baseType: !383, size: 16, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !753, file: !749, line: 212, baseType: !383, size: 16, offset: 48)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !753, file: !749, line: 213, baseType: !518, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !753, file: !749, line: 214, baseType: !383, size: 16, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !753, file: !749, line: 215, baseType: !383, size: 16, offset: 112)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !753, file: !749, line: 216, baseType: !383, size: 16, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !753, file: !749, line: 217, baseType: !383, size: 16, offset: 144)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !753, file: !749, line: 218, baseType: !383, size: 16, offset: 160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !753, file: !749, line: 219, baseType: !383, size: 16, offset: 176)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !753, file: !749, line: 220, baseType: !518, size: 32, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !753, file: !749, line: 222, baseType: !383, size: 16, offset: 224)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !753, file: !749, line: 225, baseType: !383, size: 16, offset: 240)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !753, file: !749, line: 228, baseType: !357, size: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !753, file: !749, line: 229, baseType: !357, size: 32, offset: 288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !753, file: !749, line: 233, baseType: !357, size: 32, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !753, file: !749, line: 236, baseType: !383, size: 16, offset: 352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !753, file: !749, line: 236, baseType: !383, size: 16, offset: 368)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !753, file: !749, line: 241, baseType: !518, size: 32, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !753, file: !749, line: 244, baseType: !357, size: 32, offset: 416)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !753, file: !749, line: 244, baseType: !357, size: 32, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !753, file: !749, line: 245, baseType: !518, size: 32, offset: 480)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !753, file: !749, line: 248, baseType: !518, size: 32, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !753, file: !749, line: 250, baseType: !357, size: 32, offset: 544)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !748, file: !749, line: 342, baseType: !780, size: 448, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !749, line: 79, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !749, line: 61, size: 448, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !781, file: !749, line: 62, baseType: !391, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !781, file: !749, line: 64, baseType: !383, size: 16, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !781, file: !749, line: 65, baseType: !383, size: 16, offset: 80)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !781, file: !749, line: 67, baseType: !518, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !781, file: !749, line: 68, baseType: !518, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !781, file: !749, line: 69, baseType: !518, size: 32, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !781, file: !749, line: 70, baseType: !383, size: 16, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !781, file: !749, line: 71, baseType: !383, size: 16, offset: 208)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !781, file: !749, line: 72, baseType: !549, size: 64, offset: 224)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !781, file: !749, line: 75, baseType: !518, size: 32, offset: 288)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !781, file: !749, line: 75, baseType: !518, size: 32, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !781, file: !749, line: 75, baseType: !518, size: 32, offset: 352)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !781, file: !749, line: 78, baseType: !518, size: 32, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !781, file: !749, line: 78, baseType: !518, size: 32, offset: 416)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !748, file: !749, line: 343, baseType: !393, size: 128, offset: 1024)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !748, file: !749, line: 344, baseType: !393, size: 128, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !748, file: !749, line: 345, baseType: !800, size: 192, offset: 1280)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !749, line: 278, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !749, line: 270, size: 192, elements: !802)
!802 = !{!803, !804, !805, !806, !807}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !801, file: !749, line: 271, baseType: !357, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !801, file: !749, line: 273, baseType: !518, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !801, file: !749, line: 275, baseType: !357, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !801, file: !749, line: 276, baseType: !357, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !801, file: !749, line: 277, baseType: !808, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !749, line: 55, size: 576, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !809, file: !749, line: 56, baseType: !357, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !809, file: !749, line: 57, baseType: !518, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !809, file: !749, line: 58, baseType: !814, size: 512, offset: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 512, elements: !815)
!815 = !{!816, !816}
!816 = !DISubrange(count: 4)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !748, file: !749, line: 346, baseType: !818, size: 384, offset: 1472)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !749, line: 268, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !749, line: 253, size: 384, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !869, !870, !871, !872, !873, !874}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !819, file: !749, line: 254, baseType: !357, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !819, file: !749, line: 255, baseType: !357, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !819, file: !749, line: 255, baseType: !357, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !819, file: !749, line: 258, baseType: !518, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !819, file: !749, line: 259, baseType: !826, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !749, line: 164, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !749, line: 108, size: 1664, elements: !829)
!829 = !{!830, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !828, file: !749, line: 109, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !828, file: !749, line: 109, baseType: !831, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !749, line: 111, baseType: !368, size: 512, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !828, file: !749, line: 119, baseType: !549, size: 64, offset: 640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !828, file: !749, line: 119, baseType: !549, size: 64, offset: 704)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !828, file: !749, line: 125, baseType: !549, size: 64, offset: 768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !828, file: !749, line: 125, baseType: !549, size: 64, offset: 832)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !828, file: !749, line: 127, baseType: !549, size: 64, offset: 896)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !828, file: !749, line: 130, baseType: !357, size: 32, offset: 960)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !828, file: !749, line: 131, baseType: !357, size: 32, offset: 992)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !828, file: !749, line: 132, baseType: !842, size: 64, offset: 1024)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !749, line: 106, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !749, line: 81, size: 512, elements: !845)
!845 = !{!846, !847, !850, !851, !852, !853}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !844, file: !749, line: 82, baseType: !549, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !844, file: !749, line: 97, baseType: !848, size: 256, offset: 64)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 256, elements: !849)
!849 = !{!816, !551}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !844, file: !749, line: 102, baseType: !549, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !844, file: !749, line: 102, baseType: !549, size: 64, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !844, file: !749, line: 104, baseType: !357, size: 32, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !844, file: !749, line: 105, baseType: !357, size: 32, offset: 480)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !828, file: !749, line: 135, baseType: !517, size: 96, offset: 1088)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !828, file: !749, line: 136, baseType: !518, size: 32, offset: 1184)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !828, file: !749, line: 139, baseType: !357, size: 32, offset: 1216)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !828, file: !749, line: 139, baseType: !357, size: 32, offset: 1248)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !828, file: !749, line: 139, baseType: !357, size: 32, offset: 1280)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !828, file: !749, line: 140, baseType: !517, size: 96, offset: 1312)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !828, file: !749, line: 143, baseType: !383, size: 16, offset: 1408)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !828, file: !749, line: 144, baseType: !383, size: 16, offset: 1424)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !828, file: !749, line: 145, baseType: !383, size: 16, offset: 1440)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !828, file: !749, line: 148, baseType: !383, size: 16, offset: 1456)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !828, file: !749, line: 149, baseType: !357, size: 32, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !828, file: !749, line: 150, baseType: !518, size: 32, offset: 1504)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !828, file: !749, line: 152, baseType: !546, size: 64, offset: 1536)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !828, file: !749, line: 163, baseType: !518, size: 32, offset: 1600)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !828, file: !749, line: 163, baseType: !518, size: 32, offset: 1632)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !819, file: !749, line: 261, baseType: !518, size: 32, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !819, file: !749, line: 261, baseType: !518, size: 32, offset: 224)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !819, file: !749, line: 261, baseType: !518, size: 32, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !819, file: !749, line: 263, baseType: !357, size: 32, offset: 288)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !819, file: !749, line: 266, baseType: !357, size: 32, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !819, file: !749, line: 267, baseType: !518, size: 32, offset: 352)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !748, file: !749, line: 347, baseType: !826, size: 64, offset: 1856)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !748, file: !749, line: 348, baseType: !877, size: 64, offset: 1920)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !749, line: 205, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !749, line: 186, size: 1024, elements: !880)
!880 = !{!881, !883, !884, !885, !887, !888, !889, !897, !898, !899, !976, !977}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !879, file: !749, line: 187, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !879, file: !749, line: 187, baseType: !882, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !879, file: !749, line: 189, baseType: !368, size: 512, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !879, file: !749, line: 191, baseType: !886, size: 64, offset: 640)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !879, file: !749, line: 193, baseType: !357, size: 32, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !879, file: !749, line: 193, baseType: !357, size: 32, offset: 736)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !879, file: !749, line: 195, baseType: !890, size: 64, offset: 768)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !749, line: 184, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !749, line: 166, size: 320, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !892, file: !749, line: 180, baseType: !848, size: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !892, file: !749, line: 182, baseType: !357, size: 32, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !892, file: !749, line: 183, baseType: !357, size: 32, offset: 288)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !879, file: !749, line: 196, baseType: !357, size: 32, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !879, file: !749, line: 198, baseType: !357, size: 32, offset: 864)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !879, file: !749, line: 200, baseType: !900, size: 64, offset: 896)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !686, line: 77, size: 15424, elements: !902)
!902 = !{!903, !904, !905, !908, !911, !912, !915, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !935, !936, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !962, !963, !964, !965, !966, !970}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !901, file: !686, line: 78, baseType: !447, size: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !901, file: !686, line: 80, baseType: !465, size: 8192, offset: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !901, file: !686, line: 82, baseType: !906, size: 64, offset: 9152)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !686, line: 43, flags: DIFlagFwdDecl)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !901, file: !686, line: 83, baseType: !909, size: 64, offset: 9216)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !374, line: 46, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !901, file: !686, line: 86, baseType: !684, size: 64, offset: 9280)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !901, file: !686, line: 87, baseType: !913, size: 64, offset: 9344)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !686, line: 44, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !901, file: !686, line: 89, baseType: !916, size: 512, offset: 9408)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 512, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 8)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !901, file: !686, line: 90, baseType: !383, size: 16, offset: 9920)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !901, file: !686, line: 90, baseType: !383, size: 16, offset: 9936)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !901, file: !686, line: 92, baseType: !383, size: 16, offset: 9952)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !901, file: !686, line: 92, baseType: !383, size: 16, offset: 9968)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !901, file: !686, line: 93, baseType: !383, size: 16, offset: 9984)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !901, file: !686, line: 93, baseType: !383, size: 16, offset: 10000)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !901, file: !686, line: 94, baseType: !357, size: 32, offset: 10016)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !901, file: !686, line: 97, baseType: !383, size: 16, offset: 10048)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !901, file: !686, line: 97, baseType: !383, size: 16, offset: 10064)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !901, file: !686, line: 98, baseType: !383, size: 16, offset: 10080)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !901, file: !686, line: 98, baseType: !383, size: 16, offset: 10096)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !901, file: !686, line: 99, baseType: !383, size: 16, offset: 10112)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !901, file: !686, line: 99, baseType: !383, size: 16, offset: 10128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !901, file: !686, line: 100, baseType: !5, size: 32, offset: 10144)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !901, file: !686, line: 101, baseType: !934, size: 64, offset: 10176)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !901, file: !686, line: 103, baseType: !471, size: 64, offset: 10240)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !901, file: !686, line: 104, baseType: !937, size: 64, offset: 10304)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !374, line: 159, size: 448, elements: !939)
!939 = !{!940, !942, !943, !945, !946, !948}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !938, file: !374, line: 161, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !550)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !938, file: !374, line: 162, baseType: !941, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !938, file: !374, line: 163, baseType: !944, size: 32, offset: 128)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 32, elements: !550)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !938, file: !374, line: 164, baseType: !944, size: 32, offset: 160)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !938, file: !374, line: 165, baseType: !947, size: 128, offset: 192)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 128, elements: !550)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !938, file: !374, line: 166, baseType: !949, size: 128, offset: 320)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 128, elements: !550)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !901, file: !686, line: 107, baseType: !518, size: 32, offset: 10368)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !901, file: !686, line: 108, baseType: !357, size: 32, offset: 10400)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !901, file: !686, line: 109, baseType: !383, size: 16, offset: 10432)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !901, file: !686, line: 110, baseType: !383, size: 16, offset: 10448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !901, file: !686, line: 113, baseType: !357, size: 32, offset: 10464)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !901, file: !686, line: 113, baseType: !357, size: 32, offset: 10496)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !901, file: !686, line: 114, baseType: !349, size: 8, offset: 10528)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !901, file: !686, line: 114, baseType: !349, size: 8, offset: 10536)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !901, file: !686, line: 115, baseType: !383, size: 16, offset: 10544)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !901, file: !686, line: 116, baseType: !960, size: 128, offset: 10560)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 128, elements: !961)
!961 = !{!816}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !901, file: !686, line: 119, baseType: !518, size: 32, offset: 10688)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !901, file: !686, line: 119, baseType: !518, size: 32, offset: 10720)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !901, file: !686, line: 122, baseType: !718, size: 512, offset: 10752)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !901, file: !686, line: 123, baseType: !349, size: 8, offset: 11264)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !901, file: !686, line: 125, baseType: !967, size: 56, offset: 11272)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 56, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 7)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !901, file: !686, line: 126, baseType: !971, size: 4096, offset: 11328)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 4096, elements: !917)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !686, line: 69, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !686, line: 67, size: 512, elements: !974)
!974 = !{!975}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !973, file: !686, line: 68, baseType: !368, size: 512)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !879, file: !749, line: 201, baseType: !518, size: 32, offset: 960)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !879, file: !749, line: 204, baseType: !357, size: 32, offset: 992)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !748, file: !749, line: 350, baseType: !393, size: 128, offset: 1984)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !748, file: !749, line: 351, baseType: !357, size: 32, offset: 2112)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !748, file: !749, line: 351, baseType: !357, size: 32, offset: 2144)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !748, file: !749, line: 353, baseType: !982, size: 64, offset: 2176)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !749, line: 297, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !749, line: 295, size: 2048, elements: !985)
!985 = !{!986}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !984, file: !749, line: 296, baseType: !667, size: 2048)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !748, file: !749, line: 355, baseType: !988, size: 384, offset: 2240)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !749, line: 338, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !749, line: 322, size: 384, elements: !990)
!990 = !{!991, !992, !993, !994, !995, !996, !997}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !989, file: !749, line: 323, baseType: !357, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !989, file: !749, line: 325, baseType: !383, size: 16, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !989, file: !749, line: 326, baseType: !383, size: 16, offset: 48)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !989, file: !749, line: 331, baseType: !393, size: 128, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !989, file: !749, line: 334, baseType: !393, size: 128, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !989, file: !749, line: 335, baseType: !357, size: 32, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !989, file: !749, line: 337, baseType: !357, size: 32, offset: 352)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !730, file: !731, line: 81, baseType: !391, size: 64, offset: 12224)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !730, file: !731, line: 85, baseType: !1000, size: 6208, offset: 12288)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !731, line: 55, size: 6208, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1000, file: !731, line: 56, baseType: !673, size: 6144)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1000, file: !731, line: 58, baseType: !383, size: 16, offset: 6144)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1000, file: !731, line: 59, baseType: !383, size: 16, offset: 6160)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1000, file: !731, line: 60, baseType: !383, size: 16, offset: 6176)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1000, file: !731, line: 61, baseType: !383, size: 16, offset: 6192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !730, file: !731, line: 86, baseType: !357, size: 32, offset: 18496)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !730, file: !731, line: 88, baseType: !357, size: 32, offset: 18528)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !730, file: !731, line: 90, baseType: !357, size: 32, offset: 18560)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !730, file: !731, line: 94, baseType: !357, size: 32, offset: 18592)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !730, file: !731, line: 100, baseType: !718, size: 512, offset: 18624)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !622, file: !613, line: 154, baseType: !1013, size: 64, offset: 1664)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !613, line: 154, flags: DIFlagFwdDecl)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !622, file: !613, line: 156, baseType: !684, size: 64, offset: 1728)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !622, file: !613, line: 158, baseType: !518, size: 32, offset: 1792)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !622, file: !613, line: 159, baseType: !518, size: 32, offset: 1824)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !622, file: !613, line: 162, baseType: !625, size: 64, offset: 1856)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !622, file: !613, line: 162, baseType: !625, size: 64, offset: 1920)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !622, file: !613, line: 162, baseType: !625, size: 64, offset: 1984)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !622, file: !613, line: 164, baseType: !393, size: 128, offset: 2048)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !622, file: !613, line: 166, baseType: !1023, size: 64, offset: 2176)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !613, line: 51, flags: DIFlagFwdDecl)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !622, file: !613, line: 167, baseType: !391, size: 64, offset: 2240)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !622, file: !613, line: 168, baseType: !518, size: 32, offset: 2304)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !622, file: !613, line: 170, baseType: !518, size: 32, offset: 2336)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !622, file: !613, line: 170, baseType: !518, size: 32, offset: 2368)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !622, file: !613, line: 171, baseType: !518, size: 32, offset: 2400)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !622, file: !613, line: 173, baseType: !391, size: 64, offset: 2432)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !622, file: !613, line: 175, baseType: !357, size: 32, offset: 2496)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !622, file: !613, line: 176, baseType: !357, size: 32, offset: 2528)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !622, file: !613, line: 179, baseType: !357, size: 32, offset: 2560)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !622, file: !613, line: 180, baseType: !518, size: 32, offset: 2592)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !622, file: !613, line: 183, baseType: !357, size: 32, offset: 2624)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !622, file: !613, line: 185, baseType: !349, size: 8, offset: 2656)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !622, file: !613, line: 186, baseType: !1038, size: 24, offset: 2664)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 24, elements: !519)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !622, file: !613, line: 189, baseType: !393, size: 128, offset: 2688)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !612, file: !613, line: 207, baseType: !465, size: 8192, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !612, file: !613, line: 208, baseType: !465, size: 8192, offset: 8576)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !612, file: !613, line: 210, baseType: !357, size: 32, offset: 16768)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !612, file: !613, line: 210, baseType: !357, size: 32, offset: 16800)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !612, file: !613, line: 211, baseType: !357, size: 32, offset: 16832)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !612, file: !613, line: 211, baseType: !357, size: 32, offset: 16864)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !612, file: !613, line: 212, baseType: !567, size: 128, offset: 16896)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !488, file: !489, line: 1246, baseType: !1048, size: 64, offset: 2112)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !489, line: 1067, size: 5184, elements: !1050)
!1050 = !{!1051, !1081, !1082, !1097, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1119, !1135, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1245}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1049, file: !489, line: 1068, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !489, line: 934, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !489, line: 925, size: 576, elements: !1055)
!1055 = !{!1056, !1073, !1074, !1075, !1076, !1077, !1080}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1054, file: !489, line: 926, baseType: !1057, size: 320)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !489, line: 830, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !489, line: 813, size: 320, elements: !1059)
!1059 = !{!1060, !1063, !1066, !1067, !1070, !1071, !1072}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1058, file: !489, line: 814, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !489, line: 51, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1058, file: !489, line: 815, baseType: !1064, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !489, line: 815, flags: DIFlagFwdDecl)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1058, file: !489, line: 818, baseType: !391, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1058, file: !489, line: 819, baseType: !1068, size: 32, offset: 192)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 32, elements: !961)
!1069 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1058, file: !489, line: 822, baseType: !357, size: 32, offset: 224)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1058, file: !489, line: 826, baseType: !357, size: 32, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1058, file: !489, line: 829, baseType: !357, size: 32, offset: 288)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1054, file: !489, line: 928, baseType: !383, size: 16, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1054, file: !489, line: 928, baseType: !383, size: 16, offset: 336)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1054, file: !489, line: 929, baseType: !357, size: 32, offset: 352)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1054, file: !489, line: 930, baseType: !934, size: 64, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1054, file: !489, line: 931, baseType: !1078, size: 64, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !489, line: 931, flags: DIFlagFwdDecl)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1054, file: !489, line: 933, baseType: !391, size: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1049, file: !489, line: 1069, baseType: !1052, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1049, file: !489, line: 1070, baseType: !1083, size: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !489, line: 916, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !489, line: 891, size: 704, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1091, !1092, !1093, !1094, !1095, !1096}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1085, file: !489, line: 892, baseType: !1057, size: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1085, file: !489, line: 896, baseType: !357, size: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1085, file: !489, line: 900, baseType: !1090, size: 96, offset: 352)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 96, elements: !519)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1085, file: !489, line: 903, baseType: !518, size: 32, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1085, file: !489, line: 906, baseType: !357, size: 32, offset: 480)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1085, file: !489, line: 909, baseType: !518, size: 32, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1085, file: !489, line: 912, baseType: !518, size: 32, offset: 544)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1085, file: !489, line: 914, baseType: !496, size: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1085, file: !489, line: 915, baseType: !391, size: 64, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1049, file: !489, line: 1071, baseType: !1098, size: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !489, line: 920, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !489, line: 918, size: 320, elements: !1101)
!1101 = !{!1102}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1100, file: !489, line: 919, baseType: !1057, size: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1049, file: !489, line: 1075, baseType: !518, size: 32, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1049, file: !489, line: 1077, baseType: !518, size: 32, offset: 288)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1049, file: !489, line: 1078, baseType: !518, size: 32, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1049, file: !489, line: 1079, baseType: !383, size: 16, offset: 352)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1049, file: !489, line: 1082, baseType: !383, size: 16, offset: 368)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1049, file: !489, line: 1085, baseType: !349, size: 8, offset: 384)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1049, file: !489, line: 1086, baseType: !349, size: 8, offset: 392)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1049, file: !489, line: 1087, baseType: !349, size: 8, offset: 400)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !1049, file: !489, line: 1088, baseType: !349, size: 8, offset: 408)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !1049, file: !489, line: 1090, baseType: !518, size: 32, offset: 416)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !1049, file: !489, line: 1093, baseType: !383, size: 16, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !1049, file: !489, line: 1096, baseType: !349, size: 8, offset: 464)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1049, file: !489, line: 1098, baseType: !1116, size: 40, offset: 472)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 40, elements: !1117)
!1117 = !{!1118}
!1118 = !DISubrange(count: 5)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !1049, file: !489, line: 1101, baseType: !1120, size: 832, offset: 512)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !489, line: 836, size: 832, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1120, file: !489, line: 837, baseType: !1057, size: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1120, file: !489, line: 839, baseType: !383, size: 16, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1120, file: !489, line: 839, baseType: !383, size: 16, offset: 336)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1120, file: !489, line: 842, baseType: !383, size: 16, offset: 352)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1120, file: !489, line: 842, baseType: !383, size: 16, offset: 368)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1120, file: !489, line: 843, baseType: !944, size: 32, offset: 384)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1120, file: !489, line: 845, baseType: !357, size: 32, offset: 416)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1120, file: !489, line: 847, baseType: !391, size: 64, offset: 448)
