; ModuleID = 'blender/source/blender/editors/physics/rigidbody_object.c'
source_filename = "blender/source/blender/editors/physics/rigidbody_object.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.rbMaterialDensityItem = type { i8*, float }
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }

!45 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRigidBodyOb_Type", file: !33, line: 130, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "RBO_TYPE_ACTIVE", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "RBO_TYPE_PASSIVE", value: 1, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRigidBody_Shape", file: !33, line: 158, baseType: !7, size: 32, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !60, !61}
!55 = !DIEnumerator(name: "RB_SHAPE_BOX", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "RB_SHAPE_SPHERE", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "RB_SHAPE_CAPSULE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "RB_SHAPE_CYLINDER", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "RB_SHAPE_CONE", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "RB_SHAPE_CONVEXH", value: 5, isUnsigned: true)
!61 = !DIEnumerator(name: "RB_SHAPE_TRIMESH", value: 6, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyFlag", file: !63, line: 151, baseType: !7, size: 32, elements: !64)
!63 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!65 = !DIEnumerator(name: "PROP_EDITABLE", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "PROP_LIB_EXCEPTION", value: 65536, isUnsigned: true)
!67 = !DIEnumerator(name: "PROP_ANIMATABLE", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "PROP_ICONS_CONSECUTIVE", value: 4096, isUnsigned: true)
!69 = !DIEnumerator(name: "PROP_HIDDEN", value: 524288, isUnsigned: true)
!70 = !DIEnumerator(name: "PROP_SKIP_SAVE", value: 268435456, isUnsigned: true)
!71 = !DIEnumerator(name: "PROP_REQUIRED", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "PROP_OUTPUT", value: 8, isUnsigned: true)
!73 = !DIEnumerator(name: "PROP_RNAPTR", value: 2048, isUnsigned: true)
!74 = !DIEnumerator(name: "PROP_PYFUNC_OPTIONAL", value: 1073741824, isUnsigned: true)
!75 = !DIEnumerator(name: "PROP_REGISTER", value: 16, isUnsigned: true)
!76 = !DIEnumerator(name: "PROP_REGISTER_OPTIONAL", value: 48, isUnsigned: true)
!77 = !DIEnumerator(name: "PROP_PROPORTIONAL", value: 67108864, isUnsigned: true)
!78 = !DIEnumerator(name: "PROP_ID_REFCOUNT", value: 64, isUnsigned: true)
!79 = !DIEnumerator(name: "PROP_ID_SELF_CHECK", value: 1048576, isUnsigned: true)
!80 = !DIEnumerator(name: "PROP_NEVER_NULL", value: 262144, isUnsigned: true)
!81 = !DIEnumerator(name: "PROP_NEVER_UNLINK", value: 33554432, isUnsigned: true)
!82 = !DIEnumerator(name: "PROP_ENUM_FLAG", value: 2097152, isUnsigned: true)
!83 = !DIEnumerator(name: "PROP_CONTEXT_UPDATE", value: 4194304, isUnsigned: true)
!84 = !DIEnumerator(name: "PROP_CONTEXT_PROPERTY_UPDATE", value: 138412032, isUnsigned: true)
!85 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!86 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!87 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!88 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!89 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!90 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!91 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!92 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!93 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!94 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!95 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 351, baseType: !7, size: 32, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !103}
!98 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!102 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!103 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!106 = !{!107, !0}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression(DW_OP_constu, 46, DW_OP_stack_value))
!108 = distinct !DIGlobalVariable(name: "NUM_RB_MATERIAL_PRESETS", scope: !2, file: !3, line: 448, type: !109, isLocal: true, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 5888, elements: !121)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbMaterialDensityItem", file: !3, line: 390, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbMaterialDensityItem", file: !3, line: 387, size: 128, elements: !114)
!114 = !{!115, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !3, line: 388, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !113, file: !3, line: 389, baseType: !120, size: 32, offset: 64)
!120 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!121 = !{!122}
!122 = !DISubrange(count: 46)
!123 = !{i32 7, !"Dwarf Version", i32 4}
!124 = !{i32 2, !"Debug Info Version", i32 3}
!125 = !{i32 1, !"wchar_size", i32 4}
!126 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!127 = distinct !DISubprogram(name: "ED_rigidbody_object_add", scope: !3, file: !3, line: 95, type: !128, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1887)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !131, !1742, !110, !1744}
!130 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !133, line: 1299, baseType: !134)
!133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !133, line: 1216, size: 39680, elements: !135)
!135 = !{!136, !205, !209, !557, !560, !561, !562, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !588, !662, !1090, !1305, !1308, !1597, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1619, !1620, !1621, !1622, !1623, !1631, !1698, !1705, !1706, !1713, !1714, !1715, !1716, !1717, !1718, !1719}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !134, file: !133, line: 1217, baseType: !137, size: 960)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !138, line: 130, baseType: !139)
!138 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !138, line: 117, size: 960, elements: !140)
!140 = !{!141, !142, !143, !145, !164, !168, !170, !171, !172, !173}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !139, file: !138, line: 118, baseType: !105, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !139, file: !138, line: 118, baseType: !105, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !139, file: !138, line: 119, baseType: !144, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !139, file: !138, line: 120, baseType: !146, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !138, line: 136, size: 17600, elements: !148)
!148 = !{!149, !150, !152, !155, !159, !160, !161}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !147, file: !138, line: 137, baseType: !137, size: 960)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !147, file: !138, line: 138, baseType: !151, size: 64, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !147, file: !138, line: 139, baseType: !153, size: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !138, line: 43, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !138, line: 140, baseType: !156, size: 8192, offset: 1088)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 8192, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !147, file: !138, line: 141, baseType: !156, size: 8192, offset: 9280)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !147, file: !138, line: 148, baseType: !146, size: 64, offset: 17472)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !147, file: !138, line: 150, baseType: !162, size: 64, offset: 17536)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !138, line: 45, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !138, line: 121, baseType: !165, size: 528, offset: 256)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 528, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 66)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !139, file: !138, line: 126, baseType: !169, size: 16, offset: 784)
!169 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !139, file: !138, line: 127, baseType: !110, size: 32, offset: 800)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !139, file: !138, line: 128, baseType: !110, size: 32, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !139, file: !138, line: 128, baseType: !110, size: 32, offset: 864)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !139, file: !138, line: 129, baseType: !174, size: 64, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !138, line: 75, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !138, line: 62, size: 1024, elements: !177)
!177 = !{!178, !180, !181, !182, !183, !184, !188, !189, !203, !204}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !138, line: 63, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !176, file: !138, line: 63, baseType: !179, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !138, line: 64, baseType: !118, size: 8, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !176, file: !138, line: 64, baseType: !118, size: 8, offset: 136)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !176, file: !138, line: 65, baseType: !169, size: 16, offset: 144)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !176, file: !138, line: 66, baseType: !185, size: 512, offset: 160)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 512, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !176, file: !138, line: 67, baseType: !110, size: 32, offset: 672)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !176, file: !138, line: 69, baseType: !190, size: 256, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !138, line: 60, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !138, line: 48, size: 256, elements: !192)
!192 = !{!193, !194, !201, !202}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !191, file: !138, line: 49, baseType: !105, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !191, file: !138, line: 58, baseType: !195, size: 128, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !196, line: 71, baseType: !197)
!196 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !196, line: 69, size: 128, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !197, file: !196, line: 70, baseType: !105, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !197, file: !196, line: 70, baseType: !105, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !191, file: !138, line: 59, baseType: !110, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !191, file: !138, line: 59, baseType: !110, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !176, file: !138, line: 70, baseType: !110, size: 32, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !176, file: !138, line: 74, baseType: !110, size: 32, offset: 992)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !134, file: !133, line: 1218, baseType: !206, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !208, line: 45, flags: DIFlagFwdDecl)
!208 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!209 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !134, file: !133, line: 1220, baseType: !210, size: 64, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 115, size: 11392, elements: !212)
!212 = !{!213, !214, !215, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !232, !243, !257, !258, !301, !302, !305, !306, !322, !323, !324, !325, !326, !327, !328, !332, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !348, !349, !350, !351, !352, !353, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !413, !414, !415, !416, !417, !418, !419, !420, !421, !424, !427, !436, !437, !438, !439, !440, !443, !446, !449, !450, !456, !457, !458, !459, !460, !461, !463, !486, !520, !524, !545, !546}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !211, file: !6, line: 116, baseType: !137, size: 960)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !211, file: !6, line: 117, baseType: !206, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !211, file: !6, line: 119, baseType: !216, size: 64, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !6, line: 57, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !211, file: !6, line: 121, baseType: !169, size: 16, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !211, file: !6, line: 121, baseType: !169, size: 16, offset: 1104)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !211, file: !6, line: 122, baseType: !110, size: 32, offset: 1120)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !211, file: !6, line: 122, baseType: !110, size: 32, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !211, file: !6, line: 122, baseType: !110, size: 32, offset: 1184)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !211, file: !6, line: 123, baseType: !185, size: 512, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !211, file: !6, line: 124, baseType: !210, size: 64, offset: 1728)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !211, file: !6, line: 124, baseType: !210, size: 64, offset: 1792)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !211, file: !6, line: 127, baseType: !210, size: 64, offset: 1856)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !211, file: !6, line: 127, baseType: !210, size: 64, offset: 1920)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !211, file: !6, line: 127, baseType: !210, size: 64, offset: 1984)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !211, file: !6, line: 128, baseType: !230, size: 64, offset: 2048)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !208, line: 46, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !211, file: !6, line: 130, baseType: !233, size: 64, offset: 2112)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !6, line: 97, size: 832, elements: !235)
!235 = !{!236, !241, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !234, file: !6, line: 98, baseType: !237, size: 768)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 768, elements: !238)
!238 = !{!239, !240}
!239 = !DISubrange(count: 8)
!240 = !DISubrange(count: 3)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !6, line: 99, baseType: !110, size: 32, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !234, file: !6, line: 99, baseType: !110, size: 32, offset: 800)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !211, file: !6, line: 131, baseType: !244, size: 64, offset: 2176)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !246, line: 486, size: 1600, elements: !247)
!246 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !245, file: !246, line: 487, baseType: !137, size: 960)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !245, file: !246, line: 489, baseType: !195, size: 128, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !245, file: !246, line: 490, baseType: !195, size: 128, offset: 1088)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !245, file: !246, line: 491, baseType: !195, size: 128, offset: 1216)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !245, file: !246, line: 492, baseType: !195, size: 128, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !245, file: !246, line: 494, baseType: !110, size: 32, offset: 1472)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !245, file: !246, line: 495, baseType: !110, size: 32, offset: 1504)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !245, file: !246, line: 497, baseType: !110, size: 32, offset: 1536)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !245, file: !246, line: 498, baseType: !110, size: 32, offset: 1568)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !211, file: !6, line: 132, baseType: !244, size: 64, offset: 2240)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !211, file: !6, line: 133, baseType: !259, size: 64, offset: 2304)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !246, line: 334, size: 1728, elements: !261)
!261 = !{!262, !263, !266, !267, !268, !269, !270, !271, !274, !275, !276, !277, !278, !279, !280, !300}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !260, file: !246, line: 335, baseType: !195, size: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !260, file: !246, line: 336, baseType: !264, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !246, line: 47, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !246, line: 338, baseType: !169, size: 16, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !260, file: !246, line: 338, baseType: !169, size: 16, offset: 208)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !260, file: !246, line: 339, baseType: !7, size: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !260, file: !246, line: 340, baseType: !110, size: 32, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !260, file: !246, line: 342, baseType: !120, size: 32, offset: 288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !260, file: !246, line: 343, baseType: !272, size: 96, offset: 320)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !273)
!273 = !{!240}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !260, file: !246, line: 344, baseType: !272, size: 96, offset: 416)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !260, file: !246, line: 347, baseType: !195, size: 128, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !260, file: !246, line: 349, baseType: !110, size: 32, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !260, file: !246, line: 350, baseType: !110, size: 32, offset: 672)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !260, file: !246, line: 351, baseType: !105, size: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !260, file: !246, line: 352, baseType: !105, size: 64, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !260, file: !246, line: 354, baseType: !281, size: 384, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !246, line: 116, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !246, line: 94, size: 384, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !282, file: !246, line: 96, baseType: !110, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !282, file: !246, line: 96, baseType: !110, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !282, file: !246, line: 97, baseType: !110, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !282, file: !246, line: 97, baseType: !110, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !282, file: !246, line: 99, baseType: !169, size: 16, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !282, file: !246, line: 100, baseType: !169, size: 16, offset: 144)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !282, file: !246, line: 102, baseType: !169, size: 16, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !282, file: !246, line: 105, baseType: !169, size: 16, offset: 176)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !282, file: !246, line: 108, baseType: !169, size: 16, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !282, file: !246, line: 109, baseType: !169, size: 16, offset: 208)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !282, file: !246, line: 111, baseType: !169, size: 16, offset: 224)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !282, file: !246, line: 112, baseType: !169, size: 16, offset: 240)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !282, file: !246, line: 114, baseType: !110, size: 32, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !282, file: !246, line: 114, baseType: !110, size: 32, offset: 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !282, file: !246, line: 115, baseType: !110, size: 32, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !282, file: !246, line: 115, baseType: !110, size: 32, offset: 352)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !260, file: !246, line: 355, baseType: !185, size: 512, offset: 1216)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !6, line: 134, baseType: !105, size: 64, offset: 2368)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !211, file: !6, line: 136, baseType: !303, size: 64, offset: 2432)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !6, line: 58, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !211, file: !6, line: 138, baseType: !281, size: 384, offset: 2496)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !211, file: !6, line: 139, baseType: !307, size: 64, offset: 2880)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !246, line: 80, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !246, line: 72, size: 192, elements: !310)
!310 = !{!311, !318, !319, !320, !321}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !309, file: !246, line: 73, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !246, line: 59, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !246, line: 56, size: 128, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !314, file: !246, line: 57, baseType: !272, size: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !314, file: !246, line: 58, baseType: !110, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !309, file: !246, line: 74, baseType: !110, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !309, file: !246, line: 76, baseType: !110, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !309, file: !246, line: 77, baseType: !110, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !309, file: !246, line: 79, baseType: !110, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !211, file: !6, line: 141, baseType: !195, size: 128, offset: 2944)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !211, file: !6, line: 142, baseType: !195, size: 128, offset: 3072)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !211, file: !6, line: 143, baseType: !195, size: 128, offset: 3200)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !211, file: !6, line: 144, baseType: !195, size: 128, offset: 3328)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !211, file: !6, line: 146, baseType: !110, size: 32, offset: 3456)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !211, file: !6, line: 147, baseType: !110, size: 32, offset: 3488)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !211, file: !6, line: 150, baseType: !329, size: 64, offset: 3520)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !6, line: 50, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !211, file: !6, line: 151, baseType: !333, size: 64, offset: 3584)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !211, file: !6, line: 152, baseType: !110, size: 32, offset: 3648)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !211, file: !6, line: 153, baseType: !110, size: 32, offset: 3680)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !211, file: !6, line: 156, baseType: !272, size: 96, offset: 3712)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !211, file: !6, line: 156, baseType: !272, size: 96, offset: 3808)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !211, file: !6, line: 156, baseType: !272, size: 96, offset: 3904)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !211, file: !6, line: 157, baseType: !272, size: 96, offset: 4000)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !211, file: !6, line: 158, baseType: !272, size: 96, offset: 4096)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !211, file: !6, line: 159, baseType: !272, size: 96, offset: 4192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !211, file: !6, line: 160, baseType: !272, size: 96, offset: 4288)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !211, file: !6, line: 160, baseType: !272, size: 96, offset: 4384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !211, file: !6, line: 161, baseType: !345, size: 128, offset: 4480)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 4)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !211, file: !6, line: 161, baseType: !345, size: 128, offset: 4608)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !211, file: !6, line: 162, baseType: !272, size: 96, offset: 4736)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !211, file: !6, line: 162, baseType: !272, size: 96, offset: 4832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !211, file: !6, line: 163, baseType: !120, size: 32, offset: 4928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !211, file: !6, line: 163, baseType: !120, size: 32, offset: 4960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !211, file: !6, line: 164, baseType: !354, size: 512, offset: 4992)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 512, elements: !355)
!355 = !{!347, !347}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !211, file: !6, line: 165, baseType: !354, size: 512, offset: 5504)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !211, file: !6, line: 166, baseType: !354, size: 512, offset: 6016)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !211, file: !6, line: 167, baseType: !354, size: 512, offset: 6528)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !211, file: !6, line: 176, baseType: !354, size: 512, offset: 7040)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !211, file: !6, line: 178, baseType: !7, size: 32, offset: 7552)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !211, file: !6, line: 180, baseType: !169, size: 16, offset: 7584)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !211, file: !6, line: 181, baseType: !169, size: 16, offset: 7600)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !211, file: !6, line: 183, baseType: !169, size: 16, offset: 7616)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !211, file: !6, line: 183, baseType: !169, size: 16, offset: 7632)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !211, file: !6, line: 184, baseType: !169, size: 16, offset: 7648)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !211, file: !6, line: 184, baseType: !169, size: 16, offset: 7664)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !211, file: !6, line: 185, baseType: !169, size: 16, offset: 7680)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !211, file: !6, line: 186, baseType: !169, size: 16, offset: 7696)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !211, file: !6, line: 187, baseType: !169, size: 16, offset: 7712)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !211, file: !6, line: 188, baseType: !118, size: 8, offset: 7728)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !211, file: !6, line: 189, baseType: !118, size: 8, offset: 7736)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !211, file: !6, line: 192, baseType: !110, size: 32, offset: 7744)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !211, file: !6, line: 192, baseType: !110, size: 32, offset: 7776)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !211, file: !6, line: 192, baseType: !110, size: 32, offset: 7808)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !211, file: !6, line: 192, baseType: !110, size: 32, offset: 7840)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !211, file: !6, line: 194, baseType: !110, size: 32, offset: 7872)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !211, file: !6, line: 202, baseType: !120, size: 32, offset: 7904)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !211, file: !6, line: 202, baseType: !120, size: 32, offset: 7936)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !211, file: !6, line: 202, baseType: !120, size: 32, offset: 7968)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !211, file: !6, line: 211, baseType: !120, size: 32, offset: 8000)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !211, file: !6, line: 212, baseType: !120, size: 32, offset: 8032)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !211, file: !6, line: 213, baseType: !120, size: 32, offset: 8064)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !211, file: !6, line: 214, baseType: !120, size: 32, offset: 8096)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !211, file: !6, line: 215, baseType: !120, size: 32, offset: 8128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !211, file: !6, line: 216, baseType: !120, size: 32, offset: 8160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !211, file: !6, line: 219, baseType: !120, size: 32, offset: 8192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !211, file: !6, line: 220, baseType: !120, size: 32, offset: 8224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !211, file: !6, line: 221, baseType: !120, size: 32, offset: 8256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !211, file: !6, line: 224, baseType: !390, size: 16, offset: 8288)
!390 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !211, file: !6, line: 224, baseType: !390, size: 16, offset: 8304)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !211, file: !6, line: 226, baseType: !169, size: 16, offset: 8320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !211, file: !6, line: 228, baseType: !118, size: 8, offset: 8336)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !211, file: !6, line: 229, baseType: !118, size: 8, offset: 8344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !211, file: !6, line: 231, baseType: !169, size: 16, offset: 8352)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !211, file: !6, line: 232, baseType: !118, size: 8, offset: 8368)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !211, file: !6, line: 233, baseType: !118, size: 8, offset: 8376)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !211, file: !6, line: 234, baseType: !120, size: 32, offset: 8384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !211, file: !6, line: 235, baseType: !120, size: 32, offset: 8416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !211, file: !6, line: 237, baseType: !195, size: 128, offset: 8448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !211, file: !6, line: 238, baseType: !195, size: 128, offset: 8576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !211, file: !6, line: 239, baseType: !195, size: 128, offset: 8704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !211, file: !6, line: 240, baseType: !195, size: 128, offset: 8832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !211, file: !6, line: 242, baseType: !120, size: 32, offset: 8960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !211, file: !6, line: 244, baseType: !169, size: 16, offset: 8992)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !211, file: !6, line: 245, baseType: !390, size: 16, offset: 9008)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !211, file: !6, line: 246, baseType: !345, size: 128, offset: 9024)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !211, file: !6, line: 248, baseType: !110, size: 32, offset: 9152)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !211, file: !6, line: 249, baseType: !110, size: 32, offset: 9184)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !211, file: !6, line: 251, baseType: !411, size: 64, offset: 9216)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !6, line: 251, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !211, file: !6, line: 253, baseType: !118, size: 8, offset: 9280)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !211, file: !6, line: 254, baseType: !118, size: 8, offset: 9288)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !211, file: !6, line: 255, baseType: !169, size: 16, offset: 9296)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !211, file: !6, line: 256, baseType: !272, size: 96, offset: 9312)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !211, file: !6, line: 258, baseType: !195, size: 128, offset: 9408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !211, file: !6, line: 259, baseType: !195, size: 128, offset: 9536)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !211, file: !6, line: 260, baseType: !195, size: 128, offset: 9664)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !211, file: !6, line: 261, baseType: !195, size: 128, offset: 9792)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !211, file: !6, line: 263, baseType: !422, size: 64, offset: 9920)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !6, line: 52, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !211, file: !6, line: 264, baseType: !425, size: 64, offset: 9984)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !6, line: 53, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !211, file: !6, line: 265, baseType: !428, size: 64, offset: 10048)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !430, line: 51, size: 1216, elements: !431)
!430 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!431 = !{!432, !433, !434, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !429, file: !430, line: 52, baseType: !137, size: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !429, file: !430, line: 54, baseType: !195, size: 128, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !429, file: !430, line: 59, baseType: !7, size: 32, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !429, file: !430, line: 60, baseType: !272, size: 96, offset: 1120)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !211, file: !6, line: 267, baseType: !118, size: 8, offset: 10112)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !211, file: !6, line: 268, baseType: !118, size: 8, offset: 10120)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !211, file: !6, line: 269, baseType: !169, size: 16, offset: 10128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !211, file: !6, line: 270, baseType: !120, size: 32, offset: 10144)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !211, file: !6, line: 272, baseType: !441, size: 64, offset: 10176)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !6, line: 54, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !211, file: !6, line: 275, baseType: !444, size: 64, offset: 10240)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !6, line: 275, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !211, file: !6, line: 277, baseType: !447, size: 64, offset: 10304)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 56, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !211, file: !6, line: 277, baseType: !447, size: 64, offset: 10368)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !211, file: !6, line: 278, baseType: !451, size: 64, offset: 10432)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !452, line: 27, baseType: !453)
!452 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !454, line: 45, baseType: !455)
!454 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!455 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !211, file: !6, line: 279, baseType: !451, size: 64, offset: 10496)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !211, file: !6, line: 280, baseType: !7, size: 32, offset: 10560)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !211, file: !6, line: 281, baseType: !7, size: 32, offset: 10592)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !211, file: !6, line: 283, baseType: !195, size: 128, offset: 10624)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !211, file: !6, line: 284, baseType: !195, size: 128, offset: 10752)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !211, file: !6, line: 285, baseType: !462, size: 64, offset: 10880)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !211, file: !6, line: 287, baseType: !464, size: 64, offset: 10944)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !33, line: 95, size: 768, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "physics_object", scope: !465, file: !33, line: 97, baseType: !105, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "physics_shape", scope: !465, file: !33, line: 98, baseType: !105, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !33, line: 101, baseType: !169, size: 16, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !465, file: !33, line: 102, baseType: !169, size: 16, offset: 144)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !33, line: 104, baseType: !110, size: 32, offset: 160)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "col_groups", scope: !465, file: !33, line: 105, baseType: !110, size: 32, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mesh_source", scope: !465, file: !33, line: 106, baseType: !169, size: 16, offset: 224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !33, line: 107, baseType: !169, size: 16, offset: 240)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !465, file: !33, line: 110, baseType: !120, size: 32, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !465, file: !33, line: 112, baseType: !120, size: 32, offset: 288)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "restitution", scope: !465, file: !33, line: 113, baseType: !120, size: 32, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !465, file: !33, line: 115, baseType: !120, size: 32, offset: 352)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lin_damping", scope: !465, file: !33, line: 117, baseType: !120, size: 32, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ang_damping", scope: !465, file: !33, line: 118, baseType: !120, size: 32, offset: 416)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lin_sleep_thresh", scope: !465, file: !33, line: 120, baseType: !120, size: 32, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ang_sleep_thresh", scope: !465, file: !33, line: 121, baseType: !120, size: 32, offset: 480)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "orn", scope: !465, file: !33, line: 123, baseType: !345, size: 128, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !465, file: !33, line: 124, baseType: !272, size: 96, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !465, file: !33, line: 125, baseType: !120, size: 32, offset: 736)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !211, file: !6, line: 288, baseType: !487, size: 64, offset: 11008)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !33, line: 195, size: 1024, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ob1", scope: !488, file: !33, line: 196, baseType: !210, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ob2", scope: !488, file: !33, line: 197, baseType: !210, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !33, line: 200, baseType: !169, size: 16, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num_solver_iterations", scope: !488, file: !33, line: 201, baseType: !169, size: 16, offset: 144)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !488, file: !33, line: 203, baseType: !110, size: 32, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "breaking_threshold", scope: !488, file: !33, line: 205, baseType: !120, size: 32, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !488, file: !33, line: 206, baseType: !120, size: 32, offset: 224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_x_lower", scope: !488, file: !33, line: 210, baseType: !120, size: 32, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_x_upper", scope: !488, file: !33, line: 211, baseType: !120, size: 32, offset: 288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_y_lower", scope: !488, file: !33, line: 212, baseType: !120, size: 32, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_y_upper", scope: !488, file: !33, line: 213, baseType: !120, size: 32, offset: 352)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_z_lower", scope: !488, file: !33, line: 214, baseType: !120, size: 32, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_z_upper", scope: !488, file: !33, line: 215, baseType: !120, size: 32, offset: 416)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_x_lower", scope: !488, file: !33, line: 217, baseType: !120, size: 32, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_x_upper", scope: !488, file: !33, line: 218, baseType: !120, size: 32, offset: 480)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_y_lower", scope: !488, file: !33, line: 219, baseType: !120, size: 32, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_y_upper", scope: !488, file: !33, line: 220, baseType: !120, size: 32, offset: 544)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_z_lower", scope: !488, file: !33, line: 221, baseType: !120, size: 32, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_z_upper", scope: !488, file: !33, line: 222, baseType: !120, size: 32, offset: 608)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "spring_stiffness_x", scope: !488, file: !33, line: 226, baseType: !120, size: 32, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "spring_stiffness_y", scope: !488, file: !33, line: 227, baseType: !120, size: 32, offset: 672)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "spring_stiffness_z", scope: !488, file: !33, line: 228, baseType: !120, size: 32, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "spring_damping_x", scope: !488, file: !33, line: 230, baseType: !120, size: 32, offset: 736)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "spring_damping_y", scope: !488, file: !33, line: 231, baseType: !120, size: 32, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "spring_damping_z", scope: !488, file: !33, line: 232, baseType: !120, size: 32, offset: 800)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "motor_lin_target_velocity", scope: !488, file: !33, line: 235, baseType: !120, size: 32, offset: 832)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "motor_ang_target_velocity", scope: !488, file: !33, line: 236, baseType: !120, size: 32, offset: 864)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "motor_lin_max_impulse", scope: !488, file: !33, line: 237, baseType: !120, size: 32, offset: 896)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "motor_ang_max_impulse", scope: !488, file: !33, line: 238, baseType: !120, size: 32, offset: 928)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "physics_constraint", scope: !488, file: !33, line: 241, baseType: !105, size: 64, offset: 960)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !211, file: !6, line: 290, baseType: !521, size: 64, offset: 11072)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 2)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !211, file: !6, line: 291, baseType: !525, size: 64, offset: 11136)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !527, line: 65, baseType: !528)
!527 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !527, line: 50, size: 320, elements: !529)
!529 = !{!530, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !528, file: !527, line: 51, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !528, file: !527, line: 53, baseType: !110, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !528, file: !527, line: 54, baseType: !110, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !528, file: !527, line: 55, baseType: !110, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !528, file: !527, line: 55, baseType: !110, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !528, file: !527, line: 56, baseType: !118, size: 8, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !528, file: !527, line: 56, baseType: !118, size: 8, offset: 200)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !528, file: !527, line: 57, baseType: !118, size: 8, offset: 208)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !528, file: !527, line: 57, baseType: !118, size: 8, offset: 216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !528, file: !527, line: 59, baseType: !169, size: 16, offset: 224)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !528, file: !527, line: 59, baseType: !169, size: 16, offset: 240)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !528, file: !527, line: 59, baseType: !169, size: 16, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !528, file: !527, line: 61, baseType: !169, size: 16, offset: 272)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !528, file: !527, line: 63, baseType: !110, size: 32, offset: 288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !211, file: !6, line: 293, baseType: !195, size: 128, offset: 11200)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !211, file: !6, line: 294, baseType: !547, size: 64, offset: 11328)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !6, line: 113, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !6, line: 108, size: 256, elements: !550)
!550 = !{!551, !553, !554, !555, !556}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !549, file: !6, line: 109, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !549, file: !6, line: 109, baseType: !552, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !549, file: !6, line: 110, baseType: !210, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !549, file: !6, line: 111, baseType: !110, size: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !549, file: !6, line: 112, baseType: !120, size: 32, offset: 224)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !134, file: !133, line: 1221, baseType: !558, size: 64, offset: 1088)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !133, line: 52, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !134, file: !133, line: 1223, baseType: !531, size: 64, offset: 1152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !134, file: !133, line: 1225, baseType: !195, size: 128, offset: 1216)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !134, file: !133, line: 1226, baseType: !563, size: 64, offset: 1344)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !133, line: 69, size: 320, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !133, line: 70, baseType: !563, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !564, file: !133, line: 70, baseType: !563, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !564, file: !133, line: 71, baseType: !7, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !564, file: !133, line: 71, baseType: !7, size: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !564, file: !133, line: 72, baseType: !110, size: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !564, file: !133, line: 73, baseType: !169, size: 16, offset: 224)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !564, file: !133, line: 73, baseType: !169, size: 16, offset: 240)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !564, file: !133, line: 74, baseType: !210, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !134, file: !133, line: 1227, baseType: !210, size: 64, offset: 1408)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !134, file: !133, line: 1229, baseType: !272, size: 96, offset: 1472)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !134, file: !133, line: 1230, baseType: !272, size: 96, offset: 1568)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !134, file: !133, line: 1231, baseType: !272, size: 96, offset: 1664)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !134, file: !133, line: 1231, baseType: !272, size: 96, offset: 1760)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !134, file: !133, line: 1233, baseType: !7, size: 32, offset: 1856)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !134, file: !133, line: 1234, baseType: !110, size: 32, offset: 1888)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !134, file: !133, line: 1235, baseType: !7, size: 32, offset: 1920)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !133, line: 1237, baseType: !169, size: 16, offset: 1952)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !134, file: !133, line: 1239, baseType: !118, size: 8, offset: 1968)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !134, file: !133, line: 1240, baseType: !585, size: 8, offset: 1976)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 8, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 1)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !134, file: !133, line: 1242, baseType: !589, size: 64, offset: 1984)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !591, line: 328, size: 3456, elements: !592)
!591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!592 = !{!593, !594, !595, !599, !600, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !628, !629, !630, !633, !638, !639, !642, !646, !650, !654, !658, !659, !660, !661}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !590, file: !591, line: 329, baseType: !137, size: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !590, file: !591, line: 330, baseType: !206, size: 64, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !590, file: !591, line: 332, baseType: !596, size: 64, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !598, line: 32, flags: DIFlagFwdDecl)
!598 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!599 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !590, file: !591, line: 333, baseType: !185, size: 512, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !590, file: !591, line: 335, baseType: !601, size: 64, offset: 1600)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !63, line: 41, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !590, file: !591, line: 337, baseType: !303, size: 64, offset: 1664)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !590, file: !591, line: 338, baseType: !521, size: 64, offset: 1728)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !590, file: !591, line: 340, baseType: !195, size: 128, offset: 1792)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !590, file: !591, line: 340, baseType: !195, size: 128, offset: 1920)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !590, file: !591, line: 342, baseType: !110, size: 32, offset: 2048)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !590, file: !591, line: 342, baseType: !110, size: 32, offset: 2080)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !590, file: !591, line: 343, baseType: !110, size: 32, offset: 2112)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !591, line: 345, baseType: !110, size: 32, offset: 2144)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !590, file: !591, line: 346, baseType: !110, size: 32, offset: 2176)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !590, file: !591, line: 347, baseType: !169, size: 16, offset: 2208)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !590, file: !591, line: 348, baseType: !169, size: 16, offset: 2224)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !590, file: !591, line: 349, baseType: !110, size: 32, offset: 2240)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !590, file: !591, line: 351, baseType: !110, size: 32, offset: 2272)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !590, file: !591, line: 353, baseType: !169, size: 16, offset: 2304)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !590, file: !591, line: 354, baseType: !169, size: 16, offset: 2320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !590, file: !591, line: 355, baseType: !110, size: 32, offset: 2336)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !590, file: !591, line: 357, baseType: !620, size: 128, offset: 2368)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !621, line: 95, baseType: !622)
!621 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !621, line: 92, size: 128, elements: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !622, file: !621, line: 93, baseType: !120, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !622, file: !621, line: 93, baseType: !120, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !622, file: !621, line: 94, baseType: !120, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !622, file: !621, line: 94, baseType: !120, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !590, file: !591, line: 363, baseType: !195, size: 128, offset: 2496)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !590, file: !591, line: 363, baseType: !195, size: 128, offset: 2624)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !590, file: !591, line: 368, baseType: !631, size: 64, offset: 2752)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !591, line: 48, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !590, file: !591, line: 372, baseType: !634, size: 32, offset: 2816)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !591, line: 274, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !591, line: 271, size: 32, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !635, file: !591, line: 273, baseType: !7, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !590, file: !591, line: 373, baseType: !110, size: 32, offset: 2848)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !590, file: !591, line: 382, baseType: !640, size: 64, offset: 2880)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !591, line: 46, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !590, file: !591, line: 385, baseType: !643, size: 64, offset: 2944)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !105, !120}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !590, file: !591, line: 386, baseType: !647, size: 64, offset: 3008)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !105, !333}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !590, file: !591, line: 387, baseType: !651, size: 64, offset: 3072)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!110, !105}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !590, file: !591, line: 388, baseType: !655, size: 64, offset: 3136)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !105}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !590, file: !591, line: 389, baseType: !105, size: 64, offset: 3200)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !590, file: !591, line: 389, baseType: !105, size: 64, offset: 3264)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !590, file: !591, line: 389, baseType: !105, size: 64, offset: 3328)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !590, file: !591, line: 389, baseType: !105, size: 64, offset: 3392)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !134, file: !133, line: 1244, baseType: !663, size: 64, offset: 2048)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !665, line: 200, size: 17024, elements: !666)
!665 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!666 = !{!667, !668, !669, !670, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !664, file: !665, line: 201, baseType: !462, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !664, file: !665, line: 202, baseType: !195, size: 128, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !664, file: !665, line: 203, baseType: !195, size: 128, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !664, file: !665, line: 206, baseType: !671, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !665, line: 190, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !665, line: 126, size: 2816, elements: !674)
!674 = !{!675, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !773, !774, !775, !776, !1054, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1082}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !673, file: !665, line: 127, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !673, file: !665, line: 127, baseType: !676, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !673, file: !665, line: 128, baseType: !105, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !673, file: !665, line: 129, baseType: !105, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !673, file: !665, line: 130, baseType: !185, size: 512, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !673, file: !665, line: 132, baseType: !110, size: 32, offset: 768)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !673, file: !665, line: 132, baseType: !110, size: 32, offset: 800)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !673, file: !665, line: 133, baseType: !110, size: 32, offset: 832)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !673, file: !665, line: 134, baseType: !110, size: 32, offset: 864)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !673, file: !665, line: 134, baseType: !110, size: 32, offset: 896)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !673, file: !665, line: 134, baseType: !110, size: 32, offset: 928)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !673, file: !665, line: 135, baseType: !110, size: 32, offset: 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !673, file: !665, line: 135, baseType: !110, size: 32, offset: 992)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !673, file: !665, line: 136, baseType: !110, size: 32, offset: 1024)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !673, file: !665, line: 136, baseType: !110, size: 32, offset: 1056)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !673, file: !665, line: 137, baseType: !110, size: 32, offset: 1088)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !673, file: !665, line: 137, baseType: !110, size: 32, offset: 1120)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !673, file: !665, line: 138, baseType: !120, size: 32, offset: 1152)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !673, file: !665, line: 139, baseType: !120, size: 32, offset: 1184)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !673, file: !665, line: 139, baseType: !120, size: 32, offset: 1216)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !673, file: !665, line: 141, baseType: !169, size: 16, offset: 1248)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !673, file: !665, line: 142, baseType: !169, size: 16, offset: 1264)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !673, file: !665, line: 143, baseType: !110, size: 32, offset: 1280)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !673, file: !665, line: 144, baseType: !110, size: 32, offset: 1312)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !673, file: !665, line: 146, baseType: !701, size: 64, offset: 1344)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !665, line: 114, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !665, line: 99, size: 7232, elements: !704)
!704 = !{!705, !707, !708, !709, !710, !711, !712, !723, !727, !741, !750, !757, !767}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !703, file: !665, line: 100, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !703, file: !665, line: 100, baseType: !706, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !703, file: !665, line: 101, baseType: !110, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !703, file: !665, line: 101, baseType: !110, size: 32, offset: 160)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !703, file: !665, line: 102, baseType: !110, size: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !703, file: !665, line: 102, baseType: !110, size: 32, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !703, file: !665, line: 103, baseType: !713, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !665, line: 59, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !665, line: 56, size: 2112, elements: !716)
!716 = !{!717, !721, !722}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !665, line: 57, baseType: !718, size: 2048)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 2048, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !715, file: !665, line: 58, baseType: !110, size: 32, offset: 2048)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !715, file: !665, line: 58, baseType: !110, size: 32, offset: 2080)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !703, file: !665, line: 106, baseType: !724, size: 6144, offset: 320)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 6144, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 768)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !703, file: !665, line: 107, baseType: !728, size: 64, offset: 6464)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !665, line: 97, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !665, line: 83, size: 8320, elements: !731)
!731 = !{!732, !733, !734, !737, !738, !739, !740}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !730, file: !665, line: 84, baseType: !724, size: 6144)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !730, file: !665, line: 87, baseType: !718, size: 2048, offset: 6144)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !730, file: !665, line: 88, baseType: !735, size: 64, offset: 8192)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !527, line: 41, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !730, file: !665, line: 90, baseType: !169, size: 16, offset: 8256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !730, file: !665, line: 92, baseType: !169, size: 16, offset: 8272)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !730, file: !665, line: 93, baseType: !169, size: 16, offset: 8288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !730, file: !665, line: 95, baseType: !169, size: 16, offset: 8304)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !703, file: !665, line: 108, baseType: !742, size: 64, offset: 6528)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !665, line: 66, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !665, line: 61, size: 128, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !744, file: !665, line: 62, baseType: !110, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !744, file: !665, line: 63, baseType: !110, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !744, file: !665, line: 64, baseType: !110, size: 32, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !744, file: !665, line: 65, baseType: !110, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !703, file: !665, line: 109, baseType: !751, size: 64, offset: 6592)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !665, line: 71, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !665, line: 68, size: 64, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !753, file: !665, line: 69, baseType: !110, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !753, file: !665, line: 70, baseType: !110, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !703, file: !665, line: 110, baseType: !758, size: 64, offset: 6656)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !665, line: 81, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !665, line: 73, size: 352, elements: !761)
!761 = !{!762, !763, !764, !765, !766}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !760, file: !665, line: 74, baseType: !272, size: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !760, file: !665, line: 75, baseType: !272, size: 96, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !760, file: !665, line: 76, baseType: !272, size: 96, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !760, file: !665, line: 77, baseType: !110, size: 32, offset: 288)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !760, file: !665, line: 78, baseType: !110, size: 32, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !703, file: !665, line: 113, baseType: !768, size: 512, offset: 6720)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !769, line: 182, baseType: !770)
!769 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !769, line: 180, size: 512, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !769, line: 181, baseType: !185, size: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !673, file: !665, line: 148, baseType: !230, size: 64, offset: 1408)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !673, file: !665, line: 151, baseType: !531, size: 64, offset: 1472)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !673, file: !665, line: 152, baseType: !210, size: 64, offset: 1536)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !673, file: !665, line: 153, baseType: !777, size: 64, offset: 1600)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !779, line: 64, size: 19136, elements: !780)
!779 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!780 = !{!781, !782, !783, !784, !785, !786, !788, !789, !790, !791, !794, !795, !1040, !1041, !1049, !1050, !1051, !1052, !1053}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !778, file: !779, line: 65, baseType: !137, size: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !778, file: !779, line: 66, baseType: !206, size: 64, offset: 960)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !778, file: !779, line: 68, baseType: !156, size: 8192, offset: 1024)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !778, file: !779, line: 70, baseType: !110, size: 32, offset: 9216)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !778, file: !779, line: 71, baseType: !110, size: 32, offset: 9248)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !778, file: !779, line: 72, baseType: !787, size: 64, offset: 9280)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !522)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !778, file: !779, line: 74, baseType: !120, size: 32, offset: 9344)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !778, file: !779, line: 74, baseType: !120, size: 32, offset: 9376)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !778, file: !779, line: 76, baseType: !735, size: 64, offset: 9408)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !778, file: !779, line: 77, baseType: !792, size: 64, offset: 9472)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !779, line: 77, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !778, file: !779, line: 78, baseType: !303, size: 64, offset: 9536)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !778, file: !779, line: 80, baseType: !796, size: 2624, offset: 9600)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !797, line: 340, size: 2624, elements: !798)
!797 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!798 = !{!799, !827, !845, !846, !847, !862, !920, !921, !1020, !1021, !1022, !1023, !1029}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !796, file: !797, line: 341, baseType: !800, size: 576)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !797, line: 251, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !797, line: 207, size: 576, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !801, file: !797, line: 208, baseType: !110, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !801, file: !797, line: 211, baseType: !169, size: 16, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !801, file: !797, line: 212, baseType: !169, size: 16, offset: 48)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !801, file: !797, line: 213, baseType: !120, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !801, file: !797, line: 214, baseType: !169, size: 16, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !801, file: !797, line: 215, baseType: !169, size: 16, offset: 112)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !801, file: !797, line: 216, baseType: !169, size: 16, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !801, file: !797, line: 217, baseType: !169, size: 16, offset: 144)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !801, file: !797, line: 218, baseType: !169, size: 16, offset: 160)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !801, file: !797, line: 219, baseType: !169, size: 16, offset: 176)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !801, file: !797, line: 220, baseType: !120, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !801, file: !797, line: 222, baseType: !169, size: 16, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !801, file: !797, line: 225, baseType: !169, size: 16, offset: 240)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !801, file: !797, line: 228, baseType: !110, size: 32, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !801, file: !797, line: 229, baseType: !110, size: 32, offset: 288)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !801, file: !797, line: 233, baseType: !110, size: 32, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !801, file: !797, line: 236, baseType: !169, size: 16, offset: 352)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !801, file: !797, line: 236, baseType: !169, size: 16, offset: 368)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !801, file: !797, line: 241, baseType: !120, size: 32, offset: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !801, file: !797, line: 244, baseType: !110, size: 32, offset: 416)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !801, file: !797, line: 244, baseType: !110, size: 32, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !801, file: !797, line: 245, baseType: !120, size: 32, offset: 480)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !801, file: !797, line: 248, baseType: !120, size: 32, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !801, file: !797, line: 250, baseType: !110, size: 32, offset: 544)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !796, file: !797, line: 342, baseType: !828, size: 448, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !797, line: 79, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !797, line: 61, size: 448, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !829, file: !797, line: 62, baseType: !105, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !829, file: !797, line: 64, baseType: !169, size: 16, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !829, file: !797, line: 65, baseType: !169, size: 16, offset: 80)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !829, file: !797, line: 67, baseType: !120, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !829, file: !797, line: 68, baseType: !120, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !829, file: !797, line: 69, baseType: !120, size: 32, offset: 160)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !829, file: !797, line: 70, baseType: !169, size: 16, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !829, file: !797, line: 71, baseType: !169, size: 16, offset: 208)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !829, file: !797, line: 72, baseType: !521, size: 64, offset: 224)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !829, file: !797, line: 75, baseType: !120, size: 32, offset: 288)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !829, file: !797, line: 75, baseType: !120, size: 32, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !829, file: !797, line: 75, baseType: !120, size: 32, offset: 352)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !829, file: !797, line: 78, baseType: !120, size: 32, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !829, file: !797, line: 78, baseType: !120, size: 32, offset: 416)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !796, file: !797, line: 343, baseType: !195, size: 128, offset: 1024)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !796, file: !797, line: 344, baseType: !195, size: 128, offset: 1152)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !796, file: !797, line: 345, baseType: !848, size: 192, offset: 1280)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !797, line: 278, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !797, line: 270, size: 192, elements: !850)
!850 = !{!851, !852, !853, !854, !855}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !849, file: !797, line: 271, baseType: !110, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !849, file: !797, line: 273, baseType: !120, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !849, file: !797, line: 275, baseType: !110, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !849, file: !797, line: 276, baseType: !110, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !849, file: !797, line: 277, baseType: !856, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !797, line: 55, size: 576, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !857, file: !797, line: 56, baseType: !110, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !857, file: !797, line: 57, baseType: !120, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !857, file: !797, line: 58, baseType: !354, size: 512, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !796, file: !797, line: 346, baseType: !863, size: 384, offset: 1472)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !797, line: 268, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !797, line: 253, size: 384, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !914, !915, !916, !917, !918, !919}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !864, file: !797, line: 254, baseType: !110, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !864, file: !797, line: 255, baseType: !110, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !864, file: !797, line: 255, baseType: !110, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !864, file: !797, line: 258, baseType: !120, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !864, file: !797, line: 259, baseType: !871, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !797, line: 164, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !797, line: 108, size: 1664, elements: !874)
!874 = !{!875, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !873, file: !797, line: 109, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !873, file: !797, line: 109, baseType: !876, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !873, file: !797, line: 111, baseType: !185, size: 512, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !873, file: !797, line: 119, baseType: !521, size: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !873, file: !797, line: 119, baseType: !521, size: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !873, file: !797, line: 125, baseType: !521, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !873, file: !797, line: 125, baseType: !521, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !873, file: !797, line: 127, baseType: !521, size: 64, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !873, file: !797, line: 130, baseType: !110, size: 32, offset: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !873, file: !797, line: 131, baseType: !110, size: 32, offset: 992)
