; ModuleID = 'libpng/pngwutil.c'
source_filename = "libpng/pngwutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "png_pass_start", scope: !2, file: !3, line: 2008, type: !472, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "png_write_start_row", scope: !3, file: !3, line: 2002, type: !4, scopeLine: 2003, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!3 = !DIFile(filename: "libpng/pngwutil.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !7, line: 851, baseType: !8)
!7 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !7, line: 849, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !11, line: 29, size: 9728, elements: !12)
!11 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!12 = !{!13, !40, !46, !56, !57, !60, !72, !73, !74, !92, !93, !94, !95, !96, !97, !98, !99, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !177, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !200, !201, !202, !205, !214, !215, !218, !219, !220, !221, !222, !223, !224, !228, !229, !230, !231, !232, !241, !242, !243, !244, !249, !251, !379, !384, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !412, !413, !414, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !435, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !10, file: !11, line: 32, baseType: !14, size: 1600)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !15, line: 45, baseType: !16)
!15 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1600, elements: !38)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !15, line: 33, size: 1600, elements: !18)
!18 = !{!19, !26, !28}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !17, file: !15, line: 39, baseType: !20, size: 512)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !21, line: 31, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !24)
!23 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!24 = !{!25}
!25 = !DISubrange(count: 8)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !17, file: !15, line: 40, baseType: !27, size: 32, offset: 512)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !17, file: !15, line: 41, baseType: !29, size: 1024, offset: 576)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !30, line: 8, baseType: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 5, size: 1024, elements: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !31, file: !30, line: 7, baseType: !34, size: 1024)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, elements: !36)
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !{!37}
!37 = !DISubrange(count: 16)
!38 = !{!39}
!39 = !DISubrange(count: 1)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !10, file: !11, line: 33, baseType: !41, size: 64, offset: 1600)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !7, line: 913, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45, !27}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !10, file: !11, line: 35, baseType: !47, size: 64, offset: 1664)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !7, line: 861, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !6, !51}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !52, line: 537, baseType: !53)
!52 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !10, file: !11, line: 37, baseType: !47, size: 64, offset: 1728)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !10, file: !11, line: 39, baseType: !58, size: 64, offset: 1792)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !52, line: 524, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !10, file: !11, line: 40, baseType: !61, size: 64, offset: 1856)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !7, line: 862, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !6, !65, !69}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !52, line: 526, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !52, line: 449, baseType: !68)
!68 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !52, line: 454, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !35)
!71 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !10, file: !11, line: 41, baseType: !61, size: 64, offset: 1920)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !10, file: !11, line: 42, baseType: !58, size: 64, offset: 1984)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !10, file: !11, line: 45, baseType: !75, size: 64, offset: 2048)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !7, line: 889, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !6, !79, !65}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !7, line: 842, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !7, line: 840, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !7, line: 832, size: 192, elements: !83)
!83 = !{!84, !87, !88, !89, !90, !91}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !82, file: !7, line: 834, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !52, line: 441, baseType: !86)
!86 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !82, file: !7, line: 835, baseType: !69, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !82, file: !7, line: 836, baseType: !67, size: 8, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !82, file: !7, line: 837, baseType: !67, size: 8, offset: 136)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !82, file: !7, line: 838, baseType: !67, size: 8, offset: 144)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !82, file: !7, line: 839, baseType: !67, size: 8, offset: 152)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !10, file: !11, line: 49, baseType: !75, size: 64, offset: 2112)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !10, file: !11, line: 56, baseType: !58, size: 64, offset: 2176)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !10, file: !11, line: 57, baseType: !67, size: 8, offset: 2240)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !10, file: !11, line: 58, baseType: !67, size: 8, offset: 2248)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !10, file: !11, line: 62, baseType: !85, size: 32, offset: 2272)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !10, file: !11, line: 63, baseType: !85, size: 32, offset: 2304)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !10, file: !11, line: 64, baseType: !85, size: 32, offset: 2336)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !10, file: !11, line: 66, baseType: !100, size: 896, offset: 2368)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !101, line: 104, baseType: !102)
!101 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !101, line: 85, size: 896, elements: !103)
!103 = !{!104, !109, !111, !113, !114, !115, !116, !118, !123, !129, !134, !135, !136, !137}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !102, file: !101, line: 86, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !107, line: 374, baseType: !108)
!107 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !107, line: 365, baseType: !68)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !102, file: !101, line: 87, baseType: !110, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !107, line: 367, baseType: !86)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !102, file: !101, line: 88, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !107, line: 368, baseType: !35)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !102, file: !101, line: 90, baseType: !105, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !102, file: !101, line: 91, baseType: !110, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !102, file: !101, line: 92, baseType: !112, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !102, file: !101, line: 94, baseType: !117, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !102, file: !101, line: 95, baseType: !119, size: 64, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !101, line: 1714, size: 32, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !120, file: !101, line: 1714, baseType: !27, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !102, file: !101, line: 97, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !101, line: 80, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !128, !110, !110}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !107, line: 383, baseType: !59)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !102, file: !101, line: 98, baseType: !130, size: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !101, line: 81, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !128, !128}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !102, file: !101, line: 99, baseType: !128, size: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !102, file: !101, line: 101, baseType: !27, size: 32, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !102, file: !101, line: 102, baseType: !112, size: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !102, file: !101, line: 103, baseType: !112, size: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !10, file: !11, line: 67, baseType: !65, size: 64, offset: 3264)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !10, file: !11, line: 68, baseType: !110, size: 32, offset: 3328)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !10, file: !11, line: 80, baseType: !85, size: 32, offset: 3360)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !10, file: !11, line: 83, baseType: !27, size: 32, offset: 3392)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !10, file: !11, line: 84, baseType: !27, size: 32, offset: 3424)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !10, file: !11, line: 85, baseType: !27, size: 32, offset: 3456)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !10, file: !11, line: 86, baseType: !27, size: 32, offset: 3488)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !10, file: !11, line: 87, baseType: !27, size: 32, offset: 3520)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !10, file: !11, line: 92, baseType: !27, size: 32, offset: 3552)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !10, file: !11, line: 93, baseType: !27, size: 32, offset: 3584)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !10, file: !11, line: 94, baseType: !27, size: 32, offset: 3616)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !10, file: !11, line: 95, baseType: !27, size: 32, offset: 3648)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !10, file: !11, line: 96, baseType: !27, size: 32, offset: 3680)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !10, file: !11, line: 100, baseType: !85, size: 32, offset: 3712)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !10, file: !11, line: 101, baseType: !85, size: 32, offset: 3744)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !10, file: !11, line: 102, baseType: !85, size: 32, offset: 3776)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !10, file: !11, line: 103, baseType: !85, size: 32, offset: 3808)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !10, file: !11, line: 104, baseType: !69, size: 64, offset: 3840)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !10, file: !11, line: 105, baseType: !85, size: 32, offset: 3904)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !10, file: !11, line: 106, baseType: !85, size: 32, offset: 3936)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !10, file: !11, line: 107, baseType: !85, size: 32, offset: 3968)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !10, file: !11, line: 108, baseType: !65, size: 64, offset: 4032)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !10, file: !11, line: 111, baseType: !65, size: 64, offset: 4096)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !10, file: !11, line: 114, baseType: !65, size: 64, offset: 4160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !10, file: !11, line: 115, baseType: !65, size: 64, offset: 4224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !10, file: !11, line: 116, baseType: !65, size: 64, offset: 4288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !10, file: !11, line: 117, baseType: !65, size: 64, offset: 4352)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !10, file: !11, line: 118, baseType: !69, size: 64, offset: 4416)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !10, file: !11, line: 120, baseType: !85, size: 32, offset: 4480)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !10, file: !11, line: 121, baseType: !85, size: 32, offset: 4512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !10, file: !11, line: 122, baseType: !169, size: 64, offset: 4544)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !7, line: 559, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !7, line: 558, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !7, line: 553, size: 24, elements: !173)
!173 = !{!174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !172, file: !7, line: 555, baseType: !67, size: 8)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !172, file: !7, line: 556, baseType: !67, size: 8, offset: 8)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !172, file: !7, line: 557, baseType: !67, size: 8, offset: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !10, file: !11, line: 123, baseType: !178, size: 16, offset: 4608)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !52, line: 447, baseType: !179)
!179 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !10, file: !11, line: 127, baseType: !27, size: 32, offset: 4640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !10, file: !11, line: 130, baseType: !178, size: 16, offset: 4672)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !10, file: !11, line: 131, baseType: !67, size: 8, offset: 4688)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !10, file: !11, line: 132, baseType: !67, size: 8, offset: 4696)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !10, file: !11, line: 133, baseType: !67, size: 8, offset: 4704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !10, file: !11, line: 134, baseType: !67, size: 8, offset: 4712)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !10, file: !11, line: 135, baseType: !67, size: 8, offset: 4720)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !10, file: !11, line: 136, baseType: !67, size: 8, offset: 4728)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !10, file: !11, line: 137, baseType: !67, size: 8, offset: 4736)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !10, file: !11, line: 138, baseType: !67, size: 8, offset: 4744)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !10, file: !11, line: 139, baseType: !67, size: 8, offset: 4752)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !10, file: !11, line: 140, baseType: !67, size: 8, offset: 4760)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !10, file: !11, line: 141, baseType: !67, size: 8, offset: 4768)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !10, file: !11, line: 142, baseType: !67, size: 8, offset: 4776)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !10, file: !11, line: 143, baseType: !67, size: 8, offset: 4784)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !10, file: !11, line: 145, baseType: !67, size: 8, offset: 4792)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !10, file: !11, line: 147, baseType: !197, size: 40, offset: 4800)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 40, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 5)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !10, file: !11, line: 151, baseType: !178, size: 16, offset: 4848)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !10, file: !11, line: 156, baseType: !67, size: 8, offset: 4864)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !10, file: !11, line: 157, baseType: !203, size: 32, offset: 4896)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !52, line: 521, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !52, line: 442, baseType: !27)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !10, file: !11, line: 158, baseType: !206, size: 80, offset: 4928)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !7, line: 570, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !7, line: 563, size: 80, elements: !208)
!208 = !{!209, !210, !211, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !207, file: !7, line: 565, baseType: !67, size: 8)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !207, file: !7, line: 566, baseType: !178, size: 16, offset: 16)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !207, file: !7, line: 567, baseType: !178, size: 16, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !207, file: !7, line: 568, baseType: !178, size: 16, offset: 48)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !207, file: !7, line: 569, baseType: !178, size: 16, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !10, file: !11, line: 160, baseType: !206, size: 80, offset: 5008)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !10, file: !11, line: 165, baseType: !216, size: 64, offset: 5120)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !7, line: 863, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !10, file: !11, line: 166, baseType: !85, size: 32, offset: 5184)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !10, file: !11, line: 167, baseType: !85, size: 32, offset: 5216)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !10, file: !11, line: 171, baseType: !27, size: 32, offset: 5248)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !10, file: !11, line: 172, baseType: !203, size: 32, offset: 5280)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !10, file: !11, line: 173, baseType: !203, size: 32, offset: 5312)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !10, file: !11, line: 175, baseType: !65, size: 64, offset: 5376)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !10, file: !11, line: 176, baseType: !225, size: 64, offset: 5440)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !52, line: 556, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !10, file: !11, line: 180, baseType: !65, size: 64, offset: 5504)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !10, file: !11, line: 181, baseType: !65, size: 64, offset: 5568)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !10, file: !11, line: 182, baseType: !225, size: 64, offset: 5632)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !10, file: !11, line: 183, baseType: !225, size: 64, offset: 5696)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !10, file: !11, line: 188, baseType: !233, size: 40, offset: 5760)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !7, line: 582, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !7, line: 575, size: 40, elements: !235)
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !234, file: !7, line: 577, baseType: !67, size: 8)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !234, file: !7, line: 578, baseType: !67, size: 8, offset: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !234, file: !7, line: 579, baseType: !67, size: 8, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !234, file: !7, line: 580, baseType: !67, size: 8, offset: 24)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !234, file: !7, line: 581, baseType: !67, size: 8, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !10, file: !11, line: 192, baseType: !233, size: 40, offset: 5800)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !10, file: !11, line: 197, baseType: !65, size: 64, offset: 5888)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !10, file: !11, line: 198, baseType: !206, size: 80, offset: 5952)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !10, file: !11, line: 201, baseType: !245, size: 64, offset: 6080)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !7, line: 864, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !6, !85, !27}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !10, file: !11, line: 202, baseType: !250, size: 64, offset: 6144)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !7, line: 866, baseType: !246)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !10, file: !11, line: 204, baseType: !252, size: 64, offset: 6208)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !7, line: 870, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !6, !256}
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !7, line: 723, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !7, line: 722, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !260, line: 56, size: 2496, elements: !261)
!260 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !279, !280, !281, !282, !283, !297, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !334, !335, !336, !337, !347, !348, !349, !350, !351, !352, !372, !373, !374, !375, !376}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !259, file: !260, line: 59, baseType: !85, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !259, file: !260, line: 60, baseType: !85, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !259, file: !260, line: 61, baseType: !85, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !259, file: !260, line: 62, baseType: !69, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !259, file: !260, line: 63, baseType: !169, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !259, file: !260, line: 64, baseType: !178, size: 16, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !259, file: !260, line: 65, baseType: !178, size: 16, offset: 272)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !259, file: !260, line: 66, baseType: !67, size: 8, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !259, file: !260, line: 67, baseType: !67, size: 8, offset: 296)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !259, file: !260, line: 69, baseType: !67, size: 8, offset: 304)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !259, file: !260, line: 70, baseType: !67, size: 8, offset: 312)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !259, file: !260, line: 71, baseType: !67, size: 8, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !259, file: !260, line: 74, baseType: !67, size: 8, offset: 328)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !259, file: !260, line: 75, baseType: !67, size: 8, offset: 336)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !259, file: !260, line: 76, baseType: !67, size: 8, offset: 344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !259, file: !260, line: 77, baseType: !278, size: 64, offset: 352)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !24)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !259, file: !260, line: 90, baseType: !203, size: 32, offset: 416)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !259, file: !260, line: 96, baseType: !67, size: 8, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !259, file: !260, line: 108, baseType: !27, size: 32, offset: 480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !259, file: !260, line: 109, baseType: !27, size: 32, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !259, file: !260, line: 110, baseType: !284, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !7, line: 654, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !7, line: 653, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !7, line: 637, size: 448, elements: !288)
!288 = !{!289, !290, !292, !293, !294, !295, !296}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !287, file: !7, line: 639, baseType: !27, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !287, file: !7, line: 644, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !52, line: 536, baseType: !117)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !287, file: !7, line: 645, baseType: !291, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !287, file: !7, line: 647, baseType: !69, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !287, file: !7, line: 648, baseType: !69, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !287, file: !7, line: 649, baseType: !291, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !287, file: !7, line: 651, baseType: !291, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !259, file: !260, line: 117, baseType: !298, size: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !7, line: 683, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !7, line: 675, size: 64, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !299, file: !7, line: 677, baseType: !178, size: 16)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !299, file: !7, line: 678, baseType: !67, size: 8, offset: 16)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !299, file: !7, line: 679, baseType: !67, size: 8, offset: 24)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !299, file: !7, line: 680, baseType: !67, size: 8, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !299, file: !7, line: 681, baseType: !67, size: 8, offset: 40)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !299, file: !7, line: 682, baseType: !67, size: 8, offset: 48)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !259, file: !260, line: 127, baseType: !233, size: 40, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !259, file: !260, line: 141, baseType: !65, size: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !259, file: !260, line: 142, baseType: !206, size: 80, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !259, file: !260, line: 152, baseType: !206, size: 80, offset: 912)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !259, file: !260, line: 161, baseType: !204, size: 32, offset: 992)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !259, file: !260, line: 162, baseType: !204, size: 32, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !259, file: !260, line: 163, baseType: !67, size: 8, offset: 1056)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !259, file: !260, line: 171, baseType: !85, size: 32, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !259, file: !260, line: 172, baseType: !85, size: 32, offset: 1120)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !259, file: !260, line: 173, baseType: !67, size: 8, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !259, file: !260, line: 183, baseType: !318, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !52, line: 532, baseType: !227)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !259, file: !260, line: 193, baseType: !203, size: 32, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !259, file: !260, line: 194, baseType: !203, size: 32, offset: 1312)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !259, file: !260, line: 195, baseType: !203, size: 32, offset: 1344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !259, file: !260, line: 196, baseType: !203, size: 32, offset: 1376)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !259, file: !260, line: 197, baseType: !203, size: 32, offset: 1408)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !259, file: !260, line: 198, baseType: !203, size: 32, offset: 1440)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !259, file: !260, line: 199, baseType: !203, size: 32, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !259, file: !260, line: 200, baseType: !203, size: 32, offset: 1504)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !259, file: !260, line: 215, baseType: !291, size: 64, offset: 1536)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !259, file: !260, line: 216, baseType: !204, size: 32, offset: 1600)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !259, file: !260, line: 217, baseType: !204, size: 32, offset: 1632)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !259, file: !260, line: 218, baseType: !291, size: 64, offset: 1664)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !259, file: !260, line: 219, baseType: !332, size: 64, offset: 1728)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !52, line: 559, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !259, file: !260, line: 220, baseType: !67, size: 8, offset: 1792)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !259, file: !260, line: 221, baseType: !67, size: 8, offset: 1800)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !259, file: !260, line: 225, baseType: !85, size: 32, offset: 1824)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !259, file: !260, line: 230, baseType: !338, size: 64, offset: 1856)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !7, line: 707, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !7, line: 706, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !7, line: 695, size: 256, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !7, line: 697, baseType: !197, size: 40)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !7, line: 698, baseType: !66, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !341, file: !7, line: 699, baseType: !69, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !341, file: !7, line: 702, baseType: !67, size: 8, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !259, file: !260, line: 231, baseType: !27, size: 32, offset: 1920)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !259, file: !260, line: 236, baseType: !291, size: 64, offset: 1984)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !259, file: !260, line: 237, baseType: !65, size: 64, offset: 2048)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !259, file: !260, line: 238, baseType: !85, size: 32, offset: 2112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !259, file: !260, line: 239, baseType: !67, size: 8, offset: 2144)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !259, file: !260, line: 244, baseType: !353, size: 64, offset: 2176)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !7, line: 615, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !7, line: 614, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !7, line: 608, size: 256, elements: !357)
!357 = !{!358, !359, !360, !371}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !7, line: 610, baseType: !291, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !356, file: !7, line: 611, baseType: !67, size: 8, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !356, file: !7, line: 612, baseType: !361, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !7, line: 599, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !7, line: 598, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !7, line: 591, size: 80, elements: !365)
!365 = !{!366, !367, !368, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !364, file: !7, line: 593, baseType: !178, size: 16)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !364, file: !7, line: 594, baseType: !178, size: 16, offset: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !364, file: !7, line: 595, baseType: !178, size: 16, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !364, file: !7, line: 596, baseType: !178, size: 16, offset: 48)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !364, file: !7, line: 597, baseType: !178, size: 16, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !356, file: !7, line: 613, baseType: !204, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !259, file: !260, line: 245, baseType: !85, size: 32, offset: 2240)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !259, file: !260, line: 256, baseType: !67, size: 8, offset: 2272)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !259, file: !260, line: 257, baseType: !291, size: 64, offset: 2304)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !259, file: !260, line: 258, baseType: !291, size: 64, offset: 2368)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !259, file: !260, line: 265, baseType: !377, size: 64, offset: 2432)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !52, line: 553, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !10, file: !11, line: 205, baseType: !380, size: 64, offset: 6272)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !7, line: 883, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !6, !65, !85, !27}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !10, file: !11, line: 206, baseType: !385, size: 64, offset: 6336)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !7, line: 871, baseType: !253)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !10, file: !11, line: 207, baseType: !65, size: 64, offset: 6400)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !10, file: !11, line: 208, baseType: !65, size: 64, offset: 6464)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !10, file: !11, line: 209, baseType: !65, size: 64, offset: 6528)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !10, file: !11, line: 210, baseType: !65, size: 64, offset: 6592)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !10, file: !11, line: 211, baseType: !85, size: 32, offset: 6656)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !10, file: !11, line: 212, baseType: !85, size: 32, offset: 6688)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !10, file: !11, line: 213, baseType: !69, size: 64, offset: 6720)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !10, file: !11, line: 214, baseType: !69, size: 64, offset: 6784)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !10, file: !11, line: 215, baseType: !69, size: 64, offset: 6848)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !10, file: !11, line: 216, baseType: !69, size: 64, offset: 6912)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !10, file: !11, line: 217, baseType: !27, size: 32, offset: 6976)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !10, file: !11, line: 218, baseType: !27, size: 32, offset: 7008)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !10, file: !11, line: 232, baseType: !65, size: 64, offset: 7040)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !10, file: !11, line: 233, baseType: !65, size: 64, offset: 7104)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !10, file: !11, line: 237, baseType: !318, size: 64, offset: 7168)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !10, file: !11, line: 241, baseType: !67, size: 8, offset: 7232)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !10, file: !11, line: 242, baseType: !67, size: 8, offset: 7240)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !10, file: !11, line: 243, baseType: !65, size: 64, offset: 7296)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !10, file: !11, line: 244, baseType: !318, size: 64, offset: 7360)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !10, file: !11, line: 245, baseType: !318, size: 64, offset: 7424)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !10, file: !11, line: 246, baseType: !318, size: 64, offset: 7488)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !10, file: !11, line: 247, baseType: !318, size: 64, offset: 7552)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !10, file: !11, line: 251, baseType: !409, size: 232, offset: 7616)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 232, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 29)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !10, file: !11, line: 256, baseType: !85, size: 32, offset: 7872)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !10, file: !11, line: 259, baseType: !58, size: 64, offset: 7936)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !10, file: !11, line: 260, baseType: !415, size: 64, offset: 8000)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !7, line: 894, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!27, !6, !338}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !10, file: !11, line: 264, baseType: !27, size: 32, offset: 8064)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !10, file: !11, line: 265, baseType: !65, size: 64, offset: 8128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !10, file: !11, line: 270, baseType: !67, size: 8, offset: 8192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !10, file: !11, line: 275, baseType: !67, size: 8, offset: 8200)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !10, file: !11, line: 277, baseType: !67, size: 8, offset: 8208)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !10, file: !11, line: 279, baseType: !178, size: 16, offset: 8224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !10, file: !11, line: 280, baseType: !178, size: 16, offset: 8240)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !10, file: !11, line: 287, baseType: !85, size: 32, offset: 8256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !10, file: !11, line: 292, baseType: !67, size: 8, offset: 8288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !10, file: !11, line: 299, baseType: !58, size: 64, offset: 8320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !10, file: !11, line: 300, baseType: !430, size: 64, offset: 8384)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !7, line: 950, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!58, !6, !434}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !52, line: 591, baseType: !69)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !10, file: !11, line: 301, baseType: !436, size: 64, offset: 8448)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !7, line: 952, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !6, !58}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !10, file: !11, line: 305, baseType: !65, size: 64, offset: 8512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !10, file: !11, line: 309, baseType: !65, size: 64, offset: 8576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !10, file: !11, line: 310, baseType: !65, size: 64, offset: 8640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !10, file: !11, line: 312, baseType: !65, size: 64, offset: 8704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !10, file: !11, line: 317, baseType: !67, size: 8, offset: 8768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !10, file: !11, line: 320, baseType: !85, size: 32, offset: 8800)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !10, file: !11, line: 321, baseType: !85, size: 32, offset: 8832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !10, file: !11, line: 326, baseType: !85, size: 32, offset: 8864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !10, file: !11, line: 331, baseType: !434, size: 64, offset: 8896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !10, file: !11, line: 337, baseType: !340, size: 256, offset: 8960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !10, file: !11, line: 341, baseType: !69, size: 64, offset: 9216)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !10, file: !11, line: 344, baseType: !291, size: 64, offset: 9280)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !10, file: !11, line: 348, baseType: !85, size: 32, offset: 9344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !10, file: !11, line: 352, baseType: !65, size: 64, offset: 9408)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !10, file: !11, line: 354, baseType: !455, size: 256, offset: 9472)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 256, elements: !462)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !79, !65, !459}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !52, line: 527, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!462 = !{!463}
!463 = !DISubrange(count: 4)
!464 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !465, retainedTypes: !466, globals: !469, splitDebugInlining: false, nameTableKind: None)
!465 = !{}
!466 = !{!67, !69, !85, !59, !128, !178, !110, !459, !65, !27, !291, !467, !434, !105, !377}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_tp", file: !52, line: 540, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!469 = !{!0, !470, !475, !477, !479, !482, !484, !486, !488, !493}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "png_pass_inc", scope: !2, file: !3, line: 2011, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 56, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 7)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "png_pass_ystart", scope: !2, file: !3, line: 2014, type: !472, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "png_pass_yinc", scope: !2, file: !3, line: 2017, type: !472, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "png_pass_start", scope: !481, file: !3, line: 2118, type: !472, isLocal: true, isDefinition: true)
!481 = distinct !DISubprogram(name: "png_write_finish_row", scope: !3, file: !3, line: 2112, type: !4, scopeLine: 2113, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "png_pass_inc", scope: !481, file: !3, line: 2121, type: !472, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "png_pass_ystart", scope: !481, file: !3, line: 2124, type: !472, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "png_pass_yinc", scope: !481, file: !3, line: 2127, type: !472, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "png_pass_start", scope: !490, file: !3, line: 2245, type: !472, isLocal: true, isDefinition: true)
!490 = distinct !DISubprogram(name: "png_do_write_interlace", scope: !3, file: !3, line: 2240, type: !491, scopeLine: 2241, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !79, !65, !27}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "png_pass_inc", scope: !490, file: !3, line: 2248, type: !472, isLocal: true, isDefinition: true)
!495 = !{i32 7, !"Dwarf Version", i32 4}
!496 = !{i32 2, !"Debug Info Version", i32 3}
!497 = !{i32 1, !"wchar_size", i32 4}
!498 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!499 = distinct !DISubprogram(name: "png_save_uint_32", scope: !3, file: !3, line: 24, type: !500, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !65, !85}
!502 = !DILocalVariable(name: "buf", arg: 1, scope: !499, file: !3, line: 24, type: !65)
!503 = !DILocation(line: 24, column: 28, scope: !499)
!504 = !DILocalVariable(name: "i", arg: 2, scope: !499, file: !3, line: 24, type: !85)
!505 = !DILocation(line: 24, column: 45, scope: !499)
!506 = !DILocation(line: 26, column: 25, scope: !499)
!507 = !DILocation(line: 26, column: 27, scope: !499)
!508 = !DILocation(line: 26, column: 34, scope: !499)
!509 = !DILocation(line: 26, column: 13, scope: !499)
!510 = !DILocation(line: 26, column: 4, scope: !499)
!511 = !DILocation(line: 26, column: 11, scope: !499)
!512 = !DILocation(line: 27, column: 25, scope: !499)
!513 = !DILocation(line: 27, column: 27, scope: !499)
!514 = !DILocation(line: 27, column: 34, scope: !499)
!515 = !DILocation(line: 27, column: 13, scope: !499)
!516 = !DILocation(line: 27, column: 4, scope: !499)
!517 = !DILocation(line: 27, column: 11, scope: !499)
!518 = !DILocation(line: 28, column: 25, scope: !499)
!519 = !DILocation(line: 28, column: 27, scope: !499)
!520 = !DILocation(line: 28, column: 33, scope: !499)
!521 = !DILocation(line: 28, column: 13, scope: !499)
!522 = !DILocation(line: 28, column: 4, scope: !499)
!523 = !DILocation(line: 28, column: 11, scope: !499)
!524 = !DILocation(line: 29, column: 24, scope: !499)
!525 = !DILocation(line: 29, column: 26, scope: !499)
!526 = !DILocation(line: 29, column: 13, scope: !499)
!527 = !DILocation(line: 29, column: 4, scope: !499)
!528 = !DILocation(line: 29, column: 11, scope: !499)
!529 = !DILocation(line: 30, column: 1, scope: !499)
!530 = distinct !DISubprogram(name: "png_save_int_32", scope: !3, file: !3, line: 40, type: !531, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !65, !204}
!533 = !DILocalVariable(name: "buf", arg: 1, scope: !530, file: !3, line: 40, type: !65)
!534 = !DILocation(line: 40, column: 27, scope: !530)
!535 = !DILocalVariable(name: "i", arg: 2, scope: !530, file: !3, line: 40, type: !204)
!536 = !DILocation(line: 40, column: 43, scope: !530)
!537 = !DILocation(line: 42, column: 25, scope: !530)
!538 = !DILocation(line: 42, column: 27, scope: !530)
!539 = !DILocation(line: 42, column: 34, scope: !530)
!540 = !DILocation(line: 42, column: 13, scope: !530)
!541 = !DILocation(line: 42, column: 4, scope: !530)
!542 = !DILocation(line: 42, column: 11, scope: !530)
!543 = !DILocation(line: 43, column: 25, scope: !530)
!544 = !DILocation(line: 43, column: 27, scope: !530)
!545 = !DILocation(line: 43, column: 34, scope: !530)
!546 = !DILocation(line: 43, column: 13, scope: !530)
!547 = !DILocation(line: 43, column: 4, scope: !530)
!548 = !DILocation(line: 43, column: 11, scope: !530)
!549 = !DILocation(line: 44, column: 25, scope: !530)
!550 = !DILocation(line: 44, column: 27, scope: !530)
!551 = !DILocation(line: 44, column: 33, scope: !530)
!552 = !DILocation(line: 44, column: 13, scope: !530)
!553 = !DILocation(line: 44, column: 4, scope: !530)
!554 = !DILocation(line: 44, column: 11, scope: !530)
!555 = !DILocation(line: 45, column: 24, scope: !530)
!556 = !DILocation(line: 45, column: 26, scope: !530)
!557 = !DILocation(line: 45, column: 13, scope: !530)
!558 = !DILocation(line: 45, column: 4, scope: !530)
!559 = !DILocation(line: 45, column: 11, scope: !530)
!560 = !DILocation(line: 46, column: 1, scope: !530)
!561 = distinct !DISubprogram(name: "png_save_uint_16", scope: !3, file: !3, line: 54, type: !562, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !65, !86}
!564 = !DILocalVariable(name: "buf", arg: 1, scope: !561, file: !3, line: 54, type: !65)
!565 = !DILocation(line: 54, column: 28, scope: !561)
!566 = !DILocalVariable(name: "i", arg: 2, scope: !561, file: !3, line: 54, type: !86)
!567 = !DILocation(line: 54, column: 46, scope: !561)
!568 = !DILocation(line: 56, column: 25, scope: !561)
!569 = !DILocation(line: 56, column: 27, scope: !561)
!570 = !DILocation(line: 56, column: 33, scope: !561)
!571 = !DILocation(line: 56, column: 13, scope: !561)
!572 = !DILocation(line: 56, column: 4, scope: !561)
!573 = !DILocation(line: 56, column: 11, scope: !561)
!574 = !DILocation(line: 57, column: 24, scope: !561)
!575 = !DILocation(line: 57, column: 26, scope: !561)
!576 = !DILocation(line: 57, column: 13, scope: !561)
!577 = !DILocation(line: 57, column: 4, scope: !561)
!578 = !DILocation(line: 57, column: 11, scope: !561)
!579 = !DILocation(line: 58, column: 1, scope: !561)
!580 = distinct !DISubprogram(name: "png_write_sig", scope: !3, file: !3, line: 68, type: !4, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!581 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !580, file: !3, line: 68, type: !6)
!582 = !DILocation(line: 68, column: 27, scope: !580)
!583 = !DILocalVariable(name: "png_signature", scope: !580, file: !3, line: 70, type: !278)
!584 = !DILocation(line: 70, column: 13, scope: !580)
!585 = !DILocation(line: 74, column: 4, scope: !580)
!586 = !DILocation(line: 74, column: 13, scope: !580)
!587 = !DILocation(line: 74, column: 22, scope: !580)
!588 = !DILocation(line: 78, column: 19, scope: !580)
!589 = !DILocation(line: 78, column: 43, scope: !580)
!590 = !DILocation(line: 78, column: 52, scope: !580)
!591 = !DILocation(line: 78, column: 29, scope: !580)
!592 = !DILocation(line: 79, column: 24, scope: !580)
!593 = !DILocation(line: 79, column: 33, scope: !580)
!594 = !DILocation(line: 79, column: 22, scope: !580)
!595 = !DILocation(line: 79, column: 7, scope: !580)
!596 = !DILocation(line: 78, column: 4, scope: !580)
!597 = !DILocation(line: 81, column: 8, scope: !598)
!598 = distinct !DILexicalBlock(scope: !580, file: !3, line: 81, column: 8)
!599 = !DILocation(line: 81, column: 17, scope: !598)
!600 = !DILocation(line: 81, column: 27, scope: !598)
!601 = !DILocation(line: 81, column: 8, scope: !580)
!602 = !DILocation(line: 82, column: 7, scope: !598)
!603 = !DILocation(line: 82, column: 16, scope: !598)
!604 = !DILocation(line: 82, column: 21, scope: !598)
!605 = !DILocation(line: 83, column: 1, scope: !580)
!606 = distinct !DISubprogram(name: "png_write_chunk_start", scope: !3, file: !3, line: 132, type: !607, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !6, !459, !85}
!609 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !606, file: !3, line: 132, type: !6)
!610 = !DILocation(line: 132, column: 35, scope: !606)
!611 = !DILocalVariable(name: "chunk_string", arg: 2, scope: !606, file: !3, line: 132, type: !459)
!612 = !DILocation(line: 132, column: 60, scope: !606)
!613 = !DILocalVariable(name: "length", arg: 3, scope: !606, file: !3, line: 133, type: !85)
!614 = !DILocation(line: 133, column: 17, scope: !606)
!615 = !DILocation(line: 135, column: 27, scope: !606)
!616 = !DILocation(line: 135, column: 36, scope: !606)
!617 = !DILocation(line: 135, column: 73, scope: !606)
!618 = !DILocation(line: 135, column: 4, scope: !606)
!619 = !DILocation(line: 136, column: 1, scope: !606)
!620 = distinct !DISubprogram(name: "png_write_chunk_header", scope: !3, file: !3, line: 90, type: !621, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !464, retainedNodes: !465)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !6, !85, !85}
!623 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !620, file: !3, line: 90, type: !6)
!624 = !DILocation(line: 90, column: 36, scope: !620)
!625 = !DILocalVariable(name: "chunk_name", arg: 2, scope: !620, file: !3, line: 90, type: !85)
!626 = !DILocation(line: 90, column: 57, scope: !620)
!627 = !DILocalVariable(name: "length", arg: 3, scope: !620, file: !3, line: 91, type: !85)
!628 = !DILocation(line: 91, column: 17, scope: !620)
!629 = !DILocalVariable(name: "buf", scope: !620, file: !3, line: 93, type: !278)
!630 = !DILocation(line: 93, column: 13, scope: !620)
!631 = !DILocation(line: 100, column: 8, scope: !632)
!632 = distinct !DILexicalBlock(scope: !620, file: !3, line: 100, column: 8)
!633 = !DILocation(line: 100, column: 16, scope: !632)
!634 = !DILocation(line: 100, column: 8, scope: !620)
!635 = !DILocation(line: 101, column: 7, scope: !632)
!636 = !DILocation(line: 107, column: 4, scope: !620)
!637 = !DILocation(line: 107, column: 13, scope: !620)
!638 = !DILocation(line: 107, column: 22, scope: !620)
!639 = !DILocation(line: 111, column: 21, scope: !620)
!640 = !DILocation(line: 111, column: 26, scope: !620)
!641 = !DILocation(line: 111, column: 4, scope: !620)
!642 = !DILocation(line: 112, column: 21, scope: !620)
!643 = !DILocation(line: 112, column: 25, scope: !620)
!644 = !DILocation(line: 112, column: 30, scope: !620)
!645 = !DILocation(line: 112, column: 4, scope: !620)
!646 = !DILocation(line: 113, column: 19, scope: !620)
!647 = !DILocation(line: 113, column: 28, scope: !620)
!648 = !DILocation(line: 113, column: 4, scope: !620)
!649 = !DILocation(line: 116, column: 26, scope: !620)
!650 = !DILocation(line: 116, column: 4, scope: !620)
!651 = !DILocation(line: 116, column: 13, scope: !620)
!652 = !DILocation(line: 116, column: 24, scope: !620)
!653 = !DILocation(line: 119, column: 18, scope: !620)
!654 = !DILocation(line: 119, column: 4, scope: !620)
!655 = !DILocation(line: 121, column: 22, scope: !620)
!656 = !DILocation(line: 121, column: 31, scope: !620)
!657 = !DILocation(line: 121, column: 35, scope: !620)
!658 = !DILocation(line: 121, column: 4, scope: !620)
!659 = !DILocation(line: 127, column: 4, scope: !620)
!660 = !DILocation(line: 127, column: 13, scope: !620)
!661 = !DILocation(line: 127, column: 22, scope: !620)
!662 = !DILocation(line: 129, column: 1, scope: !620)
!663 = distinct !DISubprogram(name: "png_write_chunk_data", scope: !3, file: !3, line: 144, type: !664, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !6, !459, !69}
!666 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !663, file: !3, line: 144, type: !6)
!667 = !DILocation(line: 144, column: 34, scope: !663)
!668 = !DILocalVariable(name: "data", arg: 2, scope: !663, file: !3, line: 144, type: !459)
!669 = !DILocation(line: 144, column: 59, scope: !663)
!670 = !DILocalVariable(name: "length", arg: 3, scope: !663, file: !3, line: 145, type: !69)
!671 = !DILocation(line: 145, column: 16, scope: !663)
!672 = !DILocation(line: 148, column: 8, scope: !673)
!673 = distinct !DILexicalBlock(scope: !663, file: !3, line: 148, column: 8)
!674 = !DILocation(line: 148, column: 16, scope: !673)
!675 = !DILocation(line: 148, column: 8, scope: !663)
!676 = !DILocation(line: 149, column: 7, scope: !673)
!677 = !DILocation(line: 151, column: 8, scope: !678)
!678 = distinct !DILexicalBlock(scope: !663, file: !3, line: 151, column: 8)
!679 = !DILocation(line: 151, column: 13, scope: !678)
!680 = !DILocation(line: 151, column: 21, scope: !678)
!681 = !DILocation(line: 151, column: 24, scope: !678)
!682 = !DILocation(line: 151, column: 31, scope: !678)
!683 = !DILocation(line: 151, column: 8, scope: !663)
!684 = !DILocation(line: 153, column: 22, scope: !685)
!685 = distinct !DILexicalBlock(scope: !678, file: !3, line: 152, column: 4)
!686 = !DILocation(line: 153, column: 31, scope: !685)
!687 = !DILocation(line: 153, column: 37, scope: !685)
!688 = !DILocation(line: 153, column: 7, scope: !685)
!689 = !DILocation(line: 158, column: 25, scope: !685)
!690 = !DILocation(line: 158, column: 34, scope: !685)
!691 = !DILocation(line: 158, column: 40, scope: !685)
!692 = !DILocation(line: 158, column: 7, scope: !685)
!693 = !DILocation(line: 159, column: 4, scope: !685)
!694 = !DILocation(line: 160, column: 1, scope: !663)
!695 = distinct !DISubprogram(name: "png_write_chunk_end", scope: !3, file: !3, line: 164, type: !4, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!696 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !695, file: !3, line: 164, type: !6)
!697 = !DILocation(line: 164, column: 33, scope: !695)
!698 = !DILocalVariable(name: "buf", scope: !695, file: !3, line: 166, type: !699)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 32, elements: !462)
!700 = !DILocation(line: 166, column: 13, scope: !695)
!701 = !DILocation(line: 168, column: 8, scope: !702)
!702 = distinct !DILexicalBlock(scope: !695, file: !3, line: 168, column: 8)
!703 = !DILocation(line: 168, column: 16, scope: !702)
!704 = !DILocation(line: 168, column: 8, scope: !695)
!705 = !DILocation(line: 168, column: 25, scope: !702)
!706 = !DILocation(line: 174, column: 4, scope: !695)
!707 = !DILocation(line: 174, column: 13, scope: !695)
!708 = !DILocation(line: 174, column: 22, scope: !695)
!709 = !DILocation(line: 178, column: 21, scope: !695)
!710 = !DILocation(line: 178, column: 26, scope: !695)
!711 = !DILocation(line: 178, column: 35, scope: !695)
!712 = !DILocation(line: 178, column: 4, scope: !695)
!713 = !DILocation(line: 180, column: 19, scope: !695)
!714 = !DILocation(line: 180, column: 28, scope: !695)
!715 = !DILocation(line: 180, column: 4, scope: !695)
!716 = !DILocation(line: 181, column: 1, scope: !695)
!717 = distinct !DISubprogram(name: "png_write_chunk", scope: !3, file: !3, line: 210, type: !718, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !6, !459, !459, !69}
!720 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !717, file: !3, line: 210, type: !6)
!721 = !DILocation(line: 210, column: 29, scope: !717)
!722 = !DILocalVariable(name: "chunk_string", arg: 2, scope: !717, file: !3, line: 210, type: !459)
!723 = !DILocation(line: 210, column: 54, scope: !717)
!724 = !DILocalVariable(name: "data", arg: 3, scope: !717, file: !3, line: 211, type: !459)
!725 = !DILocation(line: 211, column: 20, scope: !717)
!726 = !DILocalVariable(name: "length", arg: 4, scope: !717, file: !3, line: 211, type: !69)
!727 = !DILocation(line: 211, column: 37, scope: !717)
!728 = !DILocation(line: 213, column: 29, scope: !717)
!729 = !DILocation(line: 213, column: 38, scope: !717)
!730 = !DILocation(line: 213, column: 75, scope: !717)
!731 = !DILocation(line: 214, column: 7, scope: !717)
!732 = !DILocation(line: 213, column: 4, scope: !717)
!733 = !DILocation(line: 215, column: 1, scope: !717)
!734 = distinct !DISubprogram(name: "png_write_complete_chunk", scope: !3, file: !3, line: 193, type: !735, scopeLine: 195, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !464, retainedNodes: !465)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !6, !85, !459, !69}
!737 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !734, file: !3, line: 193, type: !6)
!738 = !DILocation(line: 193, column: 38, scope: !734)
!739 = !DILocalVariable(name: "chunk_name", arg: 2, scope: !734, file: !3, line: 193, type: !85)
!740 = !DILocation(line: 193, column: 59, scope: !734)
!741 = !DILocalVariable(name: "data", arg: 3, scope: !734, file: !3, line: 194, type: !459)
!742 = !DILocation(line: 194, column: 20, scope: !734)
!743 = !DILocalVariable(name: "length", arg: 4, scope: !734, file: !3, line: 194, type: !69)
!744 = !DILocation(line: 194, column: 37, scope: !734)
!745 = !DILocation(line: 196, column: 8, scope: !746)
!746 = distinct !DILexicalBlock(scope: !734, file: !3, line: 196, column: 8)
!747 = !DILocation(line: 196, column: 16, scope: !746)
!748 = !DILocation(line: 196, column: 8, scope: !734)
!749 = !DILocation(line: 197, column: 7, scope: !746)
!750 = !DILocation(line: 200, column: 8, scope: !751)
!751 = distinct !DILexicalBlock(scope: !734, file: !3, line: 200, column: 8)
!752 = !DILocation(line: 200, column: 15, scope: !751)
!753 = !DILocation(line: 200, column: 8, scope: !734)
!754 = !DILocation(line: 201, column: 17, scope: !751)
!755 = !DILocation(line: 201, column: 7, scope: !751)
!756 = !DILocation(line: 203, column: 27, scope: !734)
!757 = !DILocation(line: 203, column: 36, scope: !734)
!758 = !DILocation(line: 203, column: 61, scope: !734)
!759 = !DILocation(line: 203, column: 48, scope: !734)
!760 = !DILocation(line: 203, column: 4, scope: !734)
!761 = !DILocation(line: 204, column: 25, scope: !734)
!762 = !DILocation(line: 204, column: 34, scope: !734)
!763 = !DILocation(line: 204, column: 40, scope: !734)
!764 = !DILocation(line: 204, column: 4, scope: !734)
!765 = !DILocation(line: 205, column: 24, scope: !734)
!766 = !DILocation(line: 205, column: 4, scope: !734)
!767 = !DILocation(line: 206, column: 1, scope: !734)
!768 = distinct !DISubprogram(name: "png_write_IHDR", scope: !3, file: !3, line: 677, type: !769, scopeLine: 680, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !6, !85, !85, !27, !27, !27, !27, !27}
!771 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !768, file: !3, line: 677, type: !6)
!772 = !DILocation(line: 677, column: 28, scope: !768)
!773 = !DILocalVariable(name: "width", arg: 2, scope: !768, file: !3, line: 677, type: !85)
!774 = !DILocation(line: 677, column: 49, scope: !768)
!775 = !DILocalVariable(name: "height", arg: 3, scope: !768, file: !3, line: 677, type: !85)
!776 = !DILocation(line: 677, column: 68, scope: !768)
!777 = !DILocalVariable(name: "bit_depth", arg: 4, scope: !768, file: !3, line: 678, type: !27)
!778 = !DILocation(line: 678, column: 9, scope: !768)
!779 = !DILocalVariable(name: "color_type", arg: 5, scope: !768, file: !3, line: 678, type: !27)
!780 = !DILocation(line: 678, column: 24, scope: !768)
!781 = !DILocalVariable(name: "compression_type", arg: 6, scope: !768, file: !3, line: 678, type: !27)
!782 = !DILocation(line: 678, column: 40, scope: !768)
!783 = !DILocalVariable(name: "filter_type", arg: 7, scope: !768, file: !3, line: 678, type: !27)
!784 = !DILocation(line: 678, column: 62, scope: !768)
!785 = !DILocalVariable(name: "interlace_type", arg: 8, scope: !768, file: !3, line: 679, type: !27)
!786 = !DILocation(line: 679, column: 9, scope: !768)
!787 = !DILocalVariable(name: "buf", scope: !768, file: !3, line: 681, type: !788)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 104, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 13)
!791 = !DILocation(line: 681, column: 13, scope: !768)
!792 = !DILocation(line: 686, column: 12, scope: !768)
!793 = !DILocation(line: 686, column: 4, scope: !768)
!794 = !DILocation(line: 689, column: 18, scope: !795)
!795 = distinct !DILexicalBlock(scope: !768, file: !3, line: 687, column: 4)
!796 = !DILocation(line: 689, column: 10, scope: !795)
!797 = !DILocation(line: 698, column: 16, scope: !798)
!798 = distinct !DILexicalBlock(scope: !795, file: !3, line: 690, column: 10)
!799 = !DILocation(line: 698, column: 25, scope: !798)
!800 = !DILocation(line: 698, column: 34, scope: !798)
!801 = !DILocation(line: 698, column: 39, scope: !798)
!802 = !DILocation(line: 701, column: 26, scope: !798)
!803 = !DILocation(line: 701, column: 16, scope: !798)
!804 = !DILocation(line: 704, column: 10, scope: !795)
!805 = !DILocation(line: 708, column: 14, scope: !806)
!806 = distinct !DILexicalBlock(scope: !795, file: !3, line: 708, column: 14)
!807 = !DILocation(line: 708, column: 24, scope: !806)
!808 = !DILocation(line: 708, column: 29, scope: !806)
!809 = !DILocation(line: 708, column: 32, scope: !806)
!810 = !DILocation(line: 708, column: 42, scope: !806)
!811 = !DILocation(line: 708, column: 14, scope: !795)
!812 = !DILocation(line: 712, column: 23, scope: !806)
!813 = !DILocation(line: 712, column: 13, scope: !806)
!814 = !DILocation(line: 714, column: 10, scope: !795)
!815 = !DILocation(line: 714, column: 19, scope: !795)
!816 = !DILocation(line: 714, column: 28, scope: !795)
!817 = !DILocation(line: 715, column: 10, scope: !795)
!818 = !DILocation(line: 718, column: 18, scope: !795)
!819 = !DILocation(line: 718, column: 10, scope: !795)
!820 = !DILocation(line: 724, column: 16, scope: !821)
!821 = distinct !DILexicalBlock(scope: !795, file: !3, line: 719, column: 10)
!822 = !DILocation(line: 724, column: 25, scope: !821)
!823 = !DILocation(line: 724, column: 34, scope: !821)
!824 = !DILocation(line: 725, column: 16, scope: !821)
!825 = !DILocation(line: 728, column: 26, scope: !821)
!826 = !DILocation(line: 728, column: 16, scope: !821)
!827 = !DILocation(line: 730, column: 10, scope: !795)
!828 = !DILocation(line: 733, column: 14, scope: !829)
!829 = distinct !DILexicalBlock(scope: !795, file: !3, line: 733, column: 14)
!830 = !DILocation(line: 733, column: 24, scope: !829)
!831 = !DILocation(line: 733, column: 29, scope: !829)
!832 = !DILocation(line: 733, column: 32, scope: !829)
!833 = !DILocation(line: 733, column: 42, scope: !829)
!834 = !DILocation(line: 733, column: 14, scope: !795)
!835 = !DILocation(line: 734, column: 23, scope: !829)
!836 = !DILocation(line: 734, column: 13, scope: !829)
!837 = !DILocation(line: 736, column: 10, scope: !795)
!838 = !DILocation(line: 736, column: 19, scope: !795)
!839 = !DILocation(line: 736, column: 28, scope: !795)
!840 = !DILocation(line: 737, column: 10, scope: !795)
!841 = !DILocation(line: 741, column: 14, scope: !842)
!842 = distinct !DILexicalBlock(scope: !795, file: !3, line: 741, column: 14)
!843 = !DILocation(line: 741, column: 24, scope: !842)
!844 = !DILocation(line: 741, column: 29, scope: !842)
!845 = !DILocation(line: 741, column: 32, scope: !842)
!846 = !DILocation(line: 741, column: 42, scope: !842)
!847 = !DILocation(line: 741, column: 14, scope: !795)
!848 = !DILocation(line: 745, column: 23, scope: !842)
!849 = !DILocation(line: 745, column: 13, scope: !842)
!850 = !DILocation(line: 747, column: 10, scope: !795)
!851 = !DILocation(line: 747, column: 19, scope: !795)
!852 = !DILocation(line: 747, column: 28, scope: !795)
!853 = !DILocation(line: 748, column: 10, scope: !795)
!854 = !DILocation(line: 751, column: 20, scope: !795)
!855 = !DILocation(line: 751, column: 10, scope: !795)
!856 = !DILocation(line: 754, column: 8, scope: !857)
!857 = distinct !DILexicalBlock(scope: !768, file: !3, line: 754, column: 8)
!858 = !DILocation(line: 754, column: 25, scope: !857)
!859 = !DILocation(line: 754, column: 8, scope: !768)
!860 = !DILocation(line: 756, column: 19, scope: !861)
!861 = distinct !DILexicalBlock(scope: !857, file: !3, line: 755, column: 4)
!862 = !DILocation(line: 756, column: 7, scope: !861)
!863 = !DILocation(line: 757, column: 24, scope: !861)
!864 = !DILocation(line: 758, column: 4, scope: !861)
!865 = !DILocation(line: 771, column: 11, scope: !866)
!866 = distinct !DILexicalBlock(scope: !768, file: !3, line: 771, column: 8)
!867 = !DILocation(line: 771, column: 20, scope: !866)
!868 = !DILocation(line: 771, column: 43, scope: !866)
!869 = !DILocation(line: 771, column: 69, scope: !866)
!870 = !DILocation(line: 772, column: 10, scope: !866)
!871 = !DILocation(line: 772, column: 19, scope: !866)
!872 = !DILocation(line: 772, column: 23, scope: !866)
!873 = !DILocation(line: 772, column: 48, scope: !866)
!874 = !DILocation(line: 772, column: 54, scope: !866)
!875 = !DILocation(line: 773, column: 9, scope: !866)
!876 = !DILocation(line: 773, column: 20, scope: !866)
!877 = !DILocation(line: 773, column: 42, scope: !866)
!878 = !DILocation(line: 774, column: 9, scope: !866)
!879 = !DILocation(line: 774, column: 20, scope: !866)
!880 = !DILocation(line: 774, column: 49, scope: !866)
!881 = !DILocation(line: 775, column: 9, scope: !866)
!882 = !DILocation(line: 775, column: 21, scope: !866)
!883 = !DILocation(line: 775, column: 54, scope: !866)
!884 = !DILocation(line: 777, column: 8, scope: !866)
!885 = !DILocation(line: 777, column: 20, scope: !866)
!886 = !DILocation(line: 771, column: 8, scope: !768)
!887 = !DILocation(line: 779, column: 19, scope: !888)
!888 = distinct !DILexicalBlock(scope: !866, file: !3, line: 778, column: 4)
!889 = !DILocation(line: 779, column: 7, scope: !888)
!890 = !DILocation(line: 780, column: 19, scope: !888)
!891 = !DILocation(line: 781, column: 4, scope: !888)
!892 = !DILocation(line: 784, column: 8, scope: !893)
!893 = distinct !DILexicalBlock(scope: !768, file: !3, line: 784, column: 8)
!894 = !DILocation(line: 784, column: 23, scope: !893)
!895 = !DILocation(line: 784, column: 45, scope: !893)
!896 = !DILocation(line: 785, column: 8, scope: !893)
!897 = !DILocation(line: 785, column: 23, scope: !893)
!898 = !DILocation(line: 784, column: 8, scope: !768)
!899 = !DILocation(line: 787, column: 19, scope: !900)
!900 = distinct !DILexicalBlock(scope: !893, file: !3, line: 786, column: 4)
!901 = !DILocation(line: 787, column: 7, scope: !900)
!902 = !DILocation(line: 788, column: 22, scope: !900)
!903 = !DILocation(line: 789, column: 4, scope: !900)
!904 = !DILocation(line: 795, column: 35, scope: !768)
!905 = !DILocation(line: 795, column: 25, scope: !768)
!906 = !DILocation(line: 795, column: 4, scope: !768)
!907 = !DILocation(line: 795, column: 13, scope: !768)
!908 = !DILocation(line: 795, column: 23, scope: !768)
!909 = !DILocation(line: 796, column: 36, scope: !768)
!910 = !DILocation(line: 796, column: 26, scope: !768)
!911 = !DILocation(line: 796, column: 4, scope: !768)
!912 = !DILocation(line: 796, column: 13, scope: !768)
!913 = !DILocation(line: 796, column: 24, scope: !768)
!914 = !DILocation(line: 797, column: 36, scope: !768)
!915 = !DILocation(line: 797, column: 26, scope: !768)
!916 = !DILocation(line: 797, column: 4, scope: !768)
!917 = !DILocation(line: 797, column: 13, scope: !768)
!918 = !DILocation(line: 797, column: 24, scope: !768)
!919 = !DILocation(line: 799, column: 37, scope: !768)
!920 = !DILocation(line: 799, column: 27, scope: !768)
!921 = !DILocation(line: 799, column: 4, scope: !768)
!922 = !DILocation(line: 799, column: 13, scope: !768)
!923 = !DILocation(line: 799, column: 25, scope: !768)
!924 = !DILocation(line: 801, column: 42, scope: !768)
!925 = !DILocation(line: 801, column: 32, scope: !768)
!926 = !DILocation(line: 801, column: 4, scope: !768)
!927 = !DILocation(line: 801, column: 13, scope: !768)
!928 = !DILocation(line: 801, column: 30, scope: !768)
!929 = !DILocation(line: 802, column: 21, scope: !768)
!930 = !DILocation(line: 802, column: 4, scope: !768)
!931 = !DILocation(line: 802, column: 13, scope: !768)
!932 = !DILocation(line: 802, column: 19, scope: !768)
!933 = !DILocation(line: 803, column: 22, scope: !768)
!934 = !DILocation(line: 803, column: 4, scope: !768)
!935 = !DILocation(line: 803, column: 13, scope: !768)
!936 = !DILocation(line: 803, column: 20, scope: !768)
!937 = !DILocation(line: 805, column: 38, scope: !768)
!938 = !DILocation(line: 805, column: 50, scope: !768)
!939 = !DILocation(line: 805, column: 59, scope: !768)
!940 = !DILocation(line: 805, column: 48, scope: !768)
!941 = !DILocation(line: 805, column: 27, scope: !768)
!942 = !DILocation(line: 805, column: 4, scope: !768)
!943 = !DILocation(line: 805, column: 13, scope: !768)
!944 = !DILocation(line: 805, column: 25, scope: !768)
!945 = !DILocation(line: 806, column: 24, scope: !768)
!946 = !DILocation(line: 806, column: 4, scope: !768)
!947 = !DILocation(line: 806, column: 13, scope: !768)
!948 = !DILocation(line: 806, column: 22, scope: !768)
!949 = !DILocation(line: 808, column: 25, scope: !768)
!950 = !DILocation(line: 808, column: 34, scope: !768)
!951 = !DILocation(line: 808, column: 4, scope: !768)
!952 = !DILocation(line: 808, column: 13, scope: !768)
!953 = !DILocation(line: 808, column: 23, scope: !768)
!954 = !DILocation(line: 809, column: 29, scope: !768)
!955 = !DILocation(line: 809, column: 38, scope: !768)
!956 = !DILocation(line: 809, column: 4, scope: !768)
!957 = !DILocation(line: 809, column: 13, scope: !768)
!958 = !DILocation(line: 809, column: 27, scope: !768)
!959 = !DILocation(line: 810, column: 28, scope: !768)
!960 = !DILocation(line: 810, column: 37, scope: !768)
!961 = !DILocation(line: 810, column: 4, scope: !768)
!962 = !DILocation(line: 810, column: 13, scope: !768)
!963 = !DILocation(line: 810, column: 26, scope: !768)
!964 = !DILocation(line: 813, column: 21, scope: !768)
!965 = !DILocation(line: 813, column: 26, scope: !768)
!966 = !DILocation(line: 813, column: 4, scope: !768)
!967 = !DILocation(line: 814, column: 21, scope: !768)
!968 = !DILocation(line: 814, column: 25, scope: !768)
!969 = !DILocation(line: 814, column: 30, scope: !768)
!970 = !DILocation(line: 814, column: 4, scope: !768)
!971 = !DILocation(line: 815, column: 23, scope: !768)
!972 = !DILocation(line: 815, column: 13, scope: !768)
!973 = !DILocation(line: 815, column: 4, scope: !768)
!974 = !DILocation(line: 815, column: 11, scope: !768)
!975 = !DILocation(line: 816, column: 23, scope: !768)
!976 = !DILocation(line: 816, column: 13, scope: !768)
!977 = !DILocation(line: 816, column: 4, scope: !768)
!978 = !DILocation(line: 816, column: 11, scope: !768)
!979 = !DILocation(line: 817, column: 24, scope: !768)
!980 = !DILocation(line: 817, column: 14, scope: !768)
!981 = !DILocation(line: 817, column: 4, scope: !768)
!982 = !DILocation(line: 817, column: 12, scope: !768)
!983 = !DILocation(line: 818, column: 24, scope: !768)
!984 = !DILocation(line: 818, column: 14, scope: !768)
!985 = !DILocation(line: 818, column: 4, scope: !768)
!986 = !DILocation(line: 818, column: 12, scope: !768)
!987 = !DILocation(line: 819, column: 24, scope: !768)
!988 = !DILocation(line: 819, column: 14, scope: !768)
!989 = !DILocation(line: 819, column: 4, scope: !768)
!990 = !DILocation(line: 819, column: 12, scope: !768)
!991 = !DILocation(line: 822, column: 29, scope: !768)
!992 = !DILocation(line: 822, column: 48, scope: !768)
!993 = !DILocation(line: 822, column: 4, scope: !768)
!994 = !DILocation(line: 825, column: 4, scope: !768)
!995 = !DILocation(line: 825, column: 13, scope: !768)
!996 = !DILocation(line: 825, column: 21, scope: !768)
!997 = !DILocation(line: 825, column: 28, scope: !768)
!998 = !DILocation(line: 826, column: 4, scope: !768)
!999 = !DILocation(line: 826, column: 13, scope: !768)
!1000 = !DILocation(line: 826, column: 21, scope: !768)
!1001 = !DILocation(line: 826, column: 27, scope: !768)
!1002 = !DILocation(line: 827, column: 38, scope: !768)
!1003 = !DILocation(line: 827, column: 30, scope: !768)
!1004 = !DILocation(line: 827, column: 4, scope: !768)
!1005 = !DILocation(line: 827, column: 13, scope: !768)
!1006 = !DILocation(line: 827, column: 21, scope: !768)
!1007 = !DILocation(line: 827, column: 28, scope: !768)
!1008 = !DILocation(line: 829, column: 10, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !768, file: !3, line: 829, column: 8)
!1010 = !DILocation(line: 829, column: 19, scope: !1009)
!1011 = !DILocation(line: 829, column: 9, scope: !1009)
!1012 = !DILocation(line: 829, column: 8, scope: !768)
!1013 = !DILocation(line: 831, column: 11, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 831, column: 11)
!1015 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 830, column: 4)
!1016 = !DILocation(line: 831, column: 20, scope: !1014)
!1017 = !DILocation(line: 831, column: 31, scope: !1014)
!1018 = !DILocation(line: 831, column: 57, scope: !1014)
!1019 = !DILocation(line: 832, column: 11, scope: !1014)
!1020 = !DILocation(line: 832, column: 20, scope: !1014)
!1021 = !DILocation(line: 832, column: 30, scope: !1014)
!1022 = !DILocation(line: 831, column: 11, scope: !1015)
!1023 = !DILocation(line: 833, column: 10, scope: !1014)
!1024 = !DILocation(line: 833, column: 19, scope: !1014)
!1025 = !DILocation(line: 833, column: 29, scope: !1014)
!1026 = !DILocation(line: 836, column: 10, scope: !1014)
!1027 = !DILocation(line: 836, column: 19, scope: !1014)
!1028 = !DILocation(line: 836, column: 29, scope: !1014)
!1029 = !DILocation(line: 837, column: 4, scope: !1015)
!1030 = !DILocation(line: 839, column: 10, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !768, file: !3, line: 839, column: 8)
!1032 = !DILocation(line: 839, column: 19, scope: !1031)
!1033 = !DILocation(line: 839, column: 25, scope: !1031)
!1034 = !DILocation(line: 839, column: 8, scope: !768)
!1035 = !DILocation(line: 841, column: 11, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 841, column: 11)
!1037 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 840, column: 4)
!1038 = !DILocation(line: 841, column: 20, scope: !1036)
!1039 = !DILocation(line: 841, column: 30, scope: !1036)
!1040 = !DILocation(line: 841, column: 11, scope: !1037)
!1041 = !DILocation(line: 842, column: 10, scope: !1036)
!1042 = !DILocation(line: 842, column: 19, scope: !1036)
!1043 = !DILocation(line: 842, column: 33, scope: !1036)
!1044 = !DILocation(line: 845, column: 10, scope: !1036)
!1045 = !DILocation(line: 845, column: 19, scope: !1036)
!1046 = !DILocation(line: 845, column: 33, scope: !1036)
!1047 = !DILocation(line: 846, column: 4, scope: !1037)
!1048 = !DILocation(line: 848, column: 10, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !768, file: !3, line: 848, column: 8)
!1050 = !DILocation(line: 848, column: 19, scope: !1049)
!1051 = !DILocation(line: 848, column: 25, scope: !1049)
!1052 = !DILocation(line: 848, column: 8, scope: !768)
!1053 = !DILocation(line: 849, column: 7, scope: !1049)
!1054 = !DILocation(line: 849, column: 16, scope: !1049)
!1055 = !DILocation(line: 849, column: 27, scope: !1049)
!1056 = !DILocation(line: 851, column: 10, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !768, file: !3, line: 851, column: 8)
!1058 = !DILocation(line: 851, column: 19, scope: !1057)
!1059 = !DILocation(line: 851, column: 25, scope: !1057)
!1060 = !DILocation(line: 851, column: 8, scope: !768)
!1061 = !DILocation(line: 852, column: 7, scope: !1057)
!1062 = !DILocation(line: 852, column: 16, scope: !1057)
!1063 = !DILocation(line: 852, column: 31, scope: !1057)
!1064 = !DILocation(line: 854, column: 10, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !768, file: !3, line: 854, column: 8)
!1066 = !DILocation(line: 854, column: 19, scope: !1065)
!1067 = !DILocation(line: 854, column: 25, scope: !1065)
!1068 = !DILocation(line: 854, column: 8, scope: !768)
!1069 = !DILocation(line: 855, column: 7, scope: !1065)
!1070 = !DILocation(line: 855, column: 16, scope: !1065)
!1071 = !DILocation(line: 855, column: 33, scope: !1065)
!1072 = !DILocation(line: 857, column: 10, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !768, file: !3, line: 857, column: 8)
!1074 = !DILocation(line: 857, column: 19, scope: !1073)
!1075 = !DILocation(line: 857, column: 25, scope: !1073)
!1076 = !DILocation(line: 857, column: 8, scope: !768)
!1077 = !DILocation(line: 858, column: 7, scope: !1073)
!1078 = !DILocation(line: 858, column: 16, scope: !1073)
!1079 = !DILocation(line: 858, column: 28, scope: !1073)
!1080 = !DILocation(line: 862, column: 10, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !768, file: !3, line: 862, column: 8)
!1082 = !DILocation(line: 862, column: 19, scope: !1081)
!1083 = !DILocation(line: 862, column: 25, scope: !1081)
!1084 = !DILocation(line: 862, column: 8, scope: !768)
!1085 = !DILocation(line: 863, column: 7, scope: !1081)
!1086 = !DILocation(line: 863, column: 16, scope: !1081)
!1087 = !DILocation(line: 863, column: 35, scope: !1081)
!1088 = !DILocation(line: 865, column: 10, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !768, file: !3, line: 865, column: 8)
!1090 = !DILocation(line: 865, column: 19, scope: !1089)
!1091 = !DILocation(line: 865, column: 25, scope: !1089)
!1092 = !DILocation(line: 865, column: 8, scope: !768)
!1093 = !DILocation(line: 866, column: 34, scope: !1089)
!1094 = !DILocation(line: 866, column: 43, scope: !1089)
!1095 = !DILocation(line: 866, column: 7, scope: !1089)
!1096 = !DILocation(line: 866, column: 16, scope: !1089)
!1097 = !DILocation(line: 866, column: 32, scope: !1089)
!1098 = !DILocation(line: 868, column: 10, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !768, file: !3, line: 868, column: 8)
!1100 = !DILocation(line: 868, column: 19, scope: !1099)
!1101 = !DILocation(line: 868, column: 25, scope: !1099)
!1102 = !DILocation(line: 868, column: 8, scope: !768)
!1103 = !DILocation(line: 869, column: 38, scope: !1099)
!1104 = !DILocation(line: 869, column: 47, scope: !1099)
!1105 = !DILocation(line: 869, column: 7, scope: !1099)
!1106 = !DILocation(line: 869, column: 16, scope: !1099)
!1107 = !DILocation(line: 869, column: 36, scope: !1099)
!1108 = !DILocation(line: 871, column: 10, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !768, file: !3, line: 871, column: 8)
!1110 = !DILocation(line: 871, column: 19, scope: !1109)
!1111 = !DILocation(line: 871, column: 25, scope: !1109)
!1112 = !DILocation(line: 871, column: 8, scope: !768)
!1113 = !DILocation(line: 872, column: 40, scope: !1109)
!1114 = !DILocation(line: 872, column: 49, scope: !1109)
!1115 = !DILocation(line: 872, column: 7, scope: !1109)
!1116 = !DILocation(line: 872, column: 16, scope: !1109)
!1117 = !DILocation(line: 872, column: 38, scope: !1109)
!1118 = !DILocation(line: 874, column: 10, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !768, file: !3, line: 874, column: 8)
!1120 = !DILocation(line: 874, column: 19, scope: !1119)
!1121 = !DILocation(line: 874, column: 25, scope: !1119)
!1122 = !DILocation(line: 874, column: 8, scope: !768)
!1123 = !DILocation(line: 875, column: 35, scope: !1119)
!1124 = !DILocation(line: 875, column: 44, scope: !1119)
!1125 = !DILocation(line: 875, column: 7, scope: !1119)
!1126 = !DILocation(line: 875, column: 16, scope: !1119)
!1127 = !DILocation(line: 875, column: 33, scope: !1119)
!1128 = !DILocation(line: 886, column: 4, scope: !768)
!1129 = !DILocation(line: 886, column: 13, scope: !768)
!1130 = !DILocation(line: 886, column: 24, scope: !768)
!1131 = !DILocation(line: 888, column: 4, scope: !768)
!1132 = !DILocation(line: 888, column: 13, scope: !768)
!1133 = !DILocation(line: 888, column: 18, scope: !768)
!1134 = !DILocation(line: 889, column: 1, scope: !768)
!1135 = distinct !DISubprogram(name: "png_write_PLTE", scope: !3, file: !3, line: 896, type: !1136, scopeLine: 898, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !464, retainedNodes: !465)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !6, !1138, !85}
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_colorp", file: !7, line: 560, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!1141 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !1135, file: !3, line: 896, type: !6)
!1142 = !DILocation(line: 896, column: 28, scope: !1135)
!1143 = !DILocalVariable(name: "palette", arg: 2, scope: !1135, file: !3, line: 896, type: !1138)
!1144 = !DILocation(line: 896, column: 54, scope: !1135)
!1145 = !DILocalVariable(name: "num_pal", arg: 3, scope: !1135, file: !3, line: 897, type: !85)
!1146 = !DILocation(line: 897, column: 17, scope: !1135)
!1147 = !DILocalVariable(name: "i", scope: !1135, file: !3, line: 899, type: !85)
!1148 = !DILocation(line: 899, column: 16, scope: !1135)
!1149 = !DILocalVariable(name: "pal_ptr", scope: !1135, file: !3, line: 900, type: !1138)
!1150 = !DILocation(line: 900, column: 21, scope: !1135)
!1151 = !DILocalVariable(name: "buf", scope: !1135, file: !3, line: 901, type: !1152)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 24, elements: !1153)
!1153 = !{!1154}
!1154 = !DISubrange(count: 3)
!1155 = !DILocation(line: 901, column: 13, scope: !1135)
!1156 = !DILocation(line: 907, column: 10, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 905, column: 8)
!1158 = !DILocation(line: 907, column: 19, scope: !1157)
!1159 = !DILocation(line: 907, column: 42, scope: !1157)
!1160 = !DILocation(line: 907, column: 69, scope: !1157)
!1161 = !DILocation(line: 909, column: 8, scope: !1157)
!1162 = !DILocation(line: 909, column: 16, scope: !1157)
!1163 = !DILocation(line: 909, column: 22, scope: !1157)
!1164 = !DILocation(line: 909, column: 25, scope: !1157)
!1165 = !DILocation(line: 909, column: 33, scope: !1157)
!1166 = !DILocation(line: 905, column: 8, scope: !1135)
!1167 = !DILocation(line: 911, column: 11, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 911, column: 11)
!1169 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 910, column: 4)
!1170 = !DILocation(line: 911, column: 20, scope: !1168)
!1171 = !DILocation(line: 911, column: 31, scope: !1168)
!1172 = !DILocation(line: 911, column: 11, scope: !1169)
!1173 = !DILocation(line: 913, column: 20, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 912, column: 7)
!1175 = !DILocation(line: 913, column: 10, scope: !1174)
!1176 = !DILocation(line: 918, column: 22, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 917, column: 7)
!1178 = !DILocation(line: 918, column: 10, scope: !1177)
!1179 = !DILocation(line: 919, column: 10, scope: !1177)
!1180 = !DILocation(line: 923, column: 10, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 923, column: 8)
!1182 = !DILocation(line: 923, column: 19, scope: !1181)
!1183 = !DILocation(line: 923, column: 29, scope: !1181)
!1184 = !DILocation(line: 923, column: 8, scope: !1135)
!1185 = !DILocation(line: 925, column: 19, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1181, file: !3, line: 924, column: 4)
!1187 = !DILocation(line: 925, column: 7, scope: !1186)
!1188 = !DILocation(line: 928, column: 7, scope: !1186)
!1189 = !DILocation(line: 931, column: 40, scope: !1135)
!1190 = !DILocation(line: 931, column: 27, scope: !1135)
!1191 = !DILocation(line: 931, column: 4, scope: !1135)
!1192 = !DILocation(line: 931, column: 13, scope: !1135)
!1193 = !DILocation(line: 931, column: 25, scope: !1135)
!1194 = !DILocation(line: 934, column: 27, scope: !1135)
!1195 = !DILocation(line: 934, column: 60, scope: !1135)
!1196 = !DILocation(line: 934, column: 68, scope: !1135)
!1197 = !DILocation(line: 934, column: 4, scope: !1135)
!1198 = !DILocation(line: 937, column: 11, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 937, column: 4)
!1200 = !DILocation(line: 937, column: 26, scope: !1199)
!1201 = !DILocation(line: 937, column: 24, scope: !1199)
!1202 = !DILocation(line: 937, column: 9, scope: !1199)
!1203 = !DILocation(line: 937, column: 35, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 937, column: 4)
!1205 = !DILocation(line: 937, column: 39, scope: !1204)
!1206 = !DILocation(line: 937, column: 37, scope: !1204)
!1207 = !DILocation(line: 937, column: 4, scope: !1199)
!1208 = !DILocation(line: 939, column: 16, scope: !1209)
