; ModuleID = 'blender/source/blender/blenkernel/intern/mball.c'
source_filename = "blender/source/blender/blenkernel/intern/mball.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cubetable", scope: !2, file: !3, line: 885, type: !1731, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !41, globals: !1713, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/mball.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !21, !35}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 339, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!24 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!29 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!30 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!31 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!32 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!33 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!34 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eEvaluationMode", file: !36, line: 62, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "DAG_EVAL_VIEWPORT", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "DAG_EVAL_PREVIEW", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "DAG_EVAL_RENDER", value: 2, isUnsigned: true)
!41 = !{!42, !48, !78, !113, !114, !141, !1461, !1642, !1643, !1645, !1650, !1659, !1685, !1672, !1694, !1700}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !44, line: 130, baseType: !45)
!44 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !44, line: 117, size: 960, elements: !46)
!46 = !{!47, !49, !50, !52, !71, !75, !77, !79, !80, !81}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !45, file: !44, line: 118, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !45, file: !44, line: 118, baseType: !48, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !45, file: !44, line: 119, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !45, file: !44, line: 120, baseType: !53, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !44, line: 136, size: 17600, elements: !55)
!55 = !{!56, !57, !58, !61, !66, !67, !68}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !54, file: !44, line: 137, baseType: !43, size: 960)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !54, file: !44, line: 138, baseType: !42, size: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !54, file: !44, line: 139, baseType: !59, size: 64, offset: 1024)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !44, line: 43, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !44, line: 140, baseType: !62, size: 8192, offset: 1088)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 8192, elements: !64)
!63 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!65}
!65 = !DISubrange(count: 1024)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !54, file: !44, line: 141, baseType: !62, size: 8192, offset: 9280)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !54, file: !44, line: 148, baseType: !53, size: 64, offset: 17472)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !54, file: !44, line: 150, baseType: !69, size: 64, offset: 17536)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !44, line: 45, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !45, file: !44, line: 121, baseType: !72, size: 528, offset: 256)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 528, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 66)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !45, file: !44, line: 126, baseType: !76, size: 16, offset: 784)
!76 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !45, file: !44, line: 127, baseType: !78, size: 32, offset: 800)
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !45, file: !44, line: 128, baseType: !78, size: 32, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !45, file: !44, line: 128, baseType: !78, size: 32, offset: 864)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !45, file: !44, line: 129, baseType: !82, size: 64, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !44, line: 75, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !44, line: 62, size: 1024, elements: !85)
!85 = !{!86, !88, !89, !90, !91, !92, !96, !97, !111, !112}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !44, line: 63, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !84, file: !44, line: 63, baseType: !87, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !44, line: 64, baseType: !63, size: 8, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !84, file: !44, line: 64, baseType: !63, size: 8, offset: 136)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !84, file: !44, line: 65, baseType: !76, size: 16, offset: 144)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !44, line: 66, baseType: !93, size: 512, offset: 160)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !84, file: !44, line: 67, baseType: !78, size: 32, offset: 672)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !84, file: !44, line: 69, baseType: !98, size: 256, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !44, line: 60, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !44, line: 48, size: 256, elements: !100)
!100 = !{!101, !102, !109, !110}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !99, file: !44, line: 49, baseType: !48, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !99, file: !44, line: 58, baseType: !103, size: 128, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !104, line: 71, baseType: !105)
!104 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !104, line: 69, size: 128, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !105, file: !104, line: 70, baseType: !48, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !105, file: !104, line: 70, baseType: !48, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !99, file: !44, line: 59, baseType: !78, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !99, file: !44, line: 59, baseType: !78, size: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !84, file: !44, line: 70, baseType: !78, size: 32, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !84, file: !44, line: 74, baseType: !78, size: 32, offset: 992)
!113 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "MetaBall", file: !116, line: 95, baseType: !117)
!116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meta_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MetaBall", file: !116, line: 64, size: 1984, elements: !118)
!118 = !{!119, !120, !124, !125, !126, !128, !131, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !117, file: !116, line: 65, baseType: !43, size: 960)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !117, file: !116, line: 66, baseType: !121, size: 64, offset: 960)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !123, line: 48, flags: DIFlagFwdDecl)
!123 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!124 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !117, file: !116, line: 68, baseType: !103, size: 128, offset: 1024)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !117, file: !116, line: 69, baseType: !103, size: 128, offset: 1152)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "editelems", scope: !117, file: !116, line: 70, baseType: !127, size: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !117, file: !116, line: 71, baseType: !129, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !123, line: 49, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !117, file: !116, line: 74, baseType: !132, size: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !123, line: 93, size: 7552, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !188, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !257, !258, !259, !260, !261, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1604}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !134, file: !123, line: 94, baseType: !43, size: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !134, file: !123, line: 95, baseType: !121, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !134, file: !123, line: 97, baseType: !76, size: 16, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !123, line: 97, baseType: !76, size: 16, offset: 1040)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !134, file: !123, line: 99, baseType: !141, size: 32, offset: 1056)
!141 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !134, file: !123, line: 99, baseType: !141, size: 32, offset: 1088)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !134, file: !123, line: 99, baseType: !141, size: 32, offset: 1120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !134, file: !123, line: 100, baseType: !141, size: 32, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !134, file: !123, line: 100, baseType: !141, size: 32, offset: 1184)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !134, file: !123, line: 100, baseType: !141, size: 32, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !134, file: !123, line: 101, baseType: !141, size: 32, offset: 1248)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !134, file: !123, line: 101, baseType: !141, size: 32, offset: 1280)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !134, file: !123, line: 101, baseType: !141, size: 32, offset: 1312)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !134, file: !123, line: 102, baseType: !141, size: 32, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !134, file: !123, line: 102, baseType: !141, size: 32, offset: 1376)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !134, file: !123, line: 102, baseType: !141, size: 32, offset: 1408)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !134, file: !123, line: 103, baseType: !141, size: 32, offset: 1440)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !134, file: !123, line: 103, baseType: !141, size: 32, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !134, file: !123, line: 103, baseType: !141, size: 32, offset: 1504)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !134, file: !123, line: 103, baseType: !141, size: 32, offset: 1536)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !134, file: !123, line: 103, baseType: !141, size: 32, offset: 1568)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !134, file: !123, line: 104, baseType: !141, size: 32, offset: 1600)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !134, file: !123, line: 104, baseType: !141, size: 32, offset: 1632)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !134, file: !123, line: 104, baseType: !141, size: 32, offset: 1664)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !134, file: !123, line: 104, baseType: !141, size: 32, offset: 1696)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !134, file: !123, line: 104, baseType: !141, size: 32, offset: 1728)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !134, file: !123, line: 105, baseType: !141, size: 32, offset: 1760)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !134, file: !123, line: 108, baseType: !165, size: 704, offset: 1792)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !123, line: 53, size: 704, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !165, file: !123, line: 54, baseType: !141, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !165, file: !123, line: 55, baseType: !141, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !165, file: !123, line: 56, baseType: !141, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !165, file: !123, line: 57, baseType: !141, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !165, file: !123, line: 59, baseType: !172, size: 96, offset: 128)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 96, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 3)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !165, file: !123, line: 60, baseType: !172, size: 96, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !165, file: !123, line: 61, baseType: !172, size: 96, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !165, file: !123, line: 63, baseType: !141, size: 32, offset: 416)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !165, file: !123, line: 64, baseType: !141, size: 32, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !165, file: !123, line: 65, baseType: !141, size: 32, offset: 480)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !165, file: !123, line: 67, baseType: !76, size: 16, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !165, file: !123, line: 68, baseType: !76, size: 16, offset: 528)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !165, file: !123, line: 69, baseType: !76, size: 16, offset: 544)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !165, file: !123, line: 70, baseType: !76, size: 16, offset: 560)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !165, file: !123, line: 72, baseType: !141, size: 32, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !165, file: !123, line: 73, baseType: !141, size: 32, offset: 608)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !165, file: !123, line: 74, baseType: !141, size: 32, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !165, file: !123, line: 75, baseType: !141, size: 32, offset: 672)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !134, file: !123, line: 109, baseType: !189, size: 128, offset: 2496)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !123, line: 79, size: 128, elements: !190)
!190 = !{!191, !192, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !189, file: !123, line: 80, baseType: !78, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !189, file: !123, line: 81, baseType: !78, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !189, file: !123, line: 82, baseType: !78, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !189, file: !123, line: 83, baseType: !78, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !134, file: !123, line: 111, baseType: !141, size: 32, offset: 2624)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !134, file: !123, line: 111, baseType: !141, size: 32, offset: 2656)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !134, file: !123, line: 112, baseType: !141, size: 32, offset: 2688)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !134, file: !123, line: 112, baseType: !141, size: 32, offset: 2720)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !134, file: !123, line: 113, baseType: !141, size: 32, offset: 2752)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !134, file: !123, line: 114, baseType: !141, size: 32, offset: 2784)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !134, file: !123, line: 114, baseType: !141, size: 32, offset: 2816)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !134, file: !123, line: 115, baseType: !76, size: 16, offset: 2848)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !134, file: !123, line: 115, baseType: !76, size: 16, offset: 2864)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !134, file: !123, line: 116, baseType: !76, size: 16, offset: 2880)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !134, file: !123, line: 117, baseType: !63, size: 8, offset: 2896)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !134, file: !123, line: 117, baseType: !63, size: 8, offset: 2904)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !134, file: !123, line: 119, baseType: !141, size: 32, offset: 2912)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !134, file: !123, line: 119, baseType: !141, size: 32, offset: 2944)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !134, file: !123, line: 120, baseType: !76, size: 16, offset: 2976)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !134, file: !123, line: 120, baseType: !76, size: 16, offset: 2992)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !134, file: !123, line: 121, baseType: !141, size: 32, offset: 3008)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !134, file: !123, line: 121, baseType: !141, size: 32, offset: 3040)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !134, file: !123, line: 122, baseType: !141, size: 32, offset: 3072)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !134, file: !123, line: 123, baseType: !141, size: 32, offset: 3104)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !134, file: !123, line: 124, baseType: !76, size: 16, offset: 3136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !134, file: !123, line: 125, baseType: !76, size: 16, offset: 3152)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !134, file: !123, line: 127, baseType: !78, size: 32, offset: 3168)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !134, file: !123, line: 127, baseType: !78, size: 32, offset: 3200)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !134, file: !123, line: 128, baseType: !78, size: 32, offset: 3232)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !134, file: !123, line: 128, baseType: !78, size: 32, offset: 3264)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !134, file: !123, line: 129, baseType: !76, size: 16, offset: 3296)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !134, file: !123, line: 129, baseType: !76, size: 16, offset: 3312)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !134, file: !123, line: 129, baseType: !76, size: 16, offset: 3328)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !134, file: !123, line: 129, baseType: !76, size: 16, offset: 3344)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !134, file: !123, line: 130, baseType: !141, size: 32, offset: 3360)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !134, file: !123, line: 130, baseType: !141, size: 32, offset: 3392)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !134, file: !123, line: 130, baseType: !141, size: 32, offset: 3424)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !134, file: !123, line: 130, baseType: !141, size: 32, offset: 3456)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !134, file: !123, line: 131, baseType: !141, size: 32, offset: 3488)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !134, file: !123, line: 131, baseType: !141, size: 32, offset: 3520)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !134, file: !123, line: 131, baseType: !141, size: 32, offset: 3552)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !134, file: !123, line: 131, baseType: !141, size: 32, offset: 3584)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !134, file: !123, line: 132, baseType: !141, size: 32, offset: 3616)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !134, file: !123, line: 132, baseType: !141, size: 32, offset: 3648)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !134, file: !123, line: 133, baseType: !93, size: 512, offset: 3680)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !134, file: !123, line: 135, baseType: !141, size: 32, offset: 4192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !134, file: !123, line: 136, baseType: !141, size: 32, offset: 4224)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !134, file: !123, line: 137, baseType: !141, size: 32, offset: 4256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !134, file: !123, line: 138, baseType: !78, size: 32, offset: 4288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !134, file: !123, line: 141, baseType: !63, size: 8, offset: 4320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !134, file: !123, line: 141, baseType: !63, size: 8, offset: 4328)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !134, file: !123, line: 141, baseType: !63, size: 8, offset: 4336)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !134, file: !123, line: 141, baseType: !63, size: 8, offset: 4344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !134, file: !123, line: 142, baseType: !76, size: 16, offset: 4352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !134, file: !123, line: 142, baseType: !76, size: 16, offset: 4368)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !134, file: !123, line: 142, baseType: !76, size: 16, offset: 4384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !134, file: !123, line: 145, baseType: !63, size: 8, offset: 4400)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !134, file: !123, line: 145, baseType: !63, size: 8, offset: 4408)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !134, file: !123, line: 148, baseType: !76, size: 16, offset: 4416)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !134, file: !123, line: 148, baseType: !76, size: 16, offset: 4432)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !134, file: !123, line: 149, baseType: !141, size: 32, offset: 4448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !134, file: !123, line: 149, baseType: !141, size: 32, offset: 4480)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !134, file: !123, line: 152, baseType: !254, size: 128, offset: 4512)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 4)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !134, file: !123, line: 153, baseType: !141, size: 32, offset: 4640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !134, file: !123, line: 154, baseType: !141, size: 32, offset: 4672)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !134, file: !123, line: 157, baseType: !76, size: 16, offset: 4704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !134, file: !123, line: 157, baseType: !76, size: 16, offset: 4720)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !134, file: !123, line: 160, baseType: !262, size: 64, offset: 4736)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !264, line: 113, size: 6208, elements: !265)
!264 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!265 = !{!266, !267, !268, !269, !270, !271, !275}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !263, file: !264, line: 114, baseType: !76, size: 16)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !263, file: !264, line: 114, baseType: !76, size: 16, offset: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !263, file: !264, line: 115, baseType: !63, size: 8, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !263, file: !264, line: 115, baseType: !63, size: 8, offset: 40)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !263, file: !264, line: 116, baseType: !63, size: 8, offset: 48)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !263, file: !264, line: 117, baseType: !272, size: 8, offset: 56)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 8, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 1)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !264, line: 119, baseType: !276, size: 6144, offset: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 6144, elements: !286)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !264, line: 109, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !264, line: 106, size: 192, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !278, file: !264, line: 107, baseType: !141, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !278, file: !264, line: 107, baseType: !141, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !278, file: !264, line: 107, baseType: !141, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !278, file: !264, line: 107, baseType: !141, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !278, file: !264, line: 107, baseType: !141, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !278, file: !264, line: 108, baseType: !78, size: 32, offset: 160)
!286 = !{!287}
!287 = !DISubrange(count: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !134, file: !123, line: 161, baseType: !262, size: 64, offset: 4800)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !134, file: !123, line: 162, baseType: !63, size: 8, offset: 4864)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !134, file: !123, line: 162, baseType: !63, size: 8, offset: 4872)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !134, file: !123, line: 163, baseType: !63, size: 8, offset: 4880)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !134, file: !123, line: 163, baseType: !63, size: 8, offset: 4888)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !134, file: !123, line: 164, baseType: !76, size: 16, offset: 4896)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !134, file: !123, line: 164, baseType: !76, size: 16, offset: 4912)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !134, file: !123, line: 165, baseType: !141, size: 32, offset: 4928)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !134, file: !123, line: 165, baseType: !141, size: 32, offset: 4960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !134, file: !123, line: 167, baseType: !298, size: 1152, offset: 4992)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 1152, elements: !1562)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !264, line: 57, size: 2496, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !1356, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !300, file: !264, line: 59, baseType: !76, size: 16)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !300, file: !264, line: 59, baseType: !76, size: 16, offset: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !300, file: !264, line: 59, baseType: !76, size: 16, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !300, file: !264, line: 59, baseType: !76, size: 16, offset: 48)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !300, file: !264, line: 60, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !22, line: 115, size: 11392, elements: !309)
!309 = !{!310, !311, !312, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !337, !351, !352, !393, !394, !397, !398, !414, !415, !416, !417, !418, !419, !420, !421, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !498, !499, !500, !501, !502, !503, !504, !505, !506, !509, !512, !515, !516, !517, !518, !519, !522, !533, !536, !537, !543, !544, !545, !546, !547, !548, !549, !552, !555, !559, !1344, !1345}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !308, file: !22, line: 116, baseType: !43, size: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !308, file: !22, line: 117, baseType: !121, size: 64, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !308, file: !22, line: 119, baseType: !313, size: 64, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !22, line: 57, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !22, line: 121, baseType: !76, size: 16, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !308, file: !22, line: 121, baseType: !76, size: 16, offset: 1104)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !308, file: !22, line: 122, baseType: !78, size: 32, offset: 1120)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !308, file: !22, line: 122, baseType: !78, size: 32, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !308, file: !22, line: 122, baseType: !78, size: 32, offset: 1184)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !308, file: !22, line: 123, baseType: !93, size: 512, offset: 1216)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !22, line: 124, baseType: !307, size: 64, offset: 1728)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !308, file: !22, line: 124, baseType: !307, size: 64, offset: 1792)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !308, file: !22, line: 127, baseType: !307, size: 64, offset: 1856)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !308, file: !22, line: 127, baseType: !307, size: 64, offset: 1920)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !308, file: !22, line: 127, baseType: !307, size: 64, offset: 1984)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !308, file: !22, line: 128, baseType: !129, size: 64, offset: 2048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !308, file: !22, line: 130, baseType: !328, size: 64, offset: 2112)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !22, line: 97, size: 832, elements: !330)
!330 = !{!331, !335, !336}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !329, file: !22, line: 98, baseType: !332, size: 768)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 768, elements: !333)
!333 = !{!334, !174}
!334 = !DISubrange(count: 8)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !329, file: !22, line: 99, baseType: !78, size: 32, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !329, file: !22, line: 99, baseType: !78, size: 32, offset: 800)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !308, file: !22, line: 131, baseType: !338, size: 64, offset: 2176)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !340, line: 486, size: 1600, elements: !341)
!340 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !339, file: !340, line: 487, baseType: !43, size: 960)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !339, file: !340, line: 489, baseType: !103, size: 128, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !339, file: !340, line: 490, baseType: !103, size: 128, offset: 1088)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !339, file: !340, line: 491, baseType: !103, size: 128, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !339, file: !340, line: 492, baseType: !103, size: 128, offset: 1344)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !339, file: !340, line: 494, baseType: !78, size: 32, offset: 1472)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !339, file: !340, line: 495, baseType: !78, size: 32, offset: 1504)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !339, file: !340, line: 497, baseType: !78, size: 32, offset: 1536)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !339, file: !340, line: 498, baseType: !78, size: 32, offset: 1568)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !308, file: !22, line: 132, baseType: !338, size: 64, offset: 2240)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !308, file: !22, line: 133, baseType: !353, size: 64, offset: 2304)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !340, line: 334, size: 1728, elements: !355)
!355 = !{!356, !357, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !392}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !354, file: !340, line: 335, baseType: !103, size: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !354, file: !340, line: 336, baseType: !358, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !340, line: 47, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !340, line: 338, baseType: !76, size: 16, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !354, file: !340, line: 338, baseType: !76, size: 16, offset: 208)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !354, file: !340, line: 339, baseType: !7, size: 32, offset: 224)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !354, file: !340, line: 340, baseType: !78, size: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !354, file: !340, line: 342, baseType: !141, size: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !354, file: !340, line: 343, baseType: !172, size: 96, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !354, file: !340, line: 344, baseType: !172, size: 96, offset: 416)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !354, file: !340, line: 347, baseType: !103, size: 128, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !354, file: !340, line: 349, baseType: !78, size: 32, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !354, file: !340, line: 350, baseType: !78, size: 32, offset: 672)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !354, file: !340, line: 351, baseType: !48, size: 64, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !354, file: !340, line: 352, baseType: !48, size: 64, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !354, file: !340, line: 354, baseType: !373, size: 384, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !340, line: 116, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !340, line: 94, size: 384, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !374, file: !340, line: 96, baseType: !78, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !374, file: !340, line: 96, baseType: !78, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !374, file: !340, line: 97, baseType: !78, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !374, file: !340, line: 97, baseType: !78, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !374, file: !340, line: 99, baseType: !76, size: 16, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !374, file: !340, line: 100, baseType: !76, size: 16, offset: 144)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !374, file: !340, line: 102, baseType: !76, size: 16, offset: 160)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !374, file: !340, line: 105, baseType: !76, size: 16, offset: 176)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !374, file: !340, line: 108, baseType: !76, size: 16, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !374, file: !340, line: 109, baseType: !76, size: 16, offset: 208)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !374, file: !340, line: 111, baseType: !76, size: 16, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !374, file: !340, line: 112, baseType: !76, size: 16, offset: 240)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !374, file: !340, line: 114, baseType: !78, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !374, file: !340, line: 114, baseType: !78, size: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !374, file: !340, line: 115, baseType: !78, size: 32, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !374, file: !340, line: 115, baseType: !78, size: 32, offset: 352)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !354, file: !340, line: 355, baseType: !93, size: 512, offset: 1216)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !22, line: 134, baseType: !48, size: 64, offset: 2368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !308, file: !22, line: 136, baseType: !395, size: 64, offset: 2432)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !22, line: 58, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !308, file: !22, line: 138, baseType: !373, size: 384, offset: 2496)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !308, file: !22, line: 139, baseType: !399, size: 64, offset: 2880)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !340, line: 80, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !340, line: 72, size: 192, elements: !402)
!402 = !{!403, !410, !411, !412, !413}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !401, file: !340, line: 73, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !340, line: 59, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !340, line: 56, size: 128, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !406, file: !340, line: 57, baseType: !172, size: 96)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !406, file: !340, line: 58, baseType: !78, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !401, file: !340, line: 74, baseType: !78, size: 32, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !401, file: !340, line: 76, baseType: !78, size: 32, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !401, file: !340, line: 77, baseType: !78, size: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !340, line: 79, baseType: !78, size: 32, offset: 160)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !308, file: !22, line: 141, baseType: !103, size: 128, offset: 2944)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !308, file: !22, line: 142, baseType: !103, size: 128, offset: 3072)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !308, file: !22, line: 143, baseType: !103, size: 128, offset: 3200)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !308, file: !22, line: 144, baseType: !103, size: 128, offset: 3328)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !308, file: !22, line: 146, baseType: !78, size: 32, offset: 3456)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !308, file: !22, line: 147, baseType: !78, size: 32, offset: 3488)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !308, file: !22, line: 150, baseType: !132, size: 64, offset: 3520)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !308, file: !22, line: 151, baseType: !422, size: 64, offset: 3584)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !308, file: !22, line: 152, baseType: !78, size: 32, offset: 3648)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !308, file: !22, line: 153, baseType: !78, size: 32, offset: 3680)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !308, file: !22, line: 156, baseType: !172, size: 96, offset: 3712)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !308, file: !22, line: 156, baseType: !172, size: 96, offset: 3808)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !308, file: !22, line: 156, baseType: !172, size: 96, offset: 3904)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !308, file: !22, line: 157, baseType: !172, size: 96, offset: 4000)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !308, file: !22, line: 158, baseType: !172, size: 96, offset: 4096)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !308, file: !22, line: 159, baseType: !172, size: 96, offset: 4192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !308, file: !22, line: 160, baseType: !172, size: 96, offset: 4288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !308, file: !22, line: 160, baseType: !172, size: 96, offset: 4384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !308, file: !22, line: 161, baseType: !254, size: 128, offset: 4480)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !308, file: !22, line: 161, baseType: !254, size: 128, offset: 4608)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !308, file: !22, line: 162, baseType: !172, size: 96, offset: 4736)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !308, file: !22, line: 162, baseType: !172, size: 96, offset: 4832)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !308, file: !22, line: 163, baseType: !141, size: 32, offset: 4928)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !308, file: !22, line: 163, baseType: !141, size: 32, offset: 4960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !308, file: !22, line: 164, baseType: !440, size: 512, offset: 4992)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 512, elements: !441)
!441 = !{!256, !256}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !308, file: !22, line: 165, baseType: !440, size: 512, offset: 5504)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !308, file: !22, line: 166, baseType: !440, size: 512, offset: 6016)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !308, file: !22, line: 167, baseType: !440, size: 512, offset: 6528)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !308, file: !22, line: 176, baseType: !440, size: 512, offset: 7040)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !308, file: !22, line: 178, baseType: !7, size: 32, offset: 7552)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !308, file: !22, line: 180, baseType: !76, size: 16, offset: 7584)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !308, file: !22, line: 181, baseType: !76, size: 16, offset: 7600)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !308, file: !22, line: 183, baseType: !76, size: 16, offset: 7616)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !308, file: !22, line: 183, baseType: !76, size: 16, offset: 7632)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !308, file: !22, line: 184, baseType: !76, size: 16, offset: 7648)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !308, file: !22, line: 184, baseType: !76, size: 16, offset: 7664)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !308, file: !22, line: 185, baseType: !76, size: 16, offset: 7680)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !308, file: !22, line: 186, baseType: !76, size: 16, offset: 7696)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !308, file: !22, line: 187, baseType: !76, size: 16, offset: 7712)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !308, file: !22, line: 188, baseType: !63, size: 8, offset: 7728)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !308, file: !22, line: 189, baseType: !63, size: 8, offset: 7736)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !308, file: !22, line: 192, baseType: !78, size: 32, offset: 7744)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !308, file: !22, line: 192, baseType: !78, size: 32, offset: 7776)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !308, file: !22, line: 192, baseType: !78, size: 32, offset: 7808)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !308, file: !22, line: 192, baseType: !78, size: 32, offset: 7840)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !308, file: !22, line: 194, baseType: !78, size: 32, offset: 7872)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !308, file: !22, line: 202, baseType: !141, size: 32, offset: 7904)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !308, file: !22, line: 202, baseType: !141, size: 32, offset: 7936)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !308, file: !22, line: 202, baseType: !141, size: 32, offset: 7968)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !308, file: !22, line: 211, baseType: !141, size: 32, offset: 8000)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !308, file: !22, line: 212, baseType: !141, size: 32, offset: 8032)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !308, file: !22, line: 213, baseType: !141, size: 32, offset: 8064)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !308, file: !22, line: 214, baseType: !141, size: 32, offset: 8096)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !308, file: !22, line: 215, baseType: !141, size: 32, offset: 8128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !308, file: !22, line: 216, baseType: !141, size: 32, offset: 8160)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !308, file: !22, line: 219, baseType: !141, size: 32, offset: 8192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !308, file: !22, line: 220, baseType: !141, size: 32, offset: 8224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !308, file: !22, line: 221, baseType: !141, size: 32, offset: 8256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !308, file: !22, line: 224, baseType: !113, size: 16, offset: 8288)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !308, file: !22, line: 224, baseType: !113, size: 16, offset: 8304)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !308, file: !22, line: 226, baseType: !76, size: 16, offset: 8320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !308, file: !22, line: 228, baseType: !63, size: 8, offset: 8336)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !308, file: !22, line: 229, baseType: !63, size: 8, offset: 8344)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !308, file: !22, line: 231, baseType: !76, size: 16, offset: 8352)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !308, file: !22, line: 232, baseType: !63, size: 8, offset: 8368)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !308, file: !22, line: 233, baseType: !63, size: 8, offset: 8376)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !308, file: !22, line: 234, baseType: !141, size: 32, offset: 8384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !308, file: !22, line: 235, baseType: !141, size: 32, offset: 8416)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !308, file: !22, line: 237, baseType: !103, size: 128, offset: 8448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !308, file: !22, line: 238, baseType: !103, size: 128, offset: 8576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !308, file: !22, line: 239, baseType: !103, size: 128, offset: 8704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !308, file: !22, line: 240, baseType: !103, size: 128, offset: 8832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !308, file: !22, line: 242, baseType: !141, size: 32, offset: 8960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !308, file: !22, line: 244, baseType: !76, size: 16, offset: 8992)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !308, file: !22, line: 245, baseType: !113, size: 16, offset: 9008)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !308, file: !22, line: 246, baseType: !254, size: 128, offset: 9024)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !308, file: !22, line: 248, baseType: !78, size: 32, offset: 9152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !308, file: !22, line: 249, baseType: !78, size: 32, offset: 9184)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !308, file: !22, line: 251, baseType: !496, size: 64, offset: 9216)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !22, line: 251, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !308, file: !22, line: 253, baseType: !63, size: 8, offset: 9280)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !308, file: !22, line: 254, baseType: !63, size: 8, offset: 9288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !308, file: !22, line: 255, baseType: !76, size: 16, offset: 9296)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !308, file: !22, line: 256, baseType: !172, size: 96, offset: 9312)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !308, file: !22, line: 258, baseType: !103, size: 128, offset: 9408)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !308, file: !22, line: 259, baseType: !103, size: 128, offset: 9536)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !308, file: !22, line: 260, baseType: !103, size: 128, offset: 9664)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !308, file: !22, line: 261, baseType: !103, size: 128, offset: 9792)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !308, file: !22, line: 263, baseType: !507, size: 64, offset: 9920)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !22, line: 52, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !308, file: !22, line: 264, baseType: !510, size: 64, offset: 9984)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !22, line: 53, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !308, file: !22, line: 265, baseType: !513, size: 64, offset: 10048)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !123, line: 46, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !308, file: !22, line: 267, baseType: !63, size: 8, offset: 10112)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !308, file: !22, line: 268, baseType: !63, size: 8, offset: 10120)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !308, file: !22, line: 269, baseType: !76, size: 16, offset: 10128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !308, file: !22, line: 270, baseType: !141, size: 32, offset: 10144)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !308, file: !22, line: 272, baseType: !520, size: 64, offset: 10176)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !22, line: 54, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !308, file: !22, line: 275, baseType: !523, size: 64, offset: 10240)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !525, line: 49, size: 448, elements: !526)
!525 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!526 = !{!527, !528, !529, !530}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !524, file: !525, line: 50, baseType: !103, size: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !524, file: !525, line: 51, baseType: !103, size: 128, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !524, file: !525, line: 52, baseType: !103, size: 128, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !524, file: !525, line: 53, baseType: !531, size: 64, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !22, line: 49, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !308, file: !22, line: 277, baseType: !534, size: 64, offset: 10304)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !22, line: 56, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !308, file: !22, line: 277, baseType: !534, size: 64, offset: 10368)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !308, file: !22, line: 278, baseType: !538, size: 64, offset: 10432)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !539, line: 27, baseType: !540)
!539 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !541, line: 45, baseType: !542)
!541 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!542 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !308, file: !22, line: 279, baseType: !538, size: 64, offset: 10496)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !22, line: 280, baseType: !7, size: 32, offset: 10560)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !308, file: !22, line: 281, baseType: !7, size: 32, offset: 10592)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !308, file: !22, line: 283, baseType: !103, size: 128, offset: 10624)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !308, file: !22, line: 284, baseType: !103, size: 128, offset: 10752)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !308, file: !22, line: 285, baseType: !127, size: 64, offset: 10880)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !308, file: !22, line: 287, baseType: !550, size: 64, offset: 10944)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !22, line: 59, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !308, file: !22, line: 288, baseType: !553, size: 64, offset: 11008)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !22, line: 288, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !308, file: !22, line: 290, baseType: !556, size: 64, offset: 11072)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 2)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !308, file: !22, line: 291, baseType: !560, size: 64, offset: 11136)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !562, line: 65, baseType: !563)
!562 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !562, line: 50, size: 320, elements: !564)
!564 = !{!565, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !563, file: !562, line: 51, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !568, line: 1216, size: 39680, elements: !569)
!568 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!569 = !{!570, !571, !572, !573, !576, !577, !578, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !604, !607, !903, !906, !1204, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1226, !1227, !1228, !1229, !1230, !1238, !1305, !1312, !1313, !1320, !1323, !1324, !1325, !1326, !1327, !1328}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !567, file: !568, line: 1217, baseType: !43, size: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !567, file: !568, line: 1218, baseType: !121, size: 64, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !567, file: !568, line: 1220, baseType: !307, size: 64, offset: 1024)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !567, file: !568, line: 1221, baseType: !574, size: 64, offset: 1088)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !568, line: 52, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !567, file: !568, line: 1223, baseType: !566, size: 64, offset: 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !567, file: !568, line: 1225, baseType: !103, size: 128, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !567, file: !568, line: 1226, baseType: !579, size: 64, offset: 1344)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !568, line: 69, size: 320, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !580, file: !568, line: 70, baseType: !579, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !580, file: !568, line: 70, baseType: !579, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !580, file: !568, line: 71, baseType: !7, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !580, file: !568, line: 71, baseType: !7, size: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !580, file: !568, line: 72, baseType: !78, size: 32, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !580, file: !568, line: 73, baseType: !76, size: 16, offset: 224)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !580, file: !568, line: 73, baseType: !76, size: 16, offset: 240)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !580, file: !568, line: 74, baseType: !307, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !567, file: !568, line: 1227, baseType: !307, size: 64, offset: 1408)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !567, file: !568, line: 1229, baseType: !172, size: 96, offset: 1472)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !567, file: !568, line: 1230, baseType: !172, size: 96, offset: 1568)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !567, file: !568, line: 1231, baseType: !172, size: 96, offset: 1664)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !567, file: !568, line: 1231, baseType: !172, size: 96, offset: 1760)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !567, file: !568, line: 1233, baseType: !7, size: 32, offset: 1856)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !567, file: !568, line: 1234, baseType: !78, size: 32, offset: 1888)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !567, file: !568, line: 1235, baseType: !7, size: 32, offset: 1920)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !567, file: !568, line: 1237, baseType: !76, size: 16, offset: 1952)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !567, file: !568, line: 1239, baseType: !63, size: 8, offset: 1968)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !567, file: !568, line: 1240, baseType: !272, size: 8, offset: 1976)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !567, file: !568, line: 1242, baseType: !602, size: 64, offset: 1984)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !123, line: 47, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !567, file: !568, line: 1244, baseType: !605, size: 64, offset: 2048)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !568, line: 59, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !567, file: !568, line: 1246, baseType: !608, size: 64, offset: 2112)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !568, line: 1067, size: 5184, elements: !610)
!610 = !{!611, !642, !643, !658, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !680, !775, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !824, !825, !826, !827, !828, !829, !830, !831, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !886}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !609, file: !568, line: 1068, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !568, line: 934, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !568, line: 925, size: 576, elements: !615)
!615 = !{!616, !633, !634, !635, !636, !638, !641}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !614, file: !568, line: 926, baseType: !617, size: 320)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !568, line: 830, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !568, line: 813, size: 320, elements: !619)
!619 = !{!620, !623, !626, !627, !630, !631, !632}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !618, file: !568, line: 814, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !568, line: 51, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !618, file: !568, line: 815, baseType: !624, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !568, line: 815, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !618, file: !568, line: 818, baseType: !48, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !618, file: !568, line: 819, baseType: !628, size: 32, offset: 192)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 32, elements: !255)
!629 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !618, file: !568, line: 822, baseType: !78, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !618, file: !568, line: 826, baseType: !78, size: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !618, file: !568, line: 829, baseType: !78, size: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !614, file: !568, line: 928, baseType: !76, size: 16, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !614, file: !568, line: 928, baseType: !76, size: 16, offset: 336)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !614, file: !568, line: 929, baseType: !78, size: 32, offset: 352)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !614, file: !568, line: 930, baseType: !637, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !614, file: !568, line: 931, baseType: !639, size: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !568, line: 931, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !614, file: !568, line: 933, baseType: !48, size: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !609, file: !568, line: 1069, baseType: !612, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !609, file: !568, line: 1070, baseType: !644, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !568, line: 916, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !568, line: 891, size: 704, elements: !647)
!647 = !{!648, !649, !650, !652, !653, !654, !655, !656, !657}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !646, file: !568, line: 892, baseType: !617, size: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !646, file: !568, line: 896, baseType: !78, size: 32, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !646, file: !568, line: 900, baseType: !651, size: 96, offset: 352)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 96, elements: !173)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !646, file: !568, line: 903, baseType: !141, size: 32, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !646, file: !568, line: 906, baseType: !78, size: 32, offset: 480)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !646, file: !568, line: 909, baseType: !141, size: 32, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !646, file: !568, line: 912, baseType: !141, size: 32, offset: 544)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !646, file: !568, line: 914, baseType: !307, size: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !646, file: !568, line: 915, baseType: !48, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !609, file: !568, line: 1071, baseType: !659, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !568, line: 920, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !568, line: 918, size: 320, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !661, file: !568, line: 919, baseType: !617, size: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !609, file: !568, line: 1075, baseType: !141, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !609, file: !568, line: 1077, baseType: !141, size: 32, offset: 288)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !609, file: !568, line: 1078, baseType: !141, size: 32, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !609, file: !568, line: 1079, baseType: !76, size: 16, offset: 352)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !609, file: !568, line: 1082, baseType: !76, size: 16, offset: 368)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !609, file: !568, line: 1085, baseType: !63, size: 8, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !609, file: !568, line: 1086, baseType: !63, size: 8, offset: 392)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !609, file: !568, line: 1087, baseType: !63, size: 8, offset: 400)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !609, file: !568, line: 1088, baseType: !63, size: 8, offset: 408)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !609, file: !568, line: 1090, baseType: !141, size: 32, offset: 416)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !609, file: !568, line: 1093, baseType: !76, size: 16, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !609, file: !568, line: 1096, baseType: !63, size: 8, offset: 464)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !609, file: !568, line: 1098, baseType: !677, size: 40, offset: 472)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 40, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 5)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !609, file: !568, line: 1101, baseType: !681, size: 832, offset: 512)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !568, line: 836, size: 832, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !690, !691, !692, !771, !772, !773, !774}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !681, file: !568, line: 837, baseType: !617, size: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !681, file: !568, line: 839, baseType: !76, size: 16, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !681, file: !568, line: 839, baseType: !76, size: 16, offset: 336)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !681, file: !568, line: 842, baseType: !76, size: 16, offset: 352)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !681, file: !568, line: 842, baseType: !76, size: 16, offset: 368)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !681, file: !568, line: 843, baseType: !689, size: 32, offset: 384)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !557)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !681, file: !568, line: 845, baseType: !78, size: 32, offset: 416)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !681, file: !568, line: 847, baseType: !48, size: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !681, file: !568, line: 848, baseType: !693, size: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !562, line: 77, size: 15424, elements: !695)
!695 = !{!696, !697, !698, !701, !704, !707, !710, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !760, !761, !765}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !694, file: !562, line: 78, baseType: !43, size: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !694, file: !562, line: 80, baseType: !62, size: 8192, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !694, file: !562, line: 82, baseType: !699, size: 64, offset: 9152)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !562, line: 43, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !694, file: !562, line: 83, baseType: !702, size: 64, offset: 9216)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !44, line: 46, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !694, file: !562, line: 86, baseType: !705, size: 64, offset: 9280)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !562, line: 41, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !694, file: !562, line: 87, baseType: !708, size: 64, offset: 9344)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !562, line: 44, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !694, file: !562, line: 89, baseType: !711, size: 512, offset: 9408)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 512, elements: !712)
!712 = !{!334}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !694, file: !562, line: 90, baseType: !76, size: 16, offset: 9920)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !694, file: !562, line: 90, baseType: !76, size: 16, offset: 9936)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !694, file: !562, line: 92, baseType: !76, size: 16, offset: 9952)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !694, file: !562, line: 92, baseType: !76, size: 16, offset: 9968)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !694, file: !562, line: 93, baseType: !76, size: 16, offset: 9984)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !562, line: 93, baseType: !76, size: 16, offset: 10000)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !694, file: !562, line: 94, baseType: !78, size: 32, offset: 10016)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !694, file: !562, line: 97, baseType: !76, size: 16, offset: 10048)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !694, file: !562, line: 97, baseType: !76, size: 16, offset: 10064)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !694, file: !562, line: 98, baseType: !76, size: 16, offset: 10080)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !694, file: !562, line: 98, baseType: !76, size: 16, offset: 10096)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !694, file: !562, line: 99, baseType: !76, size: 16, offset: 10112)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !694, file: !562, line: 99, baseType: !76, size: 16, offset: 10128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !694, file: !562, line: 100, baseType: !7, size: 32, offset: 10144)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !694, file: !562, line: 101, baseType: !637, size: 64, offset: 10176)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !694, file: !562, line: 103, baseType: !69, size: 64, offset: 10240)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !694, file: !562, line: 104, baseType: !730, size: 64, offset: 10304)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !44, line: 159, size: 448, elements: !732)
!732 = !{!733, !735, !736, !737, !738, !740}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !731, file: !44, line: 161, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !557)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !731, file: !44, line: 162, baseType: !734, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !731, file: !44, line: 163, baseType: !689, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !731, file: !44, line: 164, baseType: !689, size: 32, offset: 160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !731, file: !44, line: 165, baseType: !739, size: 128, offset: 192)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 128, elements: !557)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !731, file: !44, line: 166, baseType: !741, size: 128, offset: 320)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 128, elements: !557)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !694, file: !562, line: 107, baseType: !141, size: 32, offset: 10368)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !694, file: !562, line: 108, baseType: !78, size: 32, offset: 10400)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !694, file: !562, line: 109, baseType: !76, size: 16, offset: 10432)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !694, file: !562, line: 110, baseType: !76, size: 16, offset: 10448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !694, file: !562, line: 113, baseType: !78, size: 32, offset: 10464)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !694, file: !562, line: 113, baseType: !78, size: 32, offset: 10496)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !694, file: !562, line: 114, baseType: !63, size: 8, offset: 10528)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !694, file: !562, line: 114, baseType: !63, size: 8, offset: 10536)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !694, file: !562, line: 115, baseType: !76, size: 16, offset: 10544)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !694, file: !562, line: 116, baseType: !254, size: 128, offset: 10560)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !694, file: !562, line: 119, baseType: !141, size: 32, offset: 10688)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !694, file: !562, line: 119, baseType: !141, size: 32, offset: 10720)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !694, file: !562, line: 122, baseType: !755, size: 512, offset: 10752)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !756, line: 182, baseType: !757)
!756 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !756, line: 180, size: 512, elements: !758)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !757, file: !756, line: 181, baseType: !93, size: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !694, file: !562, line: 123, baseType: !63, size: 8, offset: 11264)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !694, file: !562, line: 125, baseType: !762, size: 56, offset: 11272)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 56, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 7)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !694, file: !562, line: 126, baseType: !766, size: 4096, offset: 11328)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 4096, elements: !712)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !562, line: 69, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !562, line: 67, size: 512, elements: !769)
!769 = !{!770}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !562, line: 68, baseType: !93, size: 512)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !681, file: !568, line: 849, baseType: !693, size: 64, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !681, file: !568, line: 850, baseType: !693, size: 64, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !681, file: !568, line: 851, baseType: !172, size: 96, offset: 704)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !681, file: !568, line: 852, baseType: !141, size: 32, offset: 800)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !609, file: !568, line: 1104, baseType: !776, size: 1344, offset: 1344)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !568, line: 867, size: 1344, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !776, file: !568, line: 868, baseType: !76, size: 16)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !776, file: !568, line: 869, baseType: !76, size: 16, offset: 16)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !776, file: !568, line: 870, baseType: !76, size: 16, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !776, file: !568, line: 871, baseType: !76, size: 16, offset: 48)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !776, file: !568, line: 873, baseType: !783, size: 896, offset: 64)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 896, elements: !763)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !568, line: 864, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !568, line: 859, size: 128, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !785, file: !568, line: 860, baseType: !76, size: 16)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !785, file: !568, line: 861, baseType: !76, size: 16, offset: 16)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !785, file: !568, line: 861, baseType: !76, size: 16, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !785, file: !568, line: 861, baseType: !76, size: 16, offset: 48)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !785, file: !568, line: 862, baseType: !78, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !785, file: !568, line: 863, baseType: !141, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !776, file: !568, line: 874, baseType: !48, size: 64, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !776, file: !568, line: 876, baseType: !141, size: 32, offset: 1024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !776, file: !568, line: 876, baseType: !141, size: 32, offset: 1056)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !776, file: !568, line: 878, baseType: !78, size: 32, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !776, file: !568, line: 879, baseType: !78, size: 32, offset: 1120)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !776, file: !568, line: 881, baseType: !78, size: 32, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !776, file: !568, line: 881, baseType: !78, size: 32, offset: 1184)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !776, file: !568, line: 883, baseType: !566, size: 64, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !776, file: !568, line: 884, baseType: !307, size: 64, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !609, file: !568, line: 1107, baseType: !141, size: 32, offset: 2688)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !609, file: !568, line: 1110, baseType: !141, size: 32, offset: 2720)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !609, file: !568, line: 1113, baseType: !76, size: 16, offset: 2752)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !609, file: !568, line: 1113, baseType: !76, size: 16, offset: 2768)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !609, file: !568, line: 1116, baseType: !63, size: 8, offset: 2784)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !609, file: !568, line: 1117, baseType: !272, size: 8, offset: 2792)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !609, file: !568, line: 1120, baseType: !76, size: 16, offset: 2800)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !609, file: !568, line: 1121, baseType: !141, size: 32, offset: 2816)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !609, file: !568, line: 1122, baseType: !141, size: 32, offset: 2848)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !609, file: !568, line: 1123, baseType: !141, size: 32, offset: 2880)
