; ModuleID = 'blender/source/blender/editors/transform/transform_ops.c'
source_filename = "blender/source/blender/editors/transform/transform_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.TransformModeItem = type { i8*, i32, void (%struct.wmOperatorType*)* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!1238 = !DIEnumerator(name: "ICON_BRUSH_SNAKE_HOOK", value: 803, isUnsigned: true)
!1239 = !DIEnumerator(name: "ICON_BRUSH_SOFTEN", value: 804, isUnsigned: true)
!1240 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!1241 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!1242 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!1243 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!1244 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!1245 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!1246 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!1247 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!1248 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!1249 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!1250 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!1251 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!1252 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!1253 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!1254 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!1255 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!1256 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!1257 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!1258 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!1259 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!1260 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!1261 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!1262 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!1263 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!1264 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!1265 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!1266 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!1267 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!1268 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!1269 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!1270 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!1271 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!1272 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!1273 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!1274 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!1275 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!1276 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!1277 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!1278 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!1279 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!1280 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!1281 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!1282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !318, line: 67, baseType: !7, size: 32, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292}
!1284 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!1285 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!1286 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!1287 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!1288 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!1289 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!1290 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!1291 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!1292 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!1293 = !{!1294, !1295}
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !1297, line: 133, baseType: !1298)
!1297 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !1297, line: 58, size: 11008, elements: !1299)
!1299 = !{!1300, !1370, !1373, !1385, !1388, !1391, !1395, !1398, !1401, !1404, !1407, !1410, !1413, !1416, !1419, !1437, !1440, !1443, !1446, !1449, !1451, !3108, !3109, !3110, !3111, !3112, !3113, !3114, !3115, !3116, !3117, !3118, !3119, !3120, !3121, !3122, !3123, !3124, !3125, !3126, !3127, !3128, !3129, !3130, !3131, !3132, !3133, !3134, !3135}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1298, file: !1297, line: 59, baseType: !1301, size: 960)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1302, line: 130, baseType: !1303)
!1302 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1302, line: 117, size: 960, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1309, !1329, !1333, !1335, !1336, !1337, !1338}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1303, file: !1302, line: 118, baseType: !1294, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1303, file: !1302, line: 118, baseType: !1294, size: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1303, file: !1302, line: 119, baseType: !1308, size: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1303, file: !1302, line: 120, baseType: !1310, size: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1302, line: 136, size: 17600, elements: !1312)
!1312 = !{!1313, !1314, !1316, !1319, !1324, !1325, !1326}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1311, file: !1302, line: 137, baseType: !1301, size: 960)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1311, file: !1302, line: 138, baseType: !1315, size: 64, offset: 960)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1311, file: !1302, line: 139, baseType: !1317, size: 64, offset: 1024)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1302, line: 43, flags: DIFlagFwdDecl)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1311, file: !1302, line: 140, baseType: !1320, size: 8192, offset: 1088)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1321, size: 8192, elements: !1322)
!1321 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1322 = !{!1323}
!1323 = !DISubrange(count: 1024)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1311, file: !1302, line: 141, baseType: !1320, size: 8192, offset: 9280)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1311, file: !1302, line: 148, baseType: !1310, size: 64, offset: 17472)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1311, file: !1302, line: 150, baseType: !1327, size: 64, offset: 17536)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1302, line: 45, flags: DIFlagFwdDecl)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1303, file: !1302, line: 121, baseType: !1330, size: 528, offset: 256)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1321, size: 528, elements: !1331)
!1331 = !{!1332}
!1332 = !DISubrange(count: 66)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1303, file: !1302, line: 126, baseType: !1334, size: 16, offset: 784)
!1334 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1303, file: !1302, line: 127, baseType: !283, size: 32, offset: 800)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1303, file: !1302, line: 128, baseType: !283, size: 32, offset: 832)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1303, file: !1302, line: 128, baseType: !283, size: 32, offset: 864)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1303, file: !1302, line: 129, baseType: !1339, size: 64, offset: 896)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1302, line: 75, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1302, line: 62, size: 1024, elements: !1342)
!1342 = !{!1343, !1345, !1346, !1347, !1348, !1349, !1353, !1354, !1368, !1369}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1341, file: !1302, line: 63, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1341, file: !1302, line: 63, baseType: !1344, size: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1341, file: !1302, line: 64, baseType: !1321, size: 8, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1341, file: !1302, line: 64, baseType: !1321, size: 8, offset: 136)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1341, file: !1302, line: 65, baseType: !1334, size: 16, offset: 144)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1341, file: !1302, line: 66, baseType: !1350, size: 512, offset: 160)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1321, size: 512, elements: !1351)
!1351 = !{!1352}
!1352 = !DISubrange(count: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1341, file: !1302, line: 67, baseType: !283, size: 32, offset: 672)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1341, file: !1302, line: 69, baseType: !1355, size: 256, offset: 704)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1302, line: 60, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1302, line: 48, size: 256, elements: !1357)
!1357 = !{!1358, !1359, !1366, !1367}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1356, file: !1302, line: 49, baseType: !1294, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1356, file: !1302, line: 58, baseType: !1360, size: 128, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1361, line: 71, baseType: !1362)
!1361 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1361, line: 69, size: 128, elements: !1363)
!1363 = !{!1364, !1365}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1362, file: !1361, line: 70, baseType: !1294, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1362, file: !1361, line: 70, baseType: !1294, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1356, file: !1302, line: 59, baseType: !283, size: 32, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1356, file: !1302, line: 59, baseType: !283, size: 32, offset: 224)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1341, file: !1302, line: 70, baseType: !283, size: 32, offset: 960)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1341, file: !1302, line: 74, baseType: !283, size: 32, offset: 992)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1298, file: !1297, line: 60, baseType: !1371, size: 64, offset: 960)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1297, line: 39, flags: DIFlagFwdDecl)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1298, file: !1297, line: 62, baseType: !1374, size: 64, offset: 1024)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !375, line: 97, size: 832, elements: !1376)
!1376 = !{!1377, !1383, !1384}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1375, file: !375, line: 98, baseType: !1378, size: 768)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 768, elements: !1380)
!1379 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1380 = !{!1381, !1382}
!1381 = !DISubrange(count: 8)
!1382 = !DISubrange(count: 3)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1375, file: !375, line: 99, baseType: !283, size: 32, offset: 768)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1375, file: !375, line: 99, baseType: !283, size: 32, offset: 800)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1298, file: !1297, line: 64, baseType: !1386, size: 64, offset: 1088)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1297, line: 41, flags: DIFlagFwdDecl)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1298, file: !1297, line: 65, baseType: !1389, size: 64, offset: 1152)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !1297, line: 42, flags: DIFlagFwdDecl)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1298, file: !1297, line: 66, baseType: !1392, size: 64, offset: 1216)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1297, line: 53, flags: DIFlagFwdDecl)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !1298, file: !1297, line: 67, baseType: !1396, size: 64, offset: 1280)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !1297, line: 67, flags: DIFlagFwdDecl)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !1298, file: !1297, line: 71, baseType: !1399, size: 64, offset: 1344)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !1297, line: 49, flags: DIFlagFwdDecl)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !1298, file: !1297, line: 72, baseType: !1402, size: 64, offset: 1408)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !1297, line: 51, flags: DIFlagFwdDecl)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !1298, file: !1297, line: 73, baseType: !1405, size: 64, offset: 1472)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !1297, line: 46, flags: DIFlagFwdDecl)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !1298, file: !1297, line: 74, baseType: !1408, size: 64, offset: 1536)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !1297, line: 48, flags: DIFlagFwdDecl)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !1298, file: !1297, line: 75, baseType: !1411, size: 64, offset: 1600)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !1297, line: 47, flags: DIFlagFwdDecl)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !1298, file: !1297, line: 80, baseType: !1414, size: 64, offset: 1664)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !1297, line: 45, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !1298, file: !1297, line: 81, baseType: !1417, size: 64, offset: 1728)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !1297, line: 81, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !1298, file: !1297, line: 82, baseType: !1420, size: 64, offset: 1792)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !1297, line: 136, size: 512, elements: !1422)
!1422 = !{!1423, !1424, !1429, !1432, !1433, !1434, !1435, !1436}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !1421, file: !1297, line: 137, baseType: !1294, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !1421, file: !1297, line: 138, baseType: !1425, size: 256, offset: 64)
!1425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 256, elements: !1426)
!1426 = !{!1427, !1428}
!1427 = !DISubrange(count: 4)
!1428 = !DISubrange(count: 2)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1421, file: !1297, line: 139, baseType: !1430, size: 128, offset: 320)
!1430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !1431)
!1431 = !{!1427}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1421, file: !1297, line: 140, baseType: !1321, size: 8, offset: 448)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !1421, file: !1297, line: 140, baseType: !1321, size: 8, offset: 456)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1421, file: !1297, line: 141, baseType: !1334, size: 16, offset: 464)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1421, file: !1297, line: 141, baseType: !1334, size: 16, offset: 480)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !1421, file: !1297, line: 141, baseType: !1334, size: 16, offset: 496)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !1298, file: !1297, line: 83, baseType: !1438, size: 64, offset: 1856)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !1297, line: 52, flags: DIFlagFwdDecl)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !1298, file: !1297, line: 84, baseType: !1441, size: 64, offset: 1920)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64)
!1442 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !1297, line: 44, flags: DIFlagFwdDecl)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !1298, file: !1297, line: 85, baseType: !1444, size: 64, offset: 1984)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !1297, line: 85, flags: DIFlagFwdDecl)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !1298, file: !1297, line: 89, baseType: !1447, size: 64, offset: 2048)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !1297, line: 43, flags: DIFlagFwdDecl)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !1298, file: !1297, line: 90, baseType: !1450, size: 64, offset: 2112)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !1298, file: !1297, line: 93, baseType: !1452, size: 64, offset: 2176)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !1454, line: 54, size: 896, elements: !1455)
!1454 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_editmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1455 = !{!1456, !1653, !1654, !1655, !1658, !1659, !1662, !1663, !1671, !1675, !1676, !1677, !1678, !1679, !1680, !3107}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !1453, file: !1454, line: 55, baseType: !1457, size: 64)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !1459, line: 186, size: 8064, elements: !1460)
!1459 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1460 = !{!1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1473, !1474, !1475, !1476, !1539, !1543, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1609, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !1458, file: !1459, line: 187, baseType: !283, size: 32)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !1458, file: !1459, line: 187, baseType: !283, size: 32, offset: 32)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !1458, file: !1459, line: 187, baseType: !283, size: 32, offset: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !1458, file: !1459, line: 187, baseType: !283, size: 32, offset: 96)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !1458, file: !1459, line: 188, baseType: !283, size: 32, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !1458, file: !1459, line: 188, baseType: !283, size: 32, offset: 160)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !1458, file: !1459, line: 188, baseType: !283, size: 32, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !1458, file: !1459, line: 193, baseType: !1321, size: 8, offset: 224)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !1458, file: !1459, line: 197, baseType: !1321, size: 8, offset: 232)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !1458, file: !1459, line: 201, baseType: !1471, size: 64, offset: 256)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64)
!1472 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !389, line: 71, flags: DIFlagFwdDecl)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !1458, file: !1459, line: 201, baseType: !1471, size: 64, offset: 320)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !1458, file: !1459, line: 201, baseType: !1471, size: 64, offset: 384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !1458, file: !1459, line: 201, baseType: !1471, size: 64, offset: 448)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1458, file: !1459, line: 208, baseType: !1477, size: 64, offset: 512)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !1459, line: 103, baseType: !1480)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !1459, line: 90, size: 448, elements: !1481)
!1481 = !{!1482, !1491, !1496, !1499, !1500}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1480, file: !1459, line: 91, baseType: !1483, size: 128)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !1459, line: 82, baseType: !1484)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !1459, line: 64, size: 128, elements: !1485)
!1485 = !{!1486, !1487, !1488, !1489, !1490}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1484, file: !1459, line: 65, baseType: !1294, size: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1484, file: !1459, line: 66, baseType: !283, size: 32, offset: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1484, file: !1459, line: 73, baseType: !1321, size: 8, offset: 96)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !1484, file: !1459, line: 74, baseType: !1321, size: 8, offset: 104)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !1484, file: !1459, line: 80, baseType: !1321, size: 8, offset: 112)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !1480, file: !1459, line: 92, baseType: !1492, size: 64, offset: 128)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !1459, line: 180, size: 16, elements: !1494)
!1494 = !{!1495}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1493, file: !1459, line: 181, baseType: !1334, size: 16)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1480, file: !1459, line: 94, baseType: !1497, size: 96, offset: 192)
!1497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 96, elements: !1498)
!1498 = !{!1382}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1480, file: !1459, line: 95, baseType: !1497, size: 96, offset: 288)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1480, file: !1459, line: 102, baseType: !1501, size: 64, offset: 384)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !1459, line: 110, size: 640, elements: !1503)
!1503 = !{!1504, !1505, !1506, !1508, !1509, !1532, !1538}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1502, file: !1459, line: 111, baseType: !1483, size: 128)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !1502, file: !1459, line: 112, baseType: !1492, size: 64, offset: 128)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1502, file: !1459, line: 114, baseType: !1507, size: 64, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1502, file: !1459, line: 114, baseType: !1507, size: 64, offset: 256)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1502, file: !1459, line: 118, baseType: !1510, size: 64, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !1459, line: 125, size: 576, elements: !1512)
!1512 = !{!1513, !1514, !1515, !1516, !1528, !1529, !1530, !1531}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1511, file: !1459, line: 126, baseType: !1483, size: 128)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1511, file: !1459, line: 129, baseType: !1507, size: 64, offset: 128)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1511, file: !1459, line: 130, baseType: !1501, size: 64, offset: 192)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1511, file: !1459, line: 131, baseType: !1517, size: 64, offset: 256)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !1459, line: 164, size: 448, elements: !1519)
!1519 = !{!1520, !1521, !1522, !1525, !1526, !1527}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1518, file: !1459, line: 165, baseType: !1483, size: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !1518, file: !1459, line: 166, baseType: !1492, size: 64, offset: 128)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1518, file: !1459, line: 172, baseType: !1523, size: 64, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !1459, line: 140, baseType: !1511)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1518, file: !1459, line: 174, baseType: !283, size: 32, offset: 256)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1518, file: !1459, line: 175, baseType: !1497, size: 96, offset: 288)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1518, file: !1459, line: 176, baseType: !1334, size: 16, offset: 384)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !1511, file: !1459, line: 135, baseType: !1510, size: 64, offset: 320)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !1511, file: !1459, line: 135, baseType: !1510, size: 64, offset: 384)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1511, file: !1459, line: 139, baseType: !1510, size: 64, offset: 448)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1511, file: !1459, line: 139, baseType: !1510, size: 64, offset: 512)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !1502, file: !1459, line: 122, baseType: !1533, size: 128, offset: 384)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !1459, line: 108, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !1459, line: 106, size: 128, elements: !1535)
!1535 = !{!1536, !1537}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1534, file: !1459, line: 107, baseType: !1501, size: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1534, file: !1459, line: 107, baseType: !1501, size: 64, offset: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !1502, file: !1459, line: 122, baseType: !1533, size: 128, offset: 512)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !1458, file: !1459, line: 209, baseType: !1540, size: 64, offset: 576)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !1459, line: 123, baseType: !1502)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !1458, file: !1459, line: 210, baseType: !1544, size: 64, offset: 640)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64)
!1546 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !1459, line: 178, baseType: !1518)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !1458, file: !1459, line: 213, baseType: !283, size: 32, offset: 704)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !1458, file: !1459, line: 214, baseType: !283, size: 32, offset: 736)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !1458, file: !1459, line: 215, baseType: !283, size: 32, offset: 768)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !1458, file: !1459, line: 218, baseType: !1471, size: 64, offset: 832)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !1458, file: !1459, line: 218, baseType: !1471, size: 64, offset: 896)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !1458, file: !1459, line: 218, baseType: !1471, size: 64, offset: 960)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !1458, file: !1459, line: 220, baseType: !283, size: 32, offset: 1024)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !1458, file: !1459, line: 221, baseType: !1555, size: 64, offset: 1088)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64)
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !337, line: 190, size: 10496, elements: !1557)
!1557 = !{!1558, !1595, !1596, !1602, !1605, !1606, !1608}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !1556, file: !337, line: 191, baseType: !1559, size: 5120)
!1559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1560, size: 5120, elements: !1593)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !337, line: 147, size: 320, elements: !1561)
!1561 = !{!1562, !1565, !1567, !1577, !1578}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !1560, file: !337, line: 148, baseType: !1563, size: 64)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64)
!1564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1321)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !1560, file: !337, line: 149, baseType: !1566, size: 32, offset: 64)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !337, line: 112, baseType: !336)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !1560, file: !337, line: 150, baseType: !1568, size: 32, offset: 96)
!1568 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !337, line: 142, baseType: !1569)
!1569 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !337, line: 138, size: 32, elements: !1570)
!1570 = !{!1571, !1573, !1575}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1569, file: !337, line: 139, baseType: !1572, size: 32)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !337, line: 122, baseType: !347)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1569, file: !337, line: 140, baseType: !1574, size: 32)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !337, line: 136, baseType: !353)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1569, file: !337, line: 141, baseType: !1576, size: 32)
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !337, line: 130, baseType: !359)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1560, file: !337, line: 152, baseType: !283, size: 32, offset: 128)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1560, file: !337, line: 162, baseType: !1579, size: 128, offset: 192)
!1579 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1560, file: !337, line: 155, size: 128, elements: !1580)
!1580 = !{!1581, !1582, !1583, !1584, !1585, !1587}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !1579, file: !337, line: 156, baseType: !283, size: 32)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1579, file: !337, line: 157, baseType: !1379, size: 32)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1579, file: !337, line: 158, baseType: !1294, size: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1579, file: !337, line: 159, baseType: !1497, size: 96)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1579, file: !337, line: 160, baseType: !1586, size: 64)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !1579, file: !337, line: 161, baseType: !1588, size: 64)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !1590, line: 48, baseType: !1591)
!1590 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1591 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1592, line: 47, flags: DIFlagFwdDecl)
!1592 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1593 = !{!1594}
!1594 = !DISubrange(count: 16)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !1556, file: !337, line: 192, baseType: !1559, size: 5120, offset: 5120)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1556, file: !337, line: 193, baseType: !1597, size: 64, offset: 10240)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{null, !1600, !1555}
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64)
!1601 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !1459, line: 246, baseType: !1458)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !1556, file: !337, line: 194, baseType: !1603, size: 64, offset: 10304)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64)
!1604 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !337, line: 194, flags: DIFlagFwdDecl)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1556, file: !337, line: 195, baseType: !283, size: 32, offset: 10368)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !1556, file: !337, line: 196, baseType: !1607, size: 32, offset: 10400)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !337, line: 188, baseType: !367)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1556, file: !337, line: 197, baseType: !283, size: 32, offset: 10432)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1458, file: !1459, line: 223, baseType: !1610, size: 1600, offset: 1152)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !389, line: 73, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !389, line: 64, size: 1600, elements: !1612)
!1612 = !{!1613, !1628, !1632, !1633, !1634, !1635, !1636}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !1611, file: !389, line: 65, baseType: !1614, size: 64)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64)
!1615 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !389, line: 53, baseType: !1616)
!1616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !389, line: 42, size: 832, elements: !1617)
!1617 = !{!1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1616, file: !389, line: 43, baseType: !283, size: 32)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1616, file: !389, line: 44, baseType: !283, size: 32, offset: 32)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1616, file: !389, line: 45, baseType: !283, size: 32, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1616, file: !389, line: 46, baseType: !283, size: 32, offset: 96)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !1616, file: !389, line: 47, baseType: !283, size: 32, offset: 128)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !1616, file: !389, line: 48, baseType: !283, size: 32, offset: 160)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !1616, file: !389, line: 49, baseType: !283, size: 32, offset: 192)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1616, file: !389, line: 50, baseType: !283, size: 32, offset: 224)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1616, file: !389, line: 51, baseType: !1350, size: 512, offset: 256)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1616, file: !389, line: 52, baseType: !1294, size: 64, offset: 768)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !1611, file: !389, line: 66, baseType: !1629, size: 1312, offset: 64)
!1629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 1312, elements: !1630)
!1630 = !{!1631}
!1631 = !DISubrange(count: 41)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !1611, file: !389, line: 69, baseType: !283, size: 32, offset: 1376)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !1611, file: !389, line: 69, baseType: !283, size: 32, offset: 1408)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !1611, file: !389, line: 70, baseType: !283, size: 32, offset: 1440)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1611, file: !389, line: 71, baseType: !1471, size: 64, offset: 1472)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !1611, file: !389, line: 72, baseType: !1637, size: 64, offset: 1536)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64)
!1638 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !389, line: 59, baseType: !1639)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !389, line: 57, size: 8192, elements: !1640)
!1640 = !{!1641}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1639, file: !389, line: 58, baseType: !1320, size: 8192)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1458, file: !1459, line: 223, baseType: !1610, size: 1600, offset: 2752)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !1458, file: !1459, line: 223, baseType: !1610, size: 1600, offset: 4352)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1458, file: !1459, line: 223, baseType: !1610, size: 1600, offset: 5952)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1458, file: !1459, line: 233, baseType: !1334, size: 16, offset: 7552)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1458, file: !1459, line: 236, baseType: !283, size: 32, offset: 7584)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !1458, file: !1459, line: 238, baseType: !283, size: 32, offset: 7616)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !1458, file: !1459, line: 238, baseType: !283, size: 32, offset: 7648)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !1458, file: !1459, line: 239, baseType: !1360, size: 128, offset: 7680)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !1458, file: !1459, line: 241, baseType: !1545, size: 64, offset: 7808)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !1458, file: !1459, line: 243, baseType: !1360, size: 128, offset: 7872)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !1458, file: !1459, line: 245, baseType: !1294, size: 64, offset: 8000)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "emcopy", scope: !1453, file: !1454, line: 58, baseType: !1452, size: 64, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "emcopyusers", scope: !1453, file: !1454, line: 59, baseType: !283, size: 32, offset: 128)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !1453, file: !1454, line: 63, baseType: !1656, size: 64, offset: 192)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64)
!1657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1510, size: 192, elements: !1498)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "tottri", scope: !1453, file: !1454, line: 64, baseType: !283, size: 32, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1453, file: !1454, line: 67, baseType: !1660, size: 64, offset: 320)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64)
!1661 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !1297, line: 40, flags: DIFlagFwdDecl)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "derivedCage", scope: !1453, file: !1454, line: 67, baseType: !1660, size: 64, offset: 384)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1453, file: !1454, line: 68, baseType: !1664, size: 64, offset: 448)
!1664 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataMask", file: !1665, line: 48, baseType: !1666)
!1665 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1667, line: 27, baseType: !1668)
!1667 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1669, line: 45, baseType: !1670)
!1669 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1670 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColor", scope: !1453, file: !1454, line: 69, baseType: !1672, size: 64, offset: 512)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64)
!1673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1674, size: 32, elements: !1431)
!1674 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColorLen", scope: !1453, file: !1454, line: 70, baseType: !283, size: 32, offset: 576)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColor", scope: !1453, file: !1454, line: 71, baseType: !1672, size: 64, offset: 640)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColorLen", scope: !1453, file: !1454, line: 72, baseType: !283, size: 32, offset: 704)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1453, file: !1454, line: 75, baseType: !1334, size: 16, offset: 736)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1453, file: !1454, line: 76, baseType: !1334, size: 16, offset: 752)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !1453, file: !1454, line: 79, baseType: !1681, size: 64, offset: 768)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64)
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !375, line: 115, size: 11392, elements: !1683)
!1683 = !{!1684, !1685, !1686, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1715, !1716, !1756, !1757, !1760, !1761, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1798, !1799, !1800, !1801, !1802, !1803, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1874, !1877, !1880, !1881, !1882, !1883, !1884, !1887, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1900, !1903, !1906, !1909, !3095, !3096}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1682, file: !375, line: 116, baseType: !1301, size: 960)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1682, file: !375, line: 117, baseType: !1371, size: 64, offset: 960)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1682, file: !375, line: 119, baseType: !1687, size: 64, offset: 1024)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64)
!1688 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !375, line: 57, flags: DIFlagFwdDecl)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1682, file: !375, line: 121, baseType: !1334, size: 16, offset: 1088)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1682, file: !375, line: 121, baseType: !1334, size: 16, offset: 1104)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1682, file: !375, line: 122, baseType: !283, size: 32, offset: 1120)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1682, file: !375, line: 122, baseType: !283, size: 32, offset: 1152)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1682, file: !375, line: 122, baseType: !283, size: 32, offset: 1184)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1682, file: !375, line: 123, baseType: !1350, size: 512, offset: 1216)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1682, file: !375, line: 124, baseType: !1681, size: 64, offset: 1728)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1682, file: !375, line: 124, baseType: !1681, size: 64, offset: 1792)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1682, file: !375, line: 127, baseType: !1681, size: 64, offset: 1856)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1682, file: !375, line: 127, baseType: !1681, size: 64, offset: 1920)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1682, file: !375, line: 127, baseType: !1681, size: 64, offset: 1984)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1682, file: !375, line: 128, baseType: !1386, size: 64, offset: 2048)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1682, file: !375, line: 130, baseType: !1374, size: 64, offset: 2112)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1682, file: !375, line: 131, baseType: !1703, size: 64, offset: 2176)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64)
!1704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1592, line: 486, size: 1600, elements: !1705)
!1705 = !{!1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1704, file: !1592, line: 487, baseType: !1301, size: 960)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1704, file: !1592, line: 489, baseType: !1360, size: 128, offset: 960)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1704, file: !1592, line: 490, baseType: !1360, size: 128, offset: 1088)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1704, file: !1592, line: 491, baseType: !1360, size: 128, offset: 1216)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1704, file: !1592, line: 492, baseType: !1360, size: 128, offset: 1344)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1704, file: !1592, line: 494, baseType: !283, size: 32, offset: 1472)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1704, file: !1592, line: 495, baseType: !283, size: 32, offset: 1504)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1704, file: !1592, line: 497, baseType: !283, size: 32, offset: 1536)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1704, file: !1592, line: 498, baseType: !283, size: 32, offset: 1568)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1682, file: !375, line: 132, baseType: !1703, size: 64, offset: 2240)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1682, file: !375, line: 133, baseType: !1717, size: 64, offset: 2304)
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64)
!1718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1592, line: 334, size: 1728, elements: !1719)
!1719 = !{!1720, !1721, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1755}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1718, file: !1592, line: 335, baseType: !1360, size: 128)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1718, file: !1592, line: 336, baseType: !1722, size: 64, offset: 128)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1718, file: !1592, line: 338, baseType: !1334, size: 16, offset: 192)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1718, file: !1592, line: 338, baseType: !1334, size: 16, offset: 208)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1718, file: !1592, line: 339, baseType: !7, size: 32, offset: 224)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1718, file: !1592, line: 340, baseType: !283, size: 32, offset: 256)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1718, file: !1592, line: 342, baseType: !1379, size: 32, offset: 288)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1718, file: !1592, line: 343, baseType: !1497, size: 96, offset: 320)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1718, file: !1592, line: 344, baseType: !1497, size: 96, offset: 416)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1718, file: !1592, line: 347, baseType: !1360, size: 128, offset: 512)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1718, file: !1592, line: 349, baseType: !283, size: 32, offset: 640)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1718, file: !1592, line: 350, baseType: !283, size: 32, offset: 672)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1718, file: !1592, line: 351, baseType: !1294, size: 64, offset: 704)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1718, file: !1592, line: 352, baseType: !1294, size: 64, offset: 768)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1718, file: !1592, line: 354, baseType: !1736, size: 384, offset: 832)
!1736 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1592, line: 116, baseType: !1737)
!1737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1592, line: 94, size: 384, elements: !1738)
!1738 = !{!1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754}
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1737, file: !1592, line: 96, baseType: !283, size: 32)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1737, file: !1592, line: 96, baseType: !283, size: 32, offset: 32)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1737, file: !1592, line: 97, baseType: !283, size: 32, offset: 64)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1737, file: !1592, line: 97, baseType: !283, size: 32, offset: 96)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1737, file: !1592, line: 99, baseType: !1334, size: 16, offset: 128)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1737, file: !1592, line: 100, baseType: !1334, size: 16, offset: 144)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1737, file: !1592, line: 102, baseType: !1334, size: 16, offset: 160)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1737, file: !1592, line: 105, baseType: !1334, size: 16, offset: 176)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1737, file: !1592, line: 108, baseType: !1334, size: 16, offset: 192)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1737, file: !1592, line: 109, baseType: !1334, size: 16, offset: 208)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1737, file: !1592, line: 111, baseType: !1334, size: 16, offset: 224)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1737, file: !1592, line: 112, baseType: !1334, size: 16, offset: 240)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1737, file: !1592, line: 114, baseType: !283, size: 32, offset: 256)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1737, file: !1592, line: 114, baseType: !283, size: 32, offset: 288)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1737, file: !1592, line: 115, baseType: !283, size: 32, offset: 320)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1737, file: !1592, line: 115, baseType: !283, size: 32, offset: 352)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1718, file: !1592, line: 355, baseType: !1350, size: 512, offset: 1216)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1682, file: !375, line: 134, baseType: !1294, size: 64, offset: 2368)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1682, file: !375, line: 136, baseType: !1758, size: 64, offset: 2432)
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64)
!1759 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !375, line: 58, flags: DIFlagFwdDecl)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1682, file: !375, line: 138, baseType: !1736, size: 384, offset: 2496)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1682, file: !375, line: 139, baseType: !1762, size: 64, offset: 2880)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64)
!1763 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1592, line: 80, baseType: !1764)
!1764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1592, line: 72, size: 192, elements: !1765)
!1765 = !{!1766, !1773, !1774, !1775, !1776}
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1764, file: !1592, line: 73, baseType: !1767, size: 64)
!1767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1768, size: 64)
!1768 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1592, line: 59, baseType: !1769)
!1769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1592, line: 56, size: 128, elements: !1770)
!1770 = !{!1771, !1772}
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1769, file: !1592, line: 57, baseType: !1497, size: 96)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1769, file: !1592, line: 58, baseType: !283, size: 32, offset: 96)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1764, file: !1592, line: 74, baseType: !283, size: 32, offset: 64)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1764, file: !1592, line: 76, baseType: !283, size: 32, offset: 96)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1764, file: !1592, line: 77, baseType: !283, size: 32, offset: 128)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1764, file: !1592, line: 79, baseType: !283, size: 32, offset: 160)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1682, file: !375, line: 141, baseType: !1360, size: 128, offset: 2944)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1682, file: !375, line: 142, baseType: !1360, size: 128, offset: 3072)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1682, file: !375, line: 143, baseType: !1360, size: 128, offset: 3200)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1682, file: !375, line: 144, baseType: !1360, size: 128, offset: 3328)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1682, file: !375, line: 146, baseType: !283, size: 32, offset: 3456)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1682, file: !375, line: 147, baseType: !283, size: 32, offset: 3488)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1682, file: !375, line: 150, baseType: !1392, size: 64, offset: 3520)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1682, file: !375, line: 151, baseType: !1785, size: 64, offset: 3584)
!1785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1682, file: !375, line: 152, baseType: !283, size: 32, offset: 3648)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1682, file: !375, line: 153, baseType: !283, size: 32, offset: 3680)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1682, file: !375, line: 156, baseType: !1497, size: 96, offset: 3712)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1682, file: !375, line: 156, baseType: !1497, size: 96, offset: 3808)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1682, file: !375, line: 156, baseType: !1497, size: 96, offset: 3904)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1682, file: !375, line: 157, baseType: !1497, size: 96, offset: 4000)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1682, file: !375, line: 158, baseType: !1497, size: 96, offset: 4096)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1682, file: !375, line: 159, baseType: !1497, size: 96, offset: 4192)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1682, file: !375, line: 160, baseType: !1497, size: 96, offset: 4288)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1682, file: !375, line: 160, baseType: !1497, size: 96, offset: 4384)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1682, file: !375, line: 161, baseType: !1797, size: 128, offset: 4480)
!1797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 128, elements: !1431)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1682, file: !375, line: 161, baseType: !1797, size: 128, offset: 4608)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1682, file: !375, line: 162, baseType: !1497, size: 96, offset: 4736)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1682, file: !375, line: 162, baseType: !1497, size: 96, offset: 4832)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1682, file: !375, line: 163, baseType: !1379, size: 32, offset: 4928)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1682, file: !375, line: 163, baseType: !1379, size: 32, offset: 4960)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1682, file: !375, line: 164, baseType: !1804, size: 512, offset: 4992)
!1804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 512, elements: !1805)
!1805 = !{!1427, !1427}
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1682, file: !375, line: 165, baseType: !1804, size: 512, offset: 5504)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1682, file: !375, line: 166, baseType: !1804, size: 512, offset: 6016)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1682, file: !375, line: 167, baseType: !1804, size: 512, offset: 6528)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1682, file: !375, line: 176, baseType: !1804, size: 512, offset: 7040)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1682, file: !375, line: 178, baseType: !7, size: 32, offset: 7552)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1682, file: !375, line: 180, baseType: !1334, size: 16, offset: 7584)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1682, file: !375, line: 181, baseType: !1334, size: 16, offset: 7600)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1682, file: !375, line: 183, baseType: !1334, size: 16, offset: 7616)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1682, file: !375, line: 183, baseType: !1334, size: 16, offset: 7632)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1682, file: !375, line: 184, baseType: !1334, size: 16, offset: 7648)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1682, file: !375, line: 184, baseType: !1334, size: 16, offset: 7664)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1682, file: !375, line: 185, baseType: !1334, size: 16, offset: 7680)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1682, file: !375, line: 186, baseType: !1334, size: 16, offset: 7696)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1682, file: !375, line: 187, baseType: !1334, size: 16, offset: 7712)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1682, file: !375, line: 188, baseType: !1321, size: 8, offset: 7728)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1682, file: !375, line: 189, baseType: !1321, size: 8, offset: 7736)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1682, file: !375, line: 192, baseType: !283, size: 32, offset: 7744)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1682, file: !375, line: 192, baseType: !283, size: 32, offset: 7776)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1682, file: !375, line: 192, baseType: !283, size: 32, offset: 7808)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1682, file: !375, line: 192, baseType: !283, size: 32, offset: 7840)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1682, file: !375, line: 194, baseType: !283, size: 32, offset: 7872)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1682, file: !375, line: 202, baseType: !1379, size: 32, offset: 7904)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1682, file: !375, line: 202, baseType: !1379, size: 32, offset: 7936)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1682, file: !375, line: 202, baseType: !1379, size: 32, offset: 7968)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1682, file: !375, line: 211, baseType: !1379, size: 32, offset: 8000)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1682, file: !375, line: 212, baseType: !1379, size: 32, offset: 8032)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1682, file: !375, line: 213, baseType: !1379, size: 32, offset: 8064)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1682, file: !375, line: 214, baseType: !1379, size: 32, offset: 8096)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1682, file: !375, line: 215, baseType: !1379, size: 32, offset: 8128)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1682, file: !375, line: 216, baseType: !1379, size: 32, offset: 8160)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1682, file: !375, line: 219, baseType: !1379, size: 32, offset: 8192)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1682, file: !375, line: 220, baseType: !1379, size: 32, offset: 8224)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1682, file: !375, line: 221, baseType: !1379, size: 32, offset: 8256)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1682, file: !375, line: 224, baseType: !1840, size: 16, offset: 8288)
!1840 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1682, file: !375, line: 224, baseType: !1840, size: 16, offset: 8304)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1682, file: !375, line: 226, baseType: !1334, size: 16, offset: 8320)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1682, file: !375, line: 228, baseType: !1321, size: 8, offset: 8336)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1682, file: !375, line: 229, baseType: !1321, size: 8, offset: 8344)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1682, file: !375, line: 231, baseType: !1334, size: 16, offset: 8352)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1682, file: !375, line: 232, baseType: !1321, size: 8, offset: 8368)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1682, file: !375, line: 233, baseType: !1321, size: 8, offset: 8376)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1682, file: !375, line: 234, baseType: !1379, size: 32, offset: 8384)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1682, file: !375, line: 235, baseType: !1379, size: 32, offset: 8416)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1682, file: !375, line: 237, baseType: !1360, size: 128, offset: 8448)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1682, file: !375, line: 238, baseType: !1360, size: 128, offset: 8576)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1682, file: !375, line: 239, baseType: !1360, size: 128, offset: 8704)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1682, file: !375, line: 240, baseType: !1360, size: 128, offset: 8832)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1682, file: !375, line: 242, baseType: !1379, size: 32, offset: 8960)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1682, file: !375, line: 244, baseType: !1334, size: 16, offset: 8992)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1682, file: !375, line: 245, baseType: !1840, size: 16, offset: 9008)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1682, file: !375, line: 246, baseType: !1797, size: 128, offset: 9024)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1682, file: !375, line: 248, baseType: !283, size: 32, offset: 9152)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1682, file: !375, line: 249, baseType: !283, size: 32, offset: 9184)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1682, file: !375, line: 251, baseType: !1861, size: 64, offset: 9216)
!1861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1862, size: 64)
!1862 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !375, line: 251, flags: DIFlagFwdDecl)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1682, file: !375, line: 253, baseType: !1321, size: 8, offset: 9280)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1682, file: !375, line: 254, baseType: !1321, size: 8, offset: 9288)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1682, file: !375, line: 255, baseType: !1334, size: 16, offset: 9296)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1682, file: !375, line: 256, baseType: !1497, size: 96, offset: 9312)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1682, file: !375, line: 258, baseType: !1360, size: 128, offset: 9408)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1682, file: !375, line: 259, baseType: !1360, size: 128, offset: 9536)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1682, file: !375, line: 260, baseType: !1360, size: 128, offset: 9664)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1682, file: !375, line: 261, baseType: !1360, size: 128, offset: 9792)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1682, file: !375, line: 263, baseType: !1872, size: 64, offset: 9920)
!1872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1873, size: 64)
!1873 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !375, line: 52, flags: DIFlagFwdDecl)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1682, file: !375, line: 264, baseType: !1875, size: 64, offset: 9984)
!1875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1876, size: 64)
!1876 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !375, line: 53, flags: DIFlagFwdDecl)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1682, file: !375, line: 265, baseType: !1878, size: 64, offset: 10048)
!1878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1879, size: 64)
!1879 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1592, line: 46, flags: DIFlagFwdDecl)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1682, file: !375, line: 267, baseType: !1321, size: 8, offset: 10112)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1682, file: !375, line: 268, baseType: !1321, size: 8, offset: 10120)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1682, file: !375, line: 269, baseType: !1334, size: 16, offset: 10128)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1682, file: !375, line: 270, baseType: !1379, size: 32, offset: 10144)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1682, file: !375, line: 272, baseType: !1885, size: 64, offset: 10176)
!1885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1886, size: 64)
!1886 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !375, line: 54, flags: DIFlagFwdDecl)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1682, file: !375, line: 275, baseType: !1888, size: 64, offset: 10240)
!1888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1889, size: 64)
!1889 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !375, line: 275, flags: DIFlagFwdDecl)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1682, file: !375, line: 277, baseType: !1660, size: 64, offset: 10304)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1682, file: !375, line: 277, baseType: !1660, size: 64, offset: 10368)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1682, file: !375, line: 278, baseType: !1666, size: 64, offset: 10432)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1682, file: !375, line: 279, baseType: !1666, size: 64, offset: 10496)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1682, file: !375, line: 280, baseType: !7, size: 32, offset: 10560)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1682, file: !375, line: 281, baseType: !7, size: 32, offset: 10592)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1682, file: !375, line: 283, baseType: !1360, size: 128, offset: 10624)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1682, file: !375, line: 284, baseType: !1360, size: 128, offset: 10752)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1682, file: !375, line: 285, baseType: !1899, size: 64, offset: 10880)
!1899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1682, file: !375, line: 287, baseType: !1901, size: 64, offset: 10944)
!1901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1902, size: 64)
!1902 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !375, line: 59, flags: DIFlagFwdDecl)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1682, file: !375, line: 288, baseType: !1904, size: 64, offset: 11008)
!1904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1905, size: 64)
!1905 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !375, line: 288, flags: DIFlagFwdDecl)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1682, file: !375, line: 290, baseType: !1907, size: 64, offset: 11072)
!1907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 64, elements: !1908)
!1908 = !{!1428}
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1682, file: !375, line: 291, baseType: !1910, size: 64, offset: 11136)
!1910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1911, size: 64)
!1911 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1912, line: 65, baseType: !1913)
!1912 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1912, line: 50, size: 320, elements: !1914)
!1914 = !{!1915, !3082, !3083, !3084, !3085, !3086, !3087, !3088, !3089, !3090, !3091, !3092, !3093, !3094}
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1913, file: !1912, line: 51, baseType: !1916, size: 64)
!1916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1917, size: 64)
!1917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1918, line: 1216, size: 39680, elements: !1919)
!1918 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1919 = !{!1920, !1921, !1922, !1923, !1926, !1927, !1928, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1954, !2028, !2454, !2665, !2668, !2957, !2969, !2970, !2971, !2972, !2973, !2974, !2975, !2976, !2979, !2980, !2981, !2982, !2983, !2991, !3058, !3065, !3066, !3073, !3074, !3075, !3076, !3077, !3078, !3079}
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1917, file: !1918, line: 1217, baseType: !1301, size: 960)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1917, file: !1918, line: 1218, baseType: !1371, size: 64, offset: 960)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1917, file: !1918, line: 1220, baseType: !1681, size: 64, offset: 1024)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1917, file: !1918, line: 1221, baseType: !1924, size: 64, offset: 1088)
!1924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1925, size: 64)
!1925 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1918, line: 52, flags: DIFlagFwdDecl)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1917, file: !1918, line: 1223, baseType: !1916, size: 64, offset: 1152)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1917, file: !1918, line: 1225, baseType: !1360, size: 128, offset: 1216)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1917, file: !1918, line: 1226, baseType: !1929, size: 64, offset: 1344)
!1929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1930, size: 64)
!1930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1918, line: 69, size: 320, elements: !1931)
!1931 = !{!1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939}
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1930, file: !1918, line: 70, baseType: !1929, size: 64)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1930, file: !1918, line: 70, baseType: !1929, size: 64, offset: 64)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1930, file: !1918, line: 71, baseType: !7, size: 32, offset: 128)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1930, file: !1918, line: 71, baseType: !7, size: 32, offset: 160)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1930, file: !1918, line: 72, baseType: !283, size: 32, offset: 192)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1930, file: !1918, line: 73, baseType: !1334, size: 16, offset: 224)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1930, file: !1918, line: 73, baseType: !1334, size: 16, offset: 240)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1930, file: !1918, line: 74, baseType: !1681, size: 64, offset: 256)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1917, file: !1918, line: 1227, baseType: !1681, size: 64, offset: 1408)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1917, file: !1918, line: 1229, baseType: !1497, size: 96, offset: 1472)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1917, file: !1918, line: 1230, baseType: !1497, size: 96, offset: 1568)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1917, file: !1918, line: 1231, baseType: !1497, size: 96, offset: 1664)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1917, file: !1918, line: 1231, baseType: !1497, size: 96, offset: 1760)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1917, file: !1918, line: 1233, baseType: !7, size: 32, offset: 1856)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1917, file: !1918, line: 1234, baseType: !283, size: 32, offset: 1888)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1917, file: !1918, line: 1235, baseType: !7, size: 32, offset: 1920)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1917, file: !1918, line: 1237, baseType: !1334, size: 16, offset: 1952)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1917, file: !1918, line: 1239, baseType: !1321, size: 8, offset: 1968)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1917, file: !1918, line: 1240, baseType: !1951, size: 8, offset: 1976)
!1951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1321, size: 8, elements: !1952)
!1952 = !{!1953}
!1953 = !DISubrange(count: 1)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1917, file: !1918, line: 1242, baseType: !1955, size: 64, offset: 1984)
!1955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1956, size: 64)
!1956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1957, line: 328, size: 3456, elements: !1958)
!1957 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1958 = !{!1959, !1960, !1961, !1965, !1966, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1994, !1995, !1996, !1999, !2004, !2005, !2008, !2012, !2016, !2020, !2024, !2025, !2026, !2027}
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1956, file: !1957, line: 329, baseType: !1301, size: 960)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1956, file: !1957, line: 330, baseType: !1371, size: 64, offset: 960)
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1956, file: !1957, line: 332, baseType: !1962, size: 64, offset: 1024)
!1962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1963, size: 64)
!1963 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1964, line: 32, flags: DIFlagFwdDecl)
!1964 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1956, file: !1957, line: 333, baseType: !1350, size: 512, offset: 1088)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1956, file: !1957, line: 335, baseType: !1967, size: 64, offset: 1600)
!1967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1968, size: 64)
!1968 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !6, line: 41, flags: DIFlagFwdDecl)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1956, file: !1957, line: 337, baseType: !1758, size: 64, offset: 1664)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1956, file: !1957, line: 338, baseType: !1907, size: 64, offset: 1728)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1956, file: !1957, line: 340, baseType: !1360, size: 128, offset: 1792)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1956, file: !1957, line: 340, baseType: !1360, size: 128, offset: 1920)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1956, file: !1957, line: 342, baseType: !283, size: 32, offset: 2048)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1956, file: !1957, line: 342, baseType: !283, size: 32, offset: 2080)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1956, file: !1957, line: 343, baseType: !283, size: 32, offset: 2112)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1956, file: !1957, line: 345, baseType: !283, size: 32, offset: 2144)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1956, file: !1957, line: 346, baseType: !283, size: 32, offset: 2176)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1956, file: !1957, line: 347, baseType: !1334, size: 16, offset: 2208)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1956, file: !1957, line: 348, baseType: !1334, size: 16, offset: 2224)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1956, file: !1957, line: 349, baseType: !283, size: 32, offset: 2240)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1956, file: !1957, line: 351, baseType: !283, size: 32, offset: 2272)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1956, file: !1957, line: 353, baseType: !1334, size: 16, offset: 2304)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1956, file: !1957, line: 354, baseType: !1334, size: 16, offset: 2320)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1956, file: !1957, line: 355, baseType: !283, size: 32, offset: 2336)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1956, file: !1957, line: 357, baseType: !1986, size: 128, offset: 2368)
!1986 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1987, line: 95, baseType: !1988)
!1987 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1987, line: 92, size: 128, elements: !1989)
!1989 = !{!1990, !1991, !1992, !1993}
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1988, file: !1987, line: 93, baseType: !1379, size: 32)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1988, file: !1987, line: 93, baseType: !1379, size: 32, offset: 32)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1988, file: !1987, line: 94, baseType: !1379, size: 32, offset: 64)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1988, file: !1987, line: 94, baseType: !1379, size: 32, offset: 96)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1956, file: !1957, line: 363, baseType: !1360, size: 128, offset: 2496)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1956, file: !1957, line: 363, baseType: !1360, size: 128, offset: 2624)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1956, file: !1957, line: 368, baseType: !1997, size: 64, offset: 2752)
!1997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1998, size: 64)
!1998 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1957, line: 48, flags: DIFlagFwdDecl)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1956, file: !1957, line: 372, baseType: !2000, size: 32, offset: 2816)
!2000 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1957, line: 274, baseType: !2001)
!2001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1957, line: 271, size: 32, elements: !2002)
!2002 = !{!2003}
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2001, file: !1957, line: 273, baseType: !7, size: 32)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1956, file: !1957, line: 373, baseType: !283, size: 32, offset: 2848)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1956, file: !1957, line: 382, baseType: !2006, size: 64, offset: 2880)
!2006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2007, size: 64)
!2007 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1957, line: 46, flags: DIFlagFwdDecl)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1956, file: !1957, line: 385, baseType: !2009, size: 64, offset: 2944)
!2009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2010, size: 64)
!2010 = !DISubroutineType(types: !2011)
!2011 = !{null, !1294, !1379}
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1956, file: !1957, line: 386, baseType: !2013, size: 64, offset: 3008)
!2013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2014, size: 64)
!2014 = !DISubroutineType(types: !2015)
!2015 = !{null, !1294, !1785}
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1956, file: !1957, line: 387, baseType: !2017, size: 64, offset: 3072)
!2017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2018, size: 64)
!2018 = !DISubroutineType(types: !2019)
!2019 = !{!283, !1294}
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1956, file: !1957, line: 388, baseType: !2021, size: 64, offset: 3136)
!2021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2022, size: 64)
!2022 = !DISubroutineType(types: !2023)
!2023 = !{null, !1294}
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1956, file: !1957, line: 389, baseType: !1294, size: 64, offset: 3200)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1956, file: !1957, line: 389, baseType: !1294, size: 64, offset: 3264)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1956, file: !1957, line: 389, baseType: !1294, size: 64, offset: 3328)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1956, file: !1957, line: 389, baseType: !1294, size: 64, offset: 3392)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1917, file: !1918, line: 1244, baseType: !2029, size: 64, offset: 2048)
!2029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2030, size: 64)
!2030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !2031, line: 200, size: 17024, elements: !2032)
!2031 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2032 = !{!2033, !2034, !2035, !2036, !2447, !2448, !2449, !2450, !2451, !2452, !2453}
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !2030, file: !2031, line: 201, baseType: !1899, size: 64)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !2030, file: !2031, line: 202, baseType: !1360, size: 128, offset: 64)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !2030, file: !2031, line: 203, baseType: !1360, size: 128, offset: 192)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !2030, file: !2031, line: 206, baseType: !2037, size: 64, offset: 320)
!2037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2038, size: 64)
!2038 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !2031, line: 190, baseType: !2039)
!2039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !2031, line: 126, size: 2816, elements: !2040)
!2040 = !{!2041, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2139, !2140, !2141, !2142, !2418, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2446}
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2039, file: !2031, line: 127, baseType: !2042, size: 64)
!2042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2039, size: 64)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2039, file: !2031, line: 127, baseType: !2042, size: 64, offset: 64)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !2039, file: !2031, line: 128, baseType: !1294, size: 64, offset: 128)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !2039, file: !2031, line: 129, baseType: !1294, size: 64, offset: 192)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2039, file: !2031, line: 130, baseType: !1350, size: 512, offset: 256)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2039, file: !2031, line: 132, baseType: !283, size: 32, offset: 768)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2039, file: !2031, line: 132, baseType: !283, size: 32, offset: 800)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2039, file: !2031, line: 133, baseType: !283, size: 32, offset: 832)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !2039, file: !2031, line: 134, baseType: !283, size: 32, offset: 864)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !2039, file: !2031, line: 134, baseType: !283, size: 32, offset: 896)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !2039, file: !2031, line: 134, baseType: !283, size: 32, offset: 928)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !2039, file: !2031, line: 135, baseType: !283, size: 32, offset: 960)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !2039, file: !2031, line: 135, baseType: !283, size: 32, offset: 992)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2039, file: !2031, line: 136, baseType: !283, size: 32, offset: 1024)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !2039, file: !2031, line: 136, baseType: !283, size: 32, offset: 1056)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !2039, file: !2031, line: 137, baseType: !283, size: 32, offset: 1088)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !2039, file: !2031, line: 137, baseType: !283, size: 32, offset: 1120)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !2039, file: !2031, line: 138, baseType: !1379, size: 32, offset: 1152)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !2039, file: !2031, line: 139, baseType: !1379, size: 32, offset: 1184)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !2039, file: !2031, line: 139, baseType: !1379, size: 32, offset: 1216)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !2039, file: !2031, line: 141, baseType: !1334, size: 16, offset: 1248)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !2039, file: !2031, line: 142, baseType: !1334, size: 16, offset: 1264)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !2039, file: !2031, line: 143, baseType: !283, size: 32, offset: 1280)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !2039, file: !2031, line: 144, baseType: !283, size: 32, offset: 1312)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !2039, file: !2031, line: 146, baseType: !2067, size: 64, offset: 1344)
!2067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2068, size: 64)
!2068 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !2031, line: 114, baseType: !2069)
!2069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !2031, line: 99, size: 7232, elements: !2070)
!2070 = !{!2071, !2073, !2074, !2075, !2076, !2077, !2078, !2089, !2093, !2107, !2116, !2123, !2133}
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2069, file: !2031, line: 100, baseType: !2072, size: 64)
!2072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2069, size: 64)
