; ModuleID = 'libpng/pngerror.c'
source_filename = "libpng/pngerror.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 146, type: !485, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "png_format_number", scope: !3, file: !3, line: 131, type: !4, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !20)
!3 = !DIFile(filename: "libpng/pngerror.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !10, !6, !13, !14}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !7, line: 536, baseType: !8)
!7 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !7, line: 537, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !7, line: 591, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !7, line: 454, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 46, baseType: !18)
!17 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!18 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !20, retainedTypes: !21, globals: !24, splitDebugInlining: false, nameTableKind: None)
!20 = !{}
!21 = !{!22, !14, !23, !13, !9}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !7, line: 524, baseType: !22)
!24 = !{!0, !25, !482}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "valid_parameters", scope: !27, file: !3, line: 306, type: !479, isLocal: true, isDefinition: true)
!27 = distinct !DISubprogram(name: "png_formatted_warning", scope: !3, file: !3, line: 281, type: !28, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !20)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !30, !475, !10}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !31, line: 851, baseType: !32)
!31 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !31, line: 849, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !35, line: 29, size: 9728, elements: !36)
!35 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!36 = !{!37, !62, !68, !73, !74, !75, !84, !85, !86, !104, !105, !106, !107, !108, !109, !110, !111, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !188, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !211, !212, !213, !216, !225, !226, !231, !232, !233, !234, !235, !236, !237, !241, !242, !243, !244, !245, !254, !255, !256, !257, !262, !264, !391, !396, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !424, !425, !426, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !446, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !34, file: !35, line: 32, baseType: !38, size: 1600)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !39, line: 45, baseType: !40)
!39 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 1600, elements: !60)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !39, line: 33, size: 1600, elements: !42)
!42 = !{!43, !50, !51}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !41, file: !39, line: 39, baseType: !44, size: 512)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !45, line: 31, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 512, elements: !48)
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !{!49}
!49 = !DISubrange(count: 8)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !41, file: !39, line: 40, baseType: !13, size: 32, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !41, file: !39, line: 41, baseType: !52, size: 1024, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !53, line: 8, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 5, size: 1024, elements: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !54, file: !53, line: 7, baseType: !57, size: 1024)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1024, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 16)
!60 = !{!61}
!61 = !DISubrange(count: 1)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !34, file: !35, line: 33, baseType: !63, size: 64, offset: 1600)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !31, line: 913, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !13}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !34, file: !35, line: 35, baseType: !69, size: 64, offset: 1664)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !31, line: 861, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !30, !10}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !34, file: !35, line: 37, baseType: !69, size: 64, offset: 1728)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !34, file: !35, line: 39, baseType: !23, size: 64, offset: 1792)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !34, file: !35, line: 40, baseType: !76, size: 64, offset: 1856)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !31, line: 862, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !30, !80, !15}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !7, line: 526, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !7, line: 449, baseType: !83)
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !34, file: !35, line: 41, baseType: !76, size: 64, offset: 1920)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !34, file: !35, line: 42, baseType: !23, size: 64, offset: 1984)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !34, file: !35, line: 45, baseType: !87, size: 64, offset: 2048)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !31, line: 889, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !30, !91, !80}
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !31, line: 842, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !31, line: 840, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !31, line: 832, size: 192, elements: !95)
!95 = !{!96, !99, !100, !101, !102, !103}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !94, file: !31, line: 834, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !7, line: 441, baseType: !98)
!98 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !94, file: !31, line: 835, baseType: !15, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !94, file: !31, line: 836, baseType: !82, size: 8, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !94, file: !31, line: 837, baseType: !82, size: 8, offset: 136)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !94, file: !31, line: 838, baseType: !82, size: 8, offset: 144)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !94, file: !31, line: 839, baseType: !82, size: 8, offset: 152)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !34, file: !35, line: 49, baseType: !87, size: 64, offset: 2112)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !34, file: !35, line: 56, baseType: !23, size: 64, offset: 2176)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !34, file: !35, line: 57, baseType: !82, size: 8, offset: 2240)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !34, file: !35, line: 58, baseType: !82, size: 8, offset: 2248)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !34, file: !35, line: 62, baseType: !97, size: 32, offset: 2272)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !35, line: 63, baseType: !97, size: 32, offset: 2304)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !34, file: !35, line: 64, baseType: !97, size: 32, offset: 2336)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !34, file: !35, line: 66, baseType: !112, size: 896, offset: 2368)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !113, line: 104, baseType: !114)
!113 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !113, line: 85, size: 896, elements: !115)
!115 = !{!116, !121, !123, !125, !126, !127, !128, !129, !134, !140, !145, !146, !147, !148}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !114, file: !113, line: 86, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !119, line: 374, baseType: !120)
!119 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !119, line: 365, baseType: !83)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !114, file: !113, line: 87, baseType: !122, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !119, line: 367, baseType: !98)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !114, file: !113, line: 88, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !119, line: 368, baseType: !18)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !114, file: !113, line: 90, baseType: !117, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !114, file: !113, line: 91, baseType: !122, size: 32, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !114, file: !113, line: 92, baseType: !124, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !114, file: !113, line: 94, baseType: !8, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !114, file: !113, line: 95, baseType: !130, size: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !113, line: 1714, size: 32, elements: !132)
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !131, file: !113, line: 1714, baseType: !13, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !114, file: !113, line: 97, baseType: !135, size: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !113, line: 80, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !139, !122, !122}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !119, line: 383, baseType: !22)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !114, file: !113, line: 98, baseType: !141, size: 64, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !113, line: 81, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !139, !139}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !114, file: !113, line: 99, baseType: !139, size: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !114, file: !113, line: 101, baseType: !13, size: 32, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !114, file: !113, line: 102, baseType: !124, size: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !114, file: !113, line: 103, baseType: !124, size: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !34, file: !35, line: 67, baseType: !80, size: 64, offset: 3264)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !34, file: !35, line: 68, baseType: !122, size: 32, offset: 3328)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !34, file: !35, line: 80, baseType: !97, size: 32, offset: 3360)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !34, file: !35, line: 83, baseType: !13, size: 32, offset: 3392)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !34, file: !35, line: 84, baseType: !13, size: 32, offset: 3424)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !34, file: !35, line: 85, baseType: !13, size: 32, offset: 3456)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !34, file: !35, line: 86, baseType: !13, size: 32, offset: 3488)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !34, file: !35, line: 87, baseType: !13, size: 32, offset: 3520)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !34, file: !35, line: 92, baseType: !13, size: 32, offset: 3552)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !34, file: !35, line: 93, baseType: !13, size: 32, offset: 3584)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !34, file: !35, line: 94, baseType: !13, size: 32, offset: 3616)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !34, file: !35, line: 95, baseType: !13, size: 32, offset: 3648)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !34, file: !35, line: 96, baseType: !13, size: 32, offset: 3680)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !34, file: !35, line: 100, baseType: !97, size: 32, offset: 3712)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !34, file: !35, line: 101, baseType: !97, size: 32, offset: 3744)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !34, file: !35, line: 102, baseType: !97, size: 32, offset: 3776)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !34, file: !35, line: 103, baseType: !97, size: 32, offset: 3808)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !34, file: !35, line: 104, baseType: !15, size: 64, offset: 3840)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !34, file: !35, line: 105, baseType: !97, size: 32, offset: 3904)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !34, file: !35, line: 106, baseType: !97, size: 32, offset: 3936)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !34, file: !35, line: 107, baseType: !97, size: 32, offset: 3968)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !34, file: !35, line: 108, baseType: !80, size: 64, offset: 4032)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !34, file: !35, line: 111, baseType: !80, size: 64, offset: 4096)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !34, file: !35, line: 114, baseType: !80, size: 64, offset: 4160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !34, file: !35, line: 115, baseType: !80, size: 64, offset: 4224)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !34, file: !35, line: 116, baseType: !80, size: 64, offset: 4288)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !34, file: !35, line: 117, baseType: !80, size: 64, offset: 4352)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !34, file: !35, line: 118, baseType: !15, size: 64, offset: 4416)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !34, file: !35, line: 120, baseType: !97, size: 32, offset: 4480)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !34, file: !35, line: 121, baseType: !97, size: 32, offset: 4512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !34, file: !35, line: 122, baseType: !180, size: 64, offset: 4544)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !31, line: 559, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !31, line: 558, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !31, line: 553, size: 24, elements: !184)
!184 = !{!185, !186, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !183, file: !31, line: 555, baseType: !82, size: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !183, file: !31, line: 556, baseType: !82, size: 8, offset: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !183, file: !31, line: 557, baseType: !82, size: 8, offset: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !34, file: !35, line: 123, baseType: !189, size: 16, offset: 4608)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !7, line: 447, baseType: !190)
!190 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !34, file: !35, line: 127, baseType: !13, size: 32, offset: 4640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !34, file: !35, line: 130, baseType: !189, size: 16, offset: 4672)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !34, file: !35, line: 131, baseType: !82, size: 8, offset: 4688)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !34, file: !35, line: 132, baseType: !82, size: 8, offset: 4696)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !34, file: !35, line: 133, baseType: !82, size: 8, offset: 4704)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !34, file: !35, line: 134, baseType: !82, size: 8, offset: 4712)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !34, file: !35, line: 135, baseType: !82, size: 8, offset: 4720)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !34, file: !35, line: 136, baseType: !82, size: 8, offset: 4728)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !34, file: !35, line: 137, baseType: !82, size: 8, offset: 4736)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !34, file: !35, line: 138, baseType: !82, size: 8, offset: 4744)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !34, file: !35, line: 139, baseType: !82, size: 8, offset: 4752)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !34, file: !35, line: 140, baseType: !82, size: 8, offset: 4760)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !34, file: !35, line: 141, baseType: !82, size: 8, offset: 4768)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !34, file: !35, line: 142, baseType: !82, size: 8, offset: 4776)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !34, file: !35, line: 143, baseType: !82, size: 8, offset: 4784)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !34, file: !35, line: 145, baseType: !82, size: 8, offset: 4792)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !34, file: !35, line: 147, baseType: !208, size: 40, offset: 4800)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 40, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 5)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !34, file: !35, line: 151, baseType: !189, size: 16, offset: 4848)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !34, file: !35, line: 156, baseType: !82, size: 8, offset: 4864)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !34, file: !35, line: 157, baseType: !214, size: 32, offset: 4896)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !7, line: 521, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !7, line: 442, baseType: !13)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !34, file: !35, line: 158, baseType: !217, size: 80, offset: 4928)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !31, line: 570, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !31, line: 563, size: 80, elements: !219)
!219 = !{!220, !221, !222, !223, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !218, file: !31, line: 565, baseType: !82, size: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !218, file: !31, line: 566, baseType: !189, size: 16, offset: 16)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !218, file: !31, line: 567, baseType: !189, size: 16, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !218, file: !31, line: 568, baseType: !189, size: 16, offset: 48)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !218, file: !31, line: 569, baseType: !189, size: 16, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !34, file: !35, line: 160, baseType: !217, size: 80, offset: 5008)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !34, file: !35, line: 165, baseType: !227, size: 64, offset: 5120)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !31, line: 863, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !30}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !34, file: !35, line: 166, baseType: !97, size: 32, offset: 5184)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !34, file: !35, line: 167, baseType: !97, size: 32, offset: 5216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !34, file: !35, line: 171, baseType: !13, size: 32, offset: 5248)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !34, file: !35, line: 172, baseType: !214, size: 32, offset: 5280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !34, file: !35, line: 173, baseType: !214, size: 32, offset: 5312)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !34, file: !35, line: 175, baseType: !80, size: 64, offset: 5376)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !34, file: !35, line: 176, baseType: !238, size: 64, offset: 5440)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !7, line: 556, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !34, file: !35, line: 180, baseType: !80, size: 64, offset: 5504)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !34, file: !35, line: 181, baseType: !80, size: 64, offset: 5568)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !34, file: !35, line: 182, baseType: !238, size: 64, offset: 5632)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !34, file: !35, line: 183, baseType: !238, size: 64, offset: 5696)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !34, file: !35, line: 188, baseType: !246, size: 40, offset: 5760)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !31, line: 582, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !31, line: 575, size: 40, elements: !248)
!248 = !{!249, !250, !251, !252, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !247, file: !31, line: 577, baseType: !82, size: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !247, file: !31, line: 578, baseType: !82, size: 8, offset: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !247, file: !31, line: 579, baseType: !82, size: 8, offset: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !247, file: !31, line: 580, baseType: !82, size: 8, offset: 24)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !247, file: !31, line: 581, baseType: !82, size: 8, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !34, file: !35, line: 192, baseType: !246, size: 40, offset: 5800)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !34, file: !35, line: 197, baseType: !80, size: 64, offset: 5888)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !34, file: !35, line: 198, baseType: !217, size: 80, offset: 5952)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !34, file: !35, line: 201, baseType: !258, size: 64, offset: 6080)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !31, line: 864, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !30, !97, !13}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !34, file: !35, line: 202, baseType: !263, size: 64, offset: 6144)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !31, line: 866, baseType: !259)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !34, file: !35, line: 204, baseType: !265, size: 64, offset: 6208)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !31, line: 870, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !30, !269}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !31, line: 723, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !31, line: 722, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !273, line: 56, size: 2496, elements: !274)
!273 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !292, !293, !294, !295, !296, !309, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !346, !347, !348, !349, !359, !360, !361, !362, !363, !364, !384, !385, !386, !387, !388}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !272, file: !273, line: 59, baseType: !97, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !272, file: !273, line: 60, baseType: !97, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !272, file: !273, line: 61, baseType: !97, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !272, file: !273, line: 62, baseType: !15, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !272, file: !273, line: 63, baseType: !180, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !272, file: !273, line: 64, baseType: !189, size: 16, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !272, file: !273, line: 65, baseType: !189, size: 16, offset: 272)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !272, file: !273, line: 66, baseType: !82, size: 8, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !272, file: !273, line: 67, baseType: !82, size: 8, offset: 296)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !272, file: !273, line: 69, baseType: !82, size: 8, offset: 304)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !272, file: !273, line: 70, baseType: !82, size: 8, offset: 312)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !272, file: !273, line: 71, baseType: !82, size: 8, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !272, file: !273, line: 74, baseType: !82, size: 8, offset: 328)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !272, file: !273, line: 75, baseType: !82, size: 8, offset: 336)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !272, file: !273, line: 76, baseType: !82, size: 8, offset: 344)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !272, file: !273, line: 77, baseType: !291, size: 64, offset: 352)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, elements: !48)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !272, file: !273, line: 90, baseType: !214, size: 32, offset: 416)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !272, file: !273, line: 96, baseType: !82, size: 8, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !272, file: !273, line: 108, baseType: !13, size: 32, offset: 480)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !272, file: !273, line: 109, baseType: !13, size: 32, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !272, file: !273, line: 110, baseType: !297, size: 64, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !31, line: 654, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !31, line: 653, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !31, line: 637, size: 448, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !300, file: !31, line: 639, baseType: !13, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !300, file: !31, line: 644, baseType: !6, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !300, file: !31, line: 645, baseType: !6, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !300, file: !31, line: 647, baseType: !15, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !300, file: !31, line: 648, baseType: !15, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !300, file: !31, line: 649, baseType: !6, size: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !300, file: !31, line: 651, baseType: !6, size: 64, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !272, file: !273, line: 117, baseType: !310, size: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !31, line: 683, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !31, line: 675, size: 64, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !311, file: !31, line: 677, baseType: !189, size: 16)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !311, file: !31, line: 678, baseType: !82, size: 8, offset: 16)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !311, file: !31, line: 679, baseType: !82, size: 8, offset: 24)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !311, file: !31, line: 680, baseType: !82, size: 8, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !311, file: !31, line: 681, baseType: !82, size: 8, offset: 40)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !311, file: !31, line: 682, baseType: !82, size: 8, offset: 48)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !272, file: !273, line: 127, baseType: !246, size: 40, offset: 704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !272, file: !273, line: 141, baseType: !80, size: 64, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !272, file: !273, line: 142, baseType: !217, size: 80, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !272, file: !273, line: 152, baseType: !217, size: 80, offset: 912)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !272, file: !273, line: 161, baseType: !215, size: 32, offset: 992)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !272, file: !273, line: 162, baseType: !215, size: 32, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !272, file: !273, line: 163, baseType: !82, size: 8, offset: 1056)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !272, file: !273, line: 171, baseType: !97, size: 32, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !272, file: !273, line: 172, baseType: !97, size: 32, offset: 1120)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !272, file: !273, line: 173, baseType: !82, size: 8, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !272, file: !273, line: 183, baseType: !330, size: 64, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !7, line: 532, baseType: !240)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !272, file: !273, line: 193, baseType: !214, size: 32, offset: 1280)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !272, file: !273, line: 194, baseType: !214, size: 32, offset: 1312)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !272, file: !273, line: 195, baseType: !214, size: 32, offset: 1344)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !272, file: !273, line: 196, baseType: !214, size: 32, offset: 1376)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !272, file: !273, line: 197, baseType: !214, size: 32, offset: 1408)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !272, file: !273, line: 198, baseType: !214, size: 32, offset: 1440)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !272, file: !273, line: 199, baseType: !214, size: 32, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !272, file: !273, line: 200, baseType: !214, size: 32, offset: 1504)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !272, file: !273, line: 215, baseType: !6, size: 64, offset: 1536)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !272, file: !273, line: 216, baseType: !215, size: 32, offset: 1600)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !272, file: !273, line: 217, baseType: !215, size: 32, offset: 1632)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !272, file: !273, line: 218, baseType: !6, size: 64, offset: 1664)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !272, file: !273, line: 219, baseType: !344, size: 64, offset: 1728)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !7, line: 559, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !272, file: !273, line: 220, baseType: !82, size: 8, offset: 1792)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !272, file: !273, line: 221, baseType: !82, size: 8, offset: 1800)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !272, file: !273, line: 225, baseType: !97, size: 32, offset: 1824)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !272, file: !273, line: 230, baseType: !350, size: 64, offset: 1856)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !31, line: 707, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !31, line: 706, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !31, line: 695, size: 256, elements: !354)
!354 = !{!355, !356, !357, !358}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !31, line: 697, baseType: !208, size: 40)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !353, file: !31, line: 698, baseType: !81, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !353, file: !31, line: 699, baseType: !15, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !353, file: !31, line: 702, baseType: !82, size: 8, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !272, file: !273, line: 231, baseType: !13, size: 32, offset: 1920)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !272, file: !273, line: 236, baseType: !6, size: 64, offset: 1984)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !272, file: !273, line: 237, baseType: !80, size: 64, offset: 2048)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !272, file: !273, line: 238, baseType: !97, size: 32, offset: 2112)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !272, file: !273, line: 239, baseType: !82, size: 8, offset: 2144)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !272, file: !273, line: 244, baseType: !365, size: 64, offset: 2176)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !31, line: 615, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !31, line: 614, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !31, line: 608, size: 256, elements: !369)
!369 = !{!370, !371, !372, !383}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !368, file: !31, line: 610, baseType: !6, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !368, file: !31, line: 611, baseType: !82, size: 8, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !368, file: !31, line: 612, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !31, line: 599, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !31, line: 598, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !31, line: 591, size: 80, elements: !377)
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !376, file: !31, line: 593, baseType: !189, size: 16)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !376, file: !31, line: 594, baseType: !189, size: 16, offset: 16)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !376, file: !31, line: 595, baseType: !189, size: 16, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !376, file: !31, line: 596, baseType: !189, size: 16, offset: 48)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !376, file: !31, line: 597, baseType: !189, size: 16, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !368, file: !31, line: 613, baseType: !215, size: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !272, file: !273, line: 245, baseType: !97, size: 32, offset: 2240)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !272, file: !273, line: 256, baseType: !82, size: 8, offset: 2272)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !272, file: !273, line: 257, baseType: !6, size: 64, offset: 2304)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !272, file: !273, line: 258, baseType: !6, size: 64, offset: 2368)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !272, file: !273, line: 265, baseType: !389, size: 64, offset: 2432)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !7, line: 553, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !34, file: !35, line: 205, baseType: !392, size: 64, offset: 6272)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !31, line: 883, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !30, !80, !97, !13}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !34, file: !35, line: 206, baseType: !397, size: 64, offset: 6336)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !31, line: 871, baseType: !266)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !34, file: !35, line: 207, baseType: !80, size: 64, offset: 6400)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !34, file: !35, line: 208, baseType: !80, size: 64, offset: 6464)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !34, file: !35, line: 209, baseType: !80, size: 64, offset: 6528)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !34, file: !35, line: 210, baseType: !80, size: 64, offset: 6592)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !34, file: !35, line: 211, baseType: !97, size: 32, offset: 6656)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !34, file: !35, line: 212, baseType: !97, size: 32, offset: 6688)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !34, file: !35, line: 213, baseType: !15, size: 64, offset: 6720)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !34, file: !35, line: 214, baseType: !15, size: 64, offset: 6784)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !34, file: !35, line: 215, baseType: !15, size: 64, offset: 6848)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !34, file: !35, line: 216, baseType: !15, size: 64, offset: 6912)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !34, file: !35, line: 217, baseType: !13, size: 32, offset: 6976)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !34, file: !35, line: 218, baseType: !13, size: 32, offset: 7008)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !34, file: !35, line: 232, baseType: !80, size: 64, offset: 7040)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !34, file: !35, line: 233, baseType: !80, size: 64, offset: 7104)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !34, file: !35, line: 237, baseType: !330, size: 64, offset: 7168)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !34, file: !35, line: 241, baseType: !82, size: 8, offset: 7232)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !34, file: !35, line: 242, baseType: !82, size: 8, offset: 7240)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !34, file: !35, line: 243, baseType: !80, size: 64, offset: 7296)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !34, file: !35, line: 244, baseType: !330, size: 64, offset: 7360)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !34, file: !35, line: 245, baseType: !330, size: 64, offset: 7424)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !34, file: !35, line: 246, baseType: !330, size: 64, offset: 7488)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !34, file: !35, line: 247, baseType: !330, size: 64, offset: 7552)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !34, file: !35, line: 251, baseType: !421, size: 232, offset: 7616)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 232, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 29)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !34, file: !35, line: 256, baseType: !97, size: 32, offset: 7872)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !34, file: !35, line: 259, baseType: !23, size: 64, offset: 7936)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !34, file: !35, line: 260, baseType: !427, size: 64, offset: 8000)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !31, line: 894, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!13, !30, !350}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !34, file: !35, line: 264, baseType: !13, size: 32, offset: 8064)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !34, file: !35, line: 265, baseType: !80, size: 64, offset: 8128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !34, file: !35, line: 270, baseType: !82, size: 8, offset: 8192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !34, file: !35, line: 275, baseType: !82, size: 8, offset: 8200)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !34, file: !35, line: 277, baseType: !82, size: 8, offset: 8208)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !34, file: !35, line: 279, baseType: !189, size: 16, offset: 8224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !34, file: !35, line: 280, baseType: !189, size: 16, offset: 8240)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !34, file: !35, line: 287, baseType: !97, size: 32, offset: 8256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !34, file: !35, line: 292, baseType: !82, size: 8, offset: 8288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !34, file: !35, line: 299, baseType: !23, size: 64, offset: 8320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !34, file: !35, line: 300, baseType: !442, size: 64, offset: 8384)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !31, line: 950, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!23, !30, !14}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !34, file: !35, line: 301, baseType: !447, size: 64, offset: 8448)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !31, line: 952, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !30, !23}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !34, file: !35, line: 305, baseType: !80, size: 64, offset: 8512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !34, file: !35, line: 309, baseType: !80, size: 64, offset: 8576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !34, file: !35, line: 310, baseType: !80, size: 64, offset: 8640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !34, file: !35, line: 312, baseType: !80, size: 64, offset: 8704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !34, file: !35, line: 317, baseType: !82, size: 8, offset: 8768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !34, file: !35, line: 320, baseType: !97, size: 32, offset: 8800)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !34, file: !35, line: 321, baseType: !97, size: 32, offset: 8832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !34, file: !35, line: 326, baseType: !97, size: 32, offset: 8864)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !34, file: !35, line: 331, baseType: !14, size: 64, offset: 8896)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !34, file: !35, line: 337, baseType: !352, size: 256, offset: 8960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !34, file: !35, line: 341, baseType: !15, size: 64, offset: 9216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !34, file: !35, line: 344, baseType: !6, size: 64, offset: 9280)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !34, file: !35, line: 348, baseType: !97, size: 32, offset: 9344)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !34, file: !35, line: 352, baseType: !80, size: 64, offset: 9408)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !34, file: !35, line: 354, baseType: !466, size: 256, offset: 9472)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 256, elements: !473)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !91, !80, !470}
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !7, line: 527, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!473 = !{!474}
!474 = !DISubrange(count: 4)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 32)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 80, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 10)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "png_digit", scope: !19, file: !3, line: 375, type: !484, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, elements: !58)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 136, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 17)
!488 = !{i32 7, !"Dwarf Version", i32 4}
!489 = !{i32 2, !"Debug Info Version", i32 3}
!490 = !{i32 1, !"wchar_size", i32 4}
!491 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!492 = distinct !DISubprogram(name: "png_error", scope: !3, file: !3, line: 38, type: !71, scopeLine: 40, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !20)
!493 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !492, file: !3, line: 38, type: !30)
!494 = !DILocation(line: 38, column: 1, scope: !492)
!495 = !DILocalVariable(name: "error_message", arg: 2, scope: !492, file: !3, line: 38, type: !10)
!496 = !DILocation(line: 81, column: 8, scope: !497)
!497 = distinct !DILexicalBlock(scope: !492, file: !3, line: 81, column: 8)
!498 = !DILocation(line: 81, column: 16, scope: !497)
!499 = !DILocation(line: 81, column: 24, scope: !497)
!500 = !DILocation(line: 81, column: 27, scope: !497)
!501 = !DILocation(line: 81, column: 36, scope: !497)
!502 = !DILocation(line: 81, column: 45, scope: !497)
!503 = !DILocation(line: 81, column: 8, scope: !492)
!504 = !DILocation(line: 82, column: 10, scope: !497)
!505 = !DILocation(line: 82, column: 19, scope: !497)
!506 = !DILocation(line: 82, column: 30, scope: !497)
!507 = !DILocation(line: 82, column: 39, scope: !497)
!508 = !DILocation(line: 82, column: 7, scope: !497)
!509 = !DILocation(line: 86, column: 22, scope: !492)
!510 = !DILocation(line: 86, column: 31, scope: !492)
!511 = !DILocation(line: 86, column: 4, scope: !492)
!512 = distinct !DISubprogram(name: "png_default_error", scope: !3, file: !3, line: 517, type: !71, scopeLine: 520, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !19, retainedNodes: !20)
!513 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !512, file: !3, line: 517, type: !30)
!514 = !DILocation(line: 517, column: 8, scope: !512)
!515 = !DILocalVariable(name: "error_message", arg: 2, scope: !512, file: !3, line: 517, type: !10)
!516 = !DILocation(line: 554, column: 15, scope: !517)
!517 = distinct !DILexicalBlock(scope: !512, file: !3, line: 553, column: 4)
!518 = !DILocation(line: 554, column: 43, scope: !517)
!519 = !DILocation(line: 554, column: 59, scope: !517)
!520 = !DILocation(line: 554, column: 7, scope: !517)
!521 = !DILocation(line: 556, column: 15, scope: !517)
!522 = !DILocation(line: 556, column: 7, scope: !517)
!523 = !DILocation(line: 561, column: 16, scope: !512)
