; ModuleID = 'libpng/pngwtran.c'
source_filename = "libpng/pngwtran.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "libpng/pngwtran.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !8, !9, !11, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !6, line: 441, baseType: !7)
!6 = !DIFile(filename: "libpng/pngconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !6, line: 449, baseType: !10)
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !6, line: 454, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 46, baseType: !14)
!13 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!14 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !6, line: 447, baseType: !16)
!16 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!17 = !{i32 7, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{i32 1, !"wchar_size", i32 4}
!20 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!21 = distinct !DISubprogram(name: "png_do_write_transformations", scope: !1, file: !1, line: 23, type: !22, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24, !88}
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !25, line: 851, baseType: !26)
!25 = !DIFile(filename: "libpng/png.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !25, line: 849, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !29, line: 29, size: 9728, elements: !30)
!29 = !DIFile(filename: "libpng/pngstruct.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !56, !62, !71, !72, !74, !81, !82, !83, !99, !100, !101, !102, !103, !104, !105, !106, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !205, !206, !207, !210, !219, !220, !225, !226, !227, !228, !229, !230, !231, !235, !236, !237, !238, !239, !248, !249, !250, !251, !256, !258, !386, !391, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !419, !420, !421, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !442, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_buffer", scope: !28, file: !29, line: 32, baseType: !32, size: 1600)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !33, line: 45, baseType: !34)
!33 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1600, elements: !54)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !33, line: 33, size: 1600, elements: !36)
!36 = !{!37, !44, !45}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !35, file: !33, line: 39, baseType: !38, size: 512)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !39, line: 31, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, elements: !42)
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !{!43}
!43 = !DISubrange(count: 8)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !35, file: !33, line: 40, baseType: !8, size: 32, offset: 512)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !35, file: !33, line: 41, baseType: !46, size: 1024, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !47, line: 8, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 5, size: 1024, elements: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !48, file: !47, line: 7, baseType: !51, size: 1024)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1024, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 16)
!54 = !{!55}
!55 = !DISubrange(count: 1)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !28, file: !29, line: 33, baseType: !57, size: 64, offset: 1600)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !25, line: 913, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61, !8}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !28, file: !29, line: 35, baseType: !63, size: 64, offset: 1664)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !25, line: 861, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !24, !67}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !6, line: 537, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !28, file: !29, line: 37, baseType: !63, size: 64, offset: 1728)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !28, file: !29, line: 39, baseType: !73, size: 64, offset: 1792)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !6, line: 524, baseType: !4)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !28, file: !29, line: 40, baseType: !75, size: 64, offset: 1856)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !25, line: 862, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !24, !79, !11}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !6, line: 526, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !28, file: !29, line: 41, baseType: !75, size: 64, offset: 1920)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !28, file: !29, line: 42, baseType: !73, size: 64, offset: 1984)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !28, file: !29, line: 45, baseType: !84, size: 64, offset: 2048)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !25, line: 889, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !24, !88, !79}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !25, line: 842, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !25, line: 840, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !25, line: 832, size: 192, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !91, file: !25, line: 834, baseType: !5, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !91, file: !25, line: 835, baseType: !11, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !91, file: !25, line: 836, baseType: !9, size: 8, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !91, file: !25, line: 837, baseType: !9, size: 8, offset: 136)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !91, file: !25, line: 838, baseType: !9, size: 8, offset: 144)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !91, file: !25, line: 839, baseType: !9, size: 8, offset: 152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !28, file: !29, line: 49, baseType: !84, size: 64, offset: 2112)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !28, file: !29, line: 56, baseType: !73, size: 64, offset: 2176)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !28, file: !29, line: 57, baseType: !9, size: 8, offset: 2240)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !28, file: !29, line: 58, baseType: !9, size: 8, offset: 2248)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !28, file: !29, line: 62, baseType: !5, size: 32, offset: 2272)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !28, file: !29, line: 63, baseType: !5, size: 32, offset: 2304)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !28, file: !29, line: 64, baseType: !5, size: 32, offset: 2336)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !28, file: !29, line: 66, baseType: !107, size: 896, offset: 2368)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !108, line: 104, baseType: !109)
!108 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !108, line: 85, size: 896, elements: !110)
!110 = !{!111, !116, !118, !120, !121, !122, !123, !125, !130, !136, !141, !142, !143, !144}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !109, file: !108, line: 86, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !114, line: 374, baseType: !115)
!114 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !114, line: 365, baseType: !10)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !109, file: !108, line: 87, baseType: !117, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !114, line: 367, baseType: !7)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !109, file: !108, line: 88, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !114, line: 368, baseType: !14)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !109, file: !108, line: 90, baseType: !112, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !109, file: !108, line: 91, baseType: !117, size: 32, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !109, file: !108, line: 92, baseType: !119, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !109, file: !108, line: 94, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !108, line: 95, baseType: !126, size: 64, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !108, line: 1714, size: 32, elements: !128)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !127, file: !108, line: 1714, baseType: !8, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !109, file: !108, line: 97, baseType: !131, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !108, line: 80, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !135, !117, !117}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !114, line: 383, baseType: !4)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !109, file: !108, line: 98, baseType: !137, size: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !108, line: 81, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !135, !135}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !109, file: !108, line: 99, baseType: !135, size: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !109, file: !108, line: 101, baseType: !8, size: 32, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !109, file: !108, line: 102, baseType: !119, size: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !109, file: !108, line: 103, baseType: !119, size: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !28, file: !29, line: 67, baseType: !79, size: 64, offset: 3264)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !28, file: !29, line: 68, baseType: !117, size: 32, offset: 3328)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_state", scope: !28, file: !29, line: 80, baseType: !5, size: 32, offset: 3360)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !28, file: !29, line: 83, baseType: !8, size: 32, offset: 3392)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !28, file: !29, line: 84, baseType: !8, size: 32, offset: 3424)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !28, file: !29, line: 85, baseType: !8, size: 32, offset: 3456)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !28, file: !29, line: 86, baseType: !8, size: 32, offset: 3488)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !28, file: !29, line: 87, baseType: !8, size: 32, offset: 3520)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_level", scope: !28, file: !29, line: 92, baseType: !8, size: 32, offset: 3552)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_method", scope: !28, file: !29, line: 93, baseType: !8, size: 32, offset: 3584)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_window_bits", scope: !28, file: !29, line: 94, baseType: !8, size: 32, offset: 3616)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_mem_level", scope: !28, file: !29, line: 95, baseType: !8, size: 32, offset: 3648)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_text_strategy", scope: !28, file: !29, line: 96, baseType: !8, size: 32, offset: 3680)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !28, file: !29, line: 100, baseType: !5, size: 32, offset: 3712)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !28, file: !29, line: 101, baseType: !5, size: 32, offset: 3744)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !28, file: !29, line: 102, baseType: !5, size: 32, offset: 3776)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !28, file: !29, line: 103, baseType: !5, size: 32, offset: 3808)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !28, file: !29, line: 104, baseType: !11, size: 64, offset: 3840)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !28, file: !29, line: 105, baseType: !5, size: 32, offset: 3904)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !28, file: !29, line: 106, baseType: !5, size: 32, offset: 3936)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !28, file: !29, line: 107, baseType: !5, size: 32, offset: 3968)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !28, file: !29, line: 108, baseType: !79, size: 64, offset: 4032)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !28, file: !29, line: 111, baseType: !79, size: 64, offset: 4096)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !28, file: !29, line: 114, baseType: !79, size: 64, offset: 4160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !28, file: !29, line: 115, baseType: !79, size: 64, offset: 4224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !28, file: !29, line: 116, baseType: !79, size: 64, offset: 4288)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !28, file: !29, line: 117, baseType: !79, size: 64, offset: 4352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "info_rowbytes", scope: !28, file: !29, line: 118, baseType: !11, size: 64, offset: 4416)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !28, file: !29, line: 120, baseType: !5, size: 32, offset: 4480)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !28, file: !29, line: 121, baseType: !5, size: 32, offset: 4512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !28, file: !29, line: 122, baseType: !176, size: 64, offset: 4544)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !25, line: 559, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !25, line: 558, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !25, line: 553, size: 24, elements: !180)
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !179, file: !25, line: 555, baseType: !9, size: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !179, file: !25, line: 556, baseType: !9, size: 8, offset: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !179, file: !25, line: 557, baseType: !9, size: 8, offset: 16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !28, file: !29, line: 123, baseType: !15, size: 16, offset: 4608)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette_max", scope: !28, file: !29, line: 127, baseType: !8, size: 32, offset: 4640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !28, file: !29, line: 130, baseType: !15, size: 16, offset: 4672)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !28, file: !29, line: 131, baseType: !9, size: 8, offset: 4688)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !28, file: !29, line: 132, baseType: !9, size: 8, offset: 4696)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !28, file: !29, line: 133, baseType: !9, size: 8, offset: 4704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !28, file: !29, line: 134, baseType: !9, size: 8, offset: 4712)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !28, file: !29, line: 135, baseType: !9, size: 8, offset: 4720)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !28, file: !29, line: 136, baseType: !9, size: 8, offset: 4728)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !28, file: !29, line: 137, baseType: !9, size: 8, offset: 4736)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !28, file: !29, line: 138, baseType: !9, size: 8, offset: 4744)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !28, file: !29, line: 139, baseType: !9, size: 8, offset: 4752)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !28, file: !29, line: 140, baseType: !9, size: 8, offset: 4760)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !28, file: !29, line: 141, baseType: !9, size: 8, offset: 4768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !28, file: !29, line: 142, baseType: !9, size: 8, offset: 4776)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_pixel_depth", scope: !28, file: !29, line: 143, baseType: !9, size: 8, offset: 4784)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "transformed_pixel_depth", scope: !28, file: !29, line: 145, baseType: !9, size: 8, offset: 4792)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "io_chunk_string", scope: !28, file: !29, line: 147, baseType: !202, size: 40, offset: 4800)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 40, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 5)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !28, file: !29, line: 151, baseType: !15, size: 16, offset: 4848)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !28, file: !29, line: 156, baseType: !9, size: 8, offset: 4864)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !28, file: !29, line: 157, baseType: !208, size: 32, offset: 4896)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !6, line: 521, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !6, line: 442, baseType: !8)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !28, file: !29, line: 158, baseType: !211, size: 80, offset: 4928)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !25, line: 570, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !25, line: 563, size: 80, elements: !213)
!213 = !{!214, !215, !216, !217, !218}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !212, file: !25, line: 565, baseType: !9, size: 8)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !212, file: !25, line: 566, baseType: !15, size: 16, offset: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !212, file: !25, line: 567, baseType: !15, size: 16, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !212, file: !25, line: 568, baseType: !15, size: 16, offset: 48)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !212, file: !25, line: 569, baseType: !15, size: 16, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !28, file: !29, line: 160, baseType: !211, size: 80, offset: 5008)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !28, file: !29, line: 165, baseType: !221, size: 64, offset: 5120)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !25, line: 863, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !24}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !28, file: !29, line: 166, baseType: !5, size: 32, offset: 5184)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !28, file: !29, line: 167, baseType: !5, size: 32, offset: 5216)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !28, file: !29, line: 171, baseType: !8, size: 32, offset: 5248)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !28, file: !29, line: 172, baseType: !208, size: 32, offset: 5280)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !28, file: !29, line: 173, baseType: !208, size: 32, offset: 5312)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !28, file: !29, line: 175, baseType: !79, size: 64, offset: 5376)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !28, file: !29, line: 176, baseType: !232, size: 64, offset: 5440)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !6, line: 556, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !28, file: !29, line: 180, baseType: !79, size: 64, offset: 5504)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !28, file: !29, line: 181, baseType: !79, size: 64, offset: 5568)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !28, file: !29, line: 182, baseType: !232, size: 64, offset: 5632)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !28, file: !29, line: 183, baseType: !232, size: 64, offset: 5696)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !28, file: !29, line: 188, baseType: !240, size: 40, offset: 5760)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !25, line: 582, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !25, line: 575, size: 40, elements: !242)
!242 = !{!243, !244, !245, !246, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !241, file: !25, line: 577, baseType: !9, size: 8)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !241, file: !25, line: 578, baseType: !9, size: 8, offset: 8)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !241, file: !25, line: 579, baseType: !9, size: 8, offset: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !241, file: !25, line: 580, baseType: !9, size: 8, offset: 24)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !241, file: !25, line: 581, baseType: !9, size: 8, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !28, file: !29, line: 192, baseType: !240, size: 40, offset: 5800)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !28, file: !29, line: 197, baseType: !79, size: 64, offset: 5888)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !28, file: !29, line: 198, baseType: !211, size: 80, offset: 5952)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !28, file: !29, line: 201, baseType: !252, size: 64, offset: 6080)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !25, line: 864, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !24, !5, !8}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !28, file: !29, line: 202, baseType: !257, size: 64, offset: 6144)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !25, line: 866, baseType: !253)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !28, file: !29, line: 204, baseType: !259, size: 64, offset: 6208)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !25, line: 870, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !24, !263}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !25, line: 723, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !25, line: 722, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_def", file: !267, line: 56, size: 2496, elements: !268)
!267 = !DIFile(filename: "libpng/pnginfo.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !286, !287, !288, !289, !290, !304, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !341, !342, !343, !344, !354, !355, !356, !357, !358, !359, !379, !380, !381, !382, !383}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !266, file: !267, line: 59, baseType: !5, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !266, file: !267, line: 60, baseType: !5, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !266, file: !267, line: 61, baseType: !5, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !266, file: !267, line: 62, baseType: !11, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !266, file: !267, line: 63, baseType: !176, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !266, file: !267, line: 64, baseType: !15, size: 16, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !266, file: !267, line: 65, baseType: !15, size: 16, offset: 272)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !266, file: !267, line: 66, baseType: !9, size: 8, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !266, file: !267, line: 67, baseType: !9, size: 8, offset: 296)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !266, file: !267, line: 69, baseType: !9, size: 8, offset: 304)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !266, file: !267, line: 70, baseType: !9, size: 8, offset: 312)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !266, file: !267, line: 71, baseType: !9, size: 8, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !266, file: !267, line: 74, baseType: !9, size: 8, offset: 328)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !266, file: !267, line: 75, baseType: !9, size: 8, offset: 336)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !266, file: !267, line: 76, baseType: !9, size: 8, offset: 344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !266, file: !267, line: 77, baseType: !285, size: 64, offset: 352)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 64, elements: !42)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !266, file: !267, line: 90, baseType: !208, size: 32, offset: 416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !266, file: !267, line: 96, baseType: !9, size: 8, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !266, file: !267, line: 108, baseType: !8, size: 32, offset: 480)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !266, file: !267, line: 109, baseType: !8, size: 32, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !266, file: !267, line: 110, baseType: !291, size: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !25, line: 654, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !25, line: 653, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !25, line: 637, size: 448, elements: !295)
!295 = !{!296, !297, !299, !300, !301, !302, !303}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !294, file: !25, line: 639, baseType: !8, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !294, file: !25, line: 644, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !6, line: 536, baseType: !124)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !294, file: !25, line: 645, baseType: !298, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !294, file: !25, line: 647, baseType: !11, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !294, file: !25, line: 648, baseType: !11, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !294, file: !25, line: 649, baseType: !298, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !294, file: !25, line: 651, baseType: !298, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !266, file: !267, line: 117, baseType: !305, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !25, line: 683, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !25, line: 675, size: 64, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !306, file: !25, line: 677, baseType: !15, size: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !306, file: !25, line: 678, baseType: !9, size: 8, offset: 16)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !306, file: !25, line: 679, baseType: !9, size: 8, offset: 24)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !306, file: !25, line: 680, baseType: !9, size: 8, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !306, file: !25, line: 681, baseType: !9, size: 8, offset: 40)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !306, file: !25, line: 682, baseType: !9, size: 8, offset: 48)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !266, file: !267, line: 127, baseType: !240, size: 40, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !266, file: !267, line: 141, baseType: !79, size: 64, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !266, file: !267, line: 142, baseType: !211, size: 80, offset: 832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !266, file: !267, line: 152, baseType: !211, size: 80, offset: 912)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !266, file: !267, line: 161, baseType: !209, size: 32, offset: 992)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !266, file: !267, line: 162, baseType: !209, size: 32, offset: 1024)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !266, file: !267, line: 163, baseType: !9, size: 8, offset: 1056)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !266, file: !267, line: 171, baseType: !5, size: 32, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !266, file: !267, line: 172, baseType: !5, size: 32, offset: 1120)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !266, file: !267, line: 173, baseType: !9, size: 8, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !266, file: !267, line: 183, baseType: !325, size: 64, offset: 1216)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !6, line: 532, baseType: !234)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !266, file: !267, line: 193, baseType: !208, size: 32, offset: 1280)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !266, file: !267, line: 194, baseType: !208, size: 32, offset: 1312)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !266, file: !267, line: 195, baseType: !208, size: 32, offset: 1344)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !266, file: !267, line: 196, baseType: !208, size: 32, offset: 1376)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !266, file: !267, line: 197, baseType: !208, size: 32, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !266, file: !267, line: 198, baseType: !208, size: 32, offset: 1440)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !266, file: !267, line: 199, baseType: !208, size: 32, offset: 1472)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !266, file: !267, line: 200, baseType: !208, size: 32, offset: 1504)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !266, file: !267, line: 215, baseType: !298, size: 64, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !266, file: !267, line: 216, baseType: !209, size: 32, offset: 1600)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !266, file: !267, line: 217, baseType: !209, size: 32, offset: 1632)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !266, file: !267, line: 218, baseType: !298, size: 64, offset: 1664)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !266, file: !267, line: 219, baseType: !339, size: 64, offset: 1728)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !6, line: 559, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !266, file: !267, line: 220, baseType: !9, size: 8, offset: 1792)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !266, file: !267, line: 221, baseType: !9, size: 8, offset: 1800)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !266, file: !267, line: 225, baseType: !5, size: 32, offset: 1824)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !266, file: !267, line: 230, baseType: !345, size: 64, offset: 1856)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !25, line: 707, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !25, line: 706, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !25, line: 695, size: 256, elements: !349)
!349 = !{!350, !351, !352, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !348, file: !25, line: 697, baseType: !202, size: 40)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !348, file: !25, line: 698, baseType: !80, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !348, file: !25, line: 699, baseType: !11, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !348, file: !25, line: 702, baseType: !9, size: 8, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !266, file: !267, line: 231, baseType: !8, size: 32, offset: 1920)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !266, file: !267, line: 236, baseType: !298, size: 64, offset: 1984)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !266, file: !267, line: 237, baseType: !79, size: 64, offset: 2048)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !266, file: !267, line: 238, baseType: !5, size: 32, offset: 2112)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !266, file: !267, line: 239, baseType: !9, size: 8, offset: 2144)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !266, file: !267, line: 244, baseType: !360, size: 64, offset: 2176)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !25, line: 615, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !25, line: 614, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !25, line: 608, size: 256, elements: !364)
!364 = !{!365, !366, !367, !378}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !363, file: !25, line: 610, baseType: !298, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !363, file: !25, line: 611, baseType: !9, size: 8, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !363, file: !25, line: 612, baseType: !368, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !25, line: 599, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !25, line: 598, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !25, line: 591, size: 80, elements: !372)
!372 = !{!373, !374, !375, !376, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !371, file: !25, line: 593, baseType: !15, size: 16)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !371, file: !25, line: 594, baseType: !15, size: 16, offset: 16)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !371, file: !25, line: 595, baseType: !15, size: 16, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !371, file: !25, line: 596, baseType: !15, size: 16, offset: 48)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !371, file: !25, line: 597, baseType: !15, size: 16, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !363, file: !25, line: 613, baseType: !209, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !266, file: !267, line: 245, baseType: !5, size: 32, offset: 2240)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !266, file: !267, line: 256, baseType: !9, size: 8, offset: 2272)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !266, file: !267, line: 257, baseType: !298, size: 64, offset: 2304)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !266, file: !267, line: 258, baseType: !298, size: 64, offset: 2368)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !266, file: !267, line: 265, baseType: !384, size: 64, offset: 2432)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !6, line: 553, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !28, file: !29, line: 205, baseType: !387, size: 64, offset: 6272)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !25, line: 883, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !24, !79, !5, !8}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !28, file: !29, line: 206, baseType: !392, size: 64, offset: 6336)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !25, line: 871, baseType: !260)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !28, file: !29, line: 207, baseType: !79, size: 64, offset: 6400)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !28, file: !29, line: 208, baseType: !79, size: 64, offset: 6464)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !28, file: !29, line: 209, baseType: !79, size: 64, offset: 6528)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !28, file: !29, line: 210, baseType: !79, size: 64, offset: 6592)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !28, file: !29, line: 211, baseType: !5, size: 32, offset: 6656)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !28, file: !29, line: 212, baseType: !5, size: 32, offset: 6688)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !28, file: !29, line: 213, baseType: !11, size: 64, offset: 6720)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !28, file: !29, line: 214, baseType: !11, size: 64, offset: 6784)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !28, file: !29, line: 215, baseType: !11, size: 64, offset: 6848)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !28, file: !29, line: 216, baseType: !11, size: 64, offset: 6912)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !28, file: !29, line: 217, baseType: !8, size: 32, offset: 6976)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !28, file: !29, line: 218, baseType: !8, size: 32, offset: 7008)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !28, file: !29, line: 232, baseType: !79, size: 64, offset: 7040)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !28, file: !29, line: 233, baseType: !79, size: 64, offset: 7104)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !28, file: !29, line: 237, baseType: !325, size: 64, offset: 7168)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "heuristic_method", scope: !28, file: !29, line: 241, baseType: !9, size: 8, offset: 7232)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "num_prev_filters", scope: !28, file: !29, line: 242, baseType: !9, size: 8, offset: 7240)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "prev_filters", scope: !28, file: !29, line: 243, baseType: !79, size: 64, offset: 7296)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "filter_weights", scope: !28, file: !29, line: 244, baseType: !325, size: 64, offset: 7360)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_weights", scope: !28, file: !29, line: 245, baseType: !325, size: 64, offset: 7424)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "filter_costs", scope: !28, file: !29, line: 246, baseType: !325, size: 64, offset: 7488)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "inv_filter_costs", scope: !28, file: !29, line: 247, baseType: !325, size: 64, offset: 7552)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !28, file: !29, line: 251, baseType: !416, size: 232, offset: 7616)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 232, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 29)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !28, file: !29, line: 256, baseType: !5, size: 32, offset: 7872)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !28, file: !29, line: 259, baseType: !73, size: 64, offset: 7936)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !28, file: !29, line: 260, baseType: !422, size: 64, offset: 8000)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !25, line: 894, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!8, !24, !345}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !28, file: !29, line: 264, baseType: !8, size: 32, offset: 8064)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !28, file: !29, line: 265, baseType: !79, size: 64, offset: 8128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "is_sRGB", scope: !28, file: !29, line: 270, baseType: !9, size: 8, offset: 8192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !28, file: !29, line: 275, baseType: !9, size: 8, offset: 8200)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_coefficients_set", scope: !28, file: !29, line: 277, baseType: !9, size: 8, offset: 8208)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !28, file: !29, line: 279, baseType: !15, size: 16, offset: 8224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !28, file: !29, line: 280, baseType: !15, size: 16, offset: 8240)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !28, file: !29, line: 287, baseType: !5, size: 32, offset: 8256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !28, file: !29, line: 292, baseType: !9, size: 8, offset: 8288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !28, file: !29, line: 299, baseType: !73, size: 64, offset: 8320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !28, file: !29, line: 300, baseType: !437, size: 64, offset: 8384)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !25, line: 950, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!73, !24, !441}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !6, line: 591, baseType: !11)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !28, file: !29, line: 301, baseType: !443, size: 64, offset: 8448)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !25, line: 952, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !24, !73}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !28, file: !29, line: 305, baseType: !79, size: 64, offset: 8512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !28, file: !29, line: 309, baseType: !79, size: 64, offset: 8576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !28, file: !29, line: 310, baseType: !79, size: 64, offset: 8640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !28, file: !29, line: 312, baseType: !79, size: 64, offset: 8704)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !28, file: !29, line: 317, baseType: !9, size: 8, offset: 8768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !28, file: !29, line: 320, baseType: !5, size: 32, offset: 8800)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !28, file: !29, line: 321, baseType: !5, size: 32, offset: 8832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !28, file: !29, line: 326, baseType: !5, size: 32, offset: 8864)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !28, file: !29, line: 331, baseType: !441, size: 64, offset: 8896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !28, file: !29, line: 337, baseType: !347, size: 256, offset: 8960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !28, file: !29, line: 341, baseType: !11, size: 64, offset: 9216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !28, file: !29, line: 344, baseType: !298, size: 64, offset: 9280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !28, file: !29, line: 348, baseType: !5, size: 32, offset: 9344)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "big_prev_row", scope: !28, file: !29, line: 352, baseType: !79, size: 64, offset: 9408)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "read_filter", scope: !28, file: !29, line: 354, baseType: !462, size: 256, offset: 9472)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 256, elements: !469)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !88, !79, !466}
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_bytep", file: !6, line: 527, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!469 = !{!470}
!470 = !DISubrange(count: 4)
!471 = !DILocalVariable(name: "png_ptr", arg: 1, scope: !21, file: !1, line: 23, type: !24)
!472 = !DILocation(line: 23, column: 42, scope: !21)
!473 = !DILocalVariable(name: "row_info", arg: 2, scope: !21, file: !1, line: 23, type: !88)
!474 = !DILocation(line: 23, column: 65, scope: !21)
!475 = !DILocation(line: 27, column: 8, scope: !476)
!476 = distinct !DILexicalBlock(scope: !21, file: !1, line: 27, column: 8)
!477 = !DILocation(line: 27, column: 16, scope: !476)
!478 = !DILocation(line: 27, column: 8, scope: !21)
!479 = !DILocation(line: 28, column: 7, scope: !476)
!480 = !DILocation(line: 31, column: 8, scope: !481)
!481 = distinct !DILexicalBlock(scope: !21, file: !1, line: 31, column: 8)
!482 = !DILocation(line: 31, column: 17, scope: !481)
!483 = !DILocation(line: 31, column: 33, scope: !481)
!484 = !DILocation(line: 31, column: 8, scope: !21)
!485 = !DILocation(line: 32, column: 11, scope: !486)
!486 = distinct !DILexicalBlock(scope: !481, file: !1, line: 32, column: 11)
!487 = !DILocation(line: 32, column: 20, scope: !486)
!488 = !DILocation(line: 32, column: 44, scope: !486)
!489 = !DILocation(line: 32, column: 11, scope: !481)
!490 = !DILocation(line: 33, column: 13, scope: !486)
!491 = !DILocation(line: 33, column: 22, scope: !486)
!492 = !DILocation(line: 35, column: 15, scope: !486)
!493 = !DILocation(line: 36, column: 14, scope: !486)
!494 = !DILocation(line: 43, column: 14, scope: !486)
!495 = !DILocation(line: 43, column: 23, scope: !486)
!496 = !DILocation(line: 43, column: 31, scope: !486)
!497 = !DILocation(line: 33, column: 10, scope: !486)
!498 = !DILocation(line: 32, column: 47, scope: !486)
!499 = !DILocation(line: 47, column: 8, scope: !500)
!500 = distinct !DILexicalBlock(scope: !21, file: !1, line: 47, column: 8)
!501 = !DILocation(line: 47, column: 17, scope: !500)
!502 = !DILocation(line: 47, column: 33, scope: !500)
!503 = !DILocation(line: 47, column: 8, scope: !21)
!504 = !DILocation(line: 48, column: 28, scope: !500)
!505 = !DILocation(line: 48, column: 38, scope: !500)
!506 = !DILocation(line: 48, column: 47, scope: !500)
!507 = !DILocation(line: 48, column: 55, scope: !500)
!508 = !DILocation(line: 49, column: 12, scope: !500)
!509 = !DILocation(line: 49, column: 21, scope: !500)
!510 = !DILocation(line: 49, column: 27, scope: !500)
!511 = !DILocation(line: 49, column: 10, scope: !500)
!512 = !DILocation(line: 48, column: 7, scope: !500)
!513 = !DILocation(line: 53, column: 8, scope: !514)
!514 = distinct !DILexicalBlock(scope: !21, file: !1, line: 53, column: 8)
!515 = !DILocation(line: 53, column: 17, scope: !514)
!516 = !DILocation(line: 53, column: 33, scope: !514)
!517 = !DILocation(line: 53, column: 8, scope: !21)
!518 = !DILocation(line: 54, column: 23, scope: !514)
!519 = !DILocation(line: 54, column: 33, scope: !514)
!520 = !DILocation(line: 54, column: 42, scope: !514)
!521 = !DILocation(line: 54, column: 50, scope: !514)
!522 = !DILocation(line: 54, column: 7, scope: !514)
!523 = !DILocation(line: 58, column: 8, scope: !524)
!524 = distinct !DILexicalBlock(scope: !21, file: !1, line: 58, column: 8)
!525 = !DILocation(line: 58, column: 17, scope: !524)
!526 = !DILocation(line: 58, column: 33, scope: !524)
!527 = !DILocation(line: 58, column: 8, scope: !21)
!528 = !DILocation(line: 59, column: 19, scope: !524)
!529 = !DILocation(line: 59, column: 29, scope: !524)
