; ModuleID = 'blender/source/blender/modifiers/intern/MOD_displace.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_displace.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!56 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 384, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65, !66, !67}
!63 = !DIEnumerator(name: "MOD_DISP_DIR_X", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "MOD_DISP_DIR_Y", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "MOD_DISP_DIR_Z", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "MOD_DISP_DIR_NOR", value: 3, isUnsigned: true)
!67 = !DIEnumerator(name: "MOD_DISP_DIR_RGB_XYZ", value: 4, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 76, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!71 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 393, baseType: !7, size: 32, elements: !113)
!113 = !{!114, !115, !116, !117}
!114 = !DIEnumerator(name: "MOD_DISP_MAP_LOCAL", value: 0, isUnsigned: true)
!115 = !DIEnumerator(name: "MOD_DISP_MAP_GLOBAL", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "MOD_DISP_MAP_OBJECT", value: 2, isUnsigned: true)
!117 = !DIEnumerator(name: "MOD_DISP_MAP_UV", value: 3, isUnsigned: true)
!118 = !{!119, !1216, !1226, !1227}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisplaceModifierData", file: !61, line: 381, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DisplaceModifierData", file: !61, line: 365, size: 2240, elements: !122)
!122 = !{!123, !146, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !121, file: !61, line: 366, baseType: !124, size: 896)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !126)
!126 = !{!127, !129, !130, !132, !133, !134, !135, !140, !144}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !61, line: 100, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !61, line: 100, baseType: !128, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !61, line: 102, baseType: !131, size: 32, offset: 128)
!131 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !125, file: !61, line: 102, baseType: !131, size: 32, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !125, file: !61, line: 103, baseType: !131, size: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !125, file: !61, line: 103, baseType: !131, size: 32, offset: 224)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !61, line: 104, baseType: !136, size: 512, offset: 256)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 512, elements: !138)
!137 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !{!139}
!139 = !DISubrange(count: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !125, file: !61, line: 107, baseType: !141, size: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !143, line: 40, flags: DIFlagFwdDecl)
!143 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !125, file: !61, line: 109, baseType: !145, size: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !121, file: !61, line: 369, baseType: !147, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !149, line: 202, size: 3328, elements: !150)
!149 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = !{!151, !218, !221, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !288, !291, !294, !381, !407, !1100, !1101, !1176, !1197, !1205, !1206}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !148, file: !149, line: 203, baseType: !152, size: 960)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !153, line: 130, baseType: !154)
!153 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !153, line: 117, size: 960, elements: !155)
!155 = !{!156, !158, !159, !161, !180, !184, !186, !187, !188, !189}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !153, line: 118, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !153, line: 118, baseType: !157, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !154, file: !153, line: 119, baseType: !160, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !154, file: !153, line: 120, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !153, line: 136, size: 17600, elements: !164)
!164 = !{!165, !166, !168, !171, !175, !176, !177}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !153, line: 137, baseType: !152, size: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !163, file: !153, line: 138, baseType: !167, size: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !163, file: !153, line: 139, baseType: !169, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !153, line: 43, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !153, line: 140, baseType: !172, size: 8192, offset: 1088)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 8192, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 1024)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !163, file: !153, line: 141, baseType: !172, size: 8192, offset: 9280)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !163, file: !153, line: 148, baseType: !162, size: 64, offset: 17472)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !163, file: !153, line: 150, baseType: !178, size: 64, offset: 17536)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !153, line: 45, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !153, line: 121, baseType: !181, size: 528, offset: 256)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 528, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 66)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !153, line: 126, baseType: !185, size: 16, offset: 784)
!185 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !154, file: !153, line: 127, baseType: !131, size: 32, offset: 800)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !154, file: !153, line: 128, baseType: !131, size: 32, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !154, file: !153, line: 128, baseType: !131, size: 32, offset: 864)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !154, file: !153, line: 129, baseType: !190, size: 64, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !153, line: 75, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !153, line: 62, size: 1024, elements: !193)
!193 = !{!194, !196, !197, !198, !199, !200, !201, !202, !216, !217}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !153, line: 63, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !153, line: 63, baseType: !195, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !153, line: 64, baseType: !137, size: 8, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !192, file: !153, line: 64, baseType: !137, size: 8, offset: 136)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !153, line: 65, baseType: !185, size: 16, offset: 144)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !153, line: 66, baseType: !136, size: 512, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !192, file: !153, line: 67, baseType: !131, size: 32, offset: 672)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !153, line: 69, baseType: !203, size: 256, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !153, line: 60, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !153, line: 48, size: 256, elements: !205)
!205 = !{!206, !207, !214, !215}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !204, file: !153, line: 49, baseType: !157, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !204, file: !153, line: 58, baseType: !208, size: 128, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !209, line: 71, baseType: !210)
!209 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !209, line: 69, size: 128, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !210, file: !209, line: 70, baseType: !157, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !210, file: !209, line: 70, baseType: !157, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !204, file: !153, line: 59, baseType: !131, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !204, file: !153, line: 59, baseType: !131, size: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !192, file: !153, line: 70, baseType: !131, size: 32, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !192, file: !153, line: 74, baseType: !131, size: 32, offset: 992)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !148, file: !149, line: 204, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !149, line: 45, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !148, file: !149, line: 206, baseType: !222, size: 32, offset: 1024)
!222 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !148, file: !149, line: 206, baseType: !222, size: 32, offset: 1056)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !148, file: !149, line: 207, baseType: !222, size: 32, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !148, file: !149, line: 207, baseType: !222, size: 32, offset: 1120)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !148, file: !149, line: 207, baseType: !222, size: 32, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !148, file: !149, line: 207, baseType: !222, size: 32, offset: 1184)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !148, file: !149, line: 207, baseType: !222, size: 32, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !148, file: !149, line: 207, baseType: !222, size: 32, offset: 1248)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !148, file: !149, line: 208, baseType: !222, size: 32, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !148, file: !149, line: 208, baseType: !222, size: 32, offset: 1312)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !148, file: !149, line: 211, baseType: !222, size: 32, offset: 1344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !148, file: !149, line: 211, baseType: !222, size: 32, offset: 1376)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !148, file: !149, line: 211, baseType: !222, size: 32, offset: 1408)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !148, file: !149, line: 211, baseType: !222, size: 32, offset: 1440)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !148, file: !149, line: 211, baseType: !222, size: 32, offset: 1472)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !148, file: !149, line: 214, baseType: !222, size: 32, offset: 1504)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !148, file: !149, line: 214, baseType: !222, size: 32, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !148, file: !149, line: 217, baseType: !222, size: 32, offset: 1568)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !148, file: !149, line: 218, baseType: !222, size: 32, offset: 1600)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !148, file: !149, line: 219, baseType: !222, size: 32, offset: 1632)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !148, file: !149, line: 220, baseType: !222, size: 32, offset: 1664)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !148, file: !149, line: 221, baseType: !222, size: 32, offset: 1696)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !148, file: !149, line: 222, baseType: !185, size: 16, offset: 1728)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !148, file: !149, line: 222, baseType: !185, size: 16, offset: 1744)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !148, file: !149, line: 224, baseType: !185, size: 16, offset: 1760)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !148, file: !149, line: 224, baseType: !185, size: 16, offset: 1776)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !148, file: !149, line: 227, baseType: !185, size: 16, offset: 1792)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !148, file: !149, line: 227, baseType: !185, size: 16, offset: 1808)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !148, file: !149, line: 229, baseType: !185, size: 16, offset: 1824)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !149, line: 229, baseType: !185, size: 16, offset: 1840)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !149, line: 230, baseType: !185, size: 16, offset: 1856)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !148, file: !149, line: 230, baseType: !185, size: 16, offset: 1872)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !148, file: !149, line: 232, baseType: !222, size: 32, offset: 1888)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !148, file: !149, line: 232, baseType: !222, size: 32, offset: 1920)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !148, file: !149, line: 232, baseType: !222, size: 32, offset: 1952)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !148, file: !149, line: 232, baseType: !222, size: 32, offset: 1984)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !148, file: !149, line: 233, baseType: !131, size: 32, offset: 2016)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !148, file: !149, line: 234, baseType: !131, size: 32, offset: 2048)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !148, file: !149, line: 235, baseType: !185, size: 16, offset: 2080)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !148, file: !149, line: 235, baseType: !185, size: 16, offset: 2096)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !148, file: !149, line: 236, baseType: !185, size: 16, offset: 2112)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !148, file: !149, line: 239, baseType: !185, size: 16, offset: 2128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !148, file: !149, line: 240, baseType: !131, size: 32, offset: 2144)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !148, file: !149, line: 241, baseType: !131, size: 32, offset: 2176)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !148, file: !149, line: 241, baseType: !131, size: 32, offset: 2208)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !148, file: !149, line: 241, baseType: !131, size: 32, offset: 2240)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !148, file: !149, line: 243, baseType: !222, size: 32, offset: 2272)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !148, file: !149, line: 243, baseType: !222, size: 32, offset: 2304)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !148, file: !149, line: 244, baseType: !222, size: 32, offset: 2336)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !148, file: !149, line: 246, baseType: !272, size: 320, offset: 2368)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !143, line: 50, size: 320, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !272, file: !143, line: 51, baseType: !141, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !272, file: !143, line: 53, baseType: !131, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !272, file: !143, line: 54, baseType: !131, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !272, file: !143, line: 55, baseType: !131, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !272, file: !143, line: 55, baseType: !131, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !272, file: !143, line: 56, baseType: !137, size: 8, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !272, file: !143, line: 56, baseType: !137, size: 8, offset: 200)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !272, file: !143, line: 57, baseType: !137, size: 8, offset: 208)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !272, file: !143, line: 57, baseType: !137, size: 8, offset: 216)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !272, file: !143, line: 59, baseType: !185, size: 16, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !272, file: !143, line: 59, baseType: !185, size: 16, offset: 240)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !272, file: !143, line: 59, baseType: !185, size: 16, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !143, line: 61, baseType: !185, size: 16, offset: 272)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !272, file: !143, line: 63, baseType: !131, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !148, file: !149, line: 248, baseType: !289, size: 64, offset: 2688)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !149, line: 248, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !148, file: !149, line: 249, baseType: !292, size: 64, offset: 2752)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !149, line: 46, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !148, file: !149, line: 250, baseType: !295, size: 64, offset: 2816)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !143, line: 77, size: 15424, elements: !297)
!297 = !{!298, !299, !300, !303, !306, !309, !312, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !332, !333, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !362, !363, !364, !370, !371, !375}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !143, line: 78, baseType: !152, size: 960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !143, line: 80, baseType: !172, size: 8192, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !296, file: !143, line: 82, baseType: !301, size: 64, offset: 9152)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !143, line: 43, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !296, file: !143, line: 83, baseType: !304, size: 64, offset: 9216)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !153, line: 46, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !296, file: !143, line: 86, baseType: !307, size: 64, offset: 9280)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !143, line: 41, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !296, file: !143, line: 87, baseType: !310, size: 64, offset: 9344)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !143, line: 44, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !296, file: !143, line: 89, baseType: !313, size: 512, offset: 9408)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 512, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !296, file: !143, line: 90, baseType: !185, size: 16, offset: 9920)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !296, file: !143, line: 90, baseType: !185, size: 16, offset: 9936)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !296, file: !143, line: 92, baseType: !185, size: 16, offset: 9952)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !296, file: !143, line: 92, baseType: !185, size: 16, offset: 9968)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !296, file: !143, line: 93, baseType: !185, size: 16, offset: 9984)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !143, line: 93, baseType: !185, size: 16, offset: 10000)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !296, file: !143, line: 94, baseType: !131, size: 32, offset: 10016)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !296, file: !143, line: 97, baseType: !185, size: 16, offset: 10048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !296, file: !143, line: 97, baseType: !185, size: 16, offset: 10064)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !296, file: !143, line: 98, baseType: !185, size: 16, offset: 10080)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !296, file: !143, line: 98, baseType: !185, size: 16, offset: 10096)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !296, file: !143, line: 99, baseType: !185, size: 16, offset: 10112)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !296, file: !143, line: 99, baseType: !185, size: 16, offset: 10128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !296, file: !143, line: 100, baseType: !7, size: 32, offset: 10144)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !296, file: !143, line: 101, baseType: !331, size: 64, offset: 10176)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !296, file: !143, line: 103, baseType: !178, size: 64, offset: 10240)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !296, file: !143, line: 104, baseType: !334, size: 64, offset: 10304)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !153, line: 159, size: 448, elements: !336)
!336 = !{!337, !341, !342, !344, !345, !347}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !335, file: !153, line: 161, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 2)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !335, file: !153, line: 162, baseType: !338, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !335, file: !153, line: 163, baseType: !343, size: 32, offset: 128)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 32, elements: !339)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !335, file: !153, line: 164, baseType: !343, size: 32, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !335, file: !153, line: 165, baseType: !346, size: 128, offset: 192)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 128, elements: !339)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !335, file: !153, line: 166, baseType: !348, size: 128, offset: 320)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 128, elements: !339)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !296, file: !143, line: 107, baseType: !222, size: 32, offset: 10368)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !296, file: !143, line: 108, baseType: !131, size: 32, offset: 10400)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !296, file: !143, line: 109, baseType: !185, size: 16, offset: 10432)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !296, file: !143, line: 110, baseType: !185, size: 16, offset: 10448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !296, file: !143, line: 113, baseType: !131, size: 32, offset: 10464)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !296, file: !143, line: 113, baseType: !131, size: 32, offset: 10496)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !296, file: !143, line: 114, baseType: !137, size: 8, offset: 10528)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !296, file: !143, line: 114, baseType: !137, size: 8, offset: 10536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !296, file: !143, line: 115, baseType: !185, size: 16, offset: 10544)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !296, file: !143, line: 116, baseType: !359, size: 128, offset: 10560)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 128, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 4)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !296, file: !143, line: 119, baseType: !222, size: 32, offset: 10688)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !296, file: !143, line: 119, baseType: !222, size: 32, offset: 10720)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !296, file: !143, line: 122, baseType: !365, size: 512, offset: 10752)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !366, line: 182, baseType: !367)
!366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !366, line: 180, size: 512, elements: !368)
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !366, line: 181, baseType: !136, size: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !296, file: !143, line: 123, baseType: !137, size: 8, offset: 11264)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !296, file: !143, line: 125, baseType: !372, size: 56, offset: 11272)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 56, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 7)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !296, file: !143, line: 126, baseType: !376, size: 4096, offset: 11328)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 4096, elements: !314)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !143, line: 69, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !143, line: 67, size: 512, elements: !379)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !378, file: !143, line: 68, baseType: !136, size: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !148, file: !149, line: 251, baseType: !382, size: 64, offset: 2880)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !149, line: 113, size: 6208, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390, !394}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !383, file: !149, line: 114, baseType: !185, size: 16)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !383, file: !149, line: 114, baseType: !185, size: 16, offset: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !383, file: !149, line: 115, baseType: !137, size: 8, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !383, file: !149, line: 115, baseType: !137, size: 8, offset: 40)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !383, file: !149, line: 116, baseType: !137, size: 8, offset: 48)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !383, file: !149, line: 117, baseType: !391, size: 8, offset: 56)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 8, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 1)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !149, line: 119, baseType: !395, size: 6144, offset: 64)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 6144, elements: !405)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !149, line: 109, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !149, line: 106, size: 192, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !397, file: !149, line: 107, baseType: !222, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !397, file: !149, line: 107, baseType: !222, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !397, file: !149, line: 107, baseType: !222, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !397, file: !149, line: 107, baseType: !222, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !397, file: !149, line: 107, baseType: !222, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !397, file: !149, line: 108, baseType: !131, size: 32, offset: 160)
!405 = !{!406}
!406 = !DISubrange(count: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !148, file: !149, line: 252, baseType: !408, size: 64, offset: 2944)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !149, line: 122, size: 1600, elements: !410)
!410 = !{!411, !1077, !1078, !1084, !1085, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !409, file: !149, line: 123, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !414, line: 115, size: 11392, elements: !415)
!414 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!415 = !{!416, !417, !418, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !443, !457, !458, !501, !502, !505, !506, !522, !523, !524, !525, !526, !527, !528, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !609, !610, !611, !612, !613, !614, !615, !616, !617, !620, !623, !626, !627, !628, !629, !630, !633, !636, !1040, !1041, !1047, !1048, !1049, !1050, !1051, !1052, !1054, !1057, !1060, !1062, !1065, !1066}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !413, file: !414, line: 116, baseType: !152, size: 960)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !413, file: !414, line: 117, baseType: !219, size: 64, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !413, file: !414, line: 119, baseType: !419, size: 64, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !414, line: 57, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !413, file: !414, line: 121, baseType: !185, size: 16, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !413, file: !414, line: 121, baseType: !185, size: 16, offset: 1104)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !413, file: !414, line: 122, baseType: !131, size: 32, offset: 1120)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !413, file: !414, line: 122, baseType: !131, size: 32, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !413, file: !414, line: 122, baseType: !131, size: 32, offset: 1184)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !413, file: !414, line: 123, baseType: !136, size: 512, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !413, file: !414, line: 124, baseType: !412, size: 64, offset: 1728)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !413, file: !414, line: 124, baseType: !412, size: 64, offset: 1792)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !413, file: !414, line: 127, baseType: !412, size: 64, offset: 1856)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !413, file: !414, line: 127, baseType: !412, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !413, file: !414, line: 127, baseType: !412, size: 64, offset: 1984)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !413, file: !414, line: 128, baseType: !292, size: 64, offset: 2048)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !413, file: !414, line: 130, baseType: !434, size: 64, offset: 2112)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !414, line: 97, size: 832, elements: !436)
!436 = !{!437, !441, !442}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !435, file: !414, line: 98, baseType: !438, size: 768)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 768, elements: !439)
!439 = !{!315, !440}
!440 = !DISubrange(count: 3)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !414, line: 99, baseType: !131, size: 32, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !435, file: !414, line: 99, baseType: !131, size: 32, offset: 800)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !413, file: !414, line: 131, baseType: !444, size: 64, offset: 2176)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !446, line: 486, size: 1600, elements: !447)
!446 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !445, file: !446, line: 487, baseType: !152, size: 960)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !445, file: !446, line: 489, baseType: !208, size: 128, offset: 960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !445, file: !446, line: 490, baseType: !208, size: 128, offset: 1088)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !445, file: !446, line: 491, baseType: !208, size: 128, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !445, file: !446, line: 492, baseType: !208, size: 128, offset: 1344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !446, line: 494, baseType: !131, size: 32, offset: 1472)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !445, file: !446, line: 495, baseType: !131, size: 32, offset: 1504)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !445, file: !446, line: 497, baseType: !131, size: 32, offset: 1536)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !445, file: !446, line: 498, baseType: !131, size: 32, offset: 1568)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !413, file: !414, line: 132, baseType: !444, size: 64, offset: 2240)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !413, file: !414, line: 133, baseType: !459, size: 64, offset: 2304)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !446, line: 334, size: 1728, elements: !461)
!461 = !{!462, !463, !466, !467, !468, !469, !470, !471, !474, !475, !476, !477, !478, !479, !480, !500}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !460, file: !446, line: 335, baseType: !208, size: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !460, file: !446, line: 336, baseType: !464, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !446, line: 47, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !460, file: !446, line: 338, baseType: !185, size: 16, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !460, file: !446, line: 338, baseType: !185, size: 16, offset: 208)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !460, file: !446, line: 339, baseType: !7, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !460, file: !446, line: 340, baseType: !131, size: 32, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !460, file: !446, line: 342, baseType: !222, size: 32, offset: 288)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !460, file: !446, line: 343, baseType: !472, size: 96, offset: 320)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 96, elements: !473)
!473 = !{!440}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !460, file: !446, line: 344, baseType: !472, size: 96, offset: 416)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !460, file: !446, line: 347, baseType: !208, size: 128, offset: 512)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !460, file: !446, line: 349, baseType: !131, size: 32, offset: 640)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !460, file: !446, line: 350, baseType: !131, size: 32, offset: 672)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !460, file: !446, line: 351, baseType: !157, size: 64, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !460, file: !446, line: 352, baseType: !157, size: 64, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !460, file: !446, line: 354, baseType: !481, size: 384, offset: 832)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !446, line: 116, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !446, line: 94, size: 384, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !482, file: !446, line: 96, baseType: !131, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !482, file: !446, line: 96, baseType: !131, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !482, file: !446, line: 97, baseType: !131, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !482, file: !446, line: 97, baseType: !131, size: 32, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !482, file: !446, line: 99, baseType: !185, size: 16, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !482, file: !446, line: 100, baseType: !185, size: 16, offset: 144)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !482, file: !446, line: 102, baseType: !185, size: 16, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !482, file: !446, line: 105, baseType: !185, size: 16, offset: 176)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !482, file: !446, line: 108, baseType: !185, size: 16, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !482, file: !446, line: 109, baseType: !185, size: 16, offset: 208)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !482, file: !446, line: 111, baseType: !185, size: 16, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !482, file: !446, line: 112, baseType: !185, size: 16, offset: 240)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !482, file: !446, line: 114, baseType: !131, size: 32, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !482, file: !446, line: 114, baseType: !131, size: 32, offset: 288)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !482, file: !446, line: 115, baseType: !131, size: 32, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !482, file: !446, line: 115, baseType: !131, size: 32, offset: 352)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !460, file: !446, line: 355, baseType: !136, size: 512, offset: 1216)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !413, file: !414, line: 134, baseType: !157, size: 64, offset: 2368)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !413, file: !414, line: 136, baseType: !503, size: 64, offset: 2432)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !414, line: 58, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !413, file: !414, line: 138, baseType: !481, size: 384, offset: 2496)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !413, file: !414, line: 139, baseType: !507, size: 64, offset: 2880)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !446, line: 80, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !446, line: 72, size: 192, elements: !510)
!510 = !{!511, !518, !519, !520, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !509, file: !446, line: 73, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !446, line: 59, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !446, line: 56, size: 128, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !514, file: !446, line: 57, baseType: !472, size: 96)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !446, line: 58, baseType: !131, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !509, file: !446, line: 74, baseType: !131, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !509, file: !446, line: 76, baseType: !131, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !509, file: !446, line: 77, baseType: !131, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !446, line: 79, baseType: !131, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !413, file: !414, line: 141, baseType: !208, size: 128, offset: 2944)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !413, file: !414, line: 142, baseType: !208, size: 128, offset: 3072)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !413, file: !414, line: 143, baseType: !208, size: 128, offset: 3200)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !413, file: !414, line: 144, baseType: !208, size: 128, offset: 3328)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !413, file: !414, line: 146, baseType: !131, size: 32, offset: 3456)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !413, file: !414, line: 147, baseType: !131, size: 32, offset: 3488)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !413, file: !414, line: 150, baseType: !529, size: 64, offset: 3520)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !414, line: 50, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !413, file: !414, line: 151, baseType: !145, size: 64, offset: 3584)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !413, file: !414, line: 152, baseType: !131, size: 32, offset: 3648)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !413, file: !414, line: 153, baseType: !131, size: 32, offset: 3680)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !413, file: !414, line: 156, baseType: !472, size: 96, offset: 3712)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !413, file: !414, line: 156, baseType: !472, size: 96, offset: 3808)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !413, file: !414, line: 156, baseType: !472, size: 96, offset: 3904)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !413, file: !414, line: 157, baseType: !472, size: 96, offset: 4000)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !413, file: !414, line: 158, baseType: !472, size: 96, offset: 4096)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !413, file: !414, line: 159, baseType: !472, size: 96, offset: 4192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !413, file: !414, line: 160, baseType: !472, size: 96, offset: 4288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !413, file: !414, line: 160, baseType: !472, size: 96, offset: 4384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !413, file: !414, line: 161, baseType: !359, size: 128, offset: 4480)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !413, file: !414, line: 161, baseType: !359, size: 128, offset: 4608)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !413, file: !414, line: 162, baseType: !472, size: 96, offset: 4736)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !413, file: !414, line: 162, baseType: !472, size: 96, offset: 4832)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !413, file: !414, line: 163, baseType: !222, size: 32, offset: 4928)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !413, file: !414, line: 163, baseType: !222, size: 32, offset: 4960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !413, file: !414, line: 164, baseType: !550, size: 512, offset: 4992)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 512, elements: !551)
!551 = !{!361, !361}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !413, file: !414, line: 165, baseType: !550, size: 512, offset: 5504)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !413, file: !414, line: 166, baseType: !550, size: 512, offset: 6016)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !413, file: !414, line: 167, baseType: !550, size: 512, offset: 6528)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !413, file: !414, line: 176, baseType: !550, size: 512, offset: 7040)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !413, file: !414, line: 178, baseType: !7, size: 32, offset: 7552)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !413, file: !414, line: 180, baseType: !185, size: 16, offset: 7584)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !413, file: !414, line: 181, baseType: !185, size: 16, offset: 7600)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !413, file: !414, line: 183, baseType: !185, size: 16, offset: 7616)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !413, file: !414, line: 183, baseType: !185, size: 16, offset: 7632)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !413, file: !414, line: 184, baseType: !185, size: 16, offset: 7648)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !413, file: !414, line: 184, baseType: !185, size: 16, offset: 7664)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !413, file: !414, line: 185, baseType: !185, size: 16, offset: 7680)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !413, file: !414, line: 186, baseType: !185, size: 16, offset: 7696)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !413, file: !414, line: 187, baseType: !185, size: 16, offset: 7712)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !413, file: !414, line: 188, baseType: !137, size: 8, offset: 7728)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !413, file: !414, line: 189, baseType: !137, size: 8, offset: 7736)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !413, file: !414, line: 192, baseType: !131, size: 32, offset: 7744)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !413, file: !414, line: 192, baseType: !131, size: 32, offset: 7776)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !413, file: !414, line: 192, baseType: !131, size: 32, offset: 7808)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !413, file: !414, line: 192, baseType: !131, size: 32, offset: 7840)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !413, file: !414, line: 194, baseType: !131, size: 32, offset: 7872)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !413, file: !414, line: 202, baseType: !222, size: 32, offset: 7904)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !413, file: !414, line: 202, baseType: !222, size: 32, offset: 7936)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !413, file: !414, line: 202, baseType: !222, size: 32, offset: 7968)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !413, file: !414, line: 211, baseType: !222, size: 32, offset: 8000)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !413, file: !414, line: 212, baseType: !222, size: 32, offset: 8032)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !413, file: !414, line: 213, baseType: !222, size: 32, offset: 8064)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !413, file: !414, line: 214, baseType: !222, size: 32, offset: 8096)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !413, file: !414, line: 215, baseType: !222, size: 32, offset: 8128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !413, file: !414, line: 216, baseType: !222, size: 32, offset: 8160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !413, file: !414, line: 219, baseType: !222, size: 32, offset: 8192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !413, file: !414, line: 220, baseType: !222, size: 32, offset: 8224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !413, file: !414, line: 221, baseType: !222, size: 32, offset: 8256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !413, file: !414, line: 224, baseType: !586, size: 16, offset: 8288)
!586 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !413, file: !414, line: 224, baseType: !586, size: 16, offset: 8304)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !413, file: !414, line: 226, baseType: !185, size: 16, offset: 8320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !413, file: !414, line: 228, baseType: !137, size: 8, offset: 8336)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !413, file: !414, line: 229, baseType: !137, size: 8, offset: 8344)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !413, file: !414, line: 231, baseType: !185, size: 16, offset: 8352)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !413, file: !414, line: 232, baseType: !137, size: 8, offset: 8368)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !413, file: !414, line: 233, baseType: !137, size: 8, offset: 8376)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !413, file: !414, line: 234, baseType: !222, size: 32, offset: 8384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !413, file: !414, line: 235, baseType: !222, size: 32, offset: 8416)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !413, file: !414, line: 237, baseType: !208, size: 128, offset: 8448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !413, file: !414, line: 238, baseType: !208, size: 128, offset: 8576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !413, file: !414, line: 239, baseType: !208, size: 128, offset: 8704)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !413, file: !414, line: 240, baseType: !208, size: 128, offset: 8832)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !413, file: !414, line: 242, baseType: !222, size: 32, offset: 8960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !413, file: !414, line: 244, baseType: !185, size: 16, offset: 8992)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !413, file: !414, line: 245, baseType: !586, size: 16, offset: 9008)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !413, file: !414, line: 246, baseType: !359, size: 128, offset: 9024)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !413, file: !414, line: 248, baseType: !131, size: 32, offset: 9152)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !413, file: !414, line: 249, baseType: !131, size: 32, offset: 9184)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !413, file: !414, line: 251, baseType: !607, size: 64, offset: 9216)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !414, line: 251, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !413, file: !414, line: 253, baseType: !137, size: 8, offset: 9280)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !413, file: !414, line: 254, baseType: !137, size: 8, offset: 9288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !413, file: !414, line: 255, baseType: !185, size: 16, offset: 9296)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !413, file: !414, line: 256, baseType: !472, size: 96, offset: 9312)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !413, file: !414, line: 258, baseType: !208, size: 128, offset: 9408)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !413, file: !414, line: 259, baseType: !208, size: 128, offset: 9536)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !413, file: !414, line: 260, baseType: !208, size: 128, offset: 9664)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !413, file: !414, line: 261, baseType: !208, size: 128, offset: 9792)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !413, file: !414, line: 263, baseType: !618, size: 64, offset: 9920)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !414, line: 52, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !413, file: !414, line: 264, baseType: !621, size: 64, offset: 9984)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !414, line: 53, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !413, file: !414, line: 265, baseType: !624, size: 64, offset: 10048)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !446, line: 46, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !413, file: !414, line: 267, baseType: !137, size: 8, offset: 10112)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !413, file: !414, line: 268, baseType: !137, size: 8, offset: 10120)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !413, file: !414, line: 269, baseType: !185, size: 16, offset: 10128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !413, file: !414, line: 270, baseType: !222, size: 32, offset: 10144)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !413, file: !414, line: 272, baseType: !631, size: 64, offset: 10176)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !414, line: 54, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !413, file: !414, line: 275, baseType: !634, size: 64, offset: 10240)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !414, line: 275, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !413, file: !414, line: 277, baseType: !637, size: 64, offset: 10304)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !639)
!639 = !{!640, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !691, !694, !696, !697, !699, !700, !701, !702, !708, !713, !714, !718, !719, !720, !721, !722, !735, !747, !761, !765, !769, !773, !782, !794, !798, !802, !806, !810, !814, !815, !816, !817, !818, !819, !823, !824, !825, !826, !830, !831, !832, !833, !834, !839, !840, !841, !842, !843, !847, !848, !849, !850, !851, !858, !869, !874, !880, !890, !895, !906, !913, !920, !924, !929, !933, !938, !939, !940, !947, !953, !954, !955, !960, !961, !970, !997, !1001, !1009, !1013, !1017, !1021, !1029, !1039}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !638, file: !28, line: 180, baseType: !641, size: 1600)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !69, line: 73, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !69, line: 64, size: 1600, elements: !643)
!643 = !{!644, !659, !663, !664, !665, !666, !669}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !642, file: !69, line: 65, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !69, line: 53, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !69, line: 42, size: 832, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !647, file: !69, line: 43, baseType: !131, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !647, file: !69, line: 44, baseType: !131, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !647, file: !69, line: 45, baseType: !131, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !647, file: !69, line: 46, baseType: !131, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !647, file: !69, line: 47, baseType: !131, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !647, file: !69, line: 48, baseType: !131, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !647, file: !69, line: 49, baseType: !131, size: 32, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !647, file: !69, line: 50, baseType: !131, size: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !69, line: 51, baseType: !136, size: 512, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !647, file: !69, line: 52, baseType: !157, size: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !642, file: !69, line: 66, baseType: !660, size: 1312, offset: 64)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 1312, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 41)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !642, file: !69, line: 69, baseType: !131, size: 32, offset: 1376)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !642, file: !69, line: 69, baseType: !131, size: 32, offset: 1408)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !642, file: !69, line: 70, baseType: !131, size: 32, offset: 1440)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !642, file: !69, line: 71, baseType: !667, size: 64, offset: 1472)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !69, line: 71, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !642, file: !69, line: 72, baseType: !670, size: 64, offset: 1536)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !69, line: 59, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !69, line: 57, size: 8192, elements: !673)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !672, file: !69, line: 58, baseType: !172, size: 8192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !638, file: !28, line: 180, baseType: !641, size: 1600, offset: 1600)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !638, file: !28, line: 180, baseType: !641, size: 1600, offset: 3200)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !638, file: !28, line: 180, baseType: !641, size: 1600, offset: 4800)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !638, file: !28, line: 180, baseType: !641, size: 1600, offset: 6400)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !638, file: !28, line: 181, baseType: !131, size: 32, offset: 8000)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !638, file: !28, line: 181, baseType: !131, size: 32, offset: 8032)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !638, file: !28, line: 181, baseType: !131, size: 32, offset: 8064)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !638, file: !28, line: 181, baseType: !131, size: 32, offset: 8096)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !638, file: !28, line: 181, baseType: !131, size: 32, offset: 8128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !638, file: !28, line: 182, baseType: !131, size: 32, offset: 8160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !638, file: !28, line: 183, baseType: !131, size: 32, offset: 8192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !638, file: !28, line: 184, baseType: !687, size: 64, offset: 8256)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !688, line: 124, baseType: !689)
!688 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !688, line: 124, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !638, file: !28, line: 185, baseType: !692, size: 64, offset: 8320)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !28, line: 186, baseType: !695, size: 32, offset: 8384)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !638, file: !28, line: 187, baseType: !222, size: 32, offset: 8416)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !638, file: !28, line: 188, baseType: !698, size: 32, offset: 8448)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !638, file: !28, line: 189, baseType: !131, size: 32, offset: 8480)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !638, file: !28, line: 190, baseType: !529, size: 64, offset: 8512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !638, file: !28, line: 193, baseType: !137, size: 8, offset: 8576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !638, file: !28, line: 196, baseType: !703, size: 64, offset: 8640)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !706}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !638)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !638, file: !28, line: 199, baseType: !709, size: 64, offset: 8704)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !706, !712}
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !638, file: !28, line: 202, baseType: !703, size: 64, offset: 8768)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !638, file: !28, line: 207, baseType: !715, size: 64, offset: 8832)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!131, !706}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !638, file: !28, line: 208, baseType: !715, size: 64, offset: 8896)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !638, file: !28, line: 209, baseType: !715, size: 64, offset: 8960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !638, file: !28, line: 210, baseType: !715, size: 64, offset: 9024)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !638, file: !28, line: 211, baseType: !715, size: 64, offset: 9088)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !638, file: !28, line: 218, baseType: !723, size: 64, offset: 9152)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !706, !131, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !728, line: 65, size: 160, elements: !729)
!728 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!729 = !{!730, !731, !733, !734}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !727, file: !728, line: 66, baseType: !472, size: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !727, file: !728, line: 67, baseType: !732, size: 48, offset: 96)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 48, elements: !473)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !727, file: !728, line: 68, baseType: !137, size: 8, offset: 144)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !727, file: !728, line: 68, baseType: !137, size: 8, offset: 152)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !638, file: !28, line: 219, baseType: !736, size: 64, offset: 9216)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !706, !131, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !728, line: 48, size: 96, elements: !741)
!741 = !{!742, !743, !744, !745, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !740, file: !728, line: 49, baseType: !7, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !740, file: !728, line: 49, baseType: !7, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !740, file: !728, line: 50, baseType: !137, size: 8, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !740, file: !728, line: 50, baseType: !137, size: 8, offset: 72)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !740, file: !728, line: 51, baseType: !185, size: 16, offset: 80)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !638, file: !28, line: 220, baseType: !748, size: 64, offset: 9280)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !706, !131, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !728, line: 42, size: 160, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !752, file: !728, line: 43, baseType: !7, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !752, file: !728, line: 43, baseType: !7, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !752, file: !728, line: 43, baseType: !7, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !752, file: !728, line: 43, baseType: !7, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !752, file: !728, line: 44, baseType: !185, size: 16, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !752, file: !728, line: 45, baseType: !137, size: 8, offset: 144)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !728, line: 45, baseType: !137, size: 8, offset: 152)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !638, file: !28, line: 227, baseType: !762, size: 64, offset: 9344)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!726, !706}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !638, file: !28, line: 228, baseType: !766, size: 64, offset: 9408)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!739, !706}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !638, file: !28, line: 229, baseType: !770, size: 64, offset: 9472)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!751, !706}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !638, file: !28, line: 230, baseType: !774, size: 64, offset: 9536)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!777, !706}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !728, line: 88, size: 64, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !778, file: !728, line: 89, baseType: !7, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !778, file: !728, line: 90, baseType: !7, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !638, file: !28, line: 231, baseType: !783, size: 64, offset: 9600)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!786, !706}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !728, line: 79, size: 96, elements: !788)
!788 = !{!789, !790, !791, !792, !793}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !787, file: !728, line: 81, baseType: !131, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !787, file: !728, line: 82, baseType: !131, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !787, file: !728, line: 83, baseType: !185, size: 16, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !787, file: !728, line: 84, baseType: !137, size: 8, offset: 80)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !787, file: !728, line: 84, baseType: !137, size: 8, offset: 88)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !638, file: !28, line: 236, baseType: !795, size: 64, offset: 9664)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !706, !726}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !638, file: !28, line: 237, baseType: !799, size: 64, offset: 9728)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !706, !739}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !638, file: !28, line: 238, baseType: !803, size: 64, offset: 9792)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !706, !751}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !638, file: !28, line: 239, baseType: !807, size: 64, offset: 9856)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !706, !777}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !638, file: !28, line: 240, baseType: !811, size: 64, offset: 9920)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !706, !786}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !638, file: !28, line: 245, baseType: !762, size: 64, offset: 9984)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !638, file: !28, line: 246, baseType: !766, size: 64, offset: 10048)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !638, file: !28, line: 247, baseType: !770, size: 64, offset: 10112)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !638, file: !28, line: 248, baseType: !774, size: 64, offset: 10176)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !638, file: !28, line: 249, baseType: !783, size: 64, offset: 10240)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !638, file: !28, line: 255, baseType: !820, size: 64, offset: 10304)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!157, !706, !131, !131}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !638, file: !28, line: 256, baseType: !820, size: 64, offset: 10368)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !638, file: !28, line: 257, baseType: !820, size: 64, offset: 10432)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !638, file: !28, line: 258, baseType: !820, size: 64, offset: 10496)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !638, file: !28, line: 264, baseType: !827, size: 64, offset: 10560)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!157, !706, !131}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !638, file: !28, line: 265, baseType: !827, size: 64, offset: 10624)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !638, file: !28, line: 266, baseType: !827, size: 64, offset: 10688)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !638, file: !28, line: 267, baseType: !827, size: 64, offset: 10752)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !638, file: !28, line: 268, baseType: !827, size: 64, offset: 10816)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !638, file: !28, line: 272, baseType: !835, size: 64, offset: 10880)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!838, !706}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !638, file: !28, line: 273, baseType: !835, size: 64, offset: 10944)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !638, file: !28, line: 274, baseType: !835, size: 64, offset: 11008)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !638, file: !28, line: 275, baseType: !835, size: 64, offset: 11072)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !638, file: !28, line: 276, baseType: !835, size: 64, offset: 11136)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !638, file: !28, line: 279, baseType: !844, size: 64, offset: 11200)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !706, !131, !838, !131}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !638, file: !28, line: 280, baseType: !844, size: 64, offset: 11264)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !638, file: !28, line: 281, baseType: !844, size: 64, offset: 11328)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !638, file: !28, line: 284, baseType: !715, size: 64, offset: 11392)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !638, file: !28, line: 285, baseType: !715, size: 64, offset: 11456)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !638, file: !28, line: 286, baseType: !852, size: 64, offset: 11520)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!855, !706}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !638, file: !28, line: 287, baseType: !859, size: 64, offset: 11584)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!862, !706}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !865)
!865 = !{!866, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !864, file: !28, line: 118, baseType: !867, size: 128)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, elements: !360)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !864, file: !28, line: 119, baseType: !867, size: 128, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !638, file: !28, line: 288, baseType: !870, size: 64, offset: 11648)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!873, !706}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !638, file: !28, line: 289, baseType: !875, size: 64, offset: 11712)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !706, !878}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !638, file: !28, line: 290, baseType: !881, size: 64, offset: 11776)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!884, !706}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !886, file: !28, line: 124, baseType: !185, size: 16)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !886, file: !28, line: 125, baseType: !137, size: 8, offset: 16)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !638, file: !28, line: 291, baseType: !891, size: 64, offset: 11840)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!894, !706}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !638, file: !28, line: 299, baseType: !896, size: 64, offset: 11904)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !706, !899, !157, !905}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !157, !131, !902, !902, !903}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !638, file: !28, line: 309, baseType: !907, size: 64, offset: 11968)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !706, !910, !157}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !157, !131, !902, !902}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !638, file: !28, line: 317, baseType: !914, size: 64, offset: 12032)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !706, !917, !157, !905}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !157, !131, !131, !902, !902}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !638, file: !28, line: 327, baseType: !921, size: 64, offset: 12096)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !706, !910, !157, !905}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !638, file: !28, line: 337, baseType: !925, size: 64, offset: 12160)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !706, !928, !928}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !638, file: !28, line: 344, baseType: !930, size: 64, offset: 12224)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !706, !131, !928}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !638, file: !28, line: 347, baseType: !934, size: 64, offset: 12288)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !706, !937}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !638, file: !28, line: 350, baseType: !930, size: 64, offset: 12352)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !638, file: !28, line: 351, baseType: !930, size: 64, offset: 12416)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !638, file: !28, line: 355, baseType: !941, size: 64, offset: 12480)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!944, !412, !706}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !638, file: !28, line: 359, baseType: !948, size: 64, offset: 12544)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!951, !412, !706}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !638, file: !28, line: 364, baseType: !703, size: 64, offset: 12608)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !638, file: !28, line: 367, baseType: !703, size: 64, offset: 12672)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !638, file: !28, line: 373, baseType: !956, size: 64, offset: 12736)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !706, !959, !959}
!959 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !638, file: !28, line: 376, baseType: !703, size: 64, offset: 12800)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !638, file: !28, line: 385, baseType: !962, size: 64, offset: 12864)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !706, !965, !959, !966}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!131, !131, !157}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !638, file: !28, line: 391, baseType: !971, size: 64, offset: 12928)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !706, !974, !992, !157, !996}
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!978, !979, !991, !131}
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !728, line: 160, size: 384, elements: !981)
!981 = !{!982, !985, !986, !987, !988, !989, !990}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !980, file: !728, line: 161, baseType: !983, size: 256)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 256, elements: !984)
!984 = !{!361, !340}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !980, file: !728, line: 162, baseType: !295, size: 64, offset: 256)
