; ModuleID = 'blender/source/blender/render/intern/source/bake_api.c'
source_filename = "blender/source/blender/render/intern/source/bake_api.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!62 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!63 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!64 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!65 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!66 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!67 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!68 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!69 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BakeNormalSwizzle", file: !76, line: 385, baseType: !5, size: 32, elements: !77)
!76 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79, !80, !81, !82, !83}
!78 = !DIEnumerator(name: "R_BAKE_POSX", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "R_BAKE_POSY", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "R_BAKE_POSZ", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "R_BAKE_NEGX", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "R_BAKE_NEGY", value: 4, isUnsigned: true)
!83 = !DIEnumerator(name: "R_BAKE_NEGZ", value: 5, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ScenePassType", file: !76, line: 213, baseType: !85, size: 32, elements: !86)
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!87 = !DIEnumerator(name: "SCE_PASS_COMBINED", value: 1)
!88 = !DIEnumerator(name: "SCE_PASS_Z", value: 2)
!89 = !DIEnumerator(name: "SCE_PASS_RGBA", value: 4)
!90 = !DIEnumerator(name: "SCE_PASS_DIFFUSE", value: 8)
!91 = !DIEnumerator(name: "SCE_PASS_SPEC", value: 16)
!92 = !DIEnumerator(name: "SCE_PASS_SHADOW", value: 32)
!93 = !DIEnumerator(name: "SCE_PASS_AO", value: 64)
!94 = !DIEnumerator(name: "SCE_PASS_REFLECT", value: 128)
!95 = !DIEnumerator(name: "SCE_PASS_NORMAL", value: 256)
!96 = !DIEnumerator(name: "SCE_PASS_VECTOR", value: 512)
!97 = !DIEnumerator(name: "SCE_PASS_REFRACT", value: 1024)
!98 = !DIEnumerator(name: "SCE_PASS_INDEXOB", value: 2048)
!99 = !DIEnumerator(name: "SCE_PASS_UV", value: 4096)
!100 = !DIEnumerator(name: "SCE_PASS_INDIRECT", value: 8192)
!101 = !DIEnumerator(name: "SCE_PASS_MIST", value: 16384)
!102 = !DIEnumerator(name: "SCE_PASS_RAYHITS", value: 32768)
!103 = !DIEnumerator(name: "SCE_PASS_EMIT", value: 65536)
!104 = !DIEnumerator(name: "SCE_PASS_ENVIRONMENT", value: 131072)
!105 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!106 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!107 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!108 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!109 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!110 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!111 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!112 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!113 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!114 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!115 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!116 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!117 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!118 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 341, baseType: !5, size: 32, elements: !121)
!120 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = !{!122, !123}
!122 = !DIEnumerator(name: "ME_SMOOTH", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "ME_FACE_SEL", value: 2, isUnsigned: true)
!124 = !{!125, !126, !127}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "BakeDataZSpan", file: !1, line: 100, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BakeDataZSpan", file: !1, line: 93, size: 384, elements: !130)
!130 = !{!131, !146, !147, !2731, !2810, !2811, !2812, !2813}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_array", scope: !129, file: !1, line: 94, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "BakePixel", file: !134, line: 56, baseType: !135)
!134 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_bake.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BakePixel", file: !134, line: 51, size: 224, elements: !136)
!136 = !{!137, !138, !142, !143, !144, !145}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "primitive_id", scope: !135, file: !134, line: 52, baseType: !85, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !135, file: !134, line: 53, baseType: !139, size: 64, offset: 32)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 2)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "du_dx", scope: !135, file: !134, line: 54, baseType: !126, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "du_dy", scope: !135, file: !134, line: 54, baseType: !126, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dv_dx", scope: !135, file: !134, line: 55, baseType: !126, size: 32, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "dv_dy", scope: !135, file: !134, line: 55, baseType: !126, size: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "primitive_id", scope: !129, file: !1, line: 95, baseType: !85, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "bk_image", scope: !129, file: !1, line: 96, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "BakeImage", file: !134, line: 43, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BakeImage", file: !134, line: 38, size: 192, elements: !151)
!151 = !{!152, !2726, !2727, !2728}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !150, file: !134, line: 39, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !155, line: 77, size: 15424, elements: !156)
!155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !{!157, !227, !228, !231, !234, !238, !2686, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708, !2709, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2720}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !155, line: 78, baseType: !158, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !159, line: 130, baseType: !160)
!159 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !159, line: 117, size: 960, elements: !161)
!161 = !{!162, !163, !164, !166, !186, !190, !192, !193, !194, !195}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !159, line: 118, baseType: !125, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !159, line: 118, baseType: !125, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !160, file: !159, line: 119, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !160, file: !159, line: 120, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !159, line: 136, size: 17600, elements: !169)
!169 = !{!170, !171, !173, !176, !181, !182, !183}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !159, line: 137, baseType: !158, size: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !168, file: !159, line: 138, baseType: !172, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !168, file: !159, line: 139, baseType: !174, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !159, line: 43, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !159, line: 140, baseType: !177, size: 8192, offset: 1088)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 8192, elements: !179)
!178 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!179 = !{!180}
!180 = !DISubrange(count: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !168, file: !159, line: 141, baseType: !177, size: 8192, offset: 9280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !168, file: !159, line: 148, baseType: !167, size: 64, offset: 17472)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !168, file: !159, line: 150, baseType: !184, size: 64, offset: 17536)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !159, line: 45, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !159, line: 121, baseType: !187, size: 528, offset: 256)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 528, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 66)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !159, line: 126, baseType: !191, size: 16, offset: 784)
!191 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !160, file: !159, line: 127, baseType: !85, size: 32, offset: 800)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !160, file: !159, line: 128, baseType: !85, size: 32, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !160, file: !159, line: 128, baseType: !85, size: 32, offset: 864)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !160, file: !159, line: 129, baseType: !196, size: 64, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !159, line: 75, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !159, line: 62, size: 1024, elements: !199)
!199 = !{!200, !202, !203, !204, !205, !206, !210, !211, !225, !226}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !159, line: 63, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !198, file: !159, line: 63, baseType: !201, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !159, line: 64, baseType: !178, size: 8, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !198, file: !159, line: 64, baseType: !178, size: 8, offset: 136)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !198, file: !159, line: 65, baseType: !191, size: 16, offset: 144)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !159, line: 66, baseType: !207, size: 512, offset: 160)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 512, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !198, file: !159, line: 67, baseType: !85, size: 32, offset: 672)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !159, line: 69, baseType: !212, size: 256, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !159, line: 60, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !159, line: 48, size: 256, elements: !214)
!214 = !{!215, !216, !223, !224}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !213, file: !159, line: 49, baseType: !125, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !213, file: !159, line: 58, baseType: !217, size: 128, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !218, line: 71, baseType: !219)
!218 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !218, line: 69, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !219, file: !218, line: 70, baseType: !125, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !219, file: !218, line: 70, baseType: !125, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !213, file: !159, line: 59, baseType: !85, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !213, file: !159, line: 59, baseType: !85, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !198, file: !159, line: 70, baseType: !85, size: 32, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !198, file: !159, line: 74, baseType: !85, size: 32, offset: 992)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !155, line: 80, baseType: !177, size: 8192, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !154, file: !155, line: 82, baseType: !229, size: 64, offset: 9152)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !155, line: 43, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !154, file: !155, line: 83, baseType: !232, size: 64, offset: 9216)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !159, line: 46, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !154, file: !155, line: 86, baseType: !235, size: 64, offset: 9280)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !237, line: 43, flags: DIFlagFwdDecl)
!237 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !154, file: !155, line: 87, baseType: !239, size: 64, offset: 9344)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !241, line: 110, size: 1152, elements: !242)
!241 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !{!243, !244, !245, !246, !247, !248, !249, !251, !253, !254, !263, !264, !265, !266, !268, !2682, !2683, !2684, !2685}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !241, line: 111, baseType: !239, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !240, file: !241, line: 111, baseType: !239, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !240, file: !241, line: 114, baseType: !85, size: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !240, file: !241, line: 114, baseType: !85, size: 32, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !240, file: !241, line: 115, baseType: !191, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !240, file: !241, line: 115, baseType: !191, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !240, file: !241, line: 118, baseType: !250, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !240, file: !241, line: 120, baseType: !252, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !240, file: !241, line: 122, baseType: !252, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !240, file: !241, line: 125, baseType: !255, size: 128, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !256, line: 89, baseType: !257)
!256 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !256, line: 86, size: 128, elements: !258)
!258 = !{!259, !260, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !257, file: !256, line: 87, baseType: !85, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !257, file: !256, line: 87, baseType: !85, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !257, file: !256, line: 88, baseType: !85, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !257, file: !256, line: 88, baseType: !85, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !240, file: !241, line: 127, baseType: !85, size: 32, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !240, file: !241, line: 127, baseType: !85, size: 32, offset: 608)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !240, file: !241, line: 130, baseType: !217, size: 128, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !240, file: !241, line: 133, baseType: !267, size: 128, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !255)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !240, file: !241, line: 134, baseType: !269, size: 64, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !241, line: 108, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !241, line: 85, size: 1600, elements: !273)
!273 = !{!274, !276, !277, !281, !282, !283, !284, !285, !286, !287, !2673, !2674, !2675, !2676, !2677, !2678, !2679, !2680, !2681}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !241, line: 86, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !272, file: !241, line: 86, baseType: !275, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !241, line: 89, baseType: !278, size: 592, offset: 128)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 592, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 74)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !272, file: !241, line: 90, baseType: !5, size: 32, offset: 736)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !272, file: !241, line: 90, baseType: !5, size: 32, offset: 768)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !272, file: !241, line: 90, baseType: !5, size: 32, offset: 800)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !272, file: !241, line: 91, baseType: !85, size: 32, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !272, file: !241, line: 91, baseType: !85, size: 32, offset: 864)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !272, file: !241, line: 91, baseType: !85, size: 32, offset: 896)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !272, file: !241, line: 93, baseType: !288, size: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !290, line: 93, size: 7552, elements: !291)
!290 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!291 = !{!292, !293, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !346, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !415, !416, !417, !418, !419, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2664, !2672}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !289, file: !290, line: 94, baseType: !158, size: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !289, file: !290, line: 95, baseType: !294, size: 64, offset: 960)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !296, line: 39, flags: DIFlagFwdDecl)
!296 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !289, file: !290, line: 97, baseType: !191, size: 16, offset: 1024)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !289, file: !290, line: 97, baseType: !191, size: 16, offset: 1040)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !289, file: !290, line: 99, baseType: !126, size: 32, offset: 1056)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !289, file: !290, line: 99, baseType: !126, size: 32, offset: 1088)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !289, file: !290, line: 99, baseType: !126, size: 32, offset: 1120)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !289, file: !290, line: 100, baseType: !126, size: 32, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !289, file: !290, line: 100, baseType: !126, size: 32, offset: 1184)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !289, file: !290, line: 100, baseType: !126, size: 32, offset: 1216)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !289, file: !290, line: 101, baseType: !126, size: 32, offset: 1248)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !289, file: !290, line: 101, baseType: !126, size: 32, offset: 1280)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !289, file: !290, line: 101, baseType: !126, size: 32, offset: 1312)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !289, file: !290, line: 102, baseType: !126, size: 32, offset: 1344)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !289, file: !290, line: 102, baseType: !126, size: 32, offset: 1376)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !289, file: !290, line: 102, baseType: !126, size: 32, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !289, file: !290, line: 103, baseType: !126, size: 32, offset: 1440)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !289, file: !290, line: 103, baseType: !126, size: 32, offset: 1472)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !289, file: !290, line: 103, baseType: !126, size: 32, offset: 1504)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !289, file: !290, line: 103, baseType: !126, size: 32, offset: 1536)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !289, file: !290, line: 103, baseType: !126, size: 32, offset: 1568)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !289, file: !290, line: 104, baseType: !126, size: 32, offset: 1600)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !289, file: !290, line: 104, baseType: !126, size: 32, offset: 1632)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !289, file: !290, line: 104, baseType: !126, size: 32, offset: 1664)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !289, file: !290, line: 104, baseType: !126, size: 32, offset: 1696)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !289, file: !290, line: 104, baseType: !126, size: 32, offset: 1728)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !289, file: !290, line: 105, baseType: !126, size: 32, offset: 1760)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !289, file: !290, line: 108, baseType: !323, size: 704, offset: 1792)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !290, line: 53, size: 704, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !323, file: !290, line: 54, baseType: !126, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !323, file: !290, line: 55, baseType: !126, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !323, file: !290, line: 56, baseType: !126, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !323, file: !290, line: 57, baseType: !126, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !323, file: !290, line: 59, baseType: !330, size: 96, offset: 128)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 96, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 3)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !323, file: !290, line: 60, baseType: !330, size: 96, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !323, file: !290, line: 61, baseType: !330, size: 96, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !323, file: !290, line: 63, baseType: !126, size: 32, offset: 416)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !323, file: !290, line: 64, baseType: !126, size: 32, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !323, file: !290, line: 65, baseType: !126, size: 32, offset: 480)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !323, file: !290, line: 67, baseType: !191, size: 16, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !323, file: !290, line: 68, baseType: !191, size: 16, offset: 528)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !323, file: !290, line: 69, baseType: !191, size: 16, offset: 544)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !323, file: !290, line: 70, baseType: !191, size: 16, offset: 560)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !323, file: !290, line: 72, baseType: !126, size: 32, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !323, file: !290, line: 73, baseType: !126, size: 32, offset: 608)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !323, file: !290, line: 74, baseType: !126, size: 32, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !323, file: !290, line: 75, baseType: !126, size: 32, offset: 672)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !289, file: !290, line: 109, baseType: !347, size: 128, offset: 2496)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !290, line: 79, size: 128, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !290, line: 80, baseType: !85, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !347, file: !290, line: 81, baseType: !85, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !347, file: !290, line: 82, baseType: !85, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !347, file: !290, line: 83, baseType: !85, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !289, file: !290, line: 111, baseType: !126, size: 32, offset: 2624)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !289, file: !290, line: 111, baseType: !126, size: 32, offset: 2656)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !289, file: !290, line: 112, baseType: !126, size: 32, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !289, file: !290, line: 112, baseType: !126, size: 32, offset: 2720)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !289, file: !290, line: 113, baseType: !126, size: 32, offset: 2752)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !289, file: !290, line: 114, baseType: !126, size: 32, offset: 2784)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !289, file: !290, line: 114, baseType: !126, size: 32, offset: 2816)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !289, file: !290, line: 115, baseType: !191, size: 16, offset: 2848)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !289, file: !290, line: 115, baseType: !191, size: 16, offset: 2864)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !289, file: !290, line: 116, baseType: !191, size: 16, offset: 2880)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !289, file: !290, line: 117, baseType: !178, size: 8, offset: 2896)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !289, file: !290, line: 117, baseType: !178, size: 8, offset: 2904)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !289, file: !290, line: 119, baseType: !126, size: 32, offset: 2912)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !289, file: !290, line: 119, baseType: !126, size: 32, offset: 2944)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !289, file: !290, line: 120, baseType: !191, size: 16, offset: 2976)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !289, file: !290, line: 120, baseType: !191, size: 16, offset: 2992)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !289, file: !290, line: 121, baseType: !126, size: 32, offset: 3008)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !289, file: !290, line: 121, baseType: !126, size: 32, offset: 3040)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !289, file: !290, line: 122, baseType: !126, size: 32, offset: 3072)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !289, file: !290, line: 123, baseType: !126, size: 32, offset: 3104)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !289, file: !290, line: 124, baseType: !191, size: 16, offset: 3136)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !289, file: !290, line: 125, baseType: !191, size: 16, offset: 3152)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !289, file: !290, line: 127, baseType: !85, size: 32, offset: 3168)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !289, file: !290, line: 127, baseType: !85, size: 32, offset: 3200)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !289, file: !290, line: 128, baseType: !85, size: 32, offset: 3232)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !289, file: !290, line: 128, baseType: !85, size: 32, offset: 3264)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !289, file: !290, line: 129, baseType: !191, size: 16, offset: 3296)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !289, file: !290, line: 129, baseType: !191, size: 16, offset: 3312)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !289, file: !290, line: 129, baseType: !191, size: 16, offset: 3328)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !289, file: !290, line: 129, baseType: !191, size: 16, offset: 3344)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !289, file: !290, line: 130, baseType: !126, size: 32, offset: 3360)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !289, file: !290, line: 130, baseType: !126, size: 32, offset: 3392)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !289, file: !290, line: 130, baseType: !126, size: 32, offset: 3424)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !289, file: !290, line: 130, baseType: !126, size: 32, offset: 3456)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !289, file: !290, line: 131, baseType: !126, size: 32, offset: 3488)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !289, file: !290, line: 131, baseType: !126, size: 32, offset: 3520)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !289, file: !290, line: 131, baseType: !126, size: 32, offset: 3552)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !289, file: !290, line: 131, baseType: !126, size: 32, offset: 3584)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !289, file: !290, line: 132, baseType: !126, size: 32, offset: 3616)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !289, file: !290, line: 132, baseType: !126, size: 32, offset: 3648)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !289, file: !290, line: 133, baseType: !207, size: 512, offset: 3680)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !289, file: !290, line: 135, baseType: !126, size: 32, offset: 4192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !289, file: !290, line: 136, baseType: !126, size: 32, offset: 4224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !289, file: !290, line: 137, baseType: !126, size: 32, offset: 4256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !289, file: !290, line: 138, baseType: !85, size: 32, offset: 4288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !289, file: !290, line: 141, baseType: !178, size: 8, offset: 4320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !289, file: !290, line: 141, baseType: !178, size: 8, offset: 4328)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !289, file: !290, line: 141, baseType: !178, size: 8, offset: 4336)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !289, file: !290, line: 141, baseType: !178, size: 8, offset: 4344)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !289, file: !290, line: 142, baseType: !191, size: 16, offset: 4352)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !289, file: !290, line: 142, baseType: !191, size: 16, offset: 4368)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !289, file: !290, line: 142, baseType: !191, size: 16, offset: 4384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !289, file: !290, line: 145, baseType: !178, size: 8, offset: 4400)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !289, file: !290, line: 145, baseType: !178, size: 8, offset: 4408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !289, file: !290, line: 148, baseType: !191, size: 16, offset: 4416)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !289, file: !290, line: 148, baseType: !191, size: 16, offset: 4432)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !289, file: !290, line: 149, baseType: !126, size: 32, offset: 4448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !289, file: !290, line: 149, baseType: !126, size: 32, offset: 4480)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !289, file: !290, line: 152, baseType: !412, size: 128, offset: 4512)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 4)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !289, file: !290, line: 153, baseType: !126, size: 32, offset: 4640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !289, file: !290, line: 154, baseType: !126, size: 32, offset: 4672)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !289, file: !290, line: 157, baseType: !191, size: 16, offset: 4704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !289, file: !290, line: 157, baseType: !191, size: 16, offset: 4720)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !289, file: !290, line: 160, baseType: !420, size: 64, offset: 4736)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !422, line: 113, size: 6208, elements: !423)
!422 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!423 = !{!424, !425, !426, !427, !428, !429, !433}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !421, file: !422, line: 114, baseType: !191, size: 16)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !421, file: !422, line: 114, baseType: !191, size: 16, offset: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !421, file: !422, line: 115, baseType: !178, size: 8, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !421, file: !422, line: 115, baseType: !178, size: 8, offset: 40)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !421, file: !422, line: 116, baseType: !178, size: 8, offset: 48)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !421, file: !422, line: 117, baseType: !430, size: 8, offset: 56)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 8, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 1)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !421, file: !422, line: 119, baseType: !434, size: 6144, offset: 64)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 6144, elements: !444)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !422, line: 109, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !422, line: 106, size: 192, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !436, file: !422, line: 107, baseType: !126, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !436, file: !422, line: 107, baseType: !126, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !436, file: !422, line: 107, baseType: !126, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !436, file: !422, line: 107, baseType: !126, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !436, file: !422, line: 107, baseType: !126, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !436, file: !422, line: 108, baseType: !85, size: 32, offset: 160)
!444 = !{!445}
!445 = !DISubrange(count: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !289, file: !290, line: 161, baseType: !420, size: 64, offset: 4800)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !289, file: !290, line: 162, baseType: !178, size: 8, offset: 4864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !289, file: !290, line: 162, baseType: !178, size: 8, offset: 4872)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !289, file: !290, line: 163, baseType: !178, size: 8, offset: 4880)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !289, file: !290, line: 163, baseType: !178, size: 8, offset: 4888)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !289, file: !290, line: 164, baseType: !191, size: 16, offset: 4896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !289, file: !290, line: 164, baseType: !191, size: 16, offset: 4912)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !289, file: !290, line: 165, baseType: !126, size: 32, offset: 4928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !289, file: !290, line: 165, baseType: !126, size: 32, offset: 4960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !289, file: !290, line: 167, baseType: !456, size: 1152, offset: 4992)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 1152, elements: !2630)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !422, line: 57, size: 2496, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !2427, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588, !2589, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2612, !2613, !2614, !2615, !2616, !2617, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628, !2629}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !458, file: !422, line: 59, baseType: !191, size: 16)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !458, file: !422, line: 59, baseType: !191, size: 16, offset: 16)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !458, file: !422, line: 59, baseType: !191, size: 16, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !458, file: !422, line: 59, baseType: !191, size: 16, offset: 48)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !458, file: !422, line: 60, baseType: !465, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !467, line: 115, size: 11392, elements: !468)
!467 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!468 = !{!469, !470, !471, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !488, !498, !512, !513, !555, !556, !559, !560, !576, !577, !578, !579, !580, !581, !582, !584, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !662, !663, !664, !665, !666, !667, !668, !669, !670, !673, !676, !679, !680, !681, !682, !683, !686, !689, !1091, !1092, !1098, !1099, !1100, !1101, !1102, !1103, !1105, !1108, !1111, !1112, !2415, !2416}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !466, file: !467, line: 116, baseType: !158, size: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !466, file: !467, line: 117, baseType: !294, size: 64, offset: 960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !466, file: !467, line: 119, baseType: !472, size: 64, offset: 1024)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !467, line: 57, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !466, file: !467, line: 121, baseType: !191, size: 16, offset: 1088)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !466, file: !467, line: 121, baseType: !191, size: 16, offset: 1104)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !466, file: !467, line: 122, baseType: !85, size: 32, offset: 1120)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !466, file: !467, line: 122, baseType: !85, size: 32, offset: 1152)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !466, file: !467, line: 122, baseType: !85, size: 32, offset: 1184)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !466, file: !467, line: 123, baseType: !207, size: 512, offset: 1216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !466, file: !467, line: 124, baseType: !465, size: 64, offset: 1728)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !466, file: !467, line: 124, baseType: !465, size: 64, offset: 1792)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !466, file: !467, line: 127, baseType: !465, size: 64, offset: 1856)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !466, file: !467, line: 127, baseType: !465, size: 64, offset: 1920)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !466, file: !467, line: 127, baseType: !465, size: 64, offset: 1984)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !466, file: !467, line: 128, baseType: !486, size: 64, offset: 2048)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !296, line: 41, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !466, file: !467, line: 130, baseType: !489, size: 64, offset: 2112)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !467, line: 97, size: 832, elements: !491)
!491 = !{!492, !496, !497}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !490, file: !467, line: 98, baseType: !493, size: 768)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 768, elements: !494)
!494 = !{!495, !332}
!495 = !DISubrange(count: 8)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !467, line: 99, baseType: !85, size: 32, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !490, file: !467, line: 99, baseType: !85, size: 32, offset: 800)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !466, file: !467, line: 131, baseType: !499, size: 64, offset: 2176)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !501, line: 486, size: 1600, elements: !502)
!501 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !500, file: !501, line: 487, baseType: !158, size: 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !500, file: !501, line: 489, baseType: !217, size: 128, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !500, file: !501, line: 490, baseType: !217, size: 128, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !500, file: !501, line: 491, baseType: !217, size: 128, offset: 1216)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !500, file: !501, line: 492, baseType: !217, size: 128, offset: 1344)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !500, file: !501, line: 494, baseType: !85, size: 32, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !500, file: !501, line: 495, baseType: !85, size: 32, offset: 1504)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !500, file: !501, line: 497, baseType: !85, size: 32, offset: 1536)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !500, file: !501, line: 498, baseType: !85, size: 32, offset: 1568)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !466, file: !467, line: 132, baseType: !499, size: 64, offset: 2240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !466, file: !467, line: 133, baseType: !514, size: 64, offset: 2304)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !501, line: 334, size: 1728, elements: !516)
!516 = !{!517, !518, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !554}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !515, file: !501, line: 335, baseType: !217, size: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !515, file: !501, line: 336, baseType: !519, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !521, line: 48, flags: DIFlagFwdDecl)
!521 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !515, file: !501, line: 338, baseType: !191, size: 16, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !515, file: !501, line: 338, baseType: !191, size: 16, offset: 208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !515, file: !501, line: 339, baseType: !5, size: 32, offset: 224)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !515, file: !501, line: 340, baseType: !85, size: 32, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !515, file: !501, line: 342, baseType: !126, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !515, file: !501, line: 343, baseType: !330, size: 96, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !515, file: !501, line: 344, baseType: !330, size: 96, offset: 416)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !515, file: !501, line: 347, baseType: !217, size: 128, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !515, file: !501, line: 349, baseType: !85, size: 32, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !515, file: !501, line: 350, baseType: !85, size: 32, offset: 672)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !515, file: !501, line: 351, baseType: !125, size: 64, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !515, file: !501, line: 352, baseType: !125, size: 64, offset: 768)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !515, file: !501, line: 354, baseType: !535, size: 384, offset: 832)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !501, line: 116, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !501, line: 94, size: 384, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !536, file: !501, line: 96, baseType: !85, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !536, file: !501, line: 96, baseType: !85, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !536, file: !501, line: 97, baseType: !85, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !536, file: !501, line: 97, baseType: !85, size: 32, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !536, file: !501, line: 99, baseType: !191, size: 16, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !536, file: !501, line: 100, baseType: !191, size: 16, offset: 144)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !536, file: !501, line: 102, baseType: !191, size: 16, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !536, file: !501, line: 105, baseType: !191, size: 16, offset: 176)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !536, file: !501, line: 108, baseType: !191, size: 16, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !536, file: !501, line: 109, baseType: !191, size: 16, offset: 208)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !536, file: !501, line: 111, baseType: !191, size: 16, offset: 224)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !536, file: !501, line: 112, baseType: !191, size: 16, offset: 240)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !536, file: !501, line: 114, baseType: !85, size: 32, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !536, file: !501, line: 114, baseType: !85, size: 32, offset: 288)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !536, file: !501, line: 115, baseType: !85, size: 32, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !536, file: !501, line: 115, baseType: !85, size: 32, offset: 352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !515, file: !501, line: 355, baseType: !207, size: 512, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !466, file: !467, line: 134, baseType: !125, size: 64, offset: 2368)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !466, file: !467, line: 136, baseType: !557, size: 64, offset: 2432)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !76, line: 61, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !466, file: !467, line: 138, baseType: !535, size: 384, offset: 2496)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !466, file: !467, line: 139, baseType: !561, size: 64, offset: 2880)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !501, line: 80, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !501, line: 72, size: 192, elements: !564)
!564 = !{!565, !572, !573, !574, !575}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !563, file: !501, line: 73, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !501, line: 59, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !501, line: 56, size: 128, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !568, file: !501, line: 57, baseType: !330, size: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !501, line: 58, baseType: !85, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !563, file: !501, line: 74, baseType: !85, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !563, file: !501, line: 76, baseType: !85, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !563, file: !501, line: 77, baseType: !85, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !563, file: !501, line: 79, baseType: !85, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !466, file: !467, line: 141, baseType: !217, size: 128, offset: 2944)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !466, file: !467, line: 142, baseType: !217, size: 128, offset: 3072)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !466, file: !467, line: 143, baseType: !217, size: 128, offset: 3200)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !466, file: !467, line: 144, baseType: !217, size: 128, offset: 3328)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !466, file: !467, line: 146, baseType: !85, size: 32, offset: 3456)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !466, file: !467, line: 147, baseType: !85, size: 32, offset: 3488)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !466, file: !467, line: 150, baseType: !583, size: 64, offset: 3520)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !466, file: !467, line: 151, baseType: !585, size: 64, offset: 3584)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !466, file: !467, line: 152, baseType: !85, size: 32, offset: 3648)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !466, file: !467, line: 153, baseType: !85, size: 32, offset: 3680)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !466, file: !467, line: 156, baseType: !330, size: 96, offset: 3712)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !466, file: !467, line: 156, baseType: !330, size: 96, offset: 3808)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !466, file: !467, line: 156, baseType: !330, size: 96, offset: 3904)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !466, file: !467, line: 157, baseType: !330, size: 96, offset: 4000)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !466, file: !467, line: 158, baseType: !330, size: 96, offset: 4096)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !466, file: !467, line: 159, baseType: !330, size: 96, offset: 4192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !466, file: !467, line: 160, baseType: !330, size: 96, offset: 4288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !466, file: !467, line: 160, baseType: !330, size: 96, offset: 4384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !466, file: !467, line: 161, baseType: !412, size: 128, offset: 4480)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !466, file: !467, line: 161, baseType: !412, size: 128, offset: 4608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !466, file: !467, line: 162, baseType: !330, size: 96, offset: 4736)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !466, file: !467, line: 162, baseType: !330, size: 96, offset: 4832)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !466, file: !467, line: 163, baseType: !126, size: 32, offset: 4928)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !466, file: !467, line: 163, baseType: !126, size: 32, offset: 4960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !466, file: !467, line: 164, baseType: !603, size: 512, offset: 4992)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !604)
!604 = !{!414, !414}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !466, file: !467, line: 165, baseType: !603, size: 512, offset: 5504)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !466, file: !467, line: 166, baseType: !603, size: 512, offset: 6016)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !466, file: !467, line: 167, baseType: !603, size: 512, offset: 6528)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !466, file: !467, line: 176, baseType: !603, size: 512, offset: 7040)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !466, file: !467, line: 178, baseType: !5, size: 32, offset: 7552)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !466, file: !467, line: 180, baseType: !191, size: 16, offset: 7584)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !466, file: !467, line: 181, baseType: !191, size: 16, offset: 7600)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !466, file: !467, line: 183, baseType: !191, size: 16, offset: 7616)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !466, file: !467, line: 183, baseType: !191, size: 16, offset: 7632)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !466, file: !467, line: 184, baseType: !191, size: 16, offset: 7648)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !466, file: !467, line: 184, baseType: !191, size: 16, offset: 7664)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !466, file: !467, line: 185, baseType: !191, size: 16, offset: 7680)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !466, file: !467, line: 186, baseType: !191, size: 16, offset: 7696)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !466, file: !467, line: 187, baseType: !191, size: 16, offset: 7712)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !466, file: !467, line: 188, baseType: !178, size: 8, offset: 7728)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !466, file: !467, line: 189, baseType: !178, size: 8, offset: 7736)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !466, file: !467, line: 192, baseType: !85, size: 32, offset: 7744)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !466, file: !467, line: 192, baseType: !85, size: 32, offset: 7776)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !466, file: !467, line: 192, baseType: !85, size: 32, offset: 7808)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !466, file: !467, line: 192, baseType: !85, size: 32, offset: 7840)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !466, file: !467, line: 194, baseType: !85, size: 32, offset: 7872)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !466, file: !467, line: 202, baseType: !126, size: 32, offset: 7904)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !466, file: !467, line: 202, baseType: !126, size: 32, offset: 7936)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !466, file: !467, line: 202, baseType: !126, size: 32, offset: 7968)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !466, file: !467, line: 211, baseType: !126, size: 32, offset: 8000)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !466, file: !467, line: 212, baseType: !126, size: 32, offset: 8032)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !466, file: !467, line: 213, baseType: !126, size: 32, offset: 8064)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !466, file: !467, line: 214, baseType: !126, size: 32, offset: 8096)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !466, file: !467, line: 215, baseType: !126, size: 32, offset: 8128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !466, file: !467, line: 216, baseType: !126, size: 32, offset: 8160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !466, file: !467, line: 219, baseType: !126, size: 32, offset: 8192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !466, file: !467, line: 220, baseType: !126, size: 32, offset: 8224)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !466, file: !467, line: 221, baseType: !126, size: 32, offset: 8256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !466, file: !467, line: 224, baseType: !639, size: 16, offset: 8288)
!639 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !466, file: !467, line: 224, baseType: !639, size: 16, offset: 8304)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !466, file: !467, line: 226, baseType: !191, size: 16, offset: 8320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !466, file: !467, line: 228, baseType: !178, size: 8, offset: 8336)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !466, file: !467, line: 229, baseType: !178, size: 8, offset: 8344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !466, file: !467, line: 231, baseType: !191, size: 16, offset: 8352)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !466, file: !467, line: 232, baseType: !178, size: 8, offset: 8368)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !466, file: !467, line: 233, baseType: !178, size: 8, offset: 8376)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !466, file: !467, line: 234, baseType: !126, size: 32, offset: 8384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !466, file: !467, line: 235, baseType: !126, size: 32, offset: 8416)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !466, file: !467, line: 237, baseType: !217, size: 128, offset: 8448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !466, file: !467, line: 238, baseType: !217, size: 128, offset: 8576)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !466, file: !467, line: 239, baseType: !217, size: 128, offset: 8704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !466, file: !467, line: 240, baseType: !217, size: 128, offset: 8832)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !466, file: !467, line: 242, baseType: !126, size: 32, offset: 8960)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !466, file: !467, line: 244, baseType: !191, size: 16, offset: 8992)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !466, file: !467, line: 245, baseType: !639, size: 16, offset: 9008)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !466, file: !467, line: 246, baseType: !412, size: 128, offset: 9024)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !466, file: !467, line: 248, baseType: !85, size: 32, offset: 9152)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !466, file: !467, line: 249, baseType: !85, size: 32, offset: 9184)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !466, file: !467, line: 251, baseType: !660, size: 64, offset: 9216)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !467, line: 251, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !466, file: !467, line: 253, baseType: !178, size: 8, offset: 9280)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !466, file: !467, line: 254, baseType: !178, size: 8, offset: 9288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !466, file: !467, line: 255, baseType: !191, size: 16, offset: 9296)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !466, file: !467, line: 256, baseType: !330, size: 96, offset: 9312)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !466, file: !467, line: 258, baseType: !217, size: 128, offset: 9408)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !466, file: !467, line: 259, baseType: !217, size: 128, offset: 9536)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !466, file: !467, line: 260, baseType: !217, size: 128, offset: 9664)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !466, file: !467, line: 261, baseType: !217, size: 128, offset: 9792)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !466, file: !467, line: 263, baseType: !671, size: 64, offset: 9920)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !467, line: 52, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !466, file: !467, line: 264, baseType: !674, size: 64, offset: 9984)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !467, line: 53, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !466, file: !467, line: 265, baseType: !677, size: 64, offset: 10048)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !290, line: 46, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !466, file: !467, line: 267, baseType: !178, size: 8, offset: 10112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !466, file: !467, line: 268, baseType: !178, size: 8, offset: 10120)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !466, file: !467, line: 269, baseType: !191, size: 16, offset: 10128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !466, file: !467, line: 270, baseType: !126, size: 32, offset: 10144)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !466, file: !467, line: 272, baseType: !684, size: 64, offset: 10176)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !467, line: 54, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !466, file: !467, line: 275, baseType: !687, size: 64, offset: 10240)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !467, line: 275, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !466, file: !467, line: 277, baseType: !690, size: 64, offset: 10304)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !692)
!692 = !{!693, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !744, !747, !749, !750, !752, !753, !754, !755, !761, !766, !767, !771, !772, !773, !774, !775, !787, !799, !813, !817, !821, !825, !834, !846, !850, !854, !858, !862, !866, !867, !868, !869, !870, !871, !875, !876, !877, !878, !882, !883, !884, !885, !886, !891, !892, !893, !894, !895, !899, !900, !901, !902, !903, !910, !921, !925, !931, !941, !947, !958, !965, !972, !976, !980, !984, !989, !990, !991, !998, !1004, !1005, !1006, !1011, !1012, !1021, !1048, !1052, !1060, !1064, !1068, !1072, !1080, !1090}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !691, file: !4, line: 180, baseType: !694, size: 1600)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !32, line: 73, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !32, line: 64, size: 1600, elements: !696)
!696 = !{!697, !712, !716, !717, !718, !719, !722}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !695, file: !32, line: 65, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !32, line: 53, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !32, line: 42, size: 832, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !700, file: !32, line: 43, baseType: !85, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !700, file: !32, line: 44, baseType: !85, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !700, file: !32, line: 45, baseType: !85, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !700, file: !32, line: 46, baseType: !85, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !700, file: !32, line: 47, baseType: !85, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !700, file: !32, line: 48, baseType: !85, size: 32, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !700, file: !32, line: 49, baseType: !85, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !700, file: !32, line: 50, baseType: !85, size: 32, offset: 224)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !700, file: !32, line: 51, baseType: !207, size: 512, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !700, file: !32, line: 52, baseType: !125, size: 64, offset: 768)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !695, file: !32, line: 66, baseType: !713, size: 1312, offset: 64)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 1312, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 41)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !695, file: !32, line: 69, baseType: !85, size: 32, offset: 1376)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !695, file: !32, line: 69, baseType: !85, size: 32, offset: 1408)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !695, file: !32, line: 70, baseType: !85, size: 32, offset: 1440)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !695, file: !32, line: 71, baseType: !720, size: 64, offset: 1472)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !32, line: 71, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !695, file: !32, line: 72, baseType: !723, size: 64, offset: 1536)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !32, line: 59, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !32, line: 57, size: 8192, elements: !726)
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !725, file: !32, line: 58, baseType: !177, size: 8192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !691, file: !4, line: 180, baseType: !694, size: 1600, offset: 1600)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !691, file: !4, line: 180, baseType: !694, size: 1600, offset: 3200)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !691, file: !4, line: 180, baseType: !694, size: 1600, offset: 4800)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !691, file: !4, line: 180, baseType: !694, size: 1600, offset: 6400)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !691, file: !4, line: 181, baseType: !85, size: 32, offset: 8000)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !691, file: !4, line: 181, baseType: !85, size: 32, offset: 8032)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !691, file: !4, line: 181, baseType: !85, size: 32, offset: 8064)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !691, file: !4, line: 181, baseType: !85, size: 32, offset: 8096)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !691, file: !4, line: 181, baseType: !85, size: 32, offset: 8128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !691, file: !4, line: 182, baseType: !85, size: 32, offset: 8160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !691, file: !4, line: 183, baseType: !85, size: 32, offset: 8192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !691, file: !4, line: 184, baseType: !740, size: 64, offset: 8256)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !741, line: 124, baseType: !742)
!741 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !741, line: 124, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !691, file: !4, line: 185, baseType: !745, size: 64, offset: 8320)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !4, line: 186, baseType: !748, size: 32, offset: 8384)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !691, file: !4, line: 187, baseType: !126, size: 32, offset: 8416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !691, file: !4, line: 188, baseType: !751, size: 32, offset: 8448)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !691, file: !4, line: 189, baseType: !85, size: 32, offset: 8480)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !691, file: !4, line: 190, baseType: !583, size: 64, offset: 8512)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !691, file: !4, line: 193, baseType: !178, size: 8, offset: 8576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !691, file: !4, line: 196, baseType: !756, size: 64, offset: 8640)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !691)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !691, file: !4, line: 199, baseType: !762, size: 64, offset: 8704)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !759, !765}
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !691, file: !4, line: 202, baseType: !756, size: 64, offset: 8768)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !691, file: !4, line: 207, baseType: !768, size: 64, offset: 8832)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!85, !759}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !691, file: !4, line: 208, baseType: !768, size: 64, offset: 8896)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !691, file: !4, line: 209, baseType: !768, size: 64, offset: 8960)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !691, file: !4, line: 210, baseType: !768, size: 64, offset: 9024)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !691, file: !4, line: 211, baseType: !768, size: 64, offset: 9088)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !691, file: !4, line: 218, baseType: !776, size: 64, offset: 9152)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !759, !85, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !120, line: 65, size: 160, elements: !781)
!781 = !{!782, !783, !785, !786}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !780, file: !120, line: 66, baseType: !330, size: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !780, file: !120, line: 67, baseType: !784, size: 48, offset: 96)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 48, elements: !331)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !780, file: !120, line: 68, baseType: !178, size: 8, offset: 144)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !780, file: !120, line: 68, baseType: !178, size: 8, offset: 152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !691, file: !4, line: 219, baseType: !788, size: 64, offset: 9216)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !759, !85, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !120, line: 48, size: 96, elements: !793)
!793 = !{!794, !795, !796, !797, !798}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !792, file: !120, line: 49, baseType: !5, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !792, file: !120, line: 49, baseType: !5, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !792, file: !120, line: 50, baseType: !178, size: 8, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !792, file: !120, line: 50, baseType: !178, size: 8, offset: 72)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !792, file: !120, line: 51, baseType: !191, size: 16, offset: 80)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !691, file: !4, line: 220, baseType: !800, size: 64, offset: 9280)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !759, !85, !803}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !120, line: 42, size: 160, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !804, file: !120, line: 43, baseType: !5, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !804, file: !120, line: 43, baseType: !5, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !804, file: !120, line: 43, baseType: !5, size: 32, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !804, file: !120, line: 43, baseType: !5, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !804, file: !120, line: 44, baseType: !191, size: 16, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !804, file: !120, line: 45, baseType: !178, size: 8, offset: 144)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !804, file: !120, line: 45, baseType: !178, size: 8, offset: 152)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !691, file: !4, line: 227, baseType: !814, size: 64, offset: 9344)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!779, !759}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !691, file: !4, line: 228, baseType: !818, size: 64, offset: 9408)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!791, !759}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !691, file: !4, line: 229, baseType: !822, size: 64, offset: 9472)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!803, !759}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !691, file: !4, line: 230, baseType: !826, size: 64, offset: 9536)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!829, !759}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !120, line: 88, size: 64, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !830, file: !120, line: 89, baseType: !5, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !830, file: !120, line: 90, baseType: !5, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !691, file: !4, line: 231, baseType: !835, size: 64, offset: 9600)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!838, !759}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !120, line: 79, size: 96, elements: !840)
!840 = !{!841, !842, !843, !844, !845}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !839, file: !120, line: 81, baseType: !85, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !839, file: !120, line: 82, baseType: !85, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !839, file: !120, line: 83, baseType: !191, size: 16, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !839, file: !120, line: 84, baseType: !178, size: 8, offset: 80)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !839, file: !120, line: 84, baseType: !178, size: 8, offset: 88)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !691, file: !4, line: 236, baseType: !847, size: 64, offset: 9664)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !759, !779}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !691, file: !4, line: 237, baseType: !851, size: 64, offset: 9728)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !759, !791}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !691, file: !4, line: 238, baseType: !855, size: 64, offset: 9792)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !759, !803}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !691, file: !4, line: 239, baseType: !859, size: 64, offset: 9856)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !759, !829}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !691, file: !4, line: 240, baseType: !863, size: 64, offset: 9920)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !759, !838}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !691, file: !4, line: 245, baseType: !814, size: 64, offset: 9984)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !691, file: !4, line: 246, baseType: !818, size: 64, offset: 10048)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !691, file: !4, line: 247, baseType: !822, size: 64, offset: 10112)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !691, file: !4, line: 248, baseType: !826, size: 64, offset: 10176)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !691, file: !4, line: 249, baseType: !835, size: 64, offset: 10240)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !691, file: !4, line: 255, baseType: !872, size: 64, offset: 10304)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!125, !759, !85, !85}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !691, file: !4, line: 256, baseType: !872, size: 64, offset: 10368)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !691, file: !4, line: 257, baseType: !872, size: 64, offset: 10432)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !691, file: !4, line: 258, baseType: !872, size: 64, offset: 10496)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !691, file: !4, line: 264, baseType: !879, size: 64, offset: 10560)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!125, !759, !85}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !691, file: !4, line: 265, baseType: !879, size: 64, offset: 10624)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !691, file: !4, line: 266, baseType: !879, size: 64, offset: 10688)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !691, file: !4, line: 267, baseType: !879, size: 64, offset: 10752)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !691, file: !4, line: 268, baseType: !879, size: 64, offset: 10816)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !691, file: !4, line: 272, baseType: !887, size: 64, offset: 10880)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!890, !759}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !691, file: !4, line: 273, baseType: !887, size: 64, offset: 10944)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !691, file: !4, line: 274, baseType: !887, size: 64, offset: 11008)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !691, file: !4, line: 275, baseType: !887, size: 64, offset: 11072)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !691, file: !4, line: 276, baseType: !887, size: 64, offset: 11136)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !691, file: !4, line: 279, baseType: !896, size: 64, offset: 11200)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !759, !85, !890, !85}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !691, file: !4, line: 280, baseType: !896, size: 64, offset: 11264)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !691, file: !4, line: 281, baseType: !896, size: 64, offset: 11328)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !691, file: !4, line: 284, baseType: !768, size: 64, offset: 11392)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !691, file: !4, line: 285, baseType: !768, size: 64, offset: 11456)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !691, file: !4, line: 286, baseType: !904, size: 64, offset: 11520)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!907, !759}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !691, file: !4, line: 287, baseType: !911, size: 64, offset: 11584)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!914, !759}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !917)
!917 = !{!918, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !916, file: !4, line: 118, baseType: !919, size: 128)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !413)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !916, file: !4, line: 119, baseType: !919, size: 128, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !691, file: !4, line: 288, baseType: !922, size: 64, offset: 11648)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!250, !759}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !691, file: !4, line: 289, baseType: !926, size: 64, offset: 11712)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !759, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !691, file: !4, line: 290, baseType: !932, size: 64, offset: 11776)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!935, !759}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !937, file: !4, line: 124, baseType: !191, size: 16)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !937, file: !4, line: 125, baseType: !178, size: 8, offset: 16)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !691, file: !4, line: 291, baseType: !942, size: 64, offset: 11840)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!945, !759}
