; ModuleID = 'blender/source/blender/modifiers/intern/MOD_shapekey.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_shapekey.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!10 = !DIEnumerator(name: "eModifierTypeType_OnlyDeform", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "eModifierTypeType_Constructive", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "eModifierTypeType_Nonconstructive", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "eModifierTypeType_DeformOrConstruct", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "eModifierTypeType_NonGeometrical", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 73, baseType: !7, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!17 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsMesh", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsCVs", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "eModifierTypeFlag_SupportsMapping", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "eModifierTypeFlag_SupportsEditmode", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "eModifierTypeFlag_EnableInEditmode", value: 16, isUnsigned: true)
!22 = !DIEnumerator(name: "eModifierTypeFlag_RequiresOriginalData", value: 32, isUnsigned: true)
!23 = !DIEnumerator(name: "eModifierTypeFlag_UsesPointCache", value: 64, isUnsigned: true)
!24 = !DIEnumerator(name: "eModifierTypeFlag_Single", value: 128, isUnsigned: true)
!25 = !DIEnumerator(name: "eModifierTypeFlag_NoUserAdd", value: 256, isUnsigned: true)
!26 = !DIEnumerator(name: "eModifierTypeFlag_UsesPreview", value: 512, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DerivedMeshType", file: !28, line: 128, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "DM_TYPE_CDDM", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "DM_TYPE_EDITBMESH", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "DM_TYPE_CCGDM", value: 2, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDirtyFlag", file: !28, line: 164, baseType: !7, size: 32, elements: !34)
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "DM_DIRTY_TESS_CDLAYERS", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "DM_DIRTY_MCOL_UPDATE_DRAW", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "DM_DIRTY_NORMALS", value: 4, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMForeachFlag", file: !28, line: 159, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "DM_FOREACH_NOP", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "DM_FOREACH_USE_NORMAL", value: 1, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawOption", file: !28, line: 134, baseType: !7, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !28, line: 152, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !6, line: 110, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 626, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64}
!63 = !DIEnumerator(name: "OB_SHAPE_LOCK", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "OB_SHAPE_EDIT_MODE", value: 4, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 110, baseType: !7, size: 32, elements: !67)
!66 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "KEY_NORMAL", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "KEY_RELATIVE", value: 1, isUnsigned: true)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!73 = !{!0}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !76)
!76 = !{!77, !82, !83, !85, !87, !89, !112, !955, !962, !968, !972, !976, !980, !984, !990, !991, !995, !1003, !1007, !1008, !1017, !1026}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !6, line: 123, baseType: !78, size: 256)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 256, elements: !80)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !{!81}
!81 = !DISubrange(count: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !75, file: !6, line: 128, baseType: !78, size: 256, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !75, file: !6, line: 131, baseType: !84, size: 32, offset: 512)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !6, line: 133, baseType: !86, size: 32, offset: 544)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !75, file: !6, line: 134, baseType: !88, size: 32, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !75, file: !6, line: 142, baseType: !90, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !95, line: 99, size: 896, elements: !96)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !107, !110}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !95, line: 100, baseType: !93, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !94, file: !95, line: 100, baseType: !93, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !95, line: 102, baseType: !84, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !94, file: !95, line: 102, baseType: !84, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !94, file: !95, line: 103, baseType: !84, size: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !94, file: !95, line: 103, baseType: !84, size: 32, offset: 224)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !95, line: 104, baseType: !104, size: 512, offset: 256)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 512, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !94, file: !95, line: 107, baseType: !108, size: 64, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !28, line: 89, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !94, file: !95, line: 109, baseType: !111, size: 64, offset: 832)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !75, file: !6, line: 151, baseType: !113, size: 64, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !93, !116, !415, !716, !84, !954}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !61, line: 115, size: 11392, elements: !118)
!118 = !{!119, !186, !189, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !206, !217, !231, !232, !275, !276, !279, !280, !296, !297, !298, !299, !300, !301, !302, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !321, !322, !323, !324, !325, !326, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !386, !387, !388, !389, !390, !391, !392, !393, !394, !398, !401, !404, !405, !406, !407, !408, !411, !414, !901, !902, !908, !909, !910, !911, !912, !913, !915, !918, !921, !923, !942, !943}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !117, file: !61, line: 116, baseType: !120, size: 960)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !121, line: 130, baseType: !122)
!121 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !121, line: 117, size: 960, elements: !123)
!123 = !{!124, !126, !127, !129, !148, !152, !154, !155, !156, !157}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !121, line: 118, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !121, line: 118, baseType: !125, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !122, file: !121, line: 119, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !122, file: !121, line: 120, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !121, line: 136, size: 17600, elements: !132)
!132 = !{!133, !134, !136, !139, !143, !144, !145}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !131, file: !121, line: 137, baseType: !120, size: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !131, file: !121, line: 138, baseType: !135, size: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !131, file: !121, line: 139, baseType: !137, size: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !121, line: 43, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !121, line: 140, baseType: !140, size: 8192, offset: 1088)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8192, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !131, file: !121, line: 141, baseType: !140, size: 8192, offset: 9280)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !131, file: !121, line: 148, baseType: !130, size: 64, offset: 17472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !131, file: !121, line: 150, baseType: !146, size: 64, offset: 17536)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !121, line: 45, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !121, line: 121, baseType: !149, size: 528, offset: 256)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 528, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 66)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !122, file: !121, line: 126, baseType: !153, size: 16, offset: 784)
!153 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !122, file: !121, line: 127, baseType: !84, size: 32, offset: 800)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !122, file: !121, line: 128, baseType: !84, size: 32, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !122, file: !121, line: 128, baseType: !84, size: 32, offset: 864)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !122, file: !121, line: 129, baseType: !158, size: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !121, line: 75, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !121, line: 62, size: 1024, elements: !161)
!161 = !{!162, !164, !165, !166, !167, !168, !169, !170, !184, !185}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !121, line: 63, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !121, line: 63, baseType: !163, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !160, file: !121, line: 64, baseType: !79, size: 8, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !160, file: !121, line: 64, baseType: !79, size: 8, offset: 136)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !121, line: 65, baseType: !153, size: 16, offset: 144)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !121, line: 66, baseType: !104, size: 512, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !160, file: !121, line: 67, baseType: !84, size: 32, offset: 672)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !121, line: 69, baseType: !171, size: 256, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !121, line: 60, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !121, line: 48, size: 256, elements: !173)
!173 = !{!174, !175, !182, !183}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !172, file: !121, line: 49, baseType: !125, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !172, file: !121, line: 58, baseType: !176, size: 128, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !177, line: 71, baseType: !178)
!177 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !177, line: 69, size: 128, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !178, file: !177, line: 70, baseType: !125, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !178, file: !177, line: 70, baseType: !125, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !172, file: !121, line: 59, baseType: !84, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !172, file: !121, line: 59, baseType: !84, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !160, file: !121, line: 70, baseType: !84, size: 32, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !160, file: !121, line: 74, baseType: !84, size: 32, offset: 992)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !117, file: !61, line: 117, baseType: !187, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !66, line: 42, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !117, file: !61, line: 119, baseType: !190, size: 64, offset: 1024)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !61, line: 57, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !61, line: 121, baseType: !153, size: 16, offset: 1088)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !117, file: !61, line: 121, baseType: !153, size: 16, offset: 1104)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !117, file: !61, line: 122, baseType: !84, size: 32, offset: 1120)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !117, file: !61, line: 122, baseType: !84, size: 32, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !117, file: !61, line: 122, baseType: !84, size: 32, offset: 1184)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !117, file: !61, line: 123, baseType: !104, size: 512, offset: 1216)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !117, file: !61, line: 124, baseType: !116, size: 64, offset: 1728)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !117, file: !61, line: 124, baseType: !116, size: 64, offset: 1792)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !117, file: !61, line: 127, baseType: !116, size: 64, offset: 1856)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !117, file: !61, line: 127, baseType: !116, size: 64, offset: 1920)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !117, file: !61, line: 127, baseType: !116, size: 64, offset: 1984)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !117, file: !61, line: 128, baseType: !204, size: 64, offset: 2048)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !66, line: 43, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !117, file: !61, line: 130, baseType: !207, size: 64, offset: 2112)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !61, line: 97, size: 832, elements: !209)
!209 = !{!210, !215, !216}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !208, file: !61, line: 98, baseType: !211, size: 768)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 768, elements: !212)
!212 = !{!213, !214}
!213 = !DISubrange(count: 8)
!214 = !DISubrange(count: 3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !208, file: !61, line: 99, baseType: !84, size: 32, offset: 768)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !208, file: !61, line: 99, baseType: !84, size: 32, offset: 800)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !117, file: !61, line: 131, baseType: !218, size: 64, offset: 2176)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !220, line: 486, size: 1600, elements: !221)
!220 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !219, file: !220, line: 487, baseType: !120, size: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !219, file: !220, line: 489, baseType: !176, size: 128, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !219, file: !220, line: 490, baseType: !176, size: 128, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !219, file: !220, line: 491, baseType: !176, size: 128, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !219, file: !220, line: 492, baseType: !176, size: 128, offset: 1344)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !219, file: !220, line: 494, baseType: !84, size: 32, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !219, file: !220, line: 495, baseType: !84, size: 32, offset: 1504)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !219, file: !220, line: 497, baseType: !84, size: 32, offset: 1536)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !219, file: !220, line: 498, baseType: !84, size: 32, offset: 1568)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !117, file: !61, line: 132, baseType: !218, size: 64, offset: 2240)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !117, file: !61, line: 133, baseType: !233, size: 64, offset: 2304)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !220, line: 334, size: 1728, elements: !235)
!235 = !{!236, !237, !240, !241, !242, !243, !244, !245, !248, !249, !250, !251, !252, !253, !254, !274}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !234, file: !220, line: 335, baseType: !176, size: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !234, file: !220, line: 336, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !220, line: 47, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !220, line: 338, baseType: !153, size: 16, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !234, file: !220, line: 338, baseType: !153, size: 16, offset: 208)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !234, file: !220, line: 339, baseType: !7, size: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !234, file: !220, line: 340, baseType: !84, size: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !234, file: !220, line: 342, baseType: !72, size: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !234, file: !220, line: 343, baseType: !246, size: 96, offset: 320)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 96, elements: !247)
!247 = !{!214}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !234, file: !220, line: 344, baseType: !246, size: 96, offset: 416)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !234, file: !220, line: 347, baseType: !176, size: 128, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !234, file: !220, line: 349, baseType: !84, size: 32, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !234, file: !220, line: 350, baseType: !84, size: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !234, file: !220, line: 351, baseType: !125, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !234, file: !220, line: 352, baseType: !125, size: 64, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !234, file: !220, line: 354, baseType: !255, size: 384, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !220, line: 116, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !220, line: 94, size: 384, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !256, file: !220, line: 96, baseType: !84, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !256, file: !220, line: 96, baseType: !84, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !256, file: !220, line: 97, baseType: !84, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !256, file: !220, line: 97, baseType: !84, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !256, file: !220, line: 99, baseType: !153, size: 16, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !256, file: !220, line: 100, baseType: !153, size: 16, offset: 144)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !256, file: !220, line: 102, baseType: !153, size: 16, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !256, file: !220, line: 105, baseType: !153, size: 16, offset: 176)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !256, file: !220, line: 108, baseType: !153, size: 16, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !256, file: !220, line: 109, baseType: !153, size: 16, offset: 208)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !256, file: !220, line: 111, baseType: !153, size: 16, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !256, file: !220, line: 112, baseType: !153, size: 16, offset: 240)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !256, file: !220, line: 114, baseType: !84, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !256, file: !220, line: 114, baseType: !84, size: 32, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !256, file: !220, line: 115, baseType: !84, size: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !256, file: !220, line: 115, baseType: !84, size: 32, offset: 352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !234, file: !220, line: 355, baseType: !104, size: 512, offset: 1216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !61, line: 134, baseType: !125, size: 64, offset: 2368)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !117, file: !61, line: 136, baseType: !277, size: 64, offset: 2432)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !61, line: 58, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !117, file: !61, line: 138, baseType: !255, size: 384, offset: 2496)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !117, file: !61, line: 139, baseType: !281, size: 64, offset: 2880)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !220, line: 80, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !220, line: 72, size: 192, elements: !284)
!284 = !{!285, !292, !293, !294, !295}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !283, file: !220, line: 73, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !220, line: 59, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !220, line: 56, size: 128, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !288, file: !220, line: 57, baseType: !246, size: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !220, line: 58, baseType: !84, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !283, file: !220, line: 74, baseType: !84, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !283, file: !220, line: 76, baseType: !84, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !283, file: !220, line: 77, baseType: !84, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !220, line: 79, baseType: !84, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !117, file: !61, line: 141, baseType: !176, size: 128, offset: 2944)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !117, file: !61, line: 142, baseType: !176, size: 128, offset: 3072)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !117, file: !61, line: 143, baseType: !176, size: 128, offset: 3200)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !117, file: !61, line: 144, baseType: !176, size: 128, offset: 3328)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !117, file: !61, line: 146, baseType: !84, size: 32, offset: 3456)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !117, file: !61, line: 147, baseType: !84, size: 32, offset: 3488)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !117, file: !61, line: 150, baseType: !303, size: 64, offset: 3520)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !28, line: 190, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !117, file: !61, line: 151, baseType: !111, size: 64, offset: 3584)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !117, file: !61, line: 152, baseType: !84, size: 32, offset: 3648)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !117, file: !61, line: 153, baseType: !84, size: 32, offset: 3680)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !117, file: !61, line: 156, baseType: !246, size: 96, offset: 3712)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !117, file: !61, line: 156, baseType: !246, size: 96, offset: 3808)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !117, file: !61, line: 156, baseType: !246, size: 96, offset: 3904)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !117, file: !61, line: 157, baseType: !246, size: 96, offset: 4000)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !117, file: !61, line: 158, baseType: !246, size: 96, offset: 4096)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !117, file: !61, line: 159, baseType: !246, size: 96, offset: 4192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !117, file: !61, line: 160, baseType: !246, size: 96, offset: 4288)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !117, file: !61, line: 160, baseType: !246, size: 96, offset: 4384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !117, file: !61, line: 161, baseType: !318, size: 128, offset: 4480)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 4)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !117, file: !61, line: 161, baseType: !318, size: 128, offset: 4608)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !117, file: !61, line: 162, baseType: !246, size: 96, offset: 4736)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !117, file: !61, line: 162, baseType: !246, size: 96, offset: 4832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !117, file: !61, line: 163, baseType: !72, size: 32, offset: 4928)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !117, file: !61, line: 163, baseType: !72, size: 32, offset: 4960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !117, file: !61, line: 164, baseType: !327, size: 512, offset: 4992)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 512, elements: !328)
!328 = !{!320, !320}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !117, file: !61, line: 165, baseType: !327, size: 512, offset: 5504)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !117, file: !61, line: 166, baseType: !327, size: 512, offset: 6016)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !117, file: !61, line: 167, baseType: !327, size: 512, offset: 6528)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !117, file: !61, line: 176, baseType: !327, size: 512, offset: 7040)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !117, file: !61, line: 178, baseType: !7, size: 32, offset: 7552)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !117, file: !61, line: 180, baseType: !153, size: 16, offset: 7584)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !117, file: !61, line: 181, baseType: !153, size: 16, offset: 7600)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !117, file: !61, line: 183, baseType: !153, size: 16, offset: 7616)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !117, file: !61, line: 183, baseType: !153, size: 16, offset: 7632)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !117, file: !61, line: 184, baseType: !153, size: 16, offset: 7648)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !117, file: !61, line: 184, baseType: !153, size: 16, offset: 7664)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !117, file: !61, line: 185, baseType: !153, size: 16, offset: 7680)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !117, file: !61, line: 186, baseType: !153, size: 16, offset: 7696)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !117, file: !61, line: 187, baseType: !153, size: 16, offset: 7712)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !117, file: !61, line: 188, baseType: !79, size: 8, offset: 7728)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !117, file: !61, line: 189, baseType: !79, size: 8, offset: 7736)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !117, file: !61, line: 192, baseType: !84, size: 32, offset: 7744)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !117, file: !61, line: 192, baseType: !84, size: 32, offset: 7776)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !117, file: !61, line: 192, baseType: !84, size: 32, offset: 7808)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !117, file: !61, line: 192, baseType: !84, size: 32, offset: 7840)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !117, file: !61, line: 194, baseType: !84, size: 32, offset: 7872)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !117, file: !61, line: 202, baseType: !72, size: 32, offset: 7904)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !117, file: !61, line: 202, baseType: !72, size: 32, offset: 7936)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !117, file: !61, line: 202, baseType: !72, size: 32, offset: 7968)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !117, file: !61, line: 211, baseType: !72, size: 32, offset: 8000)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !117, file: !61, line: 212, baseType: !72, size: 32, offset: 8032)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !117, file: !61, line: 213, baseType: !72, size: 32, offset: 8064)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !117, file: !61, line: 214, baseType: !72, size: 32, offset: 8096)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !117, file: !61, line: 215, baseType: !72, size: 32, offset: 8128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !117, file: !61, line: 216, baseType: !72, size: 32, offset: 8160)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !117, file: !61, line: 219, baseType: !72, size: 32, offset: 8192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !117, file: !61, line: 220, baseType: !72, size: 32, offset: 8224)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !117, file: !61, line: 221, baseType: !72, size: 32, offset: 8256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !117, file: !61, line: 224, baseType: !363, size: 16, offset: 8288)
!363 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !117, file: !61, line: 224, baseType: !363, size: 16, offset: 8304)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !117, file: !61, line: 226, baseType: !153, size: 16, offset: 8320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !117, file: !61, line: 228, baseType: !79, size: 8, offset: 8336)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !117, file: !61, line: 229, baseType: !79, size: 8, offset: 8344)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !117, file: !61, line: 231, baseType: !153, size: 16, offset: 8352)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !117, file: !61, line: 232, baseType: !79, size: 8, offset: 8368)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !117, file: !61, line: 233, baseType: !79, size: 8, offset: 8376)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !117, file: !61, line: 234, baseType: !72, size: 32, offset: 8384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !117, file: !61, line: 235, baseType: !72, size: 32, offset: 8416)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !117, file: !61, line: 237, baseType: !176, size: 128, offset: 8448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !117, file: !61, line: 238, baseType: !176, size: 128, offset: 8576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !117, file: !61, line: 239, baseType: !176, size: 128, offset: 8704)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !117, file: !61, line: 240, baseType: !176, size: 128, offset: 8832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !117, file: !61, line: 242, baseType: !72, size: 32, offset: 8960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !117, file: !61, line: 244, baseType: !153, size: 16, offset: 8992)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !117, file: !61, line: 245, baseType: !363, size: 16, offset: 9008)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !117, file: !61, line: 246, baseType: !318, size: 128, offset: 9024)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !117, file: !61, line: 248, baseType: !84, size: 32, offset: 9152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !117, file: !61, line: 249, baseType: !84, size: 32, offset: 9184)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !117, file: !61, line: 251, baseType: !384, size: 64, offset: 9216)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !61, line: 251, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !117, file: !61, line: 253, baseType: !79, size: 8, offset: 9280)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !117, file: !61, line: 254, baseType: !79, size: 8, offset: 9288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !117, file: !61, line: 255, baseType: !153, size: 16, offset: 9296)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !117, file: !61, line: 256, baseType: !246, size: 96, offset: 9312)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !117, file: !61, line: 258, baseType: !176, size: 128, offset: 9408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !117, file: !61, line: 259, baseType: !176, size: 128, offset: 9536)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !117, file: !61, line: 260, baseType: !176, size: 128, offset: 9664)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !117, file: !61, line: 261, baseType: !176, size: 128, offset: 9792)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !117, file: !61, line: 263, baseType: !395, size: 64, offset: 9920)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !397, line: 244, flags: DIFlagFwdDecl)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !117, file: !61, line: 264, baseType: !399, size: 64, offset: 9984)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !61, line: 53, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !117, file: !61, line: 265, baseType: !402, size: 64, offset: 10048)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !397, line: 238, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !117, file: !61, line: 267, baseType: !79, size: 8, offset: 10112)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !117, file: !61, line: 268, baseType: !79, size: 8, offset: 10120)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !117, file: !61, line: 269, baseType: !153, size: 16, offset: 10128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !117, file: !61, line: 270, baseType: !72, size: 32, offset: 10144)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !117, file: !61, line: 272, baseType: !409, size: 64, offset: 10176)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !61, line: 54, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !117, file: !61, line: 275, baseType: !412, size: 64, offset: 10240)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !61, line: 275, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !117, file: !61, line: 277, baseType: !415, size: 64, offset: 10304)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !417)
!417 = !{!418, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !470, !473, !475, !476, !478, !479, !480, !481, !487, !492, !493, !497, !498, !499, !500, !501, !514, !526, !540, !544, !548, !552, !561, !573, !577, !581, !585, !589, !593, !594, !595, !596, !597, !598, !602, !603, !604, !605, !609, !610, !611, !612, !613, !618, !619, !620, !621, !622, !626, !627, !628, !629, !630, !637, !648, !653, !659, !669, !675, !686, !693, !700, !704, !708, !712, !717, !718, !719, !726, !732, !733, !734, !739, !740, !749, !858, !862, !870, !874, !878, !882, !890, !900}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !416, file: !28, line: 180, baseType: !419, size: 1600)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !420, line: 73, baseType: !421)
!420 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !420, line: 64, size: 1600, elements: !422)
!422 = !{!423, !438, !442, !443, !444, !445, !448}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !421, file: !420, line: 65, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !420, line: 53, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !420, line: 42, size: 832, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !426, file: !420, line: 43, baseType: !84, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !426, file: !420, line: 44, baseType: !84, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !426, file: !420, line: 45, baseType: !84, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !426, file: !420, line: 46, baseType: !84, size: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !426, file: !420, line: 47, baseType: !84, size: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !426, file: !420, line: 48, baseType: !84, size: 32, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !426, file: !420, line: 49, baseType: !84, size: 32, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !426, file: !420, line: 50, baseType: !84, size: 32, offset: 224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !426, file: !420, line: 51, baseType: !104, size: 512, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !426, file: !420, line: 52, baseType: !125, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !421, file: !420, line: 66, baseType: !439, size: 1312, offset: 64)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1312, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 41)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !421, file: !420, line: 69, baseType: !84, size: 32, offset: 1376)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !421, file: !420, line: 69, baseType: !84, size: 32, offset: 1408)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !421, file: !420, line: 70, baseType: !84, size: 32, offset: 1440)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !421, file: !420, line: 71, baseType: !446, size: 64, offset: 1472)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !420, line: 71, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !421, file: !420, line: 72, baseType: !449, size: 64, offset: 1536)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !420, line: 59, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !420, line: 57, size: 8192, elements: !452)
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !451, file: !420, line: 58, baseType: !140, size: 8192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !416, file: !28, line: 180, baseType: !419, size: 1600, offset: 1600)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !416, file: !28, line: 180, baseType: !419, size: 1600, offset: 3200)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !416, file: !28, line: 180, baseType: !419, size: 1600, offset: 4800)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !416, file: !28, line: 180, baseType: !419, size: 1600, offset: 6400)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !416, file: !28, line: 181, baseType: !84, size: 32, offset: 8000)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !416, file: !28, line: 181, baseType: !84, size: 32, offset: 8032)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !416, file: !28, line: 181, baseType: !84, size: 32, offset: 8064)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !416, file: !28, line: 181, baseType: !84, size: 32, offset: 8096)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !416, file: !28, line: 181, baseType: !84, size: 32, offset: 8128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !416, file: !28, line: 182, baseType: !84, size: 32, offset: 8160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !416, file: !28, line: 183, baseType: !84, size: 32, offset: 8192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !416, file: !28, line: 184, baseType: !466, size: 64, offset: 8256)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !467, line: 124, baseType: !468)
!467 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !467, line: 124, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !416, file: !28, line: 185, baseType: !471, size: 64, offset: 8320)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !416, file: !28, line: 186, baseType: !474, size: 32, offset: 8384)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !416, file: !28, line: 187, baseType: !72, size: 32, offset: 8416)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !416, file: !28, line: 188, baseType: !477, size: 32, offset: 8448)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !416, file: !28, line: 189, baseType: !84, size: 32, offset: 8480)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !416, file: !28, line: 190, baseType: !303, size: 64, offset: 8512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !416, file: !28, line: 193, baseType: !79, size: 8, offset: 8576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !416, file: !28, line: 196, baseType: !482, size: 64, offset: 8640)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !416)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !416, file: !28, line: 199, baseType: !488, size: 64, offset: 8704)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !485, !491}
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !416, file: !28, line: 202, baseType: !482, size: 64, offset: 8768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !416, file: !28, line: 207, baseType: !494, size: 64, offset: 8832)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!84, !485}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !416, file: !28, line: 208, baseType: !494, size: 64, offset: 8896)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !416, file: !28, line: 209, baseType: !494, size: 64, offset: 8960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !416, file: !28, line: 210, baseType: !494, size: 64, offset: 9024)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !416, file: !28, line: 211, baseType: !494, size: 64, offset: 9088)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !416, file: !28, line: 218, baseType: !502, size: 64, offset: 9152)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !485, !84, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !507, line: 65, size: 160, elements: !508)
!507 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!508 = !{!509, !510, !512, !513}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !506, file: !507, line: 66, baseType: !246, size: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !506, file: !507, line: 67, baseType: !511, size: 48, offset: 96)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 48, elements: !247)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !506, file: !507, line: 68, baseType: !79, size: 8, offset: 144)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !506, file: !507, line: 68, baseType: !79, size: 8, offset: 152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !416, file: !28, line: 219, baseType: !515, size: 64, offset: 9216)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !485, !84, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !507, line: 48, size: 96, elements: !520)
!520 = !{!521, !522, !523, !524, !525}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !519, file: !507, line: 49, baseType: !7, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !519, file: !507, line: 49, baseType: !7, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !519, file: !507, line: 50, baseType: !79, size: 8, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !519, file: !507, line: 50, baseType: !79, size: 8, offset: 72)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !519, file: !507, line: 51, baseType: !153, size: 16, offset: 80)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !416, file: !28, line: 220, baseType: !527, size: 64, offset: 9280)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !485, !84, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !507, line: 42, size: 160, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538, !539}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !531, file: !507, line: 43, baseType: !7, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !531, file: !507, line: 43, baseType: !7, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !531, file: !507, line: 43, baseType: !7, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !531, file: !507, line: 43, baseType: !7, size: 32, offset: 96)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !531, file: !507, line: 44, baseType: !153, size: 16, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !531, file: !507, line: 45, baseType: !79, size: 8, offset: 144)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !507, line: 45, baseType: !79, size: 8, offset: 152)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !416, file: !28, line: 227, baseType: !541, size: 64, offset: 9344)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!505, !485}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !416, file: !28, line: 228, baseType: !545, size: 64, offset: 9408)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!518, !485}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !416, file: !28, line: 229, baseType: !549, size: 64, offset: 9472)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!530, !485}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !416, file: !28, line: 230, baseType: !553, size: 64, offset: 9536)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !485}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !507, line: 88, size: 64, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !557, file: !507, line: 89, baseType: !7, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !557, file: !507, line: 90, baseType: !7, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !416, file: !28, line: 231, baseType: !562, size: 64, offset: 9600)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!565, !485}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !507, line: 79, size: 96, elements: !567)
!567 = !{!568, !569, !570, !571, !572}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !566, file: !507, line: 81, baseType: !84, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !566, file: !507, line: 82, baseType: !84, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !566, file: !507, line: 83, baseType: !153, size: 16, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !566, file: !507, line: 84, baseType: !79, size: 8, offset: 80)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !566, file: !507, line: 84, baseType: !79, size: 8, offset: 88)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !416, file: !28, line: 236, baseType: !574, size: 64, offset: 9664)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !485, !505}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !416, file: !28, line: 237, baseType: !578, size: 64, offset: 9728)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !485, !518}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !416, file: !28, line: 238, baseType: !582, size: 64, offset: 9792)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !485, !530}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !416, file: !28, line: 239, baseType: !586, size: 64, offset: 9856)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !485, !556}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !416, file: !28, line: 240, baseType: !590, size: 64, offset: 9920)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !485, !565}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !416, file: !28, line: 245, baseType: !541, size: 64, offset: 9984)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !416, file: !28, line: 246, baseType: !545, size: 64, offset: 10048)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !416, file: !28, line: 247, baseType: !549, size: 64, offset: 10112)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !416, file: !28, line: 248, baseType: !553, size: 64, offset: 10176)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !416, file: !28, line: 249, baseType: !562, size: 64, offset: 10240)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !416, file: !28, line: 255, baseType: !599, size: 64, offset: 10304)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!125, !485, !84, !84}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !416, file: !28, line: 256, baseType: !599, size: 64, offset: 10368)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !416, file: !28, line: 257, baseType: !599, size: 64, offset: 10432)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !416, file: !28, line: 258, baseType: !599, size: 64, offset: 10496)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !416, file: !28, line: 264, baseType: !606, size: 64, offset: 10560)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!125, !485, !84}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !416, file: !28, line: 265, baseType: !606, size: 64, offset: 10624)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !416, file: !28, line: 266, baseType: !606, size: 64, offset: 10688)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !416, file: !28, line: 267, baseType: !606, size: 64, offset: 10752)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !416, file: !28, line: 268, baseType: !606, size: 64, offset: 10816)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !416, file: !28, line: 272, baseType: !614, size: 64, offset: 10880)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!617, !485}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !416, file: !28, line: 273, baseType: !614, size: 64, offset: 10944)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !416, file: !28, line: 274, baseType: !614, size: 64, offset: 11008)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !416, file: !28, line: 275, baseType: !614, size: 64, offset: 11072)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !416, file: !28, line: 276, baseType: !614, size: 64, offset: 11136)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !416, file: !28, line: 279, baseType: !623, size: 64, offset: 11200)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !485, !84, !617, !84}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !416, file: !28, line: 280, baseType: !623, size: 64, offset: 11264)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !416, file: !28, line: 281, baseType: !623, size: 64, offset: 11328)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !416, file: !28, line: 284, baseType: !494, size: 64, offset: 11392)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !416, file: !28, line: 285, baseType: !494, size: 64, offset: 11456)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !416, file: !28, line: 286, baseType: !631, size: 64, offset: 11520)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!634, !485}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !416, file: !28, line: 287, baseType: !638, size: 64, offset: 11584)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !485}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !644)
!644 = !{!645, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !643, file: !28, line: 118, baseType: !646, size: 128)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !319)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !643, file: !28, line: 119, baseType: !646, size: 128, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !416, file: !28, line: 288, baseType: !649, size: 64, offset: 11648)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !485}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !416, file: !28, line: 289, baseType: !654, size: 64, offset: 11712)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !485, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !416, file: !28, line: 290, baseType: !660, size: 64, offset: 11776)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!663, !485}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !665, file: !28, line: 124, baseType: !153, size: 16)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !665, file: !28, line: 125, baseType: !79, size: 8, offset: 16)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !416, file: !28, line: 291, baseType: !670, size: 64, offset: 11840)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!673, !485}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !416, file: !28, line: 299, baseType: !676, size: 64, offset: 11904)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !485, !679, !125, !685}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !125, !84, !682, !682, !683}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !416, file: !28, line: 309, baseType: !687, size: 64, offset: 11968)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !485, !690, !125}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !125, !84, !682, !682}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !416, file: !28, line: 317, baseType: !694, size: 64, offset: 12032)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !485, !697, !125, !685}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !125, !84, !84, !682, !682}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !416, file: !28, line: 327, baseType: !701, size: 64, offset: 12096)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !485, !690, !125, !685}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !416, file: !28, line: 337, baseType: !705, size: 64, offset: 12160)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !485, !71, !71}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !416, file: !28, line: 344, baseType: !709, size: 64, offset: 12224)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !485, !84, !71}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !416, file: !28, line: 347, baseType: !713, size: 64, offset: 12288)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !485, !716}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !416, file: !28, line: 350, baseType: !709, size: 64, offset: 12352)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !416, file: !28, line: 351, baseType: !709, size: 64, offset: 12416)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !416, file: !28, line: 355, baseType: !720, size: 64, offset: 12480)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !116, !485}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !416, file: !28, line: 359, baseType: !727, size: 64, offset: 12544)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!730, !116, !485}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !416, file: !28, line: 364, baseType: !482, size: 64, offset: 12608)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !416, file: !28, line: 367, baseType: !482, size: 64, offset: 12672)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !416, file: !28, line: 373, baseType: !735, size: 64, offset: 12736)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !485, !738, !738}
!738 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !416, file: !28, line: 376, baseType: !482, size: 64, offset: 12800)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !416, file: !28, line: 385, baseType: !741, size: 64, offset: 12864)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !485, !744, !738, !745}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!84, !84, !125}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !416, file: !28, line: 391, baseType: !750, size: 64, offset: 12928)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !485, !753, !853, !125, !857}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!757, !758, !852, !84}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !507, line: 160, size: 384, elements: !760)
!760 = !{!761, !765, !847, !848, !849, !850, !851}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !759, file: !507, line: 161, baseType: !762, size: 256)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !763)
!763 = !{!320, !764}
!764 = !DISubrange(count: 2)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !759, file: !507, line: 162, baseType: !766, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !768, line: 77, size: 15424, elements: !769)
!768 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !{!770, !771, !772, !775, !778, !781, !784, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !836, !837, !841}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !767, file: !768, line: 78, baseType: !120, size: 960)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !767, file: !768, line: 80, baseType: !140, size: 8192, offset: 960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !767, file: !768, line: 82, baseType: !773, size: 64, offset: 9152)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !768, line: 43, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !767, file: !768, line: 83, baseType: !776, size: 64, offset: 9216)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !121, line: 46, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !767, file: !768, line: 86, baseType: !779, size: 64, offset: 9280)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !768, line: 41, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !767, file: !768, line: 87, baseType: !782, size: 64, offset: 9344)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !768, line: 44, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !767, file: !768, line: 89, baseType: !785, size: 512, offset: 9408)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 512, elements: !786)
!786 = !{!213}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !767, file: !768, line: 90, baseType: !153, size: 16, offset: 9920)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !767, file: !768, line: 90, baseType: !153, size: 16, offset: 9936)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !767, file: !768, line: 92, baseType: !153, size: 16, offset: 9952)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !767, file: !768, line: 92, baseType: !153, size: 16, offset: 9968)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !767, file: !768, line: 93, baseType: !153, size: 16, offset: 9984)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !768, line: 93, baseType: !153, size: 16, offset: 10000)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !767, file: !768, line: 94, baseType: !84, size: 32, offset: 10016)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !767, file: !768, line: 97, baseType: !153, size: 16, offset: 10048)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !767, file: !768, line: 97, baseType: !153, size: 16, offset: 10064)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !767, file: !768, line: 98, baseType: !153, size: 16, offset: 10080)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !767, file: !768, line: 98, baseType: !153, size: 16, offset: 10096)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !767, file: !768, line: 99, baseType: !153, size: 16, offset: 10112)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !767, file: !768, line: 99, baseType: !153, size: 16, offset: 10128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !767, file: !768, line: 100, baseType: !7, size: 32, offset: 10144)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !767, file: !768, line: 101, baseType: !674, size: 64, offset: 10176)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !767, file: !768, line: 103, baseType: !146, size: 64, offset: 10240)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !767, file: !768, line: 104, baseType: !804, size: 64, offset: 10304)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !121, line: 159, size: 448, elements: !806)
!806 = !{!807, !810, !811, !813, !814, !816}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !805, file: !121, line: 161, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !809)
!809 = !{!764}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !805, file: !121, line: 162, baseType: !808, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !805, file: !121, line: 163, baseType: !812, size: 32, offset: 128)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 32, elements: !809)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !805, file: !121, line: 164, baseType: !812, size: 32, offset: 160)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !805, file: !121, line: 165, baseType: !815, size: 128, offset: 192)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 128, elements: !809)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !805, file: !121, line: 166, baseType: !817, size: 128, offset: 320)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 128, elements: !809)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !767, file: !768, line: 107, baseType: !72, size: 32, offset: 10368)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !767, file: !768, line: 108, baseType: !84, size: 32, offset: 10400)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !767, file: !768, line: 109, baseType: !153, size: 16, offset: 10432)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !767, file: !768, line: 110, baseType: !153, size: 16, offset: 10448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !767, file: !768, line: 113, baseType: !84, size: 32, offset: 10464)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !767, file: !768, line: 113, baseType: !84, size: 32, offset: 10496)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !767, file: !768, line: 114, baseType: !79, size: 8, offset: 10528)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !767, file: !768, line: 114, baseType: !79, size: 8, offset: 10536)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !767, file: !768, line: 115, baseType: !153, size: 16, offset: 10544)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !767, file: !768, line: 116, baseType: !318, size: 128, offset: 10560)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !767, file: !768, line: 119, baseType: !72, size: 32, offset: 10688)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !767, file: !768, line: 119, baseType: !72, size: 32, offset: 10720)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !767, file: !768, line: 122, baseType: !831, size: 512, offset: 10752)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !832, line: 182, baseType: !833)
!832 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !832, line: 180, size: 512, elements: !834)
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !833, file: !832, line: 181, baseType: !104, size: 512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !767, file: !768, line: 123, baseType: !79, size: 8, offset: 11264)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !767, file: !768, line: 125, baseType: !838, size: 56, offset: 11272)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 56, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 7)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !767, file: !768, line: 126, baseType: !842, size: 4096, offset: 11328)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 4096, elements: !786)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !768, line: 69, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !768, line: 67, size: 512, elements: !845)
!845 = !{!846}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !844, file: !768, line: 68, baseType: !104, size: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !759, file: !507, line: 163, baseType: !79, size: 8, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !759, file: !507, line: 163, baseType: !79, size: 8, offset: 328)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !759, file: !507, line: 164, baseType: !153, size: 16, offset: 336)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !759, file: !507, line: 164, baseType: !153, size: 16, offset: 352)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !759, file: !507, line: 164, baseType: !153, size: 16, offset: 368)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!84, !125, !84, !84}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !416, file: !28, line: 400, baseType: !859, size: 64, offset: 12992)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !485, !745}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !416, file: !28, line: 415, baseType: !863, size: 64, offset: 13056)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !485, !866, !745, !853, !125, !857}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!757, !125, !84}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !416, file: !28, line: 425, baseType: !871, size: 64, offset: 13120)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !485, !866, !853, !125, !857}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !416, file: !28, line: 435, baseType: !875, size: 64, offset: 13184)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !485, !745, !866, !125}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !416, file: !28, line: 444, baseType: !879, size: 64, offset: 13248)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !485, !866, !125}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !416, file: !28, line: 455, baseType: !883, size: 64, offset: 13312)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !485, !866, !886, !125}
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !125, !84, !72}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !416, file: !28, line: 464, baseType: !891, size: 64, offset: 13376)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !485, !894, !897, !125}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !125, !84, !125}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!738, !125, !84}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !416, file: !28, line: 470, baseType: !482, size: 64, offset: 13440)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !117, file: !61, line: 277, baseType: !415, size: 64, offset: 10368)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !117, file: !61, line: 278, baseType: !903, size: 64, offset: 10432)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !904, line: 27, baseType: !905)
!904 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !906, line: 45, baseType: !907)
!906 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!907 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !117, file: !61, line: 279, baseType: !903, size: 64, offset: 10496)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !61, line: 280, baseType: !7, size: 32, offset: 10560)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !117, file: !61, line: 281, baseType: !7, size: 32, offset: 10592)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !117, file: !61, line: 283, baseType: !176, size: 128, offset: 10624)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !117, file: !61, line: 284, baseType: !176, size: 128, offset: 10752)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !117, file: !61, line: 285, baseType: !914, size: 64, offset: 10880)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !117, file: !61, line: 287, baseType: !916, size: 64, offset: 10944)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !61, line: 59, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !117, file: !61, line: 288, baseType: !919, size: 64, offset: 11008)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !61, line: 288, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !117, file: !61, line: 290, baseType: !922, size: 64, offset: 11072)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, elements: !809)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !117, file: !61, line: 291, baseType: !924, size: 64, offset: 11136)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !768, line: 65, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !768, line: 50, size: 320, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !926, file: !768, line: 51, baseType: !108, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !926, file: !768, line: 53, baseType: !84, size: 32, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !926, file: !768, line: 54, baseType: !84, size: 32, offset: 96)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !926, file: !768, line: 55, baseType: !84, size: 32, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !926, file: !768, line: 55, baseType: !84, size: 32, offset: 160)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !926, file: !768, line: 56, baseType: !79, size: 8, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !926, file: !768, line: 56, baseType: !79, size: 8, offset: 200)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !926, file: !768, line: 57, baseType: !79, size: 8, offset: 208)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !926, file: !768, line: 57, baseType: !79, size: 8, offset: 216)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !926, file: !768, line: 59, baseType: !153, size: 16, offset: 224)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !926, file: !768, line: 59, baseType: !153, size: 16, offset: 240)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !926, file: !768, line: 59, baseType: !153, size: 16, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !926, file: !768, line: 61, baseType: !153, size: 16, offset: 272)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !926, file: !768, line: 63, baseType: !84, size: 32, offset: 288)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !117, file: !61, line: 293, baseType: !176, size: 128, offset: 11200)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !117, file: !61, line: 294, baseType: !944, size: 64, offset: 11328)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !61, line: 113, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !61, line: 108, size: 256, elements: !947)
!947 = !{!948, !950, !951, !952, !953}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !946, file: !61, line: 109, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !946, file: !61, line: 109, baseType: !949, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !946, file: !61, line: 110, baseType: !116, size: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !946, file: !61, line: 111, baseType: !84, size: 32, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !946, file: !61, line: 112, baseType: !72, size: 32, offset: 224)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierApplyFlag", file: !6, line: 118, baseType: !54)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "deformMatrices", scope: !75, file: !6, line: 157, baseType: !956, size: 64, offset: 768)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !93, !116, !415, !716, !959, !84}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 288, elements: !961)
!961 = !{!214, !214}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "deformVertsEM", scope: !75, file: !6, line: 163, baseType: !963, size: 64, offset: 832)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !93, !116, !966, !415, !716, !84}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !28, line: 91, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "deformMatricesEM", scope: !75, file: !6, line: 168, baseType: !969, size: 64, offset: 896)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !93, !116, !966, !415, !716, !959, !84}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "applyModifier", scope: !75, file: !6, line: 193, baseType: !973, size: 64, offset: 960)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!415, !93, !116, !415, !954}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "applyModifierEM", scope: !75, file: !6, line: 204, baseType: !977, size: 64, offset: 1024)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!415, !93, !116, !966, !415, !954}
