; ModuleID = 'blender/source/blender/nodes/intern/node_util.c'
source_filename = "blender/source/blender/nodes/intern/node_util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.bNode = type { %struct.bNode*, %struct.bNode*, %struct.bNode*, %struct.IDProperty*, %struct.bNodeType*, [64 x i8], [64 x i8], i32, i16, i16, i16, i16, i16, i16, i16, i16, [3 x float], %struct.ListBase, %struct.ListBase, %struct.bNode*, %struct.ID*, i8*, %struct.bNode*, %struct.ListBase, float, float, float, float, float, float, float, i32, [64 x i8], i16, i16, float, float, i16, i16, i8*, %struct.rctf, %struct.rctf, %struct.rctf, i16, i16, i32, %struct.uiBlock* }
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !39, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !17, !27}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !4, line: 69, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketFlag", file: !18, line: 154, baseType: !5, size: 32, elements: !19)
!18 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!19 = !{!20, !21, !22, !23, !24, !25, !26}
!20 = !DIEnumerator(name: "SOCK_HIDDEN", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "SOCK_IN_USE", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "SOCK_UNAVAIL", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "SOCK_COLLAPSED", value: 64, isUnsigned: true)
!24 = !DIEnumerator(name: "SOCK_HIDE_VALUE", value: 128, isUnsigned: true)
!25 = !DIEnumerator(name: "SOCK_AUTO_HIDDEN__DEPRECATED", value: 256, isUnsigned: true)
!26 = !DIEnumerator(name: "SOCK_NO_INTERNAL_LINK", value: 512, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !18, line: 135, baseType: !28, size: 32, elements: !29)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38}
!30 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!31 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!32 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!33 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!34 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!35 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!36 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!37 = !DIEnumerator(name: "SOCK_INT", value: 6)
!38 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !43, line: 130, baseType: !44)
!43 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !43, line: 117, size: 960, elements: !45)
!45 = !{!46, !47, !48, !50, !69, !73, !75, !76, !77, !78}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !43, line: 118, baseType: !40, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !44, file: !43, line: 118, baseType: !40, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !44, file: !43, line: 119, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !44, file: !43, line: 120, baseType: !51, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !43, line: 136, size: 17600, elements: !53)
!53 = !{!54, !55, !56, !59, !64, !65, !66}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !52, file: !43, line: 137, baseType: !42, size: 960)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !52, file: !43, line: 138, baseType: !41, size: 64, offset: 960)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !52, file: !43, line: 139, baseType: !57, size: 64, offset: 1024)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !43, line: 43, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !43, line: 140, baseType: !60, size: 8192, offset: 1088)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8192, elements: !62)
!61 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!62 = !{!63}
!63 = !DISubrange(count: 1024)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !52, file: !43, line: 141, baseType: !60, size: 8192, offset: 9280)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !52, file: !43, line: 148, baseType: !51, size: 64, offset: 17472)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !52, file: !43, line: 150, baseType: !67, size: 64, offset: 17536)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !43, line: 45, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !43, line: 121, baseType: !70, size: 528, offset: 256)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 528, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 66)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !44, file: !43, line: 126, baseType: !74, size: 16, offset: 784)
!74 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !44, file: !43, line: 127, baseType: !28, size: 32, offset: 800)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !44, file: !43, line: 128, baseType: !28, size: 32, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !44, file: !43, line: 128, baseType: !28, size: 32, offset: 864)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !44, file: !43, line: 129, baseType: !79, size: 64, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !43, line: 75, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !43, line: 62, size: 1024, elements: !82)
!82 = !{!83, !85, !86, !87, !88, !89, !93, !94, !108, !109}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !43, line: 63, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !81, file: !43, line: 63, baseType: !84, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !43, line: 64, baseType: !61, size: 8, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !81, file: !43, line: 64, baseType: !61, size: 8, offset: 136)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !81, file: !43, line: 65, baseType: !74, size: 16, offset: 144)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !43, line: 66, baseType: !90, size: 512, offset: 160)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !81, file: !43, line: 67, baseType: !28, size: 32, offset: 672)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !81, file: !43, line: 69, baseType: !95, size: 256, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !43, line: 60, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !43, line: 48, size: 256, elements: !97)
!97 = !{!98, !99, !106, !107}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !96, file: !43, line: 49, baseType: !40, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !96, file: !43, line: 58, baseType: !100, size: 128, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !101, line: 71, baseType: !102)
!101 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !101, line: 69, size: 128, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !102, file: !101, line: 70, baseType: !40, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !102, file: !101, line: 70, baseType: !40, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !96, file: !43, line: 59, baseType: !28, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !96, file: !43, line: 59, baseType: !28, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !81, file: !43, line: 70, baseType: !28, size: 32, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !81, file: !43, line: 74, baseType: !28, size: 32, offset: 992)
!110 = !{i32 7, !"Dwarf Version", i32 4}
!111 = !{i32 2, !"Debug Info Version", i32 3}
!112 = !{i32 1, !"wchar_size", i32 4}
!113 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!114 = distinct !DISubprogram(name: "node_free_curves", scope: !1, file: !1, line: 55, type: !115, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1718)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !18, line: 218, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !18, line: 167, size: 3712, elements: !120)
!120 = !{!121, !123, !124, !125, !126, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !18, line: 168, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !18, line: 168, baseType: !122, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !119, file: !18, line: 168, baseType: !122, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !119, file: !18, line: 170, baseType: !79, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !119, file: !18, line: 172, baseType: !127, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !129, line: 144, size: 6016, elements: !130)
!129 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!130 = !{!131, !132, !133, !134, !135, !136, !137, !141, !142, !144, !145, !146, !147, !148, !149, !150, !151, !152, !1546, !1547, !1548, !1556, !1560, !1564, !1565, !1569, !1573, !1577, !1578, !1579, !1580, !1584, !1585, !1589, !1593, !1597, !1601, !1605, !1609, !1613, !1614, !1624, !1626, !1653, !1673}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !128, file: !129, line: 145, baseType: !40, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !128, file: !129, line: 145, baseType: !40, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !128, file: !129, line: 146, baseType: !74, size: 16, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !128, file: !129, line: 148, baseType: !90, size: 512, offset: 144)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !129, line: 149, baseType: !28, size: 32, offset: 672)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !128, file: !129, line: 151, baseType: !90, size: 512, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !128, file: !129, line: 152, baseType: !138, size: 2048, offset: 1216)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !128, file: !129, line: 153, baseType: !28, size: 32, offset: 3264)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !128, file: !129, line: 155, baseType: !143, size: 32, offset: 3296)
!143 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !128, file: !129, line: 155, baseType: !143, size: 32, offset: 3328)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !128, file: !129, line: 155, baseType: !143, size: 32, offset: 3360)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !128, file: !129, line: 156, baseType: !143, size: 32, offset: 3392)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !128, file: !129, line: 156, baseType: !143, size: 32, offset: 3424)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !128, file: !129, line: 156, baseType: !143, size: 32, offset: 3456)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !128, file: !129, line: 157, baseType: !74, size: 16, offset: 3488)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !128, file: !129, line: 157, baseType: !74, size: 16, offset: 3504)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !128, file: !129, line: 157, baseType: !74, size: 16, offset: 3520)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !128, file: !129, line: 160, baseType: !153, size: 64, offset: 3584)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !129, line: 109, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !129, line: 98, size: 1408, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !1545}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !129, line: 99, baseType: !28, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !155, file: !129, line: 99, baseType: !28, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !129, line: 100, baseType: !90, size: 512, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !155, file: !129, line: 101, baseType: !143, size: 32, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !155, file: !129, line: 101, baseType: !143, size: 32, offset: 608)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !155, file: !129, line: 101, baseType: !143, size: 32, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !155, file: !129, line: 101, baseType: !143, size: 32, offset: 672)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !155, file: !129, line: 102, baseType: !143, size: 32, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !155, file: !129, line: 102, baseType: !143, size: 32, offset: 736)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !155, file: !129, line: 103, baseType: !28, size: 32, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !155, file: !129, line: 104, baseType: !28, size: 32, offset: 800)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !155, file: !129, line: 107, baseType: !169, size: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !18, line: 87, size: 2816, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !18, line: 88, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !18, line: 88, baseType: !169, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !170, file: !18, line: 88, baseType: !169, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !170, file: !18, line: 90, baseType: !79, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !170, file: !18, line: 92, baseType: !90, size: 512, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !18, line: 94, baseType: !90, size: 512, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !170, file: !18, line: 99, baseType: !40, size: 64, offset: 1280)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !18, line: 101, baseType: !74, size: 16, offset: 1344)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !170, file: !18, line: 101, baseType: !74, size: 16, offset: 1360)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !170, file: !18, line: 102, baseType: !74, size: 16, offset: 1376)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !170, file: !18, line: 103, baseType: !74, size: 16, offset: 1392)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !170, file: !18, line: 104, baseType: !184, size: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !129, line: 114, size: 1600, elements: !186)
!186 = !{!187, !188, !210, !215, !219, !223, !1505, !1509, !1510, !1514, !1515, !1516, !1517}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !185, file: !129, line: 115, baseType: !90, size: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !185, file: !129, line: 117, baseType: !189, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !192, !195, !197, !197, !208}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !194, line: 44, flags: DIFlagFwdDecl)
!194 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !129, line: 73, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !194, line: 55, size: 192, elements: !199)
!199 = !{!200, !204, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !194, line: 58, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !198, file: !194, line: 56, size: 64, elements: !202)
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !201, file: !194, line: 57, baseType: !40, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !194, line: 60, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !18, line: 335, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !194, line: 61, baseType: !40, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !185, file: !129, line: 118, baseType: !211, size: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !192, !197, !197, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !185, file: !129, line: 120, baseType: !216, size: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !192, !195, !197}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !185, file: !129, line: 121, baseType: !220, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !192, !197, !214}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !185, file: !129, line: 122, baseType: !224, size: 64, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !227, !169, !205}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !18, line: 328, size: 3456, elements: !229)
!229 = !{!230, !231, !235, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1478, !1483, !1484, !1487, !1491, !1496, !1500, !1501, !1502, !1503, !1504}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !228, file: !18, line: 329, baseType: !42, size: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !228, file: !18, line: 330, baseType: !232, size: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !234, line: 45, flags: DIFlagFwdDecl)
!234 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !228, file: !18, line: 332, baseType: !236, size: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !129, line: 283, size: 4096, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !248, !252, !1382, !1388, !1394, !1398, !1399, !1400, !1401, !1418, !1419}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !237, file: !129, line: 284, baseType: !28, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !237, file: !129, line: 285, baseType: !90, size: 512, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !237, file: !129, line: 287, baseType: !90, size: 512, offset: 544)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !237, file: !129, line: 288, baseType: !138, size: 2048, offset: 1056)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !237, file: !129, line: 289, baseType: !28, size: 32, offset: 3104)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !237, file: !129, line: 292, baseType: !245, size: 64, offset: 3136)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !227}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !237, file: !129, line: 293, baseType: !249, size: 64, offset: 3200)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !227, !122}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !237, file: !129, line: 294, baseType: !253, size: 64, offset: 3264)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !256, !40, !1378}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !258, line: 1216, size: 39680, elements: !259)
!258 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!259 = !{!260, !261, !262, !265, !748, !749, !750, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !777, !992, !995, !1245, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1267, !1268, !1269, !1270, !1271, !1279, !1345, !1352, !1355, !1362, !1365, !1371, !1372, !1373, !1374, !1375}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !257, file: !258, line: 1217, baseType: !42, size: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !257, file: !258, line: 1218, baseType: !232, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !257, file: !258, line: 1220, baseType: !263, size: 64, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !234, line: 49, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !257, file: !258, line: 1221, baseType: !266, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !268, line: 52, size: 4224, elements: !269)
!268 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !342, !743, !744, !745, !746, !747}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !267, file: !268, line: 53, baseType: !42, size: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !267, file: !268, line: 54, baseType: !232, size: 64, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !267, file: !268, line: 56, baseType: !74, size: 16, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !267, file: !268, line: 56, baseType: !74, size: 16, offset: 1040)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !267, file: !268, line: 57, baseType: !74, size: 16, offset: 1056)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !267, file: !268, line: 57, baseType: !74, size: 16, offset: 1072)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !267, file: !268, line: 59, baseType: !143, size: 32, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !267, file: !268, line: 59, baseType: !143, size: 32, offset: 1120)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !267, file: !268, line: 59, baseType: !143, size: 32, offset: 1152)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !267, file: !268, line: 60, baseType: !143, size: 32, offset: 1184)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !267, file: !268, line: 60, baseType: !143, size: 32, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !267, file: !268, line: 60, baseType: !143, size: 32, offset: 1248)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !267, file: !268, line: 61, baseType: !143, size: 32, offset: 1280)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !267, file: !268, line: 61, baseType: !143, size: 32, offset: 1312)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !267, file: !268, line: 61, baseType: !143, size: 32, offset: 1344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !267, file: !268, line: 68, baseType: !143, size: 32, offset: 1376)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !267, file: !268, line: 68, baseType: !143, size: 32, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !267, file: !268, line: 68, baseType: !143, size: 32, offset: 1440)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !267, file: !268, line: 69, baseType: !143, size: 32, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !267, file: !268, line: 69, baseType: !143, size: 32, offset: 1504)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !267, file: !268, line: 74, baseType: !143, size: 32, offset: 1536)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !267, file: !268, line: 79, baseType: !143, size: 32, offset: 1568)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !267, file: !268, line: 81, baseType: !74, size: 16, offset: 1600)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !267, file: !268, line: 91, baseType: !74, size: 16, offset: 1616)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !267, file: !268, line: 92, baseType: !74, size: 16, offset: 1632)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !267, file: !268, line: 93, baseType: !74, size: 16, offset: 1648)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !267, file: !268, line: 94, baseType: !74, size: 16, offset: 1664)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !267, file: !268, line: 94, baseType: !74, size: 16, offset: 1680)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !267, file: !268, line: 94, baseType: !74, size: 16, offset: 1696)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !267, file: !268, line: 94, baseType: !74, size: 16, offset: 1712)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !267, file: !268, line: 96, baseType: !143, size: 32, offset: 1728)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !267, file: !268, line: 96, baseType: !143, size: 32, offset: 1760)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !267, file: !268, line: 96, baseType: !143, size: 32, offset: 1792)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !267, file: !268, line: 96, baseType: !143, size: 32, offset: 1824)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !267, file: !268, line: 98, baseType: !143, size: 32, offset: 1856)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !267, file: !268, line: 98, baseType: !143, size: 32, offset: 1888)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !267, file: !268, line: 98, baseType: !143, size: 32, offset: 1920)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !267, file: !268, line: 98, baseType: !143, size: 32, offset: 1952)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !267, file: !268, line: 99, baseType: !143, size: 32, offset: 1984)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !267, file: !268, line: 99, baseType: !143, size: 32, offset: 2016)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !267, file: !268, line: 100, baseType: !143, size: 32, offset: 2048)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !267, file: !268, line: 100, baseType: !143, size: 32, offset: 2080)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !267, file: !268, line: 103, baseType: !74, size: 16, offset: 2112)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !267, file: !268, line: 103, baseType: !74, size: 16, offset: 2128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !267, file: !268, line: 103, baseType: !74, size: 16, offset: 2144)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !267, file: !268, line: 103, baseType: !74, size: 16, offset: 2160)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !267, file: !268, line: 106, baseType: !143, size: 32, offset: 2176)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !267, file: !268, line: 106, baseType: !143, size: 32, offset: 2208)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !267, file: !268, line: 106, baseType: !143, size: 32, offset: 2240)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !267, file: !268, line: 106, baseType: !143, size: 32, offset: 2272)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !267, file: !268, line: 107, baseType: !74, size: 16, offset: 2304)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !267, file: !268, line: 107, baseType: !74, size: 16, offset: 2320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !267, file: !268, line: 107, baseType: !74, size: 16, offset: 2336)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !267, file: !268, line: 107, baseType: !74, size: 16, offset: 2352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !267, file: !268, line: 108, baseType: !143, size: 32, offset: 2368)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !267, file: !268, line: 108, baseType: !143, size: 32, offset: 2400)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !267, file: !268, line: 109, baseType: !143, size: 32, offset: 2432)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !267, file: !268, line: 109, baseType: !143, size: 32, offset: 2464)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !267, file: !268, line: 110, baseType: !143, size: 32, offset: 2496)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !267, file: !268, line: 110, baseType: !143, size: 32, offset: 2528)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !267, file: !268, line: 110, baseType: !143, size: 32, offset: 2560)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !267, file: !268, line: 111, baseType: !74, size: 16, offset: 2592)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !267, file: !268, line: 111, baseType: !74, size: 16, offset: 2608)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !267, file: !268, line: 112, baseType: !74, size: 16, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !267, file: !268, line: 112, baseType: !74, size: 16, offset: 2640)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !267, file: !268, line: 112, baseType: !74, size: 16, offset: 2656)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !268, line: 115, baseType: !74, size: 16, offset: 2672)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !267, file: !268, line: 118, baseType: !214, size: 64, offset: 2688)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !267, file: !268, line: 118, baseType: !214, size: 64, offset: 2752)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !267, file: !268, line: 121, baseType: !340, size: 64, offset: 2816)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !234, line: 46, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !267, file: !268, line: 122, baseType: !343, size: 1152, offset: 2880)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 1152, elements: !741)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !234, line: 57, size: 2496, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !345, file: !234, line: 59, baseType: !74, size: 16)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !345, file: !234, line: 59, baseType: !74, size: 16, offset: 16)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !345, file: !234, line: 59, baseType: !74, size: 16, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !345, file: !234, line: 59, baseType: !74, size: 16, offset: 48)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !345, file: !234, line: 60, baseType: !263, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !345, file: !234, line: 61, baseType: !353, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !234, line: 202, size: 3328, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !425, !426, !427, !514, !540, !571, !572, !651, !672, !680, !681}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !354, file: !234, line: 203, baseType: !42, size: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !354, file: !234, line: 204, baseType: !232, size: 64, offset: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !354, file: !234, line: 206, baseType: !143, size: 32, offset: 1024)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !354, file: !234, line: 206, baseType: !143, size: 32, offset: 1056)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !354, file: !234, line: 207, baseType: !143, size: 32, offset: 1088)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !354, file: !234, line: 207, baseType: !143, size: 32, offset: 1120)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !354, file: !234, line: 207, baseType: !143, size: 32, offset: 1152)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !354, file: !234, line: 207, baseType: !143, size: 32, offset: 1184)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !354, file: !234, line: 207, baseType: !143, size: 32, offset: 1216)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !354, file: !234, line: 207, baseType: !143, size: 32, offset: 1248)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !354, file: !234, line: 208, baseType: !143, size: 32, offset: 1280)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !354, file: !234, line: 208, baseType: !143, size: 32, offset: 1312)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !354, file: !234, line: 211, baseType: !143, size: 32, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !354, file: !234, line: 211, baseType: !143, size: 32, offset: 1376)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !354, file: !234, line: 211, baseType: !143, size: 32, offset: 1408)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !354, file: !234, line: 211, baseType: !143, size: 32, offset: 1440)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !354, file: !234, line: 211, baseType: !143, size: 32, offset: 1472)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !354, file: !234, line: 214, baseType: !143, size: 32, offset: 1504)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !354, file: !234, line: 214, baseType: !143, size: 32, offset: 1536)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !354, file: !234, line: 217, baseType: !143, size: 32, offset: 1568)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !354, file: !234, line: 218, baseType: !143, size: 32, offset: 1600)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !354, file: !234, line: 219, baseType: !143, size: 32, offset: 1632)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !354, file: !234, line: 220, baseType: !143, size: 32, offset: 1664)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !354, file: !234, line: 221, baseType: !143, size: 32, offset: 1696)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !354, file: !234, line: 222, baseType: !74, size: 16, offset: 1728)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !354, file: !234, line: 222, baseType: !74, size: 16, offset: 1744)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !354, file: !234, line: 224, baseType: !74, size: 16, offset: 1760)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !354, file: !234, line: 224, baseType: !74, size: 16, offset: 1776)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !354, file: !234, line: 227, baseType: !74, size: 16, offset: 1792)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !354, file: !234, line: 227, baseType: !74, size: 16, offset: 1808)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !354, file: !234, line: 229, baseType: !74, size: 16, offset: 1824)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !234, line: 229, baseType: !74, size: 16, offset: 1840)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !234, line: 230, baseType: !74, size: 16, offset: 1856)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !354, file: !234, line: 230, baseType: !74, size: 16, offset: 1872)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !354, file: !234, line: 232, baseType: !143, size: 32, offset: 1888)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !354, file: !234, line: 232, baseType: !143, size: 32, offset: 1920)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !354, file: !234, line: 232, baseType: !143, size: 32, offset: 1952)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !354, file: !234, line: 232, baseType: !143, size: 32, offset: 1984)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !354, file: !234, line: 233, baseType: !28, size: 32, offset: 2016)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !354, file: !234, line: 234, baseType: !28, size: 32, offset: 2048)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !354, file: !234, line: 235, baseType: !74, size: 16, offset: 2080)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !354, file: !234, line: 235, baseType: !74, size: 16, offset: 2096)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !354, file: !234, line: 236, baseType: !74, size: 16, offset: 2112)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !354, file: !234, line: 239, baseType: !74, size: 16, offset: 2128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !354, file: !234, line: 240, baseType: !28, size: 32, offset: 2144)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !354, file: !234, line: 241, baseType: !28, size: 32, offset: 2176)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !354, file: !234, line: 241, baseType: !28, size: 32, offset: 2208)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !354, file: !234, line: 241, baseType: !28, size: 32, offset: 2240)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !354, file: !234, line: 243, baseType: !143, size: 32, offset: 2272)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !354, file: !234, line: 243, baseType: !143, size: 32, offset: 2304)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !354, file: !234, line: 244, baseType: !143, size: 32, offset: 2336)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !354, file: !234, line: 246, baseType: !408, size: 320, offset: 2368)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !409, line: 50, size: 320, elements: !410)
!409 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !408, file: !409, line: 51, baseType: !256, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !408, file: !409, line: 53, baseType: !28, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !408, file: !409, line: 54, baseType: !28, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !408, file: !409, line: 55, baseType: !28, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !408, file: !409, line: 55, baseType: !28, size: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !408, file: !409, line: 56, baseType: !61, size: 8, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !408, file: !409, line: 56, baseType: !61, size: 8, offset: 200)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !408, file: !409, line: 57, baseType: !61, size: 8, offset: 208)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !408, file: !409, line: 57, baseType: !61, size: 8, offset: 216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !408, file: !409, line: 59, baseType: !74, size: 16, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !408, file: !409, line: 59, baseType: !74, size: 16, offset: 240)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !408, file: !409, line: 59, baseType: !74, size: 16, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !408, file: !409, line: 61, baseType: !74, size: 16, offset: 272)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !408, file: !409, line: 63, baseType: !28, size: 32, offset: 288)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !354, file: !234, line: 248, baseType: !227, size: 64, offset: 2688)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !354, file: !234, line: 249, baseType: !340, size: 64, offset: 2752)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !354, file: !234, line: 250, baseType: !428, size: 64, offset: 2816)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !409, line: 77, size: 15424, elements: !430)
!430 = !{!431, !432, !433, !436, !439, !442, !445, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !465, !466, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !495, !496, !497, !503, !504, !508}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !429, file: !409, line: 78, baseType: !42, size: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !429, file: !409, line: 80, baseType: !60, size: 8192, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !429, file: !409, line: 82, baseType: !434, size: 64, offset: 9152)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !409, line: 43, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !429, file: !409, line: 83, baseType: !437, size: 64, offset: 9216)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !43, line: 46, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !429, file: !409, line: 86, baseType: !440, size: 64, offset: 9280)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !409, line: 41, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !429, file: !409, line: 87, baseType: !443, size: 64, offset: 9344)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !409, line: 44, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !429, file: !409, line: 89, baseType: !446, size: 512, offset: 9408)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 512, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 8)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !429, file: !409, line: 90, baseType: !74, size: 16, offset: 9920)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !429, file: !409, line: 90, baseType: !74, size: 16, offset: 9936)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !429, file: !409, line: 92, baseType: !74, size: 16, offset: 9952)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !429, file: !409, line: 92, baseType: !74, size: 16, offset: 9968)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !429, file: !409, line: 93, baseType: !74, size: 16, offset: 9984)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !409, line: 93, baseType: !74, size: 16, offset: 10000)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !429, file: !409, line: 94, baseType: !28, size: 32, offset: 10016)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !429, file: !409, line: 97, baseType: !74, size: 16, offset: 10048)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !429, file: !409, line: 97, baseType: !74, size: 16, offset: 10064)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !429, file: !409, line: 98, baseType: !74, size: 16, offset: 10080)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !429, file: !409, line: 98, baseType: !74, size: 16, offset: 10096)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !429, file: !409, line: 99, baseType: !74, size: 16, offset: 10112)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !429, file: !409, line: 99, baseType: !74, size: 16, offset: 10128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !429, file: !409, line: 100, baseType: !5, size: 32, offset: 10144)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !429, file: !409, line: 101, baseType: !464, size: 64, offset: 10176)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !429, file: !409, line: 103, baseType: !67, size: 64, offset: 10240)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !429, file: !409, line: 104, baseType: !467, size: 64, offset: 10304)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !43, line: 159, size: 448, elements: !469)
!469 = !{!470, !474, !475, !477, !478, !480}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !468, file: !43, line: 161, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 2)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !468, file: !43, line: 162, baseType: !471, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !468, file: !43, line: 163, baseType: !476, size: 32, offset: 128)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !468, file: !43, line: 164, baseType: !476, size: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !468, file: !43, line: 165, baseType: !479, size: 128, offset: 192)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 128, elements: !472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !468, file: !43, line: 166, baseType: !481, size: 128, offset: 320)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 128, elements: !472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !429, file: !409, line: 107, baseType: !143, size: 32, offset: 10368)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !429, file: !409, line: 108, baseType: !28, size: 32, offset: 10400)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !429, file: !409, line: 109, baseType: !74, size: 16, offset: 10432)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !429, file: !409, line: 110, baseType: !74, size: 16, offset: 10448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !429, file: !409, line: 113, baseType: !28, size: 32, offset: 10464)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !429, file: !409, line: 113, baseType: !28, size: 32, offset: 10496)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !429, file: !409, line: 114, baseType: !61, size: 8, offset: 10528)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !429, file: !409, line: 114, baseType: !61, size: 8, offset: 10536)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !429, file: !409, line: 115, baseType: !74, size: 16, offset: 10544)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !429, file: !409, line: 116, baseType: !492, size: 128, offset: 10560)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 4)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !429, file: !409, line: 119, baseType: !143, size: 32, offset: 10688)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !429, file: !409, line: 119, baseType: !143, size: 32, offset: 10720)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !429, file: !409, line: 122, baseType: !498, size: 512, offset: 10752)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !499, line: 182, baseType: !500)
!499 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !499, line: 180, size: 512, elements: !501)
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !500, file: !499, line: 181, baseType: !90, size: 512)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !429, file: !409, line: 123, baseType: !61, size: 8, offset: 11264)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !429, file: !409, line: 125, baseType: !505, size: 56, offset: 11272)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 56, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 7)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !429, file: !409, line: 126, baseType: !509, size: 4096, offset: 11328)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 4096, elements: !447)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !409, line: 69, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !409, line: 67, size: 512, elements: !512)
!512 = !{!513}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !511, file: !409, line: 68, baseType: !90, size: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !354, file: !234, line: 251, baseType: !515, size: 64, offset: 2880)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !234, line: 113, size: 6208, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !527}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !516, file: !234, line: 114, baseType: !74, size: 16)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !516, file: !234, line: 114, baseType: !74, size: 16, offset: 16)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !516, file: !234, line: 115, baseType: !61, size: 8, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !516, file: !234, line: 115, baseType: !61, size: 8, offset: 40)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !516, file: !234, line: 116, baseType: !61, size: 8, offset: 48)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !516, file: !234, line: 117, baseType: !524, size: 8, offset: 56)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 1)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !516, file: !234, line: 119, baseType: !528, size: 6144, offset: 64)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 6144, elements: !538)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !234, line: 109, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !234, line: 106, size: 192, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !530, file: !234, line: 107, baseType: !143, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !530, file: !234, line: 107, baseType: !143, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !530, file: !234, line: 107, baseType: !143, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !530, file: !234, line: 107, baseType: !143, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !530, file: !234, line: 107, baseType: !143, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !530, file: !234, line: 108, baseType: !28, size: 32, offset: 160)
!538 = !{!539}
!539 = !DISubrange(count: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !354, file: !234, line: 252, baseType: !541, size: 64, offset: 2944)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !234, line: 122, size: 1600, elements: !543)
!543 = !{!544, !545, !546, !552, !555, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !542, file: !234, line: 123, baseType: !263, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !542, file: !234, line: 124, baseType: !428, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !542, file: !234, line: 125, baseType: !547, size: 384, offset: 128)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 384, elements: !550)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !499, line: 136, flags: DIFlagFwdDecl)
!550 = !{!551}
!551 = !DISubrange(count: 6)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !542, file: !234, line: 126, baseType: !553, size: 512, offset: 512)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 512, elements: !554)
!554 = !{!494, !494}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !542, file: !234, line: 127, baseType: !556, size: 288, offset: 1024)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 288, elements: !557)
!557 = !{!558, !558}
!558 = !DISubrange(count: 3)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !542, file: !234, line: 128, baseType: !74, size: 16, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !542, file: !234, line: 128, baseType: !74, size: 16, offset: 1328)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !542, file: !234, line: 129, baseType: !143, size: 32, offset: 1344)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !542, file: !234, line: 129, baseType: !143, size: 32, offset: 1376)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !542, file: !234, line: 130, baseType: !143, size: 32, offset: 1408)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !542, file: !234, line: 131, baseType: !5, size: 32, offset: 1440)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !542, file: !234, line: 132, baseType: !74, size: 16, offset: 1472)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !542, file: !234, line: 132, baseType: !74, size: 16, offset: 1488)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !542, file: !234, line: 133, baseType: !28, size: 32, offset: 1504)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !542, file: !234, line: 133, baseType: !28, size: 32, offset: 1536)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !542, file: !234, line: 134, baseType: !74, size: 16, offset: 1568)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !542, file: !234, line: 134, baseType: !74, size: 16, offset: 1584)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !354, file: !234, line: 253, baseType: !467, size: 64, offset: 3008)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !354, file: !234, line: 254, baseType: !573, size: 64, offset: 3072)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !234, line: 137, size: 832, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !597, !598, !599, !600, !601, !602}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !574, file: !234, line: 138, baseType: !74, size: 16)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !574, file: !234, line: 140, baseType: !74, size: 16, offset: 16)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !574, file: !234, line: 141, baseType: !143, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !574, file: !234, line: 142, baseType: !143, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !574, file: !234, line: 143, baseType: !74, size: 16, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !574, file: !234, line: 144, baseType: !74, size: 16, offset: 112)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !574, file: !234, line: 145, baseType: !28, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !574, file: !234, line: 147, baseType: !28, size: 32, offset: 160)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !574, file: !234, line: 149, baseType: !263, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !574, file: !234, line: 150, baseType: !28, size: 32, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !574, file: !234, line: 151, baseType: !74, size: 16, offset: 288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !574, file: !234, line: 152, baseType: !74, size: 16, offset: 304)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !574, file: !234, line: 154, baseType: !40, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !574, file: !234, line: 155, baseType: !214, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !574, file: !234, line: 157, baseType: !143, size: 32, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !574, file: !234, line: 158, baseType: !74, size: 16, offset: 480)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !574, file: !234, line: 159, baseType: !74, size: 16, offset: 496)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !574, file: !234, line: 160, baseType: !74, size: 16, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !574, file: !234, line: 161, baseType: !595, size: 48, offset: 528)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 48, elements: !596)
!596 = !{!558}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !574, file: !234, line: 162, baseType: !143, size: 32, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !574, file: !234, line: 164, baseType: !143, size: 32, offset: 608)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !574, file: !234, line: 164, baseType: !143, size: 32, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !574, file: !234, line: 164, baseType: !143, size: 32, offset: 672)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !574, file: !234, line: 165, baseType: !515, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !574, file: !234, line: 167, baseType: !603, size: 64, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !499, line: 72, size: 3072, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !619, !620, !646, !648, !649, !650}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !604, file: !499, line: 73, baseType: !28, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !604, file: !499, line: 73, baseType: !28, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !604, file: !499, line: 74, baseType: !28, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !604, file: !499, line: 75, baseType: !28, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !604, file: !499, line: 77, baseType: !611, size: 128, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !612, line: 95, baseType: !613)
!612 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !612, line: 92, size: 128, elements: !614)
!614 = !{!615, !616, !617, !618}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !613, file: !612, line: 93, baseType: !143, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !613, file: !612, line: 93, baseType: !143, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !613, file: !612, line: 94, baseType: !143, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !613, file: !612, line: 94, baseType: !143, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !604, file: !499, line: 77, baseType: !611, size: 128, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !604, file: !499, line: 79, baseType: !621, size: 2304, offset: 384)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 2304, elements: !493)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !499, line: 67, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !499, line: 55, size: 576, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !632, !633, !642, !643, !644, !645}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !623, file: !499, line: 56, baseType: !74, size: 16)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !623, file: !499, line: 56, baseType: !74, size: 16, offset: 16)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !623, file: !499, line: 58, baseType: !143, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !623, file: !499, line: 59, baseType: !143, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !623, file: !499, line: 59, baseType: !143, size: 32, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !623, file: !499, line: 60, baseType: !631, size: 64, offset: 128)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 64, elements: !472)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !623, file: !499, line: 60, baseType: !631, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !623, file: !499, line: 61, baseType: !634, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !499, line: 47, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !499, line: 44, size: 96, elements: !637)
!637 = !{!638, !639, !640, !641}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !636, file: !499, line: 45, baseType: !143, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !636, file: !499, line: 45, baseType: !143, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !636, file: !499, line: 46, baseType: !74, size: 16, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !636, file: !499, line: 46, baseType: !74, size: 16, offset: 80)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !623, file: !499, line: 62, baseType: !634, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !623, file: !499, line: 64, baseType: !634, size: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !623, file: !499, line: 65, baseType: !631, size: 64, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !623, file: !499, line: 66, baseType: !631, size: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !604, file: !499, line: 80, baseType: !647, size: 96, offset: 2688)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 96, elements: !596)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !604, file: !499, line: 80, baseType: !647, size: 96, offset: 2784)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !604, file: !499, line: 81, baseType: !647, size: 96, offset: 2880)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !604, file: !499, line: 83, baseType: !647, size: 96, offset: 2976)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !354, file: !234, line: 255, baseType: !652, size: 64, offset: 3136)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !234, line: 170, size: 8704, elements: !654)
!654 = !{!655, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !653, file: !234, line: 171, baseType: !656, size: 96)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 96, elements: !596)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !653, file: !234, line: 172, baseType: !28, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !653, file: !234, line: 173, baseType: !74, size: 16, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !653, file: !234, line: 174, baseType: !74, size: 16, offset: 144)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !653, file: !234, line: 175, baseType: !74, size: 16, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !653, file: !234, line: 176, baseType: !74, size: 16, offset: 176)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !653, file: !234, line: 177, baseType: !74, size: 16, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !653, file: !234, line: 178, baseType: !74, size: 16, offset: 208)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !653, file: !234, line: 179, baseType: !28, size: 32, offset: 224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !653, file: !234, line: 181, baseType: !263, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !653, file: !234, line: 182, baseType: !143, size: 32, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !653, file: !234, line: 183, baseType: !28, size: 32, offset: 352)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !653, file: !234, line: 184, baseType: !60, size: 8192, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !653, file: !234, line: 187, baseType: !214, size: 64, offset: 8576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !653, file: !234, line: 188, baseType: !28, size: 32, offset: 8640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !653, file: !234, line: 189, baseType: !28, size: 32, offset: 8672)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !354, file: !234, line: 256, baseType: !673, size: 64, offset: 3200)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OceanTex", file: !234, line: 193, size: 640, elements: !675)
!675 = !{!676, !677, !678, !679}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !674, file: !234, line: 194, baseType: !263, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "oceanmod", scope: !674, file: !234, line: 195, baseType: !90, size: 512, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !674, file: !234, line: 197, baseType: !28, size: 32, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !674, file: !234, line: 198, baseType: !28, size: 32, offset: 608)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !354, file: !234, line: 258, baseType: !61, size: 8, offset: 3264)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !354, file: !234, line: 259, baseType: !505, size: 56, offset: 3272)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !345, file: !234, line: 62, baseType: !90, size: 512, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !345, file: !234, line: 64, baseType: !61, size: 8, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !345, file: !234, line: 64, baseType: !61, size: 8, offset: 712)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !345, file: !234, line: 64, baseType: !61, size: 8, offset: 720)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !345, file: !234, line: 64, baseType: !61, size: 8, offset: 728)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !345, file: !234, line: 65, baseType: !647, size: 96, offset: 736)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !234, line: 65, baseType: !647, size: 96, offset: 832)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !345, file: !234, line: 65, baseType: !143, size: 32, offset: 928)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !345, file: !234, line: 67, baseType: !74, size: 16, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !345, file: !234, line: 67, baseType: !74, size: 16, offset: 976)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !345, file: !234, line: 67, baseType: !74, size: 16, offset: 992)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !345, file: !234, line: 67, baseType: !74, size: 16, offset: 1008)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !345, file: !234, line: 68, baseType: !74, size: 16, offset: 1024)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !345, file: !234, line: 68, baseType: !74, size: 16, offset: 1040)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !345, file: !234, line: 69, baseType: !61, size: 8, offset: 1056)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !345, file: !234, line: 69, baseType: !505, size: 56, offset: 1064)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !345, file: !234, line: 70, baseType: !143, size: 32, offset: 1120)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !345, file: !234, line: 70, baseType: !143, size: 32, offset: 1152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !345, file: !234, line: 70, baseType: !143, size: 32, offset: 1184)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !345, file: !234, line: 70, baseType: !143, size: 32, offset: 1216)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !345, file: !234, line: 71, baseType: !143, size: 32, offset: 1248)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !345, file: !234, line: 71, baseType: !143, size: 32, offset: 1280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !345, file: !234, line: 74, baseType: !143, size: 32, offset: 1312)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !345, file: !234, line: 74, baseType: !143, size: 32, offset: 1344)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !345, file: !234, line: 77, baseType: !143, size: 32, offset: 1376)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !345, file: !234, line: 77, baseType: !143, size: 32, offset: 1408)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !345, file: !234, line: 77, baseType: !143, size: 32, offset: 1440)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !345, file: !234, line: 78, baseType: !143, size: 32, offset: 1472)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !345, file: !234, line: 78, baseType: !143, size: 32, offset: 1504)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !345, file: !234, line: 78, baseType: !143, size: 32, offset: 1536)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !345, file: !234, line: 79, baseType: !143, size: 32, offset: 1568)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !345, file: !234, line: 79, baseType: !143, size: 32, offset: 1600)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !345, file: !234, line: 79, baseType: !143, size: 32, offset: 1632)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !345, file: !234, line: 79, baseType: !143, size: 32, offset: 1664)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !345, file: !234, line: 80, baseType: !143, size: 32, offset: 1696)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !345, file: !234, line: 80, baseType: !143, size: 32, offset: 1728)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !345, file: !234, line: 80, baseType: !143, size: 32, offset: 1760)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !345, file: !234, line: 81, baseType: !143, size: 32, offset: 1792)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !345, file: !234, line: 81, baseType: !143, size: 32, offset: 1824)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !345, file: !234, line: 81, baseType: !143, size: 32, offset: 1856)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !345, file: !234, line: 82, baseType: !143, size: 32, offset: 1888)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !345, file: !234, line: 82, baseType: !143, size: 32, offset: 1920)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !345, file: !234, line: 82, baseType: !143, size: 32, offset: 1952)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !345, file: !234, line: 85, baseType: !143, size: 32, offset: 1984)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !345, file: !234, line: 85, baseType: !143, size: 32, offset: 2016)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !345, file: !234, line: 85, baseType: !143, size: 32, offset: 2048)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !345, file: !234, line: 85, baseType: !143, size: 32, offset: 2080)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !345, file: !234, line: 86, baseType: !143, size: 32, offset: 2112)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !345, file: !234, line: 86, baseType: !143, size: 32, offset: 2144)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !345, file: !234, line: 86, baseType: !143, size: 32, offset: 2176)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !345, file: !234, line: 86, baseType: !143, size: 32, offset: 2208)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !345, file: !234, line: 87, baseType: !143, size: 32, offset: 2240)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !345, file: !234, line: 87, baseType: !143, size: 32, offset: 2272)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !345, file: !234, line: 87, baseType: !143, size: 32, offset: 2304)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !345, file: !234, line: 87, baseType: !143, size: 32, offset: 2336)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !345, file: !234, line: 90, baseType: !143, size: 32, offset: 2368)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !345, file: !234, line: 93, baseType: !143, size: 32, offset: 2400)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !345, file: !234, line: 93, baseType: !143, size: 32, offset: 2432)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !345, file: !234, line: 93, baseType: !143, size: 32, offset: 2464)
!741 = !{!742}
!742 = !DISubrange(count: 18)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !267, file: !268, line: 123, baseType: !74, size: 16, offset: 4032)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !267, file: !268, line: 123, baseType: !74, size: 16, offset: 4048)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !267, file: !268, line: 123, baseType: !476, size: 32, offset: 4064)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !267, file: !268, line: 126, baseType: !467, size: 64, offset: 4096)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !267, file: !268, line: 129, baseType: !227, size: 64, offset: 4160)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !257, file: !258, line: 1223, baseType: !256, size: 64, offset: 1152)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !257, file: !258, line: 1225, baseType: !100, size: 128, offset: 1216)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !257, file: !258, line: 1226, baseType: !751, size: 64, offset: 1344)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !258, line: 69, size: 320, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !258, line: 70, baseType: !751, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !752, file: !258, line: 70, baseType: !751, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !752, file: !258, line: 71, baseType: !5, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !752, file: !258, line: 71, baseType: !5, size: 32, offset: 160)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !258, line: 72, baseType: !28, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !752, file: !258, line: 73, baseType: !74, size: 16, offset: 224)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !752, file: !258, line: 73, baseType: !74, size: 16, offset: 240)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !752, file: !258, line: 74, baseType: !263, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !257, file: !258, line: 1227, baseType: !263, size: 64, offset: 1408)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !257, file: !258, line: 1229, baseType: !647, size: 96, offset: 1472)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !257, file: !258, line: 1230, baseType: !647, size: 96, offset: 1568)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !257, file: !258, line: 1231, baseType: !647, size: 96, offset: 1664)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !257, file: !258, line: 1231, baseType: !647, size: 96, offset: 1760)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !257, file: !258, line: 1233, baseType: !5, size: 32, offset: 1856)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !257, file: !258, line: 1234, baseType: !28, size: 32, offset: 1888)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !257, file: !258, line: 1235, baseType: !5, size: 32, offset: 1920)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !257, file: !258, line: 1237, baseType: !74, size: 16, offset: 1952)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !257, file: !258, line: 1239, baseType: !61, size: 8, offset: 1968)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !257, file: !258, line: 1240, baseType: !524, size: 8, offset: 1976)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !257, file: !258, line: 1242, baseType: !227, size: 64, offset: 1984)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !257, file: !258, line: 1244, baseType: !775, size: 64, offset: 2048)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !258, line: 59, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !257, file: !258, line: 1246, baseType: !778, size: 64, offset: 2112)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !258, line: 1067, size: 5184, elements: !780)
!780 = !{!781, !811, !812, !826, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !848, !864, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !913, !914, !915, !916, !917, !918, !919, !920, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !975}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !779, file: !258, line: 1068, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !258, line: 934, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !258, line: 925, size: 576, elements: !785)
!785 = !{!786, !803, !804, !805, !806, !807, !810}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !784, file: !258, line: 926, baseType: !787, size: 320)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !258, line: 830, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !258, line: 813, size: 320, elements: !789)
!789 = !{!790, !793, !796, !797, !800, !801, !802}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !788, file: !258, line: 814, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !258, line: 51, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !788, file: !258, line: 815, baseType: !794, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !258, line: 815, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !788, file: !258, line: 818, baseType: !40, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !788, file: !258, line: 819, baseType: !798, size: 32, offset: 192)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 32, elements: !493)
!799 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !788, file: !258, line: 822, baseType: !28, size: 32, offset: 224)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !788, file: !258, line: 826, baseType: !28, size: 32, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !788, file: !258, line: 829, baseType: !28, size: 32, offset: 288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !784, file: !258, line: 928, baseType: !74, size: 16, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !784, file: !258, line: 928, baseType: !74, size: 16, offset: 336)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !784, file: !258, line: 929, baseType: !28, size: 32, offset: 352)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !784, file: !258, line: 930, baseType: !464, size: 64, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !784, file: !258, line: 931, baseType: !808, size: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !258, line: 931, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !784, file: !258, line: 933, baseType: !40, size: 64, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !779, file: !258, line: 1069, baseType: !782, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !779, file: !258, line: 1070, baseType: !813, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !258, line: 916, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !258, line: 891, size: 704, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !815, file: !258, line: 892, baseType: !787, size: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !815, file: !258, line: 896, baseType: !28, size: 32, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !815, file: !258, line: 900, baseType: !656, size: 96, offset: 352)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !815, file: !258, line: 903, baseType: !143, size: 32, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !815, file: !258, line: 906, baseType: !28, size: 32, offset: 480)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !815, file: !258, line: 909, baseType: !143, size: 32, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !815, file: !258, line: 912, baseType: !143, size: 32, offset: 544)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !815, file: !258, line: 914, baseType: !263, size: 64, offset: 576)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !815, file: !258, line: 915, baseType: !40, size: 64, offset: 640)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !779, file: !258, line: 1071, baseType: !827, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !258, line: 920, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !258, line: 918, size: 320, elements: !830)
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !829, file: !258, line: 919, baseType: !787, size: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !779, file: !258, line: 1075, baseType: !143, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !779, file: !258, line: 1077, baseType: !143, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !779, file: !258, line: 1078, baseType: !143, size: 32, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !779, file: !258, line: 1079, baseType: !74, size: 16, offset: 352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !779, file: !258, line: 1082, baseType: !74, size: 16, offset: 368)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !779, file: !258, line: 1085, baseType: !61, size: 8, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !779, file: !258, line: 1086, baseType: !61, size: 8, offset: 392)
