; ModuleID = 'blender/source/blender/editors/space_graph/graph_select.c'
source_filename = "blender/source/blender/editors/space_graph/graph_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!182 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eEditKeyframes_SelMap", file: !56, line: 78, baseType: !7, size: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DIEnumerator(name: "SELMAP_MORE", value: 0, isUnsigned: true)
!185 = !DIEnumerator(name: "SELMAP_LESS", value: 1, isUnsigned: true)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eGraphVertIndex", file: !3, line: 1014, baseType: !77, size: 32, elements: !187)
!187 = !{!188, !189, !190}
!188 = !DIEnumerator(name: "NEAREST_HANDLE_LEFT", value: -1)
!189 = !DIEnumerator(name: "NEAREST_HANDLE_KEY", value: 0)
!190 = !DIEnumerator(name: "NEAREST_HANDLE_RIGHT", value: 1)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Interpolation", file: !192, line: 371, baseType: !7, size: 32, elements: !193)
!192 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!194 = !DIEnumerator(name: "BEZT_IPO_CONST", value: 0, isUnsigned: true)
!195 = !DIEnumerator(name: "BEZT_IPO_LIN", value: 1, isUnsigned: true)
!196 = !DIEnumerator(name: "BEZT_IPO_BEZ", value: 2, isUnsigned: true)
!197 = !DIEnumerator(name: "BEZT_IPO_BACK", value: 3, isUnsigned: true)
!198 = !DIEnumerator(name: "BEZT_IPO_BOUNCE", value: 4, isUnsigned: true)
!199 = !DIEnumerator(name: "BEZT_IPO_CIRC", value: 5, isUnsigned: true)
!200 = !DIEnumerator(name: "BEZT_IPO_CUBIC", value: 6, isUnsigned: true)
!201 = !DIEnumerator(name: "BEZT_IPO_ELASTIC", value: 7, isUnsigned: true)
!202 = !DIEnumerator(name: "BEZT_IPO_EXPO", value: 8, isUnsigned: true)
!203 = !DIEnumerator(name: "BEZT_IPO_QUAD", value: 9, isUnsigned: true)
!204 = !DIEnumerator(name: "BEZT_IPO_QUART", value: 10, isUnsigned: true)
!205 = !DIEnumerator(name: "BEZT_IPO_QUINT", value: 11, isUnsigned: true)
!206 = !DIEnumerator(name: "BEZT_IPO_SINE", value: 12, isUnsigned: true)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimChannels_SetFlag", file: !76, line: 393, baseType: !7, size: 32, elements: !208)
!208 = !{!209, !210, !211, !212}
!209 = !DIEnumerator(name: "ACHANNEL_SETFLAG_CLEAR", value: 0, isUnsigned: true)
!210 = !DIEnumerator(name: "ACHANNEL_SETFLAG_ADD", value: 1, isUnsigned: true)
!211 = !DIEnumerator(name: "ACHANNEL_SETFLAG_INVERT", value: 2, isUnsigned: true)
!212 = !DIEnumerator(name: "ACHANNEL_SETFLAG_TOGGLE", value: 3, isUnsigned: true)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnim_ChannelType", file: !76, line: 132, baseType: !7, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!215 = !DIEnumerator(name: "ANIMTYPE_NONE", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "ANIMTYPE_ANIMDATA", value: 1, isUnsigned: true)
!217 = !DIEnumerator(name: "ANIMTYPE_SPECIALDATA", value: 2, isUnsigned: true)
!218 = !DIEnumerator(name: "ANIMTYPE_SUMMARY", value: 3, isUnsigned: true)
!219 = !DIEnumerator(name: "ANIMTYPE_SCENE", value: 4, isUnsigned: true)
!220 = !DIEnumerator(name: "ANIMTYPE_OBJECT", value: 5, isUnsigned: true)
!221 = !DIEnumerator(name: "ANIMTYPE_GROUP", value: 6, isUnsigned: true)
!222 = !DIEnumerator(name: "ANIMTYPE_FCURVE", value: 7, isUnsigned: true)
!223 = !DIEnumerator(name: "ANIMTYPE_FILLACTD", value: 8, isUnsigned: true)
!224 = !DIEnumerator(name: "ANIMTYPE_FILLDRIVERS", value: 9, isUnsigned: true)
!225 = !DIEnumerator(name: "ANIMTYPE_DSMAT", value: 10, isUnsigned: true)
!226 = !DIEnumerator(name: "ANIMTYPE_DSLAM", value: 11, isUnsigned: true)
!227 = !DIEnumerator(name: "ANIMTYPE_DSCAM", value: 12, isUnsigned: true)
!228 = !DIEnumerator(name: "ANIMTYPE_DSCUR", value: 13, isUnsigned: true)
!229 = !DIEnumerator(name: "ANIMTYPE_DSSKEY", value: 14, isUnsigned: true)
!230 = !DIEnumerator(name: "ANIMTYPE_DSWOR", value: 15, isUnsigned: true)
!231 = !DIEnumerator(name: "ANIMTYPE_DSNTREE", value: 16, isUnsigned: true)
!232 = !DIEnumerator(name: "ANIMTYPE_DSPART", value: 17, isUnsigned: true)
!233 = !DIEnumerator(name: "ANIMTYPE_DSMBALL", value: 18, isUnsigned: true)
!234 = !DIEnumerator(name: "ANIMTYPE_DSARM", value: 19, isUnsigned: true)
!235 = !DIEnumerator(name: "ANIMTYPE_DSMESH", value: 20, isUnsigned: true)
!236 = !DIEnumerator(name: "ANIMTYPE_DSTEX", value: 21, isUnsigned: true)
!237 = !DIEnumerator(name: "ANIMTYPE_DSLAT", value: 22, isUnsigned: true)
!238 = !DIEnumerator(name: "ANIMTYPE_DSLINESTYLE", value: 23, isUnsigned: true)
!239 = !DIEnumerator(name: "ANIMTYPE_DSSPK", value: 24, isUnsigned: true)
!240 = !DIEnumerator(name: "ANIMTYPE_SHAPEKEY", value: 25, isUnsigned: true)
!241 = !DIEnumerator(name: "ANIMTYPE_GPDATABLOCK", value: 26, isUnsigned: true)
!242 = !DIEnumerator(name: "ANIMTYPE_GPLAYER", value: 27, isUnsigned: true)
!243 = !DIEnumerator(name: "ANIMTYPE_MASKDATABLOCK", value: 28, isUnsigned: true)
!244 = !DIEnumerator(name: "ANIMTYPE_MASKLAYER", value: 29, isUnsigned: true)
!245 = !DIEnumerator(name: "ANIMTYPE_NLATRACK", value: 30, isUnsigned: true)
!246 = !DIEnumerator(name: "ANIMTYPE_NLAACTION", value: 31, isUnsigned: true)
!247 = !DIEnumerator(name: "ANIMTYPE_NUM_TYPES", value: 32, isUnsigned: true)
!248 = !{!249, !271, !359, !306, !1879}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !63, line: 463, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !63, line: 433, size: 896, elements: !252)
!252 = !{!253, !255, !256, !294, !310, !311, !335, !346, !347, !348, !349, !350, !351, !353, !354, !357, !358}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !63, line: 434, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !251, file: !63, line: 434, baseType: !254, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !251, file: !63, line: 437, baseType: !257, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !259, line: 450, baseType: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !259, line: 440, size: 960, elements: !261)
!261 = !{!262, !264, !265, !273, !274, !275, !280}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !259, line: 441, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !259, line: 441, baseType: !263, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !260, file: !259, line: 443, baseType: !266, size: 128, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !267, line: 71, baseType: !268)
!267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !267, line: 69, size: 128, elements: !269)
!269 = !{!270, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !268, file: !267, line: 70, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !268, file: !267, line: 70, baseType: !271, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !259, line: 445, baseType: !77, size: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !260, file: !259, line: 446, baseType: !77, size: 32, offset: 288)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !259, line: 447, baseType: !276, size: 512, offset: 320)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 512, elements: !278)
!277 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!278 = !{!279}
!279 = !DISubrange(count: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !260, file: !259, line: 449, baseType: !281, size: 128, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !282, line: 347, baseType: !283)
!282 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !282, line: 340, size: 128, elements: !284)
!284 = !{!285, !289, !290, !291, !293}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !283, file: !282, line: 341, baseType: !286, size: 32)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 32, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 4)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !283, file: !282, line: 342, baseType: !286, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !283, file: !282, line: 343, baseType: !286, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !282, line: 345, baseType: !292, size: 16, offset: 96)
!292 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !283, file: !282, line: 346, baseType: !292, size: 16, offset: 112)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !251, file: !63, line: 440, baseType: !295, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !63, line: 386, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !63, line: 371, size: 2368, elements: !298)
!298 = !{!299, !300, !304, !305, !307, !308, !309}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !297, file: !63, line: 372, baseType: !266, size: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !297, file: !63, line: 377, baseType: !301, size: 2048, offset: 128)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 2048, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !297, file: !63, line: 378, baseType: !271, size: 64, offset: 2176)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !297, file: !63, line: 380, baseType: !306, size: 32, offset: 2240)
!306 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !297, file: !63, line: 381, baseType: !306, size: 32, offset: 2272)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !63, line: 384, baseType: !77, size: 32, offset: 2304)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !297, file: !63, line: 385, baseType: !77, size: 32, offset: 2336)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !251, file: !63, line: 442, baseType: !266, size: 128, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !251, file: !63, line: 445, baseType: !312, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !192, line: 133, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !192, line: 117, size: 576, elements: !315)
!315 = !{!316, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !314, file: !192, line: 118, baseType: !317, size: 288)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 288, elements: !318)
!318 = !{!319, !319}
!319 = !DISubrange(count: 3)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !314, file: !192, line: 119, baseType: !306, size: 32, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !314, file: !192, line: 119, baseType: !306, size: 32, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !314, file: !192, line: 119, baseType: !306, size: 32, offset: 352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !314, file: !192, line: 121, baseType: !277, size: 8, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !314, file: !192, line: 123, baseType: !277, size: 8, offset: 392)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !314, file: !192, line: 123, baseType: !277, size: 8, offset: 400)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !314, file: !192, line: 124, baseType: !277, size: 8, offset: 408)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !314, file: !192, line: 124, baseType: !277, size: 8, offset: 416)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !314, file: !192, line: 124, baseType: !277, size: 8, offset: 424)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !314, file: !192, line: 126, baseType: !277, size: 8, offset: 432)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !314, file: !192, line: 128, baseType: !277, size: 8, offset: 440)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !314, file: !192, line: 129, baseType: !306, size: 32, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !314, file: !192, line: 130, baseType: !306, size: 32, offset: 480)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !314, file: !192, line: 130, baseType: !306, size: 32, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !314, file: !192, line: 132, baseType: !286, size: 32, offset: 544)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !251, file: !63, line: 446, baseType: !336, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !63, line: 430, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !63, line: 426, size: 128, elements: !339)
!339 = !{!340, !344, !345}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !338, file: !63, line: 427, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 64, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 2)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !338, file: !63, line: 428, baseType: !77, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !338, file: !63, line: 429, baseType: !77, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !251, file: !63, line: 447, baseType: !7, size: 32, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !251, file: !63, line: 450, baseType: !306, size: 32, offset: 544)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !63, line: 451, baseType: !292, size: 16, offset: 576)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !251, file: !63, line: 452, baseType: !292, size: 16, offset: 592)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !251, file: !63, line: 455, baseType: !77, size: 32, offset: 608)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !251, file: !63, line: 456, baseType: !352, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !251, file: !63, line: 459, baseType: !77, size: 32, offset: 704)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !251, file: !63, line: 460, baseType: !355, size: 96, offset: 736)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 96, elements: !356)
!356 = !{!319}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !251, file: !63, line: 462, baseType: !306, size: 32, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !251, file: !63, line: 462, baseType: !306, size: 32, offset: 864)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceIpo", file: !103, line: 334, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceIpo", file: !103, line: 315, size: 2048, elements: !362)
!362 = !{!363, !378, !379, !380, !381, !382, !383, !1859, !1873, !1874, !1875, !1876, !1877, !1878}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !361, file: !103, line: 316, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !103, line: 91, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !103, line: 85, size: 448, elements: !367)
!367 = !{!368, !370, !371, !372, !373, !374}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !103, line: 86, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !366, file: !103, line: 86, baseType: !369, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !366, file: !103, line: 87, baseType: !266, size: 128, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !366, file: !103, line: 88, baseType: !77, size: 32, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !366, file: !103, line: 89, baseType: !306, size: 32, offset: 288)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !366, file: !103, line: 90, baseType: !375, size: 128, offset: 320)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 128, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 8)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !361, file: !103, line: 316, baseType: !364, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !361, file: !103, line: 317, baseType: !266, size: 128, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !361, file: !103, line: 318, baseType: !77, size: 32, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !361, file: !103, line: 319, baseType: !306, size: 32, offset: 288)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !361, file: !103, line: 320, baseType: !375, size: 128, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !361, file: !103, line: 322, baseType: !384, size: 1280, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !385, line: 71, baseType: !386)
!385 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !385, line: 40, size: 1280, elements: !387)
!387 = !{!388, !397, !398, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !426, !427, !428, !431}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !386, file: !385, line: 41, baseType: !389, size: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !390, line: 95, baseType: !391)
!390 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !390, line: 92, size: 128, elements: !392)
!392 = !{!393, !394, !395, !396}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !391, file: !390, line: 93, baseType: !306, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !391, file: !390, line: 93, baseType: !306, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !391, file: !390, line: 94, baseType: !306, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !391, file: !390, line: 94, baseType: !306, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !386, file: !385, line: 41, baseType: !389, size: 128, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !386, file: !385, line: 42, baseType: !399, size: 128, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !390, line: 89, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !390, line: 86, size: 128, elements: !401)
!401 = !{!402, !403, !404, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !400, file: !390, line: 87, baseType: !77, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !400, file: !390, line: 87, baseType: !77, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !400, file: !390, line: 88, baseType: !77, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !400, file: !390, line: 88, baseType: !77, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !386, file: !385, line: 42, baseType: !399, size: 128, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !386, file: !385, line: 43, baseType: !399, size: 128, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !386, file: !385, line: 45, baseType: !341, size: 64, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !386, file: !385, line: 45, baseType: !341, size: 64, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !386, file: !385, line: 46, baseType: !306, size: 32, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !386, file: !385, line: 46, baseType: !306, size: 32, offset: 800)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !386, file: !385, line: 48, baseType: !292, size: 16, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !386, file: !385, line: 49, baseType: !292, size: 16, offset: 848)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !386, file: !385, line: 51, baseType: !292, size: 16, offset: 864)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !386, file: !385, line: 52, baseType: !292, size: 16, offset: 880)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !386, file: !385, line: 53, baseType: !292, size: 16, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !386, file: !385, line: 55, baseType: !292, size: 16, offset: 912)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !386, file: !385, line: 56, baseType: !292, size: 16, offset: 928)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !386, file: !385, line: 58, baseType: !292, size: 16, offset: 944)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !386, file: !385, line: 58, baseType: !292, size: 16, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !386, file: !385, line: 59, baseType: !292, size: 16, offset: 976)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !386, file: !385, line: 59, baseType: !292, size: 16, offset: 992)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !386, file: !385, line: 61, baseType: !292, size: 16, offset: 1008)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !386, file: !385, line: 63, baseType: !425, size: 64, offset: 1024)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !386, file: !385, line: 64, baseType: !77, size: 32, offset: 1088)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !386, file: !385, line: 65, baseType: !77, size: 32, offset: 1120)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !386, file: !385, line: 68, baseType: !429, size: 64, offset: 1152)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !385, line: 68, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !386, file: !385, line: 69, baseType: !432, size: 64, offset: 1216)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !434, line: 490, size: 768, elements: !435)
!434 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!435 = !{!436, !437, !438, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !433, file: !434, line: 491, baseType: !432, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !433, file: !434, line: 491, baseType: !432, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !433, file: !434, line: 493, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !47, line: 169, size: 2048, elements: !441)
!441 = !{!442, !443, !444, !445, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1825, !1828, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !440, file: !47, line: 170, baseType: !439, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !440, file: !47, line: 170, baseType: !439, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !440, file: !47, line: 172, baseType: !271, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !440, file: !47, line: 174, baseType: !446, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !448, line: 49, size: 1984, elements: !449)
!448 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!449 = !{!450, !509, !510, !511, !512, !513, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !447, file: !448, line: 50, baseType: !451, size: 960)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !452, line: 130, baseType: !453)
!452 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !452, line: 117, size: 960, elements: !454)
!454 = !{!455, !456, !457, !459, !478, !482, !483, !484, !485, !486}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !452, line: 118, baseType: !271, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !452, line: 118, baseType: !271, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !453, file: !452, line: 119, baseType: !458, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !453, file: !452, line: 120, baseType: !460, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !452, line: 136, size: 17600, elements: !462)
!462 = !{!463, !464, !466, !469, !473, !474, !475}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !461, file: !452, line: 137, baseType: !451, size: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !461, file: !452, line: 138, baseType: !465, size: 64, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !461, file: !452, line: 139, baseType: !467, size: 64, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !452, line: 43, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !452, line: 140, baseType: !470, size: 8192, offset: 1088)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 8192, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 1024)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !461, file: !452, line: 141, baseType: !470, size: 8192, offset: 9280)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !461, file: !452, line: 148, baseType: !460, size: 64, offset: 17472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !461, file: !452, line: 150, baseType: !476, size: 64, offset: 17536)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !452, line: 45, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !453, file: !452, line: 121, baseType: !479, size: 528, offset: 256)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 528, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 66)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !452, line: 126, baseType: !292, size: 16, offset: 784)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !453, file: !452, line: 127, baseType: !77, size: 32, offset: 800)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !453, file: !452, line: 128, baseType: !77, size: 32, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !453, file: !452, line: 128, baseType: !77, size: 32, offset: 864)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !453, file: !452, line: 129, baseType: !487, size: 64, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !452, line: 75, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !452, line: 62, size: 1024, elements: !490)
!490 = !{!491, !493, !494, !495, !496, !497, !498, !499, !507, !508}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !452, line: 63, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !489, file: !452, line: 63, baseType: !492, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !452, line: 64, baseType: !277, size: 8, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !489, file: !452, line: 64, baseType: !277, size: 8, offset: 136)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !489, file: !452, line: 65, baseType: !292, size: 16, offset: 144)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !489, file: !452, line: 66, baseType: !276, size: 512, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !489, file: !452, line: 67, baseType: !77, size: 32, offset: 672)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !452, line: 69, baseType: !500, size: 256, offset: 704)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !452, line: 60, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !452, line: 48, size: 256, elements: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !501, file: !452, line: 49, baseType: !271, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !501, file: !452, line: 58, baseType: !266, size: 128, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !501, file: !452, line: 59, baseType: !77, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !501, file: !452, line: 59, baseType: !77, size: 32, offset: 224)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !489, file: !452, line: 70, baseType: !77, size: 32, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !489, file: !452, line: 74, baseType: !77, size: 32, offset: 992)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !447, file: !448, line: 52, baseType: !266, size: 128, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !447, file: !448, line: 53, baseType: !266, size: 128, offset: 1088)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !447, file: !448, line: 54, baseType: !266, size: 128, offset: 1216)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !447, file: !448, line: 55, baseType: !266, size: 128, offset: 1344)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !447, file: !448, line: 57, baseType: !514, size: 64, offset: 1472)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !516, line: 1216, size: 39680, elements: !517)
!516 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!517 = !{!518, !519, !587, !591, !594, !595, !596, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !622, !689, !1119, !1334, !1337, !1618, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1640, !1641, !1642, !1643, !1644, !1652, !1719, !1726, !1727, !1734, !1735, !1741, !1742, !1743, !1744, !1745}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !515, file: !516, line: 1217, baseType: !451, size: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !515, file: !516, line: 1218, baseType: !520, size: 64, offset: 960)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !63, line: 838, size: 768, elements: !522)
!522 = !{!523, !537, !538, !548, !549, !580, !581, !582, !583, !584, !585, !586}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !521, file: !63, line: 840, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !259, line: 499, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !259, line: 486, size: 1600, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !526, file: !259, line: 487, baseType: !451, size: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !526, file: !259, line: 489, baseType: !266, size: 128, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !526, file: !259, line: 490, baseType: !266, size: 128, offset: 1088)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !526, file: !259, line: 491, baseType: !266, size: 128, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !526, file: !259, line: 492, baseType: !266, size: 128, offset: 1344)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !526, file: !259, line: 494, baseType: !77, size: 32, offset: 1472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !526, file: !259, line: 495, baseType: !77, size: 32, offset: 1504)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !526, file: !259, line: 497, baseType: !77, size: 32, offset: 1536)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !526, file: !259, line: 498, baseType: !77, size: 32, offset: 1568)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !521, file: !63, line: 844, baseType: !524, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !521, file: !63, line: 848, baseType: !539, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !63, line: 549, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !63, line: 544, size: 320, elements: !542)
!542 = !{!543, !545, !546, !547}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !63, line: 545, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !541, file: !63, line: 545, baseType: !544, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !541, file: !63, line: 547, baseType: !524, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !541, file: !63, line: 548, baseType: !266, size: 128, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !521, file: !63, line: 851, baseType: !266, size: 128, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !521, file: !63, line: 853, baseType: !550, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !63, line: 594, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !63, line: 561, size: 1664, elements: !553)
!553 = !{!554, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !552, file: !63, line: 562, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !552, file: !63, line: 562, baseType: !555, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !552, file: !63, line: 564, baseType: !266, size: 128, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !552, file: !63, line: 565, baseType: !524, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !552, file: !63, line: 566, baseType: !539, size: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !552, file: !63, line: 568, baseType: !266, size: 128, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !552, file: !63, line: 569, baseType: !266, size: 128, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !552, file: !63, line: 571, baseType: !276, size: 512, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !552, file: !63, line: 573, baseType: !306, size: 32, offset: 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !552, file: !63, line: 574, baseType: !306, size: 32, offset: 1184)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !552, file: !63, line: 576, baseType: !306, size: 32, offset: 1216)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !552, file: !63, line: 576, baseType: !306, size: 32, offset: 1248)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !552, file: !63, line: 577, baseType: !306, size: 32, offset: 1280)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !552, file: !63, line: 577, baseType: !306, size: 32, offset: 1312)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !552, file: !63, line: 579, baseType: !306, size: 32, offset: 1344)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !552, file: !63, line: 580, baseType: !306, size: 32, offset: 1376)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !552, file: !63, line: 582, baseType: !306, size: 32, offset: 1408)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !552, file: !63, line: 582, baseType: !306, size: 32, offset: 1440)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !552, file: !63, line: 583, baseType: !292, size: 16, offset: 1472)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !552, file: !63, line: 585, baseType: !292, size: 16, offset: 1488)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !552, file: !63, line: 586, baseType: !292, size: 16, offset: 1504)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !552, file: !63, line: 588, baseType: !292, size: 16, offset: 1520)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !552, file: !63, line: 590, baseType: !271, size: 64, offset: 1536)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !552, file: !63, line: 592, baseType: !77, size: 32, offset: 1600)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !552, file: !63, line: 593, baseType: !77, size: 32, offset: 1632)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !521, file: !63, line: 858, baseType: !266, size: 128, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !521, file: !63, line: 859, baseType: !266, size: 128, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !63, line: 862, baseType: !77, size: 32, offset: 640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !521, file: !63, line: 863, baseType: !77, size: 32, offset: 672)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !521, file: !63, line: 866, baseType: !292, size: 16, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !521, file: !63, line: 867, baseType: !292, size: 16, offset: 720)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !521, file: !63, line: 868, baseType: !306, size: 32, offset: 736)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !515, file: !516, line: 1220, baseType: !588, size: 64, offset: 1024)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !590, line: 49, flags: DIFlagFwdDecl)
!590 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!591 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !515, file: !516, line: 1221, baseType: !592, size: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !516, line: 52, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !515, file: !516, line: 1223, baseType: !514, size: 64, offset: 1152)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !515, file: !516, line: 1225, baseType: !266, size: 128, offset: 1216)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !515, file: !516, line: 1226, baseType: !597, size: 64, offset: 1344)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !516, line: 69, size: 320, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !598, file: !516, line: 70, baseType: !597, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !598, file: !516, line: 70, baseType: !597, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !598, file: !516, line: 71, baseType: !7, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !598, file: !516, line: 71, baseType: !7, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !598, file: !516, line: 72, baseType: !77, size: 32, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !598, file: !516, line: 73, baseType: !292, size: 16, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !598, file: !516, line: 73, baseType: !292, size: 16, offset: 240)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !598, file: !516, line: 74, baseType: !588, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !515, file: !516, line: 1227, baseType: !588, size: 64, offset: 1408)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !515, file: !516, line: 1229, baseType: !355, size: 96, offset: 1472)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !515, file: !516, line: 1230, baseType: !355, size: 96, offset: 1568)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !515, file: !516, line: 1231, baseType: !355, size: 96, offset: 1664)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !515, file: !516, line: 1231, baseType: !355, size: 96, offset: 1760)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !515, file: !516, line: 1233, baseType: !7, size: 32, offset: 1856)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !515, file: !516, line: 1234, baseType: !77, size: 32, offset: 1888)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !515, file: !516, line: 1235, baseType: !7, size: 32, offset: 1920)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !515, file: !516, line: 1237, baseType: !292, size: 16, offset: 1952)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !515, file: !516, line: 1239, baseType: !277, size: 8, offset: 1968)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !515, file: !516, line: 1240, baseType: !619, size: 8, offset: 1976)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 8, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 1)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !515, file: !516, line: 1242, baseType: !623, size: 64, offset: 1984)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !625, line: 328, size: 3456, elements: !626)
!625 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!626 = !{!627, !628, !629, !632, !633, !636, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !660, !665, !666, !669, !673, !677, !681, !685, !686, !687, !688}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !624, file: !625, line: 329, baseType: !451, size: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !624, file: !625, line: 330, baseType: !520, size: 64, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !624, file: !625, line: 332, baseType: !630, size: 64, offset: 1024)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !625, line: 332, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !624, file: !625, line: 333, baseType: !276, size: 512, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !624, file: !625, line: 335, baseType: !634, size: 64, offset: 1600)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !625, line: 335, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !624, file: !625, line: 337, baseType: !637, size: 64, offset: 1664)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !516, line: 61, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !624, file: !625, line: 338, baseType: !341, size: 64, offset: 1728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !624, file: !625, line: 340, baseType: !266, size: 128, offset: 1792)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !624, file: !625, line: 340, baseType: !266, size: 128, offset: 1920)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !624, file: !625, line: 342, baseType: !77, size: 32, offset: 2048)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !624, file: !625, line: 342, baseType: !77, size: 32, offset: 2080)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !624, file: !625, line: 343, baseType: !77, size: 32, offset: 2112)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !624, file: !625, line: 345, baseType: !77, size: 32, offset: 2144)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !624, file: !625, line: 346, baseType: !77, size: 32, offset: 2176)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !624, file: !625, line: 347, baseType: !292, size: 16, offset: 2208)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !624, file: !625, line: 348, baseType: !292, size: 16, offset: 2224)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !624, file: !625, line: 349, baseType: !77, size: 32, offset: 2240)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !624, file: !625, line: 351, baseType: !77, size: 32, offset: 2272)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !624, file: !625, line: 353, baseType: !292, size: 16, offset: 2304)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !624, file: !625, line: 354, baseType: !292, size: 16, offset: 2320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !624, file: !625, line: 355, baseType: !77, size: 32, offset: 2336)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !624, file: !625, line: 357, baseType: !389, size: 128, offset: 2368)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !624, file: !625, line: 363, baseType: !266, size: 128, offset: 2496)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !624, file: !625, line: 363, baseType: !266, size: 128, offset: 2624)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !624, file: !625, line: 368, baseType: !658, size: 64, offset: 2752)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !625, line: 48, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !624, file: !625, line: 372, baseType: !661, size: 32, offset: 2816)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !625, line: 274, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !625, line: 271, size: 32, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !662, file: !625, line: 273, baseType: !7, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !624, file: !625, line: 373, baseType: !77, size: 32, offset: 2848)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !624, file: !625, line: 382, baseType: !667, size: 64, offset: 2880)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !625, line: 46, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !624, file: !625, line: 385, baseType: !670, size: 64, offset: 2944)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !271, !306}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !624, file: !625, line: 386, baseType: !674, size: 64, offset: 3008)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !271, !352}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !624, file: !625, line: 387, baseType: !678, size: 64, offset: 3072)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!77, !271}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !624, file: !625, line: 388, baseType: !682, size: 64, offset: 3136)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !271}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !624, file: !625, line: 389, baseType: !271, size: 64, offset: 3200)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !624, file: !625, line: 389, baseType: !271, size: 64, offset: 3264)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !624, file: !625, line: 389, baseType: !271, size: 64, offset: 3328)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !624, file: !625, line: 389, baseType: !271, size: 64, offset: 3392)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !515, file: !516, line: 1244, baseType: !690, size: 64, offset: 2048)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !692, line: 200, size: 17024, elements: !693)
!692 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !{!694, !696, !697, !698, !1112, !1113, !1114, !1115, !1116, !1117, !1118}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !691, file: !692, line: 201, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !691, file: !692, line: 202, baseType: !266, size: 128, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !691, file: !692, line: 203, baseType: !266, size: 128, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !691, file: !692, line: 206, baseType: !699, size: 64, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !692, line: 190, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !692, line: 126, size: 2816, elements: !702)
!702 = !{!703, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !799, !802, !803, !804, !1084, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1111}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !701, file: !692, line: 127, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !701, file: !692, line: 127, baseType: !704, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !701, file: !692, line: 128, baseType: !271, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !701, file: !692, line: 129, baseType: !271, size: 64, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !701, file: !692, line: 130, baseType: !276, size: 512, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !701, file: !692, line: 132, baseType: !77, size: 32, offset: 768)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !701, file: !692, line: 132, baseType: !77, size: 32, offset: 800)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !701, file: !692, line: 133, baseType: !77, size: 32, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !701, file: !692, line: 134, baseType: !77, size: 32, offset: 864)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !701, file: !692, line: 134, baseType: !77, size: 32, offset: 896)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !701, file: !692, line: 134, baseType: !77, size: 32, offset: 928)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !701, file: !692, line: 135, baseType: !77, size: 32, offset: 960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !701, file: !692, line: 135, baseType: !77, size: 32, offset: 992)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !701, file: !692, line: 136, baseType: !77, size: 32, offset: 1024)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !701, file: !692, line: 136, baseType: !77, size: 32, offset: 1056)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !701, file: !692, line: 137, baseType: !77, size: 32, offset: 1088)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !701, file: !692, line: 137, baseType: !77, size: 32, offset: 1120)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !701, file: !692, line: 138, baseType: !306, size: 32, offset: 1152)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !701, file: !692, line: 139, baseType: !306, size: 32, offset: 1184)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !701, file: !692, line: 139, baseType: !306, size: 32, offset: 1216)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !701, file: !692, line: 141, baseType: !292, size: 16, offset: 1248)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !701, file: !692, line: 142, baseType: !292, size: 16, offset: 1264)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !701, file: !692, line: 143, baseType: !77, size: 32, offset: 1280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !701, file: !692, line: 144, baseType: !77, size: 32, offset: 1312)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !701, file: !692, line: 146, baseType: !729, size: 64, offset: 1344)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !692, line: 114, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !692, line: 99, size: 7232, elements: !732)
!732 = !{!733, !735, !736, !737, !738, !739, !740, !748, !752, !767, !776, !783, !793}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !731, file: !692, line: 100, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !731, file: !692, line: 100, baseType: !734, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !731, file: !692, line: 101, baseType: !77, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !731, file: !692, line: 101, baseType: !77, size: 32, offset: 160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !731, file: !692, line: 102, baseType: !77, size: 32, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !731, file: !692, line: 102, baseType: !77, size: 32, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !731, file: !692, line: 103, baseType: !741, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !692, line: 59, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !692, line: 56, size: 2112, elements: !744)
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !743, file: !692, line: 57, baseType: !301, size: 2048)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !743, file: !692, line: 58, baseType: !77, size: 32, offset: 2048)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !743, file: !692, line: 58, baseType: !77, size: 32, offset: 2080)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !731, file: !692, line: 106, baseType: !749, size: 6144, offset: 320)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 6144, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !731, file: !692, line: 107, baseType: !753, size: 64, offset: 6464)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !692, line: 97, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !692, line: 83, size: 8320, elements: !756)
!756 = !{!757, !758, !759, !763, !764, !765, !766}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !755, file: !692, line: 84, baseType: !749, size: 6144)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !755, file: !692, line: 87, baseType: !301, size: 2048, offset: 6144)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !755, file: !692, line: 88, baseType: !760, size: 64, offset: 8192)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !762, line: 41, flags: DIFlagFwdDecl)
!762 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !755, file: !692, line: 90, baseType: !292, size: 16, offset: 8256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !755, file: !692, line: 92, baseType: !292, size: 16, offset: 8272)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !755, file: !692, line: 93, baseType: !292, size: 16, offset: 8288)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !755, file: !692, line: 95, baseType: !292, size: 16, offset: 8304)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !731, file: !692, line: 108, baseType: !768, size: 64, offset: 6528)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !692, line: 66, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !692, line: 61, size: 128, elements: !771)
!771 = !{!772, !773, !774, !775}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !770, file: !692, line: 62, baseType: !77, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !770, file: !692, line: 63, baseType: !77, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !770, file: !692, line: 64, baseType: !77, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !770, file: !692, line: 65, baseType: !77, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !731, file: !692, line: 109, baseType: !777, size: 64, offset: 6592)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !692, line: 71, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !692, line: 68, size: 64, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !779, file: !692, line: 69, baseType: !77, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !779, file: !692, line: 70, baseType: !77, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !731, file: !692, line: 110, baseType: !784, size: 64, offset: 6656)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !692, line: 81, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !692, line: 73, size: 352, elements: !787)
!787 = !{!788, !789, !790, !791, !792}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !786, file: !692, line: 74, baseType: !355, size: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !786, file: !692, line: 75, baseType: !355, size: 96, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !786, file: !692, line: 76, baseType: !355, size: 96, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !786, file: !692, line: 77, baseType: !77, size: 32, offset: 288)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !786, file: !692, line: 78, baseType: !77, size: 32, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !731, file: !692, line: 113, baseType: !794, size: 512, offset: 6720)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !795, line: 182, baseType: !796)
!795 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !795, line: 180, size: 512, elements: !797)
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !795, line: 181, baseType: !276, size: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !701, file: !692, line: 148, baseType: !800, size: 64, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !590, line: 46, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !701, file: !692, line: 151, baseType: !514, size: 64, offset: 1472)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !701, file: !692, line: 152, baseType: !588, size: 64, offset: 1536)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !701, file: !692, line: 153, baseType: !805, size: 64, offset: 1600)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !807, line: 64, size: 19136, elements: !808)
!807 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!808 = !{!809, !810, !811, !812, !813, !814, !816, !817, !818, !819, !822, !823, !1070, !1071, !1079, !1080, !1081, !1082, !1083}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !806, file: !807, line: 65, baseType: !451, size: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !806, file: !807, line: 66, baseType: !520, size: 64, offset: 960)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !806, file: !807, line: 68, baseType: !470, size: 8192, offset: 1024)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !806, file: !807, line: 70, baseType: !77, size: 32, offset: 9216)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !806, file: !807, line: 71, baseType: !77, size: 32, offset: 9248)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !806, file: !807, line: 72, baseType: !815, size: 64, offset: 9280)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !342)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !806, file: !807, line: 74, baseType: !306, size: 32, offset: 9344)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !806, file: !807, line: 74, baseType: !306, size: 32, offset: 9376)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !806, file: !807, line: 76, baseType: !760, size: 64, offset: 9408)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !806, file: !807, line: 77, baseType: !820, size: 64, offset: 9472)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !807, line: 77, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !806, file: !807, line: 78, baseType: !637, size: 64, offset: 9536)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !806, file: !807, line: 80, baseType: !824, size: 2624, offset: 9600)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !825, line: 340, size: 2624, elements: !826)
!825 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!826 = !{!827, !855, !873, !874, !875, !892, !950, !951, !1050, !1051, !1052, !1053, !1059}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !824, file: !825, line: 341, baseType: !828, size: 576)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !825, line: 251, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !825, line: 207, size: 576, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !829, file: !825, line: 208, baseType: !77, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !829, file: !825, line: 211, baseType: !292, size: 16, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !829, file: !825, line: 212, baseType: !292, size: 16, offset: 48)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !829, file: !825, line: 213, baseType: !306, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !829, file: !825, line: 214, baseType: !292, size: 16, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !829, file: !825, line: 215, baseType: !292, size: 16, offset: 112)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !829, file: !825, line: 216, baseType: !292, size: 16, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !829, file: !825, line: 217, baseType: !292, size: 16, offset: 144)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !829, file: !825, line: 218, baseType: !292, size: 16, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !829, file: !825, line: 219, baseType: !292, size: 16, offset: 176)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !829, file: !825, line: 220, baseType: !306, size: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !829, file: !825, line: 222, baseType: !292, size: 16, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !829, file: !825, line: 225, baseType: !292, size: 16, offset: 240)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !829, file: !825, line: 228, baseType: !77, size: 32, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !829, file: !825, line: 229, baseType: !77, size: 32, offset: 288)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !829, file: !825, line: 233, baseType: !77, size: 32, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !829, file: !825, line: 236, baseType: !292, size: 16, offset: 352)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !829, file: !825, line: 236, baseType: !292, size: 16, offset: 368)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !829, file: !825, line: 241, baseType: !306, size: 32, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !829, file: !825, line: 244, baseType: !77, size: 32, offset: 416)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !829, file: !825, line: 244, baseType: !77, size: 32, offset: 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !829, file: !825, line: 245, baseType: !306, size: 32, offset: 480)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !829, file: !825, line: 248, baseType: !306, size: 32, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !829, file: !825, line: 250, baseType: !77, size: 32, offset: 544)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !824, file: !825, line: 342, baseType: !856, size: 448, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !825, line: 79, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !825, line: 61, size: 448, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !857, file: !825, line: 62, baseType: !271, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !857, file: !825, line: 64, baseType: !292, size: 16, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !857, file: !825, line: 65, baseType: !292, size: 16, offset: 80)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !857, file: !825, line: 67, baseType: !306, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !857, file: !825, line: 68, baseType: !306, size: 32, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !857, file: !825, line: 69, baseType: !306, size: 32, offset: 160)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !857, file: !825, line: 70, baseType: !292, size: 16, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !857, file: !825, line: 71, baseType: !292, size: 16, offset: 208)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !857, file: !825, line: 72, baseType: !341, size: 64, offset: 224)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !857, file: !825, line: 75, baseType: !306, size: 32, offset: 288)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !857, file: !825, line: 75, baseType: !306, size: 32, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !857, file: !825, line: 75, baseType: !306, size: 32, offset: 352)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !857, file: !825, line: 78, baseType: !306, size: 32, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !857, file: !825, line: 78, baseType: !306, size: 32, offset: 416)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !824, file: !825, line: 343, baseType: !266, size: 128, offset: 1024)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !824, file: !825, line: 344, baseType: !266, size: 128, offset: 1152)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !824, file: !825, line: 345, baseType: !876, size: 192, offset: 1280)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !825, line: 278, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !825, line: 270, size: 192, elements: !878)
!878 = !{!879, !880, !881, !882, !883}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !877, file: !825, line: 271, baseType: !77, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !877, file: !825, line: 273, baseType: !306, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !877, file: !825, line: 275, baseType: !77, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !877, file: !825, line: 276, baseType: !77, size: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !877, file: !825, line: 277, baseType: !884, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !825, line: 55, size: 576, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !885, file: !825, line: 56, baseType: !77, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !885, file: !825, line: 57, baseType: !306, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !885, file: !825, line: 58, baseType: !890, size: 512, offset: 64)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 512, elements: !891)
!891 = !{!288, !288}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !824, file: !825, line: 346, baseType: !893, size: 384, offset: 1472)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !825, line: 268, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !825, line: 253, size: 384, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !944, !945, !946, !947, !948, !949}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !894, file: !825, line: 254, baseType: !77, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !894, file: !825, line: 255, baseType: !77, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !894, file: !825, line: 255, baseType: !77, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !894, file: !825, line: 258, baseType: !306, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !894, file: !825, line: 259, baseType: !901, size: 64, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !825, line: 164, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !825, line: 108, size: 1664, elements: !904)
!904 = !{!905, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !903, file: !825, line: 109, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !903, file: !825, line: 109, baseType: !906, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !903, file: !825, line: 111, baseType: !276, size: 512, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !903, file: !825, line: 119, baseType: !341, size: 64, offset: 640)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !903, file: !825, line: 119, baseType: !341, size: 64, offset: 704)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !903, file: !825, line: 125, baseType: !341, size: 64, offset: 768)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !903, file: !825, line: 125, baseType: !341, size: 64, offset: 832)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !903, file: !825, line: 127, baseType: !341, size: 64, offset: 896)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !903, file: !825, line: 130, baseType: !77, size: 32, offset: 960)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !903, file: !825, line: 131, baseType: !77, size: 32, offset: 992)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !903, file: !825, line: 132, baseType: !917, size: 64, offset: 1024)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !825, line: 106, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !825, line: 81, size: 512, elements: !920)
!920 = !{!921, !922, !925, !926, !927, !928}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !919, file: !825, line: 82, baseType: !341, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !919, file: !825, line: 97, baseType: !923, size: 256, offset: 64)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 256, elements: !924)
!924 = !{!288, !343}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !919, file: !825, line: 102, baseType: !341, size: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !919, file: !825, line: 102, baseType: !341, size: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !919, file: !825, line: 104, baseType: !77, size: 32, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !919, file: !825, line: 105, baseType: !77, size: 32, offset: 480)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !903, file: !825, line: 135, baseType: !355, size: 96, offset: 1088)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !903, file: !825, line: 136, baseType: !306, size: 32, offset: 1184)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !903, file: !825, line: 139, baseType: !77, size: 32, offset: 1216)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !903, file: !825, line: 139, baseType: !77, size: 32, offset: 1248)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !903, file: !825, line: 139, baseType: !77, size: 32, offset: 1280)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !903, file: !825, line: 140, baseType: !355, size: 96, offset: 1312)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !903, file: !825, line: 143, baseType: !292, size: 16, offset: 1408)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !903, file: !825, line: 144, baseType: !292, size: 16, offset: 1424)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !903, file: !825, line: 145, baseType: !292, size: 16, offset: 1440)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !903, file: !825, line: 148, baseType: !292, size: 16, offset: 1456)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !903, file: !825, line: 149, baseType: !77, size: 32, offset: 1472)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !903, file: !825, line: 150, baseType: !306, size: 32, offset: 1504)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !903, file: !825, line: 152, baseType: !637, size: 64, offset: 1536)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !903, file: !825, line: 163, baseType: !306, size: 32, offset: 1600)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !903, file: !825, line: 163, baseType: !306, size: 32, offset: 1632)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !894, file: !825, line: 261, baseType: !306, size: 32, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !894, file: !825, line: 261, baseType: !306, size: 32, offset: 224)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !894, file: !825, line: 261, baseType: !306, size: 32, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !894, file: !825, line: 263, baseType: !77, size: 32, offset: 288)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !894, file: !825, line: 266, baseType: !77, size: 32, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !894, file: !825, line: 267, baseType: !306, size: 32, offset: 352)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !824, file: !825, line: 347, baseType: !901, size: 64, offset: 1856)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !824, file: !825, line: 348, baseType: !952, size: 64, offset: 1920)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !825, line: 205, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !825, line: 186, size: 1024, elements: !955)
!955 = !{!956, !958, !959, !960, !962, !963, !964, !972, !973, !974, !1048, !1049}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !954, file: !825, line: 187, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !954, file: !825, line: 187, baseType: !957, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !825, line: 189, baseType: !276, size: 512, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !954, file: !825, line: 191, baseType: !961, size: 64, offset: 640)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !954, file: !825, line: 193, baseType: !77, size: 32, offset: 704)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !954, file: !825, line: 193, baseType: !77, size: 32, offset: 736)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !954, file: !825, line: 195, baseType: !965, size: 64, offset: 768)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !825, line: 184, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !825, line: 166, size: 320, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !967, file: !825, line: 180, baseType: !923, size: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !967, file: !825, line: 182, baseType: !77, size: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !967, file: !825, line: 183, baseType: !77, size: 32, offset: 288)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !954, file: !825, line: 196, baseType: !77, size: 32, offset: 832)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !954, file: !825, line: 198, baseType: !77, size: 32, offset: 864)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !954, file: !825, line: 200, baseType: !975, size: 64, offset: 896)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !762, line: 77, size: 15424, elements: !977)
!977 = !{!978, !979, !980, !983, !986, !987, !990, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1008, !1009, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1034, !1035, !1036, !1037, !1038, !1042}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !976, file: !762, line: 78, baseType: !451, size: 960)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !976, file: !762, line: 80, baseType: !470, size: 8192, offset: 960)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !976, file: !762, line: 82, baseType: !981, size: 64, offset: 9152)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !762, line: 43, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !976, file: !762, line: 83, baseType: !984, size: 64, offset: 9216)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !452, line: 46, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !976, file: !762, line: 86, baseType: !760, size: 64, offset: 9280)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !976, file: !762, line: 87, baseType: !988, size: 64, offset: 9344)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !762, line: 44, flags: DIFlagFwdDecl)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !976, file: !762, line: 89, baseType: !991, size: 512, offset: 9408)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 512, elements: !376)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !976, file: !762, line: 90, baseType: !292, size: 16, offset: 9920)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !976, file: !762, line: 90, baseType: !292, size: 16, offset: 9936)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !976, file: !762, line: 92, baseType: !292, size: 16, offset: 9952)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !976, file: !762, line: 92, baseType: !292, size: 16, offset: 9968)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !976, file: !762, line: 93, baseType: !292, size: 16, offset: 9984)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !976, file: !762, line: 93, baseType: !292, size: 16, offset: 10000)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !976, file: !762, line: 94, baseType: !77, size: 32, offset: 10016)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !976, file: !762, line: 97, baseType: !292, size: 16, offset: 10048)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !976, file: !762, line: 97, baseType: !292, size: 16, offset: 10064)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !976, file: !762, line: 98, baseType: !292, size: 16, offset: 10080)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !976, file: !762, line: 98, baseType: !292, size: 16, offset: 10096)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !976, file: !762, line: 99, baseType: !292, size: 16, offset: 10112)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !976, file: !762, line: 99, baseType: !292, size: 16, offset: 10128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !976, file: !762, line: 100, baseType: !7, size: 32, offset: 10144)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !976, file: !762, line: 101, baseType: !1007, size: 64, offset: 10176)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !976, file: !762, line: 103, baseType: !476, size: 64, offset: 10240)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !976, file: !762, line: 104, baseType: !1010, size: 64, offset: 10304)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !452, line: 159, size: 448, elements: !1012)
!1012 = !{!1013, !1015, !1016, !1018, !1019, !1021}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1011, file: !452, line: 161, baseType: !1014, size: 64)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !342)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1011, file: !452, line: 162, baseType: !1014, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1011, file: !452, line: 163, baseType: !1017, size: 32, offset: 128)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 32, elements: !342)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1011, file: !452, line: 164, baseType: !1017, size: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1011, file: !452, line: 165, baseType: !1020, size: 128, offset: 192)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 128, elements: !342)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1011, file: !452, line: 166, baseType: !1022, size: 128, offset: 320)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 128, elements: !342)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !976, file: !762, line: 107, baseType: !306, size: 32, offset: 10368)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !976, file: !762, line: 108, baseType: !77, size: 32, offset: 10400)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !976, file: !762, line: 109, baseType: !292, size: 16, offset: 10432)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !976, file: !762, line: 110, baseType: !292, size: 16, offset: 10448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !976, file: !762, line: 113, baseType: !77, size: 32, offset: 10464)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !976, file: !762, line: 113, baseType: !77, size: 32, offset: 10496)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !976, file: !762, line: 114, baseType: !277, size: 8, offset: 10528)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !976, file: !762, line: 114, baseType: !277, size: 8, offset: 10536)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !976, file: !762, line: 115, baseType: !292, size: 16, offset: 10544)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !976, file: !762, line: 116, baseType: !1033, size: 128, offset: 10560)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 128, elements: !287)
