; ModuleID = 'blender/source/blender/imbuf/intern/readimage.c'
source_filename = "blender/source/blender/imbuf/intern/readimage.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ImFileType = type { void ()*, void ()*, i32 (i8*)*, i32 (i8*)*, i32 (%struct.ImFileType*, %struct.ImBuf*)*, %struct.ImBuf* (i8*, i64, i32, i8*)*, %struct.ImBuf* (i8*, i32, i8*)*, i32 (%struct.ImBuf*, i8*, i32)*, void (%struct.ImBuf*, i8*, i64, i32, i32, i32*)*, i32, i32, i32 }
%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/imbuf/intern/readimage.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !{i32 7, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 1, !"wchar_size", i32 4}
!10 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!11 = distinct !DISubprogram(name: "IMB_ibImageFromMemory", scope: !1, file: !1, line: 103, type: !12, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !5, !118, !21, !121, !122}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !16, line: 70, size: 19840, elements: !17)
!16 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !{!18, !19, !20, !22, !23, !24, !25, !26, !27, !30, !33, !38, !39, !40, !41, !42, !44, !46, !47, !48, !52, !53, !54, !55, !56, !59, !60, !61, !66, !67, !70, !71, !72, !73, !74, !96, !97, !98, !101, !102, !111}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !16, line: 71, baseType: !14, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !15, file: !16, line: 71, baseType: !14, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !16, line: 74, baseType: !21, size: 32, offset: 128)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !16, line: 74, baseType: !21, size: 32, offset: 160)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !15, file: !16, line: 79, baseType: !6, size: 8, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !15, file: !16, line: 80, baseType: !21, size: 32, offset: 224)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !15, file: !16, line: 83, baseType: !21, size: 32, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !15, file: !16, line: 84, baseType: !21, size: 32, offset: 288)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !15, file: !16, line: 87, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !15, file: !16, line: 88, baseType: !31, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !15, file: !16, line: 93, baseType: !34, size: 128, offset: 448)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !36)
!35 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!36 = !{!37}
!37 = !DISubrange(count: 2)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !15, file: !16, line: 96, baseType: !21, size: 32, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !15, file: !16, line: 96, baseType: !21, size: 32, offset: 608)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !15, file: !16, line: 97, baseType: !21, size: 32, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !15, file: !16, line: 97, baseType: !21, size: 32, offset: 672)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !15, file: !16, line: 98, baseType: !43, size: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !15, file: !16, line: 101, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !15, file: !16, line: 102, baseType: !31, size: 64, offset: 832)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !15, file: !16, line: 105, baseType: !32, size: 32, offset: 896)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !15, file: !16, line: 108, baseType: !49, size: 1280, offset: 960)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1280, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 20)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !15, file: !16, line: 109, baseType: !21, size: 32, offset: 2240)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !15, file: !16, line: 109, baseType: !21, size: 32, offset: 2272)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !15, file: !16, line: 112, baseType: !21, size: 32, offset: 2304)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !15, file: !16, line: 113, baseType: !21, size: 32, offset: 2336)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !15, file: !16, line: 114, baseType: !57, size: 64, offset: 2368)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !16, line: 50, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !15, file: !16, line: 115, baseType: !4, size: 64, offset: 2432)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !15, file: !16, line: 118, baseType: !21, size: 32, offset: 2496)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !15, file: !16, line: 119, baseType: !62, size: 8192, offset: 2528)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 8192, elements: !64)
!63 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!65}
!65 = !DISubrange(count: 1024)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !15, file: !16, line: 120, baseType: !62, size: 8192, offset: 10720)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !15, file: !16, line: 123, baseType: !68, size: 64, offset: 18944)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !16, line: 123, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !15, file: !16, line: 124, baseType: !21, size: 32, offset: 19008)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !15, file: !16, line: 127, baseType: !5, size: 64, offset: 19072)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !15, file: !16, line: 128, baseType: !29, size: 32, offset: 19136)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !15, file: !16, line: 129, baseType: !29, size: 32, offset: 19168)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !15, file: !16, line: 132, baseType: !75, size: 64, offset: 19200)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !77, line: 47, size: 4992, elements: !78)
!77 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_colormanagement_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!78 = !{!79, !80, !81, !82, !86, !90, !93, !94, !95}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !77, line: 48, baseType: !75, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !76, file: !77, line: 48, baseType: !75, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !76, file: !77, line: 49, baseType: !21, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !77, line: 50, baseType: !83, size: 512, offset: 160)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !76, file: !77, line: 51, baseType: !87, size: 4096, offset: 672)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 4096, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "to_scene_linear", scope: !76, file: !77, line: 53, baseType: !91, size: 64, offset: 4800)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "OCIO_ConstProcessorRcPtr", file: !77, line: 41, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "from_scene_linear", scope: !76, file: !77, line: 54, baseType: !91, size: 64, offset: 4864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "is_invertible", scope: !76, file: !77, line: 56, baseType: !6, size: 8, offset: 4928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "is_data", scope: !76, file: !77, line: 57, baseType: !6, size: 8, offset: 4936)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !15, file: !16, line: 133, baseType: !75, size: 64, offset: 19264)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !15, file: !16, line: 134, baseType: !28, size: 64, offset: 19328)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !15, file: !16, line: 135, baseType: !99, size: 64, offset: 19392)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !16, line: 135, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !15, file: !16, line: 136, baseType: !21, size: 32, offset: 19456)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !15, file: !16, line: 137, baseType: !103, size: 128, offset: 19488)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !104, line: 89, baseType: !105)
!104 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !104, line: 86, size: 128, elements: !106)
!106 = !{!107, !108, !109, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !105, file: !104, line: 87, baseType: !21, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !105, file: !104, line: 87, baseType: !21, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !105, file: !104, line: 88, baseType: !21, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !105, file: !104, line: 88, baseType: !21, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !15, file: !16, line: 140, baseType: !112, size: 192, offset: 19648)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !16, line: 55, size: 192, elements: !113)
!113 = !{!114, !115, !116, !117}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !112, file: !16, line: 56, baseType: !29, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !112, file: !16, line: 57, baseType: !29, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !112, file: !16, line: 58, baseType: !5, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !112, file: !16, line: 59, baseType: !29, size: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !119, line: 46, baseType: !120)
!119 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!120 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!124 = !DILocalVariable(name: "mem", arg: 1, scope: !11, file: !1, line: 103, type: !5)
!125 = !DILocation(line: 103, column: 45, scope: !11)
!126 = !DILocalVariable(name: "size", arg: 2, scope: !11, file: !1, line: 103, type: !118)
!127 = !DILocation(line: 103, column: 57, scope: !11)
!128 = !DILocalVariable(name: "flags", arg: 3, scope: !11, file: !1, line: 103, type: !21)
!129 = !DILocation(line: 103, column: 67, scope: !11)
!130 = !DILocalVariable(name: "colorspace", arg: 4, scope: !11, file: !1, line: 103, type: !121)
!131 = !DILocation(line: 103, column: 79, scope: !11)
!132 = !DILocalVariable(name: "descr", arg: 5, scope: !11, file: !1, line: 103, type: !122)
!133 = !DILocation(line: 103, column: 117, scope: !11)
!134 = !DILocalVariable(name: "ibuf", scope: !11, file: !1, line: 105, type: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !16, line: 141, baseType: !15)
!137 = !DILocation(line: 105, column: 9, scope: !11)
!138 = !DILocalVariable(name: "type", scope: !11, file: !1, line: 106, type: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImFileType", file: !141, line: 52, baseType: !142)
!141 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_filetype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImFileType", file: !141, line: 37, size: 704, elements: !143)
!143 = !{!144, !148, !149, !153, !157, !162, !166, !170, !174, !178, !179, !180}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !142, file: !141, line: 38, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !142, file: !141, line: 39, baseType: !145, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "is_a", scope: !142, file: !141, line: 41, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!21, !5}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "is_a_filepath", scope: !142, file: !141, line: 42, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!21, !122}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !142, file: !141, line: 43, baseType: !158, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!21, !161, !14}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !142, file: !141, line: 44, baseType: !163, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!14, !5, !118, !21, !121}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "load_filepath", scope: !142, file: !141, line: 45, baseType: !167, size: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!14, !122, !21, !121}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !142, file: !141, line: 46, baseType: !171, size: 64, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!21, !14, !122, !21}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "load_tile", scope: !142, file: !141, line: 47, baseType: !175, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !14, !5, !118, !21, !21, !28}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !142, file: !141, line: 49, baseType: !21, size: 32, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !142, file: !141, line: 50, baseType: !21, size: 32, offset: 608)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "default_save_role", scope: !142, file: !141, line: 51, baseType: !21, size: 32, offset: 640)
!181 = !DILocation(line: 106, column: 14, scope: !11)
!182 = !DILocalVariable(name: "effective_colorspace", scope: !11, file: !1, line: 107, type: !83)
!183 = !DILocation(line: 107, column: 7, scope: !11)
!184 = !DILocation(line: 109, column: 6, scope: !185)
!185 = distinct !DILexicalBlock(scope: !11, file: !1, line: 109, column: 6)
!186 = !DILocation(line: 109, column: 10, scope: !185)
!187 = !DILocation(line: 109, column: 6, scope: !11)
!188 = !DILocation(line: 110, column: 11, scope: !189)
!189 = distinct !DILexicalBlock(scope: !185, file: !1, line: 109, column: 19)
!190 = !DILocation(line: 110, column: 3, scope: !189)
!191 = !DILocation(line: 111, column: 3, scope: !189)
!192 = !DILocation(line: 114, column: 6, scope: !193)
!193 = distinct !DILexicalBlock(scope: !11, file: !1, line: 114, column: 6)
!194 = !DILocation(line: 114, column: 6, scope: !11)
!195 = !DILocation(line: 115, column: 15, scope: !193)
!196 = !DILocation(line: 115, column: 37, scope: !193)
!197 = !DILocation(line: 115, column: 3, scope: !193)
!198 = !DILocation(line: 117, column: 12, scope: !199)
!199 = distinct !DILexicalBlock(scope: !11, file: !1, line: 117, column: 2)
!200 = !DILocation(line: 117, column: 7, scope: !199)
!201 = !DILocation(line: 117, column: 30, scope: !202)
!202 = distinct !DILexicalBlock(scope: !199, file: !1, line: 117, column: 2)
!203 = !DILocation(line: 117, column: 37, scope: !202)
!204 = !DILocation(line: 117, column: 35, scope: !202)
!205 = !DILocation(line: 117, column: 2, scope: !199)
!206 = !DILocation(line: 118, column: 7, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !1, line: 118, column: 7)
!208 = distinct !DILexicalBlock(scope: !202, file: !1, line: 117, column: 66)
!209 = !DILocation(line: 118, column: 13, scope: !207)
!210 = !DILocation(line: 118, column: 7, scope: !208)
!211 = !DILocation(line: 119, column: 11, scope: !212)
!212 = distinct !DILexicalBlock(scope: !207, file: !1, line: 118, column: 19)
!213 = !DILocation(line: 119, column: 17, scope: !212)
!214 = !DILocation(line: 119, column: 22, scope: !212)
!215 = !DILocation(line: 119, column: 27, scope: !212)
!216 = !DILocation(line: 119, column: 33, scope: !212)
!217 = !DILocation(line: 119, column: 40, scope: !212)
!218 = !DILocation(line: 119, column: 9, scope: !212)
!219 = !DILocation(line: 120, column: 8, scope: !220)
!220 = distinct !DILexicalBlock(scope: !212, file: !1, line: 120, column: 8)
!221 = !DILocation(line: 120, column: 8, scope: !212)
!222 = !DILocation(line: 121, column: 22, scope: !223)
!223 = distinct !DILexicalBlock(scope: !220, file: !1, line: 120, column: 14)
!224 = !DILocation(line: 121, column: 28, scope: !223)
!225 = !DILocation(line: 121, column: 35, scope: !223)
!226 = !DILocation(line: 121, column: 47, scope: !223)
!227 = !DILocation(line: 121, column: 5, scope: !223)
!228 = !DILocation(line: 122, column: 12, scope: !223)
!229 = !DILocation(line: 122, column: 5, scope: !223)
!230 = !DILocation(line: 124, column: 3, scope: !212)
!231 = !DILocation(line: 125, column: 2, scope: !208)
!232 = !DILocation(line: 117, column: 62, scope: !202)
!233 = !DILocation(line: 117, column: 2, scope: !202)
!234 = distinct !{!234, !205, !235}
!235 = !DILocation(line: 125, column: 2, scope: !199)
!236 = !DILocation(line: 127, column: 7, scope: !237)
!237 = distinct !DILexicalBlock(scope: !11, file: !1, line: 127, column: 6)
!238 = !DILocation(line: 127, column: 13, scope: !237)
!239 = !DILocation(line: 127, column: 24, scope: !237)
!240 = !DILocation(line: 127, column: 6, scope: !11)
!241 = !DILocation(line: 128, column: 11, scope: !237)
!242 = !DILocation(line: 128, column: 62, scope: !237)
!243 = !DILocation(line: 128, column: 3, scope: !237)
!244 = !DILocation(line: 130, column: 2, scope: !11)
!245 = !DILocation(line: 131, column: 1, scope: !11)
