; ModuleID = 'blender/source/blender/editors/armature/pose_edit.c'
source_filename = "blender/source/blender/editors/armature/pose_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "axis_items", scope: !2, file: !3, line: 642, type: !1987, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "POSE_OT_autoside_names", scope: !3, file: !3, line: 640, type: !4, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1862, retainedNodes: !1986)
!3 = !DIFile(filename: "blender/source/blender/editors/armature/pose_edit.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !1788, !1792, !1798, !1802, !1803, !1807, !1808, !1809, !1810, !1814, !1815, !1830, !1831, !1835, !1861}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !84, !1781, !1782, !1783, !1786, !1787}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !25, line: 41, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !86, file: !28, line: 107, baseType: !58, size: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !86, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !86, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !86, file: !28, line: 111, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !96)
!96 = !{!97, !98, !99, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !8, line: 491, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !8, line: 491, baseType: !94, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !95, file: !8, line: 493, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !102)
!102 = !{!103, !104, !105, !106, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1747, !1750, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !28, line: 170, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !28, line: 170, baseType: !100, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !101, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !101, file: !28, line: 174, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !109, line: 49, size: 1984, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !147, !148, !149, !150, !151, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !109, line: 50, baseType: !112, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !114)
!114 = !{!115, !116, !117, !119, !138, !142, !143, !144, !145, !146}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !39, line: 118, baseType: !56, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !113, file: !39, line: 119, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !113, file: !39, line: 120, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !122)
!122 = !{!123, !124, !126, !129, !133, !134, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !39, line: 137, baseType: !112, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !121, file: !39, line: 138, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !121, file: !39, line: 139, baseType: !127, size: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !39, line: 140, baseType: !130, size: 8192, offset: 1088)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !121, file: !39, line: 141, baseType: !130, size: 8192, offset: 9280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !39, line: 148, baseType: !120, size: 64, offset: 17472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !121, file: !39, line: 150, baseType: !136, size: 64, offset: 17536)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !39, line: 121, baseType: !139, size: 528, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 66)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !113, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !113, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !108, file: !109, line: 52, baseType: !58, size: 128, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !108, file: !109, line: 53, baseType: !58, size: 128, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !108, file: !109, line: 54, baseType: !58, size: 128, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !108, file: !109, line: 55, baseType: !58, size: 128, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !108, file: !109, line: 57, baseType: !152, size: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !154, line: 1216, size: 39680, elements: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !157, !228, !510, !513, !514, !515, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !541, !613, !1041, !1256, !1259, !1547, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1569, !1570, !1571, !1572, !1573, !1581, !1648, !1655, !1656, !1663, !1664, !1665, !1666, !1667, !1668, !1669}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !154, line: 1217, baseType: !112, size: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !153, file: !154, line: 1218, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !160, line: 838, size: 768, elements: !161)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !{!162, !177, !178, !188, !189, !221, !222, !223, !224, !225, !226, !227}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !159, file: !160, line: 840, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !165, line: 499, baseType: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !165, line: 486, size: 1600, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !165, line: 487, baseType: !112, size: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !166, file: !165, line: 489, baseType: !58, size: 128, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !166, file: !165, line: 490, baseType: !58, size: 128, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !166, file: !165, line: 491, baseType: !58, size: 128, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !166, file: !165, line: 492, baseType: !58, size: 128, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !165, line: 494, baseType: !22, size: 32, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !166, file: !165, line: 495, baseType: !22, size: 32, offset: 1504)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !166, file: !165, line: 497, baseType: !22, size: 32, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !166, file: !165, line: 498, baseType: !22, size: 32, offset: 1568)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !159, file: !160, line: 844, baseType: !163, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !159, file: !160, line: 848, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !160, line: 549, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !160, line: 544, size: 320, elements: !182)
!182 = !{!183, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !160, line: 545, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !181, file: !160, line: 545, baseType: !184, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !181, file: !160, line: 547, baseType: !163, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !181, file: !160, line: 548, baseType: !58, size: 128, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !159, file: !160, line: 851, baseType: !58, size: 128, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !159, file: !160, line: 853, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !160, line: 594, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !160, line: 561, size: 1664, elements: !193)
!193 = !{!194, !196, !197, !198, !199, !200, !201, !202, !203, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !160, line: 562, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !160, line: 562, baseType: !195, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !192, file: !160, line: 564, baseType: !58, size: 128, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !192, file: !160, line: 565, baseType: !163, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !192, file: !160, line: 566, baseType: !179, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !192, file: !160, line: 568, baseType: !58, size: 128, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !192, file: !160, line: 569, baseType: !58, size: 128, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !160, line: 571, baseType: !33, size: 512, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !192, file: !160, line: 573, baseType: !204, size: 32, offset: 1152)
!204 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !192, file: !160, line: 574, baseType: !204, size: 32, offset: 1184)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !192, file: !160, line: 576, baseType: !204, size: 32, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !192, file: !160, line: 576, baseType: !204, size: 32, offset: 1248)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !192, file: !160, line: 577, baseType: !204, size: 32, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !192, file: !160, line: 577, baseType: !204, size: 32, offset: 1312)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !192, file: !160, line: 579, baseType: !204, size: 32, offset: 1344)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !192, file: !160, line: 580, baseType: !204, size: 32, offset: 1376)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !192, file: !160, line: 582, baseType: !204, size: 32, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !192, file: !160, line: 582, baseType: !204, size: 32, offset: 1440)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !192, file: !160, line: 583, baseType: !48, size: 16, offset: 1472)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !192, file: !160, line: 585, baseType: !48, size: 16, offset: 1488)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !192, file: !160, line: 586, baseType: !48, size: 16, offset: 1504)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !160, line: 588, baseType: !48, size: 16, offset: 1520)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !192, file: !160, line: 590, baseType: !56, size: 64, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !160, line: 592, baseType: !22, size: 32, offset: 1600)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !192, file: !160, line: 593, baseType: !22, size: 32, offset: 1632)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !159, file: !160, line: 858, baseType: !58, size: 128, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !159, file: !160, line: 859, baseType: !58, size: 128, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !160, line: 862, baseType: !22, size: 32, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !159, file: !160, line: 863, baseType: !22, size: 32, offset: 672)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !159, file: !160, line: 866, baseType: !48, size: 16, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !159, file: !160, line: 867, baseType: !48, size: 16, offset: 720)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !159, file: !160, line: 868, baseType: !204, size: 32, offset: 736)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !153, file: !154, line: 1220, baseType: !229, size: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !231, line: 115, size: 11392, elements: !232)
!231 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!232 = !{!233, !234, !235, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !253, !264, !266, !267, !311, !312, !315, !316, !332, !333, !334, !335, !336, !337, !338, !343, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !359, !360, !361, !362, !363, !364, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !424, !425, !426, !427, !428, !429, !430, !431, !432, !435, !438, !441, !442, !443, !444, !445, !448, !451, !454, !455, !461, !462, !463, !464, !465, !466, !468, !471, !474, !478, !498, !499}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !230, file: !231, line: 116, baseType: !112, size: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !230, file: !231, line: 117, baseType: !158, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !230, file: !231, line: 119, baseType: !236, size: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !231, line: 57, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !230, file: !231, line: 121, baseType: !48, size: 16, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !230, file: !231, line: 121, baseType: !48, size: 16, offset: 1104)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !230, file: !231, line: 122, baseType: !22, size: 32, offset: 1120)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !230, file: !231, line: 122, baseType: !22, size: 32, offset: 1152)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !230, file: !231, line: 122, baseType: !22, size: 32, offset: 1184)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !230, file: !231, line: 123, baseType: !33, size: 512, offset: 1216)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !230, file: !231, line: 124, baseType: !229, size: 64, offset: 1728)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !230, file: !231, line: 124, baseType: !229, size: 64, offset: 1792)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !230, file: !231, line: 127, baseType: !229, size: 64, offset: 1856)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !230, file: !231, line: 127, baseType: !229, size: 64, offset: 1920)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !230, file: !231, line: 127, baseType: !229, size: 64, offset: 1984)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !230, file: !231, line: 128, baseType: !250, size: 64, offset: 2048)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !252, line: 46, flags: DIFlagFwdDecl)
!252 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !230, file: !231, line: 130, baseType: !254, size: 64, offset: 2112)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !231, line: 97, size: 832, elements: !256)
!256 = !{!257, !262, !263}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !255, file: !231, line: 98, baseType: !258, size: 768)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 768, elements: !259)
!259 = !{!260, !261}
!260 = !DISubrange(count: 8)
!261 = !DISubrange(count: 3)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !255, file: !231, line: 99, baseType: !22, size: 32, offset: 768)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !255, file: !231, line: 99, baseType: !22, size: 32, offset: 800)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !230, file: !231, line: 131, baseType: !265, size: 64, offset: 2176)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !230, file: !231, line: 132, baseType: !265, size: 64, offset: 2240)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !230, file: !231, line: 133, baseType: !268, size: 64, offset: 2304)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !165, line: 334, size: 1728, elements: !270)
!270 = !{!271, !272, !275, !276, !277, !279, !280, !281, !284, !285, !286, !287, !288, !289, !290, !310}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !269, file: !165, line: 335, baseType: !58, size: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !269, file: !165, line: 336, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !165, line: 47, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !165, line: 338, baseType: !48, size: 16, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !269, file: !165, line: 338, baseType: !48, size: 16, offset: 208)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !269, file: !165, line: 339, baseType: !278, size: 32, offset: 224)
!278 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !269, file: !165, line: 340, baseType: !22, size: 32, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !269, file: !165, line: 342, baseType: !204, size: 32, offset: 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !269, file: !165, line: 343, baseType: !282, size: 96, offset: 320)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 96, elements: !283)
!283 = !{!261}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !269, file: !165, line: 344, baseType: !282, size: 96, offset: 416)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !269, file: !165, line: 347, baseType: !58, size: 128, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !269, file: !165, line: 349, baseType: !22, size: 32, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !269, file: !165, line: 350, baseType: !22, size: 32, offset: 672)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !269, file: !165, line: 351, baseType: !56, size: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !269, file: !165, line: 352, baseType: !56, size: 64, offset: 768)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !269, file: !165, line: 354, baseType: !291, size: 384, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !165, line: 116, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !165, line: 94, size: 384, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !292, file: !165, line: 96, baseType: !22, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !292, file: !165, line: 96, baseType: !22, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !292, file: !165, line: 97, baseType: !22, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !292, file: !165, line: 97, baseType: !22, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !292, file: !165, line: 99, baseType: !48, size: 16, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !292, file: !165, line: 100, baseType: !48, size: 16, offset: 144)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !292, file: !165, line: 102, baseType: !48, size: 16, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !292, file: !165, line: 105, baseType: !48, size: 16, offset: 176)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !292, file: !165, line: 108, baseType: !48, size: 16, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !292, file: !165, line: 109, baseType: !48, size: 16, offset: 208)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !292, file: !165, line: 111, baseType: !48, size: 16, offset: 224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !292, file: !165, line: 112, baseType: !48, size: 16, offset: 240)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !292, file: !165, line: 114, baseType: !22, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !292, file: !165, line: 114, baseType: !22, size: 32, offset: 288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !292, file: !165, line: 115, baseType: !22, size: 32, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !292, file: !165, line: 115, baseType: !22, size: 32, offset: 352)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !269, file: !165, line: 355, baseType: !33, size: 512, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !231, line: 134, baseType: !56, size: 64, offset: 2368)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !230, file: !231, line: 136, baseType: !313, size: 64, offset: 2432)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !154, line: 61, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !230, file: !231, line: 138, baseType: !291, size: 384, offset: 2496)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !230, file: !231, line: 139, baseType: !317, size: 64, offset: 2880)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !165, line: 80, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !165, line: 72, size: 192, elements: !320)
!320 = !{!321, !328, !329, !330, !331}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !319, file: !165, line: 73, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !165, line: 59, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !165, line: 56, size: 128, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !324, file: !165, line: 57, baseType: !282, size: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !165, line: 58, baseType: !22, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !319, file: !165, line: 74, baseType: !22, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !319, file: !165, line: 76, baseType: !22, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !319, file: !165, line: 77, baseType: !22, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !319, file: !165, line: 79, baseType: !22, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !230, file: !231, line: 141, baseType: !58, size: 128, offset: 2944)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !230, file: !231, line: 142, baseType: !58, size: 128, offset: 3072)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !230, file: !231, line: 143, baseType: !58, size: 128, offset: 3200)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !230, file: !231, line: 144, baseType: !58, size: 128, offset: 3328)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !230, file: !231, line: 146, baseType: !22, size: 32, offset: 3456)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !230, file: !231, line: 147, baseType: !22, size: 32, offset: 3488)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !230, file: !231, line: 150, baseType: !339, size: 64, offset: 3520)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !342, line: 46, flags: DIFlagFwdDecl)
!342 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !230, file: !231, line: 151, baseType: !344, size: 64, offset: 3584)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !230, file: !231, line: 152, baseType: !22, size: 32, offset: 3648)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !230, file: !231, line: 153, baseType: !22, size: 32, offset: 3680)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !230, file: !231, line: 156, baseType: !282, size: 96, offset: 3712)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !230, file: !231, line: 156, baseType: !282, size: 96, offset: 3808)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !230, file: !231, line: 156, baseType: !282, size: 96, offset: 3904)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !230, file: !231, line: 157, baseType: !282, size: 96, offset: 4000)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !230, file: !231, line: 158, baseType: !282, size: 96, offset: 4096)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !230, file: !231, line: 159, baseType: !282, size: 96, offset: 4192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !230, file: !231, line: 160, baseType: !282, size: 96, offset: 4288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !230, file: !231, line: 160, baseType: !282, size: 96, offset: 4384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !230, file: !231, line: 161, baseType: !356, size: 128, offset: 4480)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 128, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 4)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !230, file: !231, line: 161, baseType: !356, size: 128, offset: 4608)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !230, file: !231, line: 162, baseType: !282, size: 96, offset: 4736)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !230, file: !231, line: 162, baseType: !282, size: 96, offset: 4832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !230, file: !231, line: 163, baseType: !204, size: 32, offset: 4928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !230, file: !231, line: 163, baseType: !204, size: 32, offset: 4960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !230, file: !231, line: 164, baseType: !365, size: 512, offset: 4992)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 512, elements: !366)
!366 = !{!358, !358}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !230, file: !231, line: 165, baseType: !365, size: 512, offset: 5504)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !230, file: !231, line: 166, baseType: !365, size: 512, offset: 6016)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !230, file: !231, line: 167, baseType: !365, size: 512, offset: 6528)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !230, file: !231, line: 176, baseType: !365, size: 512, offset: 7040)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !230, file: !231, line: 178, baseType: !278, size: 32, offset: 7552)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !230, file: !231, line: 180, baseType: !48, size: 16, offset: 7584)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !230, file: !231, line: 181, baseType: !48, size: 16, offset: 7600)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !230, file: !231, line: 183, baseType: !48, size: 16, offset: 7616)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !230, file: !231, line: 183, baseType: !48, size: 16, offset: 7632)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !230, file: !231, line: 184, baseType: !48, size: 16, offset: 7648)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !230, file: !231, line: 184, baseType: !48, size: 16, offset: 7664)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !230, file: !231, line: 185, baseType: !48, size: 16, offset: 7680)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !230, file: !231, line: 186, baseType: !48, size: 16, offset: 7696)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !230, file: !231, line: 187, baseType: !48, size: 16, offset: 7712)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !230, file: !231, line: 188, baseType: !14, size: 8, offset: 7728)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !230, file: !231, line: 189, baseType: !14, size: 8, offset: 7736)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !230, file: !231, line: 192, baseType: !22, size: 32, offset: 7744)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !230, file: !231, line: 192, baseType: !22, size: 32, offset: 7776)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !230, file: !231, line: 192, baseType: !22, size: 32, offset: 7808)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !230, file: !231, line: 192, baseType: !22, size: 32, offset: 7840)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !230, file: !231, line: 194, baseType: !22, size: 32, offset: 7872)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !230, file: !231, line: 202, baseType: !204, size: 32, offset: 7904)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !230, file: !231, line: 202, baseType: !204, size: 32, offset: 7936)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !230, file: !231, line: 202, baseType: !204, size: 32, offset: 7968)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !230, file: !231, line: 211, baseType: !204, size: 32, offset: 8000)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !230, file: !231, line: 212, baseType: !204, size: 32, offset: 8032)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !230, file: !231, line: 213, baseType: !204, size: 32, offset: 8064)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !230, file: !231, line: 214, baseType: !204, size: 32, offset: 8096)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !230, file: !231, line: 215, baseType: !204, size: 32, offset: 8128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !230, file: !231, line: 216, baseType: !204, size: 32, offset: 8160)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !230, file: !231, line: 219, baseType: !204, size: 32, offset: 8192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !230, file: !231, line: 220, baseType: !204, size: 32, offset: 8224)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !230, file: !231, line: 221, baseType: !204, size: 32, offset: 8256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !230, file: !231, line: 224, baseType: !401, size: 16, offset: 8288)
!401 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !230, file: !231, line: 224, baseType: !401, size: 16, offset: 8304)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !230, file: !231, line: 226, baseType: !48, size: 16, offset: 8320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !230, file: !231, line: 228, baseType: !14, size: 8, offset: 8336)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !230, file: !231, line: 229, baseType: !14, size: 8, offset: 8344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !230, file: !231, line: 231, baseType: !48, size: 16, offset: 8352)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !230, file: !231, line: 232, baseType: !14, size: 8, offset: 8368)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !230, file: !231, line: 233, baseType: !14, size: 8, offset: 8376)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !230, file: !231, line: 234, baseType: !204, size: 32, offset: 8384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !230, file: !231, line: 235, baseType: !204, size: 32, offset: 8416)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !230, file: !231, line: 237, baseType: !58, size: 128, offset: 8448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !230, file: !231, line: 238, baseType: !58, size: 128, offset: 8576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !230, file: !231, line: 239, baseType: !58, size: 128, offset: 8704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !230, file: !231, line: 240, baseType: !58, size: 128, offset: 8832)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !230, file: !231, line: 242, baseType: !204, size: 32, offset: 8960)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !230, file: !231, line: 244, baseType: !48, size: 16, offset: 8992)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !230, file: !231, line: 245, baseType: !401, size: 16, offset: 9008)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !230, file: !231, line: 246, baseType: !356, size: 128, offset: 9024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !230, file: !231, line: 248, baseType: !22, size: 32, offset: 9152)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !230, file: !231, line: 249, baseType: !22, size: 32, offset: 9184)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !230, file: !231, line: 251, baseType: !422, size: 64, offset: 9216)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !231, line: 251, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !230, file: !231, line: 253, baseType: !14, size: 8, offset: 9280)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !230, file: !231, line: 254, baseType: !14, size: 8, offset: 9288)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !230, file: !231, line: 255, baseType: !48, size: 16, offset: 9296)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !230, file: !231, line: 256, baseType: !282, size: 96, offset: 9312)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !230, file: !231, line: 258, baseType: !58, size: 128, offset: 9408)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !230, file: !231, line: 259, baseType: !58, size: 128, offset: 9536)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !230, file: !231, line: 260, baseType: !58, size: 128, offset: 9664)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !230, file: !231, line: 261, baseType: !58, size: 128, offset: 9792)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !230, file: !231, line: 263, baseType: !433, size: 64, offset: 9920)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !231, line: 52, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !230, file: !231, line: 264, baseType: !436, size: 64, offset: 9984)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !231, line: 53, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !230, file: !231, line: 265, baseType: !439, size: 64, offset: 10048)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !165, line: 46, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !230, file: !231, line: 267, baseType: !14, size: 8, offset: 10112)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !230, file: !231, line: 268, baseType: !14, size: 8, offset: 10120)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !230, file: !231, line: 269, baseType: !48, size: 16, offset: 10128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !230, file: !231, line: 270, baseType: !204, size: 32, offset: 10144)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !230, file: !231, line: 272, baseType: !446, size: 64, offset: 10176)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !231, line: 54, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !230, file: !231, line: 275, baseType: !449, size: 64, offset: 10240)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !231, line: 275, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !230, file: !231, line: 277, baseType: !452, size: 64, offset: 10304)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !231, line: 56, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !230, file: !231, line: 277, baseType: !452, size: 64, offset: 10368)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !230, file: !231, line: 278, baseType: !456, size: 64, offset: 10432)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !457, line: 27, baseType: !458)
!457 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !459, line: 45, baseType: !460)
!459 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!460 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !230, file: !231, line: 279, baseType: !456, size: 64, offset: 10496)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !230, file: !231, line: 280, baseType: !278, size: 32, offset: 10560)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !230, file: !231, line: 281, baseType: !278, size: 32, offset: 10592)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !230, file: !231, line: 283, baseType: !58, size: 128, offset: 10624)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !230, file: !231, line: 284, baseType: !58, size: 128, offset: 10752)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !230, file: !231, line: 285, baseType: !467, size: 64, offset: 10880)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !230, file: !231, line: 287, baseType: !469, size: 64, offset: 10944)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !231, line: 59, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !230, file: !231, line: 288, baseType: !472, size: 64, offset: 11008)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !231, line: 288, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !230, file: !231, line: 290, baseType: !475, size: 64, offset: 11072)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 2)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !230, file: !231, line: 291, baseType: !479, size: 64, offset: 11136)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !481, line: 65, baseType: !482)
!481 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !481, line: 50, size: 320, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !482, file: !481, line: 51, baseType: !152, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !482, file: !481, line: 53, baseType: !22, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !482, file: !481, line: 54, baseType: !22, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !482, file: !481, line: 55, baseType: !22, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !482, file: !481, line: 55, baseType: !22, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !482, file: !481, line: 56, baseType: !14, size: 8, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !482, file: !481, line: 56, baseType: !14, size: 8, offset: 200)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !482, file: !481, line: 57, baseType: !14, size: 8, offset: 208)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !482, file: !481, line: 57, baseType: !14, size: 8, offset: 216)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !482, file: !481, line: 59, baseType: !48, size: 16, offset: 224)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !482, file: !481, line: 59, baseType: !48, size: 16, offset: 240)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !482, file: !481, line: 59, baseType: !48, size: 16, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !482, file: !481, line: 61, baseType: !48, size: 16, offset: 272)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !482, file: !481, line: 63, baseType: !22, size: 32, offset: 288)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !230, file: !231, line: 293, baseType: !58, size: 128, offset: 11200)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !230, file: !231, line: 294, baseType: !500, size: 64, offset: 11328)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !231, line: 113, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !231, line: 108, size: 256, elements: !503)
!503 = !{!504, !506, !507, !508, !509}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !231, line: 109, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !502, file: !231, line: 109, baseType: !505, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !502, file: !231, line: 110, baseType: !229, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !502, file: !231, line: 111, baseType: !22, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !502, file: !231, line: 112, baseType: !204, size: 32, offset: 224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !153, file: !154, line: 1221, baseType: !511, size: 64, offset: 1088)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !154, line: 52, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !153, file: !154, line: 1223, baseType: !152, size: 64, offset: 1152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !153, file: !154, line: 1225, baseType: !58, size: 128, offset: 1216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !153, file: !154, line: 1226, baseType: !516, size: 64, offset: 1344)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !154, line: 69, size: 320, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !517, file: !154, line: 70, baseType: !516, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !517, file: !154, line: 70, baseType: !516, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !517, file: !154, line: 71, baseType: !278, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !517, file: !154, line: 71, baseType: !278, size: 32, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !517, file: !154, line: 72, baseType: !22, size: 32, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !517, file: !154, line: 73, baseType: !48, size: 16, offset: 224)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !517, file: !154, line: 73, baseType: !48, size: 16, offset: 240)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !517, file: !154, line: 74, baseType: !229, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !153, file: !154, line: 1227, baseType: !229, size: 64, offset: 1408)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !153, file: !154, line: 1229, baseType: !282, size: 96, offset: 1472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !153, file: !154, line: 1230, baseType: !282, size: 96, offset: 1568)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !153, file: !154, line: 1231, baseType: !282, size: 96, offset: 1664)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !153, file: !154, line: 1231, baseType: !282, size: 96, offset: 1760)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !153, file: !154, line: 1233, baseType: !278, size: 32, offset: 1856)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !153, file: !154, line: 1234, baseType: !22, size: 32, offset: 1888)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !153, file: !154, line: 1235, baseType: !278, size: 32, offset: 1920)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !154, line: 1237, baseType: !48, size: 16, offset: 1952)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !153, file: !154, line: 1239, baseType: !14, size: 8, offset: 1968)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !153, file: !154, line: 1240, baseType: !538, size: 8, offset: 1976)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 1)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !153, file: !154, line: 1242, baseType: !542, size: 64, offset: 1984)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !544, line: 328, size: 3456, elements: !545)
!544 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!545 = !{!546, !547, !548, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !579, !580, !581, !584, !589, !590, !593, !597, !601, !605, !609, !610, !611, !612}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !543, file: !544, line: 329, baseType: !112, size: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !543, file: !544, line: 330, baseType: !158, size: 64, offset: 960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !543, file: !544, line: 332, baseType: !549, size: 64, offset: 1024)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !551, line: 32, flags: DIFlagFwdDecl)
!551 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!552 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !543, file: !544, line: 333, baseType: !33, size: 512, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !543, file: !544, line: 335, baseType: !81, size: 64, offset: 1600)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !543, file: !544, line: 337, baseType: !313, size: 64, offset: 1664)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !543, file: !544, line: 338, baseType: !475, size: 64, offset: 1728)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !543, file: !544, line: 340, baseType: !58, size: 128, offset: 1792)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !543, file: !544, line: 340, baseType: !58, size: 128, offset: 1920)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !543, file: !544, line: 342, baseType: !22, size: 32, offset: 2048)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !543, file: !544, line: 342, baseType: !22, size: 32, offset: 2080)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !543, file: !544, line: 343, baseType: !22, size: 32, offset: 2112)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !543, file: !544, line: 345, baseType: !22, size: 32, offset: 2144)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !543, file: !544, line: 346, baseType: !22, size: 32, offset: 2176)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !543, file: !544, line: 347, baseType: !48, size: 16, offset: 2208)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !543, file: !544, line: 348, baseType: !48, size: 16, offset: 2224)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !543, file: !544, line: 349, baseType: !22, size: 32, offset: 2240)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !543, file: !544, line: 351, baseType: !22, size: 32, offset: 2272)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !543, file: !544, line: 353, baseType: !48, size: 16, offset: 2304)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !543, file: !544, line: 354, baseType: !48, size: 16, offset: 2320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !543, file: !544, line: 355, baseType: !22, size: 32, offset: 2336)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !543, file: !544, line: 357, baseType: !571, size: 128, offset: 2368)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !572, line: 95, baseType: !573)
!572 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !572, line: 92, size: 128, elements: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !573, file: !572, line: 93, baseType: !204, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !573, file: !572, line: 93, baseType: !204, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !573, file: !572, line: 94, baseType: !204, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !573, file: !572, line: 94, baseType: !204, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !543, file: !544, line: 363, baseType: !58, size: 128, offset: 2496)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !543, file: !544, line: 363, baseType: !58, size: 128, offset: 2624)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !543, file: !544, line: 368, baseType: !582, size: 64, offset: 2752)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !544, line: 48, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !543, file: !544, line: 372, baseType: !585, size: 32, offset: 2816)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !544, line: 274, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !544, line: 271, size: 32, elements: !587)
!587 = !{!588}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !586, file: !544, line: 273, baseType: !278, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !543, file: !544, line: 373, baseType: !22, size: 32, offset: 2848)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !543, file: !544, line: 382, baseType: !591, size: 64, offset: 2880)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !544, line: 46, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !543, file: !544, line: 385, baseType: !594, size: 64, offset: 2944)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !56, !204}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !543, file: !544, line: 386, baseType: !598, size: 64, offset: 3008)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !56, !344}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !543, file: !544, line: 387, baseType: !602, size: 64, offset: 3072)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!22, !56}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !543, file: !544, line: 388, baseType: !606, size: 64, offset: 3136)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !56}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !543, file: !544, line: 389, baseType: !56, size: 64, offset: 3200)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !543, file: !544, line: 389, baseType: !56, size: 64, offset: 3264)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !543, file: !544, line: 389, baseType: !56, size: 64, offset: 3328)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !543, file: !544, line: 389, baseType: !56, size: 64, offset: 3392)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !153, file: !154, line: 1244, baseType: !614, size: 64, offset: 2048)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !616, line: 200, size: 17024, elements: !617)
!616 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!617 = !{!618, !619, !620, !621, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !615, file: !616, line: 201, baseType: !467, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !615, file: !616, line: 202, baseType: !58, size: 128, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !615, file: !616, line: 203, baseType: !58, size: 128, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !615, file: !616, line: 206, baseType: !622, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !616, line: 190, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !616, line: 126, size: 2816, elements: !625)
!625 = !{!626, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !724, !725, !726, !727, !1005, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1033}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !624, file: !616, line: 127, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !624, file: !616, line: 127, baseType: !627, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !624, file: !616, line: 128, baseType: !56, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !624, file: !616, line: 129, baseType: !56, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !624, file: !616, line: 130, baseType: !33, size: 512, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !624, file: !616, line: 132, baseType: !22, size: 32, offset: 768)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !624, file: !616, line: 132, baseType: !22, size: 32, offset: 800)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !624, file: !616, line: 133, baseType: !22, size: 32, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !624, file: !616, line: 134, baseType: !22, size: 32, offset: 864)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !624, file: !616, line: 134, baseType: !22, size: 32, offset: 896)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !624, file: !616, line: 134, baseType: !22, size: 32, offset: 928)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !624, file: !616, line: 135, baseType: !22, size: 32, offset: 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !624, file: !616, line: 135, baseType: !22, size: 32, offset: 992)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !624, file: !616, line: 136, baseType: !22, size: 32, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !624, file: !616, line: 136, baseType: !22, size: 32, offset: 1056)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !624, file: !616, line: 137, baseType: !22, size: 32, offset: 1088)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !624, file: !616, line: 137, baseType: !22, size: 32, offset: 1120)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !624, file: !616, line: 138, baseType: !204, size: 32, offset: 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !624, file: !616, line: 139, baseType: !204, size: 32, offset: 1184)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !624, file: !616, line: 139, baseType: !204, size: 32, offset: 1216)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !624, file: !616, line: 141, baseType: !48, size: 16, offset: 1248)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !624, file: !616, line: 142, baseType: !48, size: 16, offset: 1264)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !624, file: !616, line: 143, baseType: !22, size: 32, offset: 1280)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !624, file: !616, line: 144, baseType: !22, size: 32, offset: 1312)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !624, file: !616, line: 146, baseType: !652, size: 64, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !616, line: 114, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !616, line: 99, size: 7232, elements: !655)
!655 = !{!656, !658, !659, !660, !661, !662, !663, !674, !678, !692, !701, !708, !718}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !616, line: 100, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !654, file: !616, line: 100, baseType: !657, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !654, file: !616, line: 101, baseType: !22, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !654, file: !616, line: 101, baseType: !22, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !654, file: !616, line: 102, baseType: !22, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !654, file: !616, line: 102, baseType: !22, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !654, file: !616, line: 103, baseType: !664, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !616, line: 59, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !616, line: 56, size: 2112, elements: !667)
!667 = !{!668, !672, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !666, file: !616, line: 57, baseType: !669, size: 2048)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !666, file: !616, line: 58, baseType: !22, size: 32, offset: 2048)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !666, file: !616, line: 58, baseType: !22, size: 32, offset: 2080)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !654, file: !616, line: 106, baseType: !675, size: 6144, offset: 320)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 6144, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !654, file: !616, line: 107, baseType: !679, size: 64, offset: 6464)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !616, line: 97, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !616, line: 83, size: 8320, elements: !682)
!682 = !{!683, !684, !685, !688, !689, !690, !691}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !681, file: !616, line: 84, baseType: !675, size: 6144)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !681, file: !616, line: 87, baseType: !669, size: 2048, offset: 6144)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !681, file: !616, line: 88, baseType: !686, size: 64, offset: 8192)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !481, line: 41, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !681, file: !616, line: 90, baseType: !48, size: 16, offset: 8256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !681, file: !616, line: 92, baseType: !48, size: 16, offset: 8272)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !681, file: !616, line: 93, baseType: !48, size: 16, offset: 8288)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !681, file: !616, line: 95, baseType: !48, size: 16, offset: 8304)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !654, file: !616, line: 108, baseType: !693, size: 64, offset: 6528)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !616, line: 66, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !616, line: 61, size: 128, elements: !696)
!696 = !{!697, !698, !699, !700}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !695, file: !616, line: 62, baseType: !22, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !695, file: !616, line: 63, baseType: !22, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !695, file: !616, line: 64, baseType: !22, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !695, file: !616, line: 65, baseType: !22, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !654, file: !616, line: 109, baseType: !702, size: 64, offset: 6592)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !616, line: 71, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !616, line: 68, size: 64, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !704, file: !616, line: 69, baseType: !22, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !704, file: !616, line: 70, baseType: !22, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !654, file: !616, line: 110, baseType: !709, size: 64, offset: 6656)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !616, line: 81, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !616, line: 73, size: 352, elements: !712)
!712 = !{!713, !714, !715, !716, !717}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !711, file: !616, line: 74, baseType: !282, size: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !711, file: !616, line: 75, baseType: !282, size: 96, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !711, file: !616, line: 76, baseType: !282, size: 96, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !711, file: !616, line: 77, baseType: !22, size: 32, offset: 288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !711, file: !616, line: 78, baseType: !22, size: 32, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !654, file: !616, line: 113, baseType: !719, size: 512, offset: 6720)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !720, line: 182, baseType: !721)
!720 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !720, line: 180, size: 512, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !721, file: !720, line: 181, baseType: !33, size: 512)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !624, file: !616, line: 148, baseType: !250, size: 64, offset: 1408)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !624, file: !616, line: 151, baseType: !152, size: 64, offset: 1472)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !624, file: !616, line: 152, baseType: !229, size: 64, offset: 1536)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !624, file: !616, line: 153, baseType: !728, size: 64, offset: 1600)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !730, line: 64, size: 19136, elements: !731)
!730 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!731 = !{!732, !733, !734, !735, !736, !737, !739, !740, !741, !742, !745, !746, !991, !992, !1000, !1001, !1002, !1003, !1004}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !729, file: !730, line: 65, baseType: !112, size: 960)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !729, file: !730, line: 66, baseType: !158, size: 64, offset: 960)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !729, file: !730, line: 68, baseType: !130, size: 8192, offset: 1024)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !729, file: !730, line: 70, baseType: !22, size: 32, offset: 9216)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !729, file: !730, line: 71, baseType: !22, size: 32, offset: 9248)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !729, file: !730, line: 72, baseType: !738, size: 64, offset: 9280)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !476)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !729, file: !730, line: 74, baseType: !204, size: 32, offset: 9344)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !729, file: !730, line: 74, baseType: !204, size: 32, offset: 9376)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !729, file: !730, line: 76, baseType: !686, size: 64, offset: 9408)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !729, file: !730, line: 77, baseType: !743, size: 64, offset: 9472)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !730, line: 77, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !729, file: !730, line: 78, baseType: !313, size: 64, offset: 9536)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !729, file: !730, line: 80, baseType: !747, size: 2624, offset: 9600)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !748, line: 340, size: 2624, elements: !749)
!748 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!749 = !{!750, !778, !796, !797, !798, !813, !871, !872, !971, !972, !973, !974, !980}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !747, file: !748, line: 341, baseType: !751, size: 576)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !748, line: 251, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !748, line: 207, size: 576, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !748, line: 208, baseType: !22, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !752, file: !748, line: 211, baseType: !48, size: 16, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !752, file: !748, line: 212, baseType: !48, size: 16, offset: 48)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !752, file: !748, line: 213, baseType: !204, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !752, file: !748, line: 214, baseType: !48, size: 16, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !752, file: !748, line: 215, baseType: !48, size: 16, offset: 112)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !752, file: !748, line: 216, baseType: !48, size: 16, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !752, file: !748, line: 217, baseType: !48, size: 16, offset: 144)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !752, file: !748, line: 218, baseType: !48, size: 16, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !752, file: !748, line: 219, baseType: !48, size: 16, offset: 176)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !752, file: !748, line: 220, baseType: !204, size: 32, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !752, file: !748, line: 222, baseType: !48, size: 16, offset: 224)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !752, file: !748, line: 225, baseType: !48, size: 16, offset: 240)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !752, file: !748, line: 228, baseType: !22, size: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !752, file: !748, line: 229, baseType: !22, size: 32, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !752, file: !748, line: 233, baseType: !22, size: 32, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !752, file: !748, line: 236, baseType: !48, size: 16, offset: 352)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !752, file: !748, line: 236, baseType: !48, size: 16, offset: 368)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !752, file: !748, line: 241, baseType: !204, size: 32, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !752, file: !748, line: 244, baseType: !22, size: 32, offset: 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !752, file: !748, line: 244, baseType: !22, size: 32, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !752, file: !748, line: 245, baseType: !204, size: 32, offset: 480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !752, file: !748, line: 248, baseType: !204, size: 32, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !752, file: !748, line: 250, baseType: !22, size: 32, offset: 544)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !747, file: !748, line: 342, baseType: !779, size: 448, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !748, line: 79, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !748, line: 61, size: 448, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !780, file: !748, line: 62, baseType: !56, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !780, file: !748, line: 64, baseType: !48, size: 16, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !780, file: !748, line: 65, baseType: !48, size: 16, offset: 80)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !780, file: !748, line: 67, baseType: !204, size: 32, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !780, file: !748, line: 68, baseType: !204, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !780, file: !748, line: 69, baseType: !204, size: 32, offset: 160)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !780, file: !748, line: 70, baseType: !48, size: 16, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !780, file: !748, line: 71, baseType: !48, size: 16, offset: 208)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !780, file: !748, line: 72, baseType: !475, size: 64, offset: 224)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !780, file: !748, line: 75, baseType: !204, size: 32, offset: 288)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !780, file: !748, line: 75, baseType: !204, size: 32, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !780, file: !748, line: 75, baseType: !204, size: 32, offset: 352)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !780, file: !748, line: 78, baseType: !204, size: 32, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !780, file: !748, line: 78, baseType: !204, size: 32, offset: 416)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !747, file: !748, line: 343, baseType: !58, size: 128, offset: 1024)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !747, file: !748, line: 344, baseType: !58, size: 128, offset: 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !747, file: !748, line: 345, baseType: !799, size: 192, offset: 1280)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !748, line: 278, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !748, line: 270, size: 192, elements: !801)
!801 = !{!802, !803, !804, !805, !806}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !800, file: !748, line: 271, baseType: !22, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !800, file: !748, line: 273, baseType: !204, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !800, file: !748, line: 275, baseType: !22, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !800, file: !748, line: 276, baseType: !22, size: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !800, file: !748, line: 277, baseType: !807, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !748, line: 55, size: 576, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !808, file: !748, line: 56, baseType: !22, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !808, file: !748, line: 57, baseType: !204, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !808, file: !748, line: 58, baseType: !365, size: 512, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !747, file: !748, line: 346, baseType: !814, size: 384, offset: 1472)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !748, line: 268, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !748, line: 253, size: 384, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !865, !866, !867, !868, !869, !870}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !815, file: !748, line: 254, baseType: !22, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !815, file: !748, line: 255, baseType: !22, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !815, file: !748, line: 255, baseType: !22, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !815, file: !748, line: 258, baseType: !204, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !815, file: !748, line: 259, baseType: !822, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
