; ModuleID = 'blender/source/blender/bmesh/operators/bmo_create.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_create.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !50, line: 33, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !56, line: 57, baseType: !5, size: 32, elements: !57)
!56 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!58 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80}
!74 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!81 = !{!82, !104, !91}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElemF", file: !43, line: 149, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElemF", file: !43, line: 143, size: 192, elements: !85)
!85 = !{!86, !98}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !84, file: !43, line: 144, baseType: !87, size: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !89)
!89 = !{!90, !92, !94, !96, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !43, line: 65, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !88, file: !43, line: 66, baseType: !93, size: 32, offset: 64)
!93 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !88, file: !43, line: 73, baseType: !95, size: 8, offset: 96)
!95 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !88, file: !43, line: 74, baseType: !95, size: 8, offset: 104)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !88, file: !43, line: 80, baseType: !95, size: 8, offset: 112)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !84, file: !43, line: 148, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !100, file: !43, line: 181, baseType: !103, size: 16)
!103 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!105 = !{i32 7, !"Dwarf Version", i32 4}
!106 = !{i32 2, !"Debug Info Version", i32 3}
!107 = !{i32 1, !"wchar_size", i32 4}
!108 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!109 = distinct !DISubprogram(name: "bmo_contextual_create_exec", scope: !1, file: !1, line: 44, type: !110, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !309)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !112, !307}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !129, !130, !131, !132, !185, !189, !193, !194, !195, !196, !197, !198, !199, !200, !251, !290, !291, !292, !293, !294, !295, !296, !297, !304, !305, !306}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !114, file: !43, line: 187, baseType: !93, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !114, file: !43, line: 187, baseType: !93, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !114, file: !43, line: 187, baseType: !93, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !114, file: !43, line: 187, baseType: !93, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !114, file: !43, line: 188, baseType: !93, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !114, file: !43, line: 188, baseType: !93, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !114, file: !43, line: 188, baseType: !93, size: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !114, file: !43, line: 193, baseType: !95, size: 8, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !114, file: !43, line: 197, baseType: !95, size: 8, offset: 232)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !114, file: !43, line: 201, baseType: !126, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !128, line: 71, flags: DIFlagFwdDecl)
!128 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!129 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !114, file: !43, line: 201, baseType: !126, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !114, file: !43, line: 201, baseType: !126, size: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !114, file: !43, line: 201, baseType: !126, size: 64, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !114, file: !43, line: 208, baseType: !133, size: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !137)
!137 = !{!138, !139, !140, !145, !146}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !136, file: !43, line: 91, baseType: !87, size: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !136, file: !43, line: 92, baseType: !99, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !136, file: !43, line: 94, baseType: !141, size: 96, offset: 192)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 96, elements: !143)
!142 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!143 = !{!144}
!144 = !DISubrange(count: 3)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !136, file: !43, line: 95, baseType: !141, size: 96, offset: 288)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !136, file: !43, line: 102, baseType: !147, size: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !149)
!149 = !{!150, !151, !152, !154, !155, !178, !184}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !148, file: !43, line: 111, baseType: !87, size: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !148, file: !43, line: 112, baseType: !99, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !148, file: !43, line: 114, baseType: !153, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !148, file: !43, line: 114, baseType: !153, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !148, file: !43, line: 118, baseType: !156, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !158)
!158 = !{!159, !160, !161, !162, !174, !175, !176, !177}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !157, file: !43, line: 126, baseType: !87, size: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !157, file: !43, line: 129, baseType: !153, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !157, file: !43, line: 130, baseType: !147, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !157, file: !43, line: 131, baseType: !163, size: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !165)
!165 = !{!166, !167, !168, !171, !172, !173}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !164, file: !43, line: 165, baseType: !87, size: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !164, file: !43, line: 166, baseType: !99, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !164, file: !43, line: 172, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !157)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !164, file: !43, line: 174, baseType: !93, size: 32, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !164, file: !43, line: 175, baseType: !141, size: 96, offset: 288)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !164, file: !43, line: 176, baseType: !103, size: 16, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !157, file: !43, line: 135, baseType: !156, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !157, file: !43, line: 135, baseType: !156, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !43, line: 139, baseType: !156, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !157, file: !43, line: 139, baseType: !156, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !148, file: !43, line: 122, baseType: !179, size: 128, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !180, file: !43, line: 107, baseType: !147, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !180, file: !43, line: 107, baseType: !147, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !148, file: !43, line: 122, baseType: !179, size: 128, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !114, file: !43, line: 209, baseType: !186, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !148)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !114, file: !43, line: 210, baseType: !190, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !164)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !114, file: !43, line: 213, baseType: !93, size: 32, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !114, file: !43, line: 214, baseType: !93, size: 32, offset: 736)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !114, file: !43, line: 215, baseType: !93, size: 32, offset: 768)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !114, file: !43, line: 218, baseType: !126, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !114, file: !43, line: 218, baseType: !126, size: 64, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !114, file: !43, line: 218, baseType: !126, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !114, file: !43, line: 220, baseType: !93, size: 32, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !114, file: !43, line: 221, baseType: !201, size: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !203)
!203 = !{!204, !239, !240, !244, !247, !248, !250}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !202, file: !4, line: 191, baseType: !205, size: 5120)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 5120, elements: !237)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !207)
!207 = !{!208, !211, !213, !223, !224}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !206, file: !4, line: 148, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !206, file: !4, line: 149, baseType: !212, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !206, file: !4, line: 150, baseType: !214, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !216)
!216 = !{!217, !219, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !215, file: !4, line: 139, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !215, file: !4, line: 140, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !215, file: !4, line: 141, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !206, file: !4, line: 152, baseType: !93, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !4, line: 162, baseType: !225, size: 128, offset: 192)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !206, file: !4, line: 155, size: 128, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !225, file: !4, line: 156, baseType: !93, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !225, file: !4, line: 157, baseType: !142, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !225, file: !4, line: 158, baseType: !91, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !225, file: !4, line: 159, baseType: !141, size: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !225, file: !4, line: 160, baseType: !104, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !225, file: !4, line: 161, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !235, line: 48, baseType: !236)
!235 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !235, line: 48, flags: DIFlagFwdDecl)
!237 = !{!238}
!238 = !DISubrange(count: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !202, file: !4, line: 192, baseType: !205, size: 5120, offset: 5120)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !202, file: !4, line: 193, baseType: !241, size: 64, offset: 10240)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !112, !201}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !202, file: !4, line: 194, baseType: !245, size: 64, offset: 10304)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !202, file: !4, line: 195, baseType: !93, size: 32, offset: 10368)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !202, file: !4, line: 196, baseType: !249, size: 32, offset: 10400)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !202, file: !4, line: 197, baseType: !93, size: 32, offset: 10432)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !114, file: !43, line: 223, baseType: !252, size: 1600, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !128, line: 73, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !128, line: 64, size: 1600, elements: !254)
!254 = !{!255, !273, !277, !278, !279, !280, !281}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !253, file: !128, line: 65, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !128, line: 53, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !128, line: 42, size: 832, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !272}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !128, line: 43, baseType: !93, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !258, file: !128, line: 44, baseType: !93, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !258, file: !128, line: 45, baseType: !93, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !258, file: !128, line: 46, baseType: !93, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !258, file: !128, line: 47, baseType: !93, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !258, file: !128, line: 48, baseType: !93, size: 32, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !258, file: !128, line: 49, baseType: !93, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !258, file: !128, line: 50, baseType: !93, size: 32, offset: 224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !258, file: !128, line: 51, baseType: !269, size: 512, offset: 256)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 512, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !128, line: 52, baseType: !91, size: 64, offset: 768)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !253, file: !128, line: 66, baseType: !274, size: 1312, offset: 64)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 1312, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 41)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !253, file: !128, line: 69, baseType: !93, size: 32, offset: 1376)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !253, file: !128, line: 69, baseType: !93, size: 32, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !253, file: !128, line: 70, baseType: !93, size: 32, offset: 1440)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !253, file: !128, line: 71, baseType: !126, size: 64, offset: 1472)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !253, file: !128, line: 72, baseType: !282, size: 64, offset: 1536)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !128, line: 59, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !128, line: 57, size: 8192, elements: !285)
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !284, file: !128, line: 58, baseType: !287, size: 8192)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 8192, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !114, file: !43, line: 223, baseType: !252, size: 1600, offset: 2752)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !114, file: !43, line: 223, baseType: !252, size: 1600, offset: 4352)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !114, file: !43, line: 223, baseType: !252, size: 1600, offset: 5952)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !114, file: !43, line: 233, baseType: !103, size: 16, offset: 7552)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !114, file: !43, line: 236, baseType: !93, size: 32, offset: 7584)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !114, file: !43, line: 238, baseType: !93, size: 32, offset: 7616)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !114, file: !43, line: 238, baseType: !93, size: 32, offset: 7648)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !114, file: !43, line: 239, baseType: !298, size: 128, offset: 7680)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !299, line: 71, baseType: !300)
!299 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !299, line: 69, size: 128, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !300, file: !299, line: 70, baseType: !91, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !300, file: !299, line: 70, baseType: !91, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !114, file: !43, line: 241, baseType: !191, size: 64, offset: 7808)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !114, file: !43, line: 243, baseType: !298, size: 128, offset: 7872)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !114, file: !43, line: 245, baseType: !91, size: 64, offset: 8000)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !202)
!309 = !{}
!310 = !DILocalVariable(name: "bm", arg: 1, scope: !109, file: !1, line: 44, type: !112)
!311 = !DILocation(line: 44, column: 40, scope: !109)
!312 = !DILocalVariable(name: "op", arg: 2, scope: !109, file: !1, line: 44, type: !307)
!313 = !DILocation(line: 44, column: 56, scope: !109)
!314 = !DILocalVariable(name: "oiter", scope: !109, file: !1, line: 46, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !317)
!317 = !{!318, !321, !322, !331, !332}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !316, file: !4, line: 458, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !206)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !316, file: !4, line: 459, baseType: !93, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !316, file: !4, line: 460, baseType: !323, size: 192, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !235, line: 54, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !235, line: 50, size: 192, elements: !325)
!325 = !{!326, !327, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !324, file: !235, line: 51, baseType: !233, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !324, file: !235, line: 52, baseType: !328, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !235, line: 52, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !324, file: !235, line: 53, baseType: !5, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !316, file: !4, line: 461, baseType: !104, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !316, file: !4, line: 462, baseType: !95, size: 8, offset: 384)
!333 = !DILocation(line: 46, column: 10, scope: !109)
!334 = !DILocalVariable(name: "h", scope: !109, file: !1, line: 47, type: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!336 = !DILocation(line: 47, column: 12, scope: !109)
!337 = !DILocalVariable(name: "totv", scope: !109, file: !1, line: 48, type: !93)
!338 = !DILocation(line: 48, column: 6, scope: !109)
!339 = !DILocalVariable(name: "tote", scope: !109, file: !1, line: 48, type: !93)
!340 = !DILocation(line: 48, column: 16, scope: !109)
!341 = !DILocalVariable(name: "totf", scope: !109, file: !1, line: 48, type: !93)
!342 = !DILocation(line: 48, column: 26, scope: !109)
!343 = !DILocalVariable(name: "mat_nr", scope: !109, file: !1, line: 49, type: !344)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!345 = !DILocation(line: 49, column: 14, scope: !109)
!346 = !DILocation(line: 49, column: 44, scope: !109)
!347 = !DILocation(line: 49, column: 48, scope: !109)
!348 = !DILocation(line: 49, column: 27, scope: !109)
!349 = !DILocalVariable(name: "use_smooth", scope: !109, file: !1, line: 50, type: !350)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!351 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!352 = !DILocation(line: 50, column: 13, scope: !109)
!353 = !DILocation(line: 50, column: 45, scope: !109)
!354 = !DILocation(line: 50, column: 49, scope: !109)
!355 = !DILocation(line: 50, column: 27, scope: !109)
!356 = !DILocation(line: 53, column: 2, scope: !357)
!357 = distinct !DILexicalBlock(scope: !109, file: !1, line: 53, column: 2)
!358 = !DILocation(line: 53, column: 2, scope: !359)
!359 = distinct !DILexicalBlock(scope: !357, file: !1, line: 53, column: 2)
!360 = !DILocation(line: 54, column: 11, scope: !361)
!361 = distinct !DILexicalBlock(scope: !359, file: !1, line: 53, column: 74)
!362 = !DILocation(line: 54, column: 14, scope: !361)
!363 = !DILocation(line: 54, column: 3, scope: !361)
!364 = !DILocation(line: 55, column: 22, scope: !365)
!365 = distinct !DILexicalBlock(scope: !361, file: !1, line: 54, column: 21)
!366 = !DILocation(line: 55, column: 26, scope: !365)
!367 = !DILocation(line: 56, column: 22, scope: !365)
!368 = !DILocation(line: 56, column: 26, scope: !365)
!369 = !DILocation(line: 57, column: 22, scope: !365)
!370 = !DILocation(line: 57, column: 26, scope: !365)
!371 = !DILocation(line: 60, column: 3, scope: !361)
!372 = !DILocation(line: 61, column: 2, scope: !361)
!373 = distinct !{!373, !356, !374}
!374 = !DILocation(line: 61, column: 2, scope: !357)
!375 = !DILocation(line: 66, column: 6, scope: !376)
!376 = distinct !DILexicalBlock(scope: !109, file: !1, line: 66, column: 6)
!377 = !DILocation(line: 66, column: 11, scope: !376)
!378 = !DILocation(line: 66, column: 16, scope: !376)
!379 = !DILocation(line: 66, column: 19, scope: !376)
!380 = !DILocation(line: 66, column: 24, scope: !376)
!381 = !DILocation(line: 66, column: 29, scope: !376)
!382 = !DILocation(line: 66, column: 32, scope: !376)
!383 = !DILocation(line: 66, column: 37, scope: !376)
!384 = !DILocation(line: 66, column: 6, scope: !109)
!385 = !DILocalVariable(name: "verts", scope: !386, file: !1, line: 67, type: !387)
!386 = distinct !DILexicalBlock(scope: !376, file: !1, line: 66, column: 43)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 128, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 2)
!390 = !DILocation(line: 67, column: 11, scope: !386)
!391 = !DILocalVariable(name: "e", scope: !386, file: !1, line: 68, type: !187)
!392 = !DILocation(line: 68, column: 11, scope: !386)
!393 = !DILocation(line: 70, column: 21, scope: !386)
!394 = !DILocation(line: 70, column: 25, scope: !386)
!395 = !DILocation(line: 70, column: 61, scope: !386)
!396 = !DILocation(line: 70, column: 52, scope: !386)
!397 = !DILocation(line: 70, column: 3, scope: !386)
