; ModuleID = 'blender/source/blender/bmesh/operators/bmo_unsubdivide.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_unsubdivide.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!11 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!12 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!14 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !4, line: 116, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !43, line: 57, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!45 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!50 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 260, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65, !66, !67, !68}
!62 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!69 = !{!70, !80, !138, !139, !143, !71, !147, !149, !122, !84}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !60, line: 103, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !60, line: 90, size: 448, elements: !74)
!74 = !{!75, !87, !93, !98, !99}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !73, file: !60, line: 91, baseType: !76, size: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !60, line: 82, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !60, line: 64, size: 128, elements: !78)
!78 = !{!79, !81, !83, !85, !86}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !60, line: 65, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !77, file: !60, line: 66, baseType: !82, size: 32, offset: 64)
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !77, file: !60, line: 73, baseType: !84, size: 8, offset: 96)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !77, file: !60, line: 74, baseType: !84, size: 8, offset: 104)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !77, file: !60, line: 80, baseType: !84, size: 8, offset: 112)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !73, file: !60, line: 92, baseType: !88, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !60, line: 180, size: 16, elements: !90)
!90 = !{!91}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !89, file: !60, line: 181, baseType: !92, size: 16)
!92 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !73, file: !60, line: 94, baseType: !94, size: 96, offset: 192)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 96, elements: !96)
!95 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!96 = !{!97}
!97 = !DISubrange(count: 3)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !73, file: !60, line: 95, baseType: !94, size: 96, offset: 288)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !73, file: !60, line: 102, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !60, line: 110, size: 640, elements: !102)
!102 = !{!103, !104, !105, !107, !108, !131, !137}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !101, file: !60, line: 111, baseType: !76, size: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !101, file: !60, line: 112, baseType: !88, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !101, file: !60, line: 114, baseType: !106, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !101, file: !60, line: 114, baseType: !106, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !101, file: !60, line: 118, baseType: !109, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !60, line: 125, size: 576, elements: !111)
!111 = !{!112, !113, !114, !115, !127, !128, !129, !130}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !110, file: !60, line: 126, baseType: !76, size: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !110, file: !60, line: 129, baseType: !106, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !110, file: !60, line: 130, baseType: !100, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !110, file: !60, line: 131, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !60, line: 164, size: 448, elements: !118)
!118 = !{!119, !120, !121, !124, !125, !126}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !117, file: !60, line: 165, baseType: !76, size: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !117, file: !60, line: 166, baseType: !88, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !117, file: !60, line: 172, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !60, line: 140, baseType: !110)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !117, file: !60, line: 174, baseType: !82, size: 32, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !117, file: !60, line: 175, baseType: !94, size: 96, offset: 288)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !117, file: !60, line: 176, baseType: !92, size: 16, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !110, file: !60, line: 135, baseType: !109, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !110, file: !60, line: 135, baseType: !109, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !60, line: 139, baseType: !109, size: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !60, line: 139, baseType: !109, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !101, file: !60, line: 122, baseType: !132, size: 128, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !60, line: 108, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !60, line: 106, size: 128, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !60, line: 107, baseType: !100, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !133, file: !60, line: 107, baseType: !100, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !101, file: !60, line: 122, baseType: !132, size: 128, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !43, line: 79, baseType: !42)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !43, line: 158, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !80}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !43, line: 159, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!80, !80}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !60, line: 123, baseType: !101)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !60, line: 178, baseType: !117)
!151 = !{i32 7, !"Dwarf Version", i32 4}
!152 = !{i32 2, !"Debug Info Version", i32 3}
!153 = !{i32 1, !"wchar_size", i32 4}
!154 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!155 = distinct !DISubprogram(name: "bmo_unsubdivide_exec", scope: !1, file: !1, line: 41, type: !156, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !300)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !158, !298}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !60, line: 246, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !60, line: 186, size: 8064, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !175, !176, !177, !178, !179, !181, !183, !184, !185, !186, !187, !188, !189, !190, !242, !281, !282, !283, !284, !285, !286, !287, !288, !295, !296, !297}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !160, file: !60, line: 187, baseType: !82, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !160, file: !60, line: 187, baseType: !82, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !160, file: !60, line: 187, baseType: !82, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !160, file: !60, line: 187, baseType: !82, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !160, file: !60, line: 188, baseType: !82, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !160, file: !60, line: 188, baseType: !82, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !160, file: !60, line: 188, baseType: !82, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !160, file: !60, line: 193, baseType: !84, size: 8, offset: 224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !160, file: !60, line: 197, baseType: !84, size: 8, offset: 232)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !160, file: !60, line: 201, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !174, line: 71, flags: DIFlagFwdDecl)
!174 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!175 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !160, file: !60, line: 201, baseType: !172, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !160, file: !60, line: 201, baseType: !172, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !160, file: !60, line: 201, baseType: !172, size: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !160, file: !60, line: 208, baseType: !70, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !160, file: !60, line: 209, baseType: !180, size: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !160, file: !60, line: 210, baseType: !182, size: 64, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !160, file: !60, line: 213, baseType: !82, size: 32, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !160, file: !60, line: 214, baseType: !82, size: 32, offset: 736)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !160, file: !60, line: 215, baseType: !82, size: 32, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !160, file: !60, line: 218, baseType: !172, size: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !160, file: !60, line: 218, baseType: !172, size: 64, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !160, file: !60, line: 218, baseType: !172, size: 64, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !160, file: !60, line: 220, baseType: !82, size: 32, offset: 1024)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !160, file: !60, line: 221, baseType: !191, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !193)
!193 = !{!194, !230, !231, !235, !238, !239, !241}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !192, file: !4, line: 191, baseType: !195, size: 5120)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 5120, elements: !228)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !197)
!197 = !{!198, !201, !203, !213, !214}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !196, file: !4, line: 148, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !196, file: !4, line: 149, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !196, file: !4, line: 150, baseType: !204, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !206)
!206 = !{!207, !209, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !205, file: !4, line: 139, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !205, file: !4, line: 140, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !205, file: !4, line: 141, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !196, file: !4, line: 152, baseType: !82, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !4, line: 162, baseType: !215, size: 128, offset: 192)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !196, file: !4, line: 155, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !215, file: !4, line: 156, baseType: !82, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !215, file: !4, line: 157, baseType: !95, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !215, file: !4, line: 158, baseType: !80, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !215, file: !4, line: 159, baseType: !94, size: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !215, file: !4, line: 160, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !215, file: !4, line: 161, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !226, line: 48, baseType: !227)
!226 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !226, line: 48, flags: DIFlagFwdDecl)
!228 = !{!229}
!229 = !DISubrange(count: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !192, file: !4, line: 192, baseType: !195, size: 5120, offset: 5120)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !192, file: !4, line: 193, baseType: !232, size: 64, offset: 10240)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !158, !191}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !192, file: !4, line: 194, baseType: !236, size: 64, offset: 10304)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !4, line: 195, baseType: !82, size: 32, offset: 10368)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !192, file: !4, line: 196, baseType: !240, size: 32, offset: 10400)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !4, line: 197, baseType: !82, size: 32, offset: 10432)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !160, file: !60, line: 223, baseType: !243, size: 1600, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !174, line: 73, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !174, line: 64, size: 1600, elements: !245)
!245 = !{!246, !264, !268, !269, !270, !271, !272}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !244, file: !174, line: 65, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !174, line: 53, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !174, line: 42, size: 832, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !263}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !249, file: !174, line: 43, baseType: !82, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !249, file: !174, line: 44, baseType: !82, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !249, file: !174, line: 45, baseType: !82, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !249, file: !174, line: 46, baseType: !82, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !249, file: !174, line: 47, baseType: !82, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !249, file: !174, line: 48, baseType: !82, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !249, file: !174, line: 49, baseType: !82, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !249, file: !174, line: 50, baseType: !82, size: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !249, file: !174, line: 51, baseType: !260, size: 512, offset: 256)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !249, file: !174, line: 52, baseType: !80, size: 64, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !244, file: !174, line: 66, baseType: !265, size: 1312, offset: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 1312, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 41)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !244, file: !174, line: 69, baseType: !82, size: 32, offset: 1376)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !244, file: !174, line: 69, baseType: !82, size: 32, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !244, file: !174, line: 70, baseType: !82, size: 32, offset: 1440)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !244, file: !174, line: 71, baseType: !172, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !244, file: !174, line: 72, baseType: !273, size: 64, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !174, line: 59, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !174, line: 57, size: 8192, elements: !276)
!276 = !{!277}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !275, file: !174, line: 58, baseType: !278, size: 8192)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 1024)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !160, file: !60, line: 223, baseType: !243, size: 1600, offset: 2752)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !160, file: !60, line: 223, baseType: !243, size: 1600, offset: 4352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !160, file: !60, line: 223, baseType: !243, size: 1600, offset: 5952)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !160, file: !60, line: 233, baseType: !92, size: 16, offset: 7552)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !160, file: !60, line: 236, baseType: !82, size: 32, offset: 7584)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !160, file: !60, line: 238, baseType: !82, size: 32, offset: 7616)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !160, file: !60, line: 238, baseType: !82, size: 32, offset: 7648)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !160, file: !60, line: 239, baseType: !289, size: 128, offset: 7680)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !290, line: 71, baseType: !291)
!290 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !290, line: 69, size: 128, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !291, file: !290, line: 70, baseType: !80, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !291, file: !290, line: 70, baseType: !80, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !160, file: !60, line: 241, baseType: !149, size: 64, offset: 7808)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !160, file: !60, line: 243, baseType: !289, size: 128, offset: 7872)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !160, file: !60, line: 245, baseType: !80, size: 64, offset: 8000)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !192)
!300 = !{}
!301 = !DILocalVariable(name: "bm", arg: 1, scope: !155, file: !1, line: 41, type: !158)
!302 = !DILocation(line: 41, column: 34, scope: !155)
!303 = !DILocalVariable(name: "op", arg: 2, scope: !155, file: !1, line: 41, type: !298)
!304 = !DILocation(line: 41, column: 50, scope: !155)
!305 = !DILocalVariable(name: "v", scope: !155, file: !1, line: 43, type: !71)
!306 = !DILocation(line: 43, column: 10, scope: !155)
!307 = !DILocalVariable(name: "iter", scope: !155, file: !1, line: 44, type: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !43, line: 186, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !43, line: 164, size: 512, elements: !310)
!310 = !{!311, !391, !392, !393, !394}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !43, line: 179, baseType: !312, size: 320)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !43, line: 166, size: 320, elements: !313)
!313 = !{!314, !329, !335, !343, !351, !357, !363, !369, !373, !379, !385}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !312, file: !43, line: 167, baseType: !315, size: 192)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !43, line: 113, size: 192, elements: !316)
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !315, file: !43, line: 114, baseType: !318, size: 192)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !319, line: 80, baseType: !320)
!319 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !319, line: 76, size: 192, elements: !321)
!321 = !{!322, !325, !328}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !320, file: !319, line: 77, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !319, line: 47, baseType: !173)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !320, file: !319, line: 78, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !319, line: 45, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !320, file: !319, line: 79, baseType: !5, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !312, file: !43, line: 169, baseType: !330, size: 192)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !43, line: 116, size: 192, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !330, file: !43, line: 117, baseType: !71, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !330, file: !43, line: 118, baseType: !147, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !330, file: !43, line: 118, baseType: !147, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !312, file: !43, line: 170, baseType: !336, size: 320)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !43, line: 120, size: 320, elements: !337)
!337 = !{!338, !339, !340, !341, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !336, file: !43, line: 121, baseType: !71, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !336, file: !43, line: 122, baseType: !122, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !336, file: !43, line: 122, baseType: !122, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !336, file: !43, line: 123, baseType: !147, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !336, file: !43, line: 123, baseType: !147, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !312, file: !43, line: 171, baseType: !344, size: 320)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !43, line: 125, size: 320, elements: !345)
!345 = !{!346, !347, !348, !349, !350}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !344, file: !43, line: 126, baseType: !71, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !344, file: !43, line: 127, baseType: !122, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !344, file: !43, line: 127, baseType: !122, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !344, file: !43, line: 128, baseType: !147, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !344, file: !43, line: 128, baseType: !147, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !312, file: !43, line: 172, baseType: !352, size: 192)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !43, line: 130, size: 192, elements: !353)
!353 = !{!354, !355, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !352, file: !43, line: 131, baseType: !147, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !352, file: !43, line: 132, baseType: !122, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !352, file: !43, line: 132, baseType: !122, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !312, file: !43, line: 173, baseType: !358, size: 192)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !43, line: 134, size: 192, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !358, file: !43, line: 135, baseType: !122, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !358, file: !43, line: 136, baseType: !122, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !358, file: !43, line: 136, baseType: !122, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !312, file: !43, line: 174, baseType: !364, size: 192)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !43, line: 138, size: 192, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !364, file: !43, line: 139, baseType: !147, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !364, file: !43, line: 140, baseType: !122, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !364, file: !43, line: 140, baseType: !122, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !312, file: !43, line: 175, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !43, line: 142, size: 64, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !370, file: !43, line: 143, baseType: !147, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !312, file: !43, line: 176, baseType: !374, size: 192)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !43, line: 145, size: 192, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !374, file: !43, line: 146, baseType: !149, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !374, file: !43, line: 147, baseType: !122, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !374, file: !43, line: 147, baseType: !122, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !312, file: !43, line: 177, baseType: !380, size: 192)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !43, line: 149, size: 192, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !380, file: !43, line: 150, baseType: !149, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !380, file: !43, line: 151, baseType: !122, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !380, file: !43, line: 151, baseType: !122, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !312, file: !43, line: 178, baseType: !386, size: 192)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !43, line: 153, size: 192, elements: !387)
!387 = !{!388, !389, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !386, file: !43, line: 154, baseType: !149, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !386, file: !43, line: 155, baseType: !122, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !386, file: !43, line: 155, baseType: !122, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !309, file: !43, line: 181, baseType: !139, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !309, file: !43, line: 182, baseType: !143, size: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !309, file: !43, line: 184, baseType: !82, size: 32, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !309, file: !43, line: 185, baseType: !84, size: 8, offset: 480)
!395 = !DILocation(line: 44, column: 9, scope: !155)
!396 = !DILocalVariable(name: "iterations", scope: !155, file: !1, line: 46, type: !397)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!398 = !DILocation(line: 46, column: 12, scope: !155)
!399 = !DILocation(line: 46, column: 52, scope: !155)
!400 = !DILocation(line: 46, column: 56, scope: !155)
!401 = !DILocation(line: 46, column: 35, scope: !155)
!402 = !DILocation(line: 46, column: 25, scope: !155)
!403 = !DILocalVariable(name: "vinput", scope: !155, file: !1, line: 48, type: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !196)
!406 = !DILocation(line: 48, column: 12, scope: !155)
!407 = !DILocation(line: 48, column: 34, scope: !155)
!408 = !DILocation(line: 48, column: 38, scope: !155)
!409 = !DILocation(line: 48, column: 21, scope: !155)
!410 = !DILocalVariable(name: "vinput_arr", scope: !155, file: !1, line: 49, type: !70)
!411 = !DILocation(line: 49, column: 11, scope: !155)
!412 = !DILocation(line: 49, column: 35, scope: !155)
!413 = !DILocation(line: 49, column: 43, scope: !155)
!414 = !DILocation(line: 49, column: 48, scope: !155)
!415 = !DILocation(line: 49, column: 24, scope: !155)
!416 = !DILocalVariable(name: "v_index", scope: !155, file: !1, line: 50, type: !82)
!417 = !DILocation(line: 50, column: 6, scope: !155)
!418 = !DILocation(line: 53, column: 2, scope: !419)
!419 = distinct !DILexicalBlock(scope: !155, file: !1, line: 53, column: 2)
!420 = !DILocation(line: 53, column: 2, scope: !421)
!421 = distinct !DILexicalBlock(scope: !419, file: !1, line: 53, column: 2)
!422 = !DILocation(line: 54, column: 3, scope: !423)
!423 = distinct !DILexicalBlock(scope: !421, file: !1, line: 53, column: 48)
!424 = !DILocation(line: 55, column: 2, scope: !423)
!425 = distinct !{!425, !418, !426}
!426 = !DILocation(line: 55, column: 2, scope: !419)
!427 = !DILocation(line: 56, column: 15, scope: !428)
!428 = distinct !DILexicalBlock(scope: !155, file: !1, line: 56, column: 2)
!429 = !DILocation(line: 56, column: 7, scope: !428)
!430 = !DILocation(line: 56, column: 20, scope: !431)
!431 = distinct !DILexicalBlock(scope: !428, file: !1, line: 56, column: 2)
!432 = !DILocation(line: 56, column: 30, scope: !431)
!433 = !DILocation(line: 56, column: 38, scope: !431)
!434 = !DILocation(line: 56, column: 28, scope: !431)
!435 = !DILocation(line: 56, column: 2, scope: !428)
!436 = !DILocation(line: 57, column: 7, scope: !437)
!437 = distinct !DILexicalBlock(scope: !431, file: !1, line: 56, column: 54)
!438 = !DILocation(line: 57, column: 18, scope: !437)
!439 = !DILocation(line: 57, column: 5, scope: !437)
!440 = !DILocation(line: 58, column: 3, scope: !437)
!441 = !DILocation(line: 59, column: 2, scope: !437)
!442 = !DILocation(line: 56, column: 50, scope: !431)
!443 = !DILocation(line: 56, column: 2, scope: !431)
!444 = distinct !{!444, !435, !445}
!445 = !DILocation(line: 59, column: 2, scope: !428)
!446 = !DILocation(line: 62, column: 34, scope: !155)
!447 = !DILocation(line: 62, column: 38, scope: !155)
!448 = !DILocation(line: 62, column: 2, scope: !155)
!449 = !DILocation(line: 63, column: 1, scope: !155)
!450 = distinct !DISubprogram(name: "max_ii", scope: !451, file: !451, line: 215, type: !452, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !300)
!451 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_base_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!452 = !DISubroutineType(types: !453)
!453 = !{!82, !82, !82}
!454 = !DILocalVariable(name: "a", arg: 1, scope: !450, file: !451, line: 215, type: !82)
!455 = !DILocation(line: 215, column: 24, scope: !450)
