; ModuleID = 'blender/source/blender/render/intern/source/volume_precache.c'
source_filename = "blender/source/blender/render/intern/source/volume_precache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/source/volume_precache.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TaskPriority", file: !4, line: 70, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenlib/BLI_task.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "TASK_PRIORITY_LOW", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "TASK_PRIORITY_HIGH", value: 1, isUnsigned: true)
!9 = !{!10, !11, !12, !20, !19, !111}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "VolPrecacheState", file: !1, line: 497, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolPrecacheState", file: !1, line: 494, size: 128, elements: !15)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "lasttime", scope: !14, file: !1, line: 495, baseType: !17, size: 64)
!17 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "totparts", scope: !14, file: !1, line: 496, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "VolPrecachePart", file: !22, line: 511, baseType: !23)
!22 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolPrecachePart", file: !22, line: 497, size: 1408, elements: !24)
!24 = !{!25, !27, !28, !132, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !22, line: 498, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !23, file: !22, line: 498, baseType: !26, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !23, file: !22, line: 499, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayObject", file: !31, line: 118, size: 192, elements: !32)
!31 = !DIFile(filename: "blender/source/blender/render/intern/include/../raytrace/rayobject_internal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!32 = !{!33, !123}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !30, file: !31, line: 119, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayObjectAPI", file: !31, line: 131, size: 448, elements: !36)
!36 = !{!37, !94, !99, !104, !106, !112, !117}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "raycast", scope: !35, file: !31, line: 132, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_raycast_callback", file: !31, line: 123, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!19, !42, !45}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "RayObject", file: !44, line: 50, baseType: !30)
!44 = !DIFile(filename: "blender/source/blender/render/intern/include/rayobject.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Isect", file: !47, line: 60, size: 1408, elements: !48)
!47 = !DIFile(filename: "blender/source/blender/render/intern/include/rayintersection.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!48 = !{!49, !53, !54, !55, !56, !57, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !75, !76, !77}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !46, file: !47, line: 63, baseType: !50, size: 96)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 96, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 3)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !46, file: !47, line: 64, baseType: !50, size: 96, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !46, file: !47, line: 65, baseType: !11, size: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "origstart", scope: !46, file: !47, line: 68, baseType: !50, size: 96, offset: 224)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "origdir", scope: !46, file: !47, line: 69, baseType: !50, size: 96, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "bv_index", scope: !46, file: !47, line: 72, baseType: !58, size: 192, offset: 416)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 6)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "idot_axis", scope: !46, file: !47, line: 73, baseType: !50, size: 96, offset: 608)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !46, file: !47, line: 76, baseType: !19, size: 32, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !46, file: !47, line: 77, baseType: !19, size: 32, offset: 736)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !46, file: !47, line: 78, baseType: !19, size: 32, offset: 768)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !46, file: !47, line: 79, baseType: !19, size: 32, offset: 800)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !46, file: !47, line: 80, baseType: !10, size: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !46, file: !47, line: 83, baseType: !11, size: 32, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !46, file: !47, line: 83, baseType: !11, size: 32, offset: 928)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "isect", scope: !46, file: !47, line: 84, baseType: !19, size: 32, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !46, file: !47, line: 89, baseType: !71, size: 128, offset: 1024)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !47, line: 86, size: 128, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !71, file: !47, line: 87, baseType: !10, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !71, file: !47, line: 88, baseType: !10, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !46, file: !47, line: 89, baseType: !71, size: 128, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "last_hit", scope: !46, file: !47, line: 92, baseType: !29, size: 64, offset: 1280)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "hint", scope: !46, file: !47, line: 98, baseType: !78, size: 64, offset: 1344)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "RayHint", file: !47, line: 56, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayHint", file: !47, line: 54, size: 16448, elements: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !80, file: !47, line: 55, baseType: !83, size: 16448)
!83 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !47, line: 55, size: 16448, elements: !84)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "lcts", scope: !83, file: !47, line: 55, baseType: !86, size: 16448)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "LCTSHint", file: !47, line: 52, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LCTSHint", file: !47, line: 49, size: 16448, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !87, file: !47, line: 50, baseType: !19, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !87, file: !47, line: 51, baseType: !91, size: 16384, offset: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 16384, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !35, file: !31, line: 133, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_add_callback", file: !31, line: 124, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !42, !42}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !35, file: !31, line: 134, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_done_callback", file: !31, line: 125, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !42}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !35, file: !31, line: 135, baseType: !105, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_free_callback", file: !31, line: 126, baseType: !101)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !35, file: !31, line: 136, baseType: !107, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_merge_bb_callback", file: !31, line: 127, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !42, !111, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !35, file: !31, line: 137, baseType: !113, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_cost_callback", file: !31, line: 128, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!11, !42}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "hint_bb", scope: !35, file: !31, line: 138, baseType: !118, size: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobject_hint_bb_callback", file: !31, line: 129, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !42, !122, !111, !111}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !30, file: !31, line: 120, baseType: !124, size: 128, offset: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayObjectControl", file: !31, line: 51, size: 128, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !124, file: !31, line: 52, baseType: !10, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !124, file: !31, line: 53, baseType: !128, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "RE_rayobjectcontrol_test_break_callback", file: !31, line: 49, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!19, !10}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "shi", scope: !23, file: !22, line: 500, baseType: !133, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShadeInput", file: !135, line: 98, size: 11776, elements: !136)
!135 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_shader_ext.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !{!137, !1802, !1825, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2147, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !134, file: !135, line: 102, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !140, line: 93, size: 7552, elements: !141)
!140 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!141 = !{!142, !212, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !261, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !330, !331, !332, !333, !334, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1801}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !140, line: 94, baseType: !143, size: 960)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !144, line: 130, baseType: !145)
!144 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !144, line: 117, size: 960, elements: !146)
!146 = !{!147, !148, !149, !151, !171, !175, !177, !178, !179, !180}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !144, line: 118, baseType: !10, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !145, file: !144, line: 118, baseType: !10, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !145, file: !144, line: 119, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !145, file: !144, line: 120, baseType: !152, size: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !144, line: 136, size: 17600, elements: !154)
!154 = !{!155, !156, !158, !161, !166, !167, !168}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !144, line: 137, baseType: !143, size: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !153, file: !144, line: 138, baseType: !157, size: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !153, file: !144, line: 139, baseType: !159, size: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !144, line: 43, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !144, line: 140, baseType: !162, size: 8192, offset: 1088)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 8192, elements: !164)
!163 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!164 = !{!165}
!165 = !DISubrange(count: 1024)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !153, file: !144, line: 141, baseType: !162, size: 8192, offset: 9280)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !153, file: !144, line: 148, baseType: !152, size: 64, offset: 17472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !153, file: !144, line: 150, baseType: !169, size: 64, offset: 17536)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !144, line: 45, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !144, line: 121, baseType: !172, size: 528, offset: 256)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 528, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 66)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !144, line: 126, baseType: !176, size: 16, offset: 784)
!176 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !145, file: !144, line: 127, baseType: !19, size: 32, offset: 800)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !145, file: !144, line: 128, baseType: !19, size: 32, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !145, file: !144, line: 128, baseType: !19, size: 32, offset: 864)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !145, file: !144, line: 129, baseType: !181, size: 64, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !144, line: 75, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !144, line: 62, size: 1024, elements: !184)
!184 = !{!185, !187, !188, !189, !190, !191, !195, !196, !210, !211}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !183, file: !144, line: 63, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !183, file: !144, line: 63, baseType: !186, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !183, file: !144, line: 64, baseType: !163, size: 8, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !183, file: !144, line: 64, baseType: !163, size: 8, offset: 136)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !183, file: !144, line: 65, baseType: !176, size: 16, offset: 144)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !144, line: 66, baseType: !192, size: 512, offset: 160)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 512, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !183, file: !144, line: 67, baseType: !19, size: 32, offset: 672)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !144, line: 69, baseType: !197, size: 256, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !144, line: 60, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !144, line: 48, size: 256, elements: !199)
!199 = !{!200, !201, !208, !209}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !198, file: !144, line: 49, baseType: !10, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !198, file: !144, line: 58, baseType: !202, size: 128, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !203, line: 71, baseType: !204)
!203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !203, line: 69, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !204, file: !203, line: 70, baseType: !10, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !204, file: !203, line: 70, baseType: !10, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !198, file: !144, line: 59, baseType: !19, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !198, file: !144, line: 59, baseType: !19, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !183, file: !144, line: 70, baseType: !19, size: 32, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !183, file: !144, line: 74, baseType: !19, size: 32, offset: 992)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !139, file: !140, line: 95, baseType: !213, size: 64, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !140, line: 48, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !139, file: !140, line: 97, baseType: !176, size: 16, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !139, file: !140, line: 97, baseType: !176, size: 16, offset: 1040)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !139, file: !140, line: 99, baseType: !11, size: 32, offset: 1056)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !139, file: !140, line: 99, baseType: !11, size: 32, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !139, file: !140, line: 99, baseType: !11, size: 32, offset: 1120)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !139, file: !140, line: 100, baseType: !11, size: 32, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !139, file: !140, line: 100, baseType: !11, size: 32, offset: 1184)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !139, file: !140, line: 100, baseType: !11, size: 32, offset: 1216)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !139, file: !140, line: 101, baseType: !11, size: 32, offset: 1248)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !139, file: !140, line: 101, baseType: !11, size: 32, offset: 1280)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !139, file: !140, line: 101, baseType: !11, size: 32, offset: 1312)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !139, file: !140, line: 102, baseType: !11, size: 32, offset: 1344)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !139, file: !140, line: 102, baseType: !11, size: 32, offset: 1376)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !139, file: !140, line: 102, baseType: !11, size: 32, offset: 1408)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !139, file: !140, line: 103, baseType: !11, size: 32, offset: 1440)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !139, file: !140, line: 103, baseType: !11, size: 32, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !139, file: !140, line: 103, baseType: !11, size: 32, offset: 1504)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !139, file: !140, line: 103, baseType: !11, size: 32, offset: 1536)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !139, file: !140, line: 103, baseType: !11, size: 32, offset: 1568)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !139, file: !140, line: 104, baseType: !11, size: 32, offset: 1600)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !139, file: !140, line: 104, baseType: !11, size: 32, offset: 1632)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !139, file: !140, line: 104, baseType: !11, size: 32, offset: 1664)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !139, file: !140, line: 104, baseType: !11, size: 32, offset: 1696)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !139, file: !140, line: 104, baseType: !11, size: 32, offset: 1728)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !139, file: !140, line: 105, baseType: !11, size: 32, offset: 1760)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !139, file: !140, line: 108, baseType: !241, size: 704, offset: 1792)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !140, line: 53, size: 704, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !241, file: !140, line: 54, baseType: !11, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !241, file: !140, line: 55, baseType: !11, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !241, file: !140, line: 56, baseType: !11, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !241, file: !140, line: 57, baseType: !11, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !241, file: !140, line: 59, baseType: !50, size: 96, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !241, file: !140, line: 60, baseType: !50, size: 96, offset: 224)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !241, file: !140, line: 61, baseType: !50, size: 96, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !241, file: !140, line: 63, baseType: !11, size: 32, offset: 416)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !241, file: !140, line: 64, baseType: !11, size: 32, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !241, file: !140, line: 65, baseType: !11, size: 32, offset: 480)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !241, file: !140, line: 67, baseType: !176, size: 16, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !241, file: !140, line: 68, baseType: !176, size: 16, offset: 528)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !241, file: !140, line: 69, baseType: !176, size: 16, offset: 544)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !241, file: !140, line: 70, baseType: !176, size: 16, offset: 560)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !241, file: !140, line: 72, baseType: !11, size: 32, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !241, file: !140, line: 73, baseType: !11, size: 32, offset: 608)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !241, file: !140, line: 74, baseType: !11, size: 32, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !241, file: !140, line: 75, baseType: !11, size: 32, offset: 672)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !139, file: !140, line: 109, baseType: !262, size: 128, offset: 2496)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !140, line: 79, size: 128, elements: !263)
!263 = !{!264, !265, !266, !267}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !262, file: !140, line: 80, baseType: !19, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !262, file: !140, line: 81, baseType: !19, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !262, file: !140, line: 82, baseType: !19, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !262, file: !140, line: 83, baseType: !19, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !139, file: !140, line: 111, baseType: !11, size: 32, offset: 2624)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !139, file: !140, line: 111, baseType: !11, size: 32, offset: 2656)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !139, file: !140, line: 112, baseType: !11, size: 32, offset: 2688)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !139, file: !140, line: 112, baseType: !11, size: 32, offset: 2720)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !139, file: !140, line: 113, baseType: !11, size: 32, offset: 2752)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !139, file: !140, line: 114, baseType: !11, size: 32, offset: 2784)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !139, file: !140, line: 114, baseType: !11, size: 32, offset: 2816)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !139, file: !140, line: 115, baseType: !176, size: 16, offset: 2848)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !139, file: !140, line: 115, baseType: !176, size: 16, offset: 2864)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !139, file: !140, line: 116, baseType: !176, size: 16, offset: 2880)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !139, file: !140, line: 117, baseType: !163, size: 8, offset: 2896)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !139, file: !140, line: 117, baseType: !163, size: 8, offset: 2904)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !139, file: !140, line: 119, baseType: !11, size: 32, offset: 2912)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !139, file: !140, line: 119, baseType: !11, size: 32, offset: 2944)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !139, file: !140, line: 120, baseType: !176, size: 16, offset: 2976)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !139, file: !140, line: 120, baseType: !176, size: 16, offset: 2992)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !139, file: !140, line: 121, baseType: !11, size: 32, offset: 3008)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !139, file: !140, line: 121, baseType: !11, size: 32, offset: 3040)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !139, file: !140, line: 122, baseType: !11, size: 32, offset: 3072)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !139, file: !140, line: 123, baseType: !11, size: 32, offset: 3104)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !139, file: !140, line: 124, baseType: !176, size: 16, offset: 3136)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !139, file: !140, line: 125, baseType: !176, size: 16, offset: 3152)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !139, file: !140, line: 127, baseType: !19, size: 32, offset: 3168)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !139, file: !140, line: 127, baseType: !19, size: 32, offset: 3200)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !139, file: !140, line: 128, baseType: !19, size: 32, offset: 3232)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !139, file: !140, line: 128, baseType: !19, size: 32, offset: 3264)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !139, file: !140, line: 129, baseType: !176, size: 16, offset: 3296)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !139, file: !140, line: 129, baseType: !176, size: 16, offset: 3312)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !139, file: !140, line: 129, baseType: !176, size: 16, offset: 3328)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !139, file: !140, line: 129, baseType: !176, size: 16, offset: 3344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !139, file: !140, line: 130, baseType: !11, size: 32, offset: 3360)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !139, file: !140, line: 130, baseType: !11, size: 32, offset: 3392)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !139, file: !140, line: 130, baseType: !11, size: 32, offset: 3424)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !139, file: !140, line: 130, baseType: !11, size: 32, offset: 3456)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !139, file: !140, line: 131, baseType: !11, size: 32, offset: 3488)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !139, file: !140, line: 131, baseType: !11, size: 32, offset: 3520)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !139, file: !140, line: 131, baseType: !11, size: 32, offset: 3552)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !139, file: !140, line: 131, baseType: !11, size: 32, offset: 3584)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !139, file: !140, line: 132, baseType: !11, size: 32, offset: 3616)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !139, file: !140, line: 132, baseType: !11, size: 32, offset: 3648)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !139, file: !140, line: 133, baseType: !192, size: 512, offset: 3680)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !139, file: !140, line: 135, baseType: !11, size: 32, offset: 4192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !139, file: !140, line: 136, baseType: !11, size: 32, offset: 4224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !139, file: !140, line: 137, baseType: !11, size: 32, offset: 4256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !139, file: !140, line: 138, baseType: !19, size: 32, offset: 4288)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !139, file: !140, line: 141, baseType: !163, size: 8, offset: 4320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !139, file: !140, line: 141, baseType: !163, size: 8, offset: 4328)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !139, file: !140, line: 141, baseType: !163, size: 8, offset: 4336)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !139, file: !140, line: 141, baseType: !163, size: 8, offset: 4344)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !139, file: !140, line: 142, baseType: !176, size: 16, offset: 4352)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !139, file: !140, line: 142, baseType: !176, size: 16, offset: 4368)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !139, file: !140, line: 142, baseType: !176, size: 16, offset: 4384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !139, file: !140, line: 145, baseType: !163, size: 8, offset: 4400)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !139, file: !140, line: 145, baseType: !163, size: 8, offset: 4408)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !139, file: !140, line: 148, baseType: !176, size: 16, offset: 4416)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !139, file: !140, line: 148, baseType: !176, size: 16, offset: 4432)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !139, file: !140, line: 149, baseType: !11, size: 32, offset: 4448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !139, file: !140, line: 149, baseType: !11, size: 32, offset: 4480)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !139, file: !140, line: 152, baseType: !327, size: 128, offset: 4512)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 128, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 4)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !139, file: !140, line: 153, baseType: !11, size: 32, offset: 4640)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !139, file: !140, line: 154, baseType: !11, size: 32, offset: 4672)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !139, file: !140, line: 157, baseType: !176, size: 16, offset: 4704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !139, file: !140, line: 157, baseType: !176, size: 16, offset: 4720)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !139, file: !140, line: 160, baseType: !335, size: 64, offset: 4736)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !337, line: 113, size: 6208, elements: !338)
!337 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!338 = !{!339, !340, !341, !342, !343, !344, !348}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !336, file: !337, line: 114, baseType: !176, size: 16)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !336, file: !337, line: 114, baseType: !176, size: 16, offset: 16)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !336, file: !337, line: 115, baseType: !163, size: 8, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !336, file: !337, line: 115, baseType: !163, size: 8, offset: 40)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !336, file: !337, line: 116, baseType: !163, size: 8, offset: 48)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !336, file: !337, line: 117, baseType: !345, size: 8, offset: 56)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 8, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !337, line: 119, baseType: !349, size: 6144, offset: 64)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 6144, elements: !359)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !337, line: 109, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !337, line: 106, size: 192, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !351, file: !337, line: 107, baseType: !11, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !351, file: !337, line: 107, baseType: !11, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !351, file: !337, line: 107, baseType: !11, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !351, file: !337, line: 107, baseType: !11, size: 32, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !351, file: !337, line: 107, baseType: !11, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !351, file: !337, line: 108, baseType: !19, size: 32, offset: 160)
!359 = !{!360}
!360 = !DISubrange(count: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !139, file: !140, line: 161, baseType: !335, size: 64, offset: 4800)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !139, file: !140, line: 162, baseType: !163, size: 8, offset: 4864)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !139, file: !140, line: 162, baseType: !163, size: 8, offset: 4872)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !139, file: !140, line: 163, baseType: !163, size: 8, offset: 4880)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !139, file: !140, line: 163, baseType: !163, size: 8, offset: 4888)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !139, file: !140, line: 164, baseType: !176, size: 16, offset: 4896)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !139, file: !140, line: 164, baseType: !176, size: 16, offset: 4912)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !139, file: !140, line: 165, baseType: !11, size: 32, offset: 4928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !139, file: !140, line: 165, baseType: !11, size: 32, offset: 4960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !139, file: !140, line: 167, baseType: !371, size: 1152, offset: 4992)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 1152, elements: !1759)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !337, line: 57, size: 2496, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !1554, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !373, file: !337, line: 59, baseType: !176, size: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !373, file: !337, line: 59, baseType: !176, size: 16, offset: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !373, file: !337, line: 59, baseType: !176, size: 16, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !373, file: !337, line: 59, baseType: !176, size: 16, offset: 48)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !373, file: !337, line: 60, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !382, line: 115, size: 11392, elements: !383)
!382 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!383 = !{!384, !385, !386, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !403, !413, !427, !428, !469, !470, !474, !475, !491, !492, !493, !494, !495, !496, !497, !499, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !577, !578, !579, !580, !581, !582, !583, !584, !585, !588, !591, !594, !595, !596, !597, !598, !601, !604, !607, !608, !614, !615, !616, !617, !618, !619, !621, !624, !627, !631, !1542, !1543}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !381, file: !382, line: 116, baseType: !143, size: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !381, file: !382, line: 117, baseType: !213, size: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !381, file: !382, line: 119, baseType: !387, size: 64, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !382, line: 57, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !382, line: 121, baseType: !176, size: 16, offset: 1088)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !381, file: !382, line: 121, baseType: !176, size: 16, offset: 1104)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !381, file: !382, line: 122, baseType: !19, size: 32, offset: 1120)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !381, file: !382, line: 122, baseType: !19, size: 32, offset: 1152)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !381, file: !382, line: 122, baseType: !19, size: 32, offset: 1184)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !381, file: !382, line: 123, baseType: !192, size: 512, offset: 1216)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !381, file: !382, line: 124, baseType: !380, size: 64, offset: 1728)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !381, file: !382, line: 124, baseType: !380, size: 64, offset: 1792)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !381, file: !382, line: 127, baseType: !380, size: 64, offset: 1856)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !381, file: !382, line: 127, baseType: !380, size: 64, offset: 1920)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !381, file: !382, line: 127, baseType: !380, size: 64, offset: 1984)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !381, file: !382, line: 128, baseType: !401, size: 64, offset: 2048)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !140, line: 49, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !381, file: !382, line: 130, baseType: !404, size: 64, offset: 2112)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !382, line: 97, size: 832, elements: !406)
!406 = !{!407, !411, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !405, file: !382, line: 98, baseType: !408, size: 768)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 768, elements: !409)
!409 = !{!410, !52}
!410 = !DISubrange(count: 8)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !405, file: !382, line: 99, baseType: !19, size: 32, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !405, file: !382, line: 99, baseType: !19, size: 32, offset: 800)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !381, file: !382, line: 131, baseType: !414, size: 64, offset: 2176)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !416, line: 486, size: 1600, elements: !417)
!416 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !415, file: !416, line: 487, baseType: !143, size: 960)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !415, file: !416, line: 489, baseType: !202, size: 128, offset: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !415, file: !416, line: 490, baseType: !202, size: 128, offset: 1088)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !415, file: !416, line: 491, baseType: !202, size: 128, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !415, file: !416, line: 492, baseType: !202, size: 128, offset: 1344)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !416, line: 494, baseType: !19, size: 32, offset: 1472)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !415, file: !416, line: 495, baseType: !19, size: 32, offset: 1504)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !415, file: !416, line: 497, baseType: !19, size: 32, offset: 1536)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !415, file: !416, line: 498, baseType: !19, size: 32, offset: 1568)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !381, file: !382, line: 132, baseType: !414, size: 64, offset: 2240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !381, file: !382, line: 133, baseType: !429, size: 64, offset: 2304)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !416, line: 334, size: 1728, elements: !431)
!431 = !{!432, !433, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !468}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !430, file: !416, line: 335, baseType: !202, size: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !430, file: !416, line: 336, baseType: !434, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !416, line: 47, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !430, file: !416, line: 338, baseType: !176, size: 16, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !430, file: !416, line: 338, baseType: !176, size: 16, offset: 208)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !430, file: !416, line: 339, baseType: !5, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !430, file: !416, line: 340, baseType: !19, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !430, file: !416, line: 342, baseType: !11, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !430, file: !416, line: 343, baseType: !50, size: 96, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !430, file: !416, line: 344, baseType: !50, size: 96, offset: 416)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !430, file: !416, line: 347, baseType: !202, size: 128, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !430, file: !416, line: 349, baseType: !19, size: 32, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !430, file: !416, line: 350, baseType: !19, size: 32, offset: 672)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !430, file: !416, line: 351, baseType: !10, size: 64, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !430, file: !416, line: 352, baseType: !10, size: 64, offset: 768)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !430, file: !416, line: 354, baseType: !449, size: 384, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !416, line: 116, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !416, line: 94, size: 384, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !450, file: !416, line: 96, baseType: !19, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !450, file: !416, line: 96, baseType: !19, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !450, file: !416, line: 97, baseType: !19, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !450, file: !416, line: 97, baseType: !19, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !450, file: !416, line: 99, baseType: !176, size: 16, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !450, file: !416, line: 100, baseType: !176, size: 16, offset: 144)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !450, file: !416, line: 102, baseType: !176, size: 16, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !450, file: !416, line: 105, baseType: !176, size: 16, offset: 176)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !450, file: !416, line: 108, baseType: !176, size: 16, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !450, file: !416, line: 109, baseType: !176, size: 16, offset: 208)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !450, file: !416, line: 111, baseType: !176, size: 16, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !450, file: !416, line: 112, baseType: !176, size: 16, offset: 240)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !450, file: !416, line: 114, baseType: !19, size: 32, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !450, file: !416, line: 114, baseType: !19, size: 32, offset: 288)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !450, file: !416, line: 115, baseType: !19, size: 32, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !450, file: !416, line: 115, baseType: !19, size: 32, offset: 352)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !430, file: !416, line: 355, baseType: !192, size: 512, offset: 1216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !381, file: !382, line: 134, baseType: !10, size: 64, offset: 2368)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !381, file: !382, line: 136, baseType: !471, size: 64, offset: 2432)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !473, line: 61, flags: DIFlagFwdDecl)
!473 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!474 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !381, file: !382, line: 138, baseType: !449, size: 384, offset: 2496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !381, file: !382, line: 139, baseType: !476, size: 64, offset: 2880)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !416, line: 80, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !416, line: 72, size: 192, elements: !479)
!479 = !{!480, !487, !488, !489, !490}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !478, file: !416, line: 73, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !416, line: 59, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !416, line: 56, size: 128, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !483, file: !416, line: 57, baseType: !50, size: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !416, line: 58, baseType: !19, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !478, file: !416, line: 74, baseType: !19, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !478, file: !416, line: 76, baseType: !19, size: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !478, file: !416, line: 77, baseType: !19, size: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !478, file: !416, line: 79, baseType: !19, size: 32, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !381, file: !382, line: 141, baseType: !202, size: 128, offset: 2944)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !381, file: !382, line: 142, baseType: !202, size: 128, offset: 3072)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !381, file: !382, line: 143, baseType: !202, size: 128, offset: 3200)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !381, file: !382, line: 144, baseType: !202, size: 128, offset: 3328)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !381, file: !382, line: 146, baseType: !19, size: 32, offset: 3456)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !381, file: !382, line: 147, baseType: !19, size: 32, offset: 3488)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !381, file: !382, line: 150, baseType: !498, size: 64, offset: 3520)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !381, file: !382, line: 151, baseType: !500, size: 64, offset: 3584)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !381, file: !382, line: 152, baseType: !19, size: 32, offset: 3648)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !381, file: !382, line: 153, baseType: !19, size: 32, offset: 3680)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !381, file: !382, line: 156, baseType: !50, size: 96, offset: 3712)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !381, file: !382, line: 156, baseType: !50, size: 96, offset: 3808)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !381, file: !382, line: 156, baseType: !50, size: 96, offset: 3904)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !381, file: !382, line: 157, baseType: !50, size: 96, offset: 4000)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !381, file: !382, line: 158, baseType: !50, size: 96, offset: 4096)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !381, file: !382, line: 159, baseType: !50, size: 96, offset: 4192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !381, file: !382, line: 160, baseType: !50, size: 96, offset: 4288)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !381, file: !382, line: 160, baseType: !50, size: 96, offset: 4384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !381, file: !382, line: 161, baseType: !327, size: 128, offset: 4480)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !381, file: !382, line: 161, baseType: !327, size: 128, offset: 4608)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !381, file: !382, line: 162, baseType: !50, size: 96, offset: 4736)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !381, file: !382, line: 162, baseType: !50, size: 96, offset: 4832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !381, file: !382, line: 163, baseType: !11, size: 32, offset: 4928)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !381, file: !382, line: 163, baseType: !11, size: 32, offset: 4960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !381, file: !382, line: 164, baseType: !518, size: 512, offset: 4992)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, elements: !519)
!519 = !{!329, !329}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !381, file: !382, line: 165, baseType: !518, size: 512, offset: 5504)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !381, file: !382, line: 166, baseType: !518, size: 512, offset: 6016)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !381, file: !382, line: 167, baseType: !518, size: 512, offset: 6528)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !381, file: !382, line: 176, baseType: !518, size: 512, offset: 7040)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !381, file: !382, line: 178, baseType: !5, size: 32, offset: 7552)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !381, file: !382, line: 180, baseType: !176, size: 16, offset: 7584)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !381, file: !382, line: 181, baseType: !176, size: 16, offset: 7600)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !381, file: !382, line: 183, baseType: !176, size: 16, offset: 7616)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !381, file: !382, line: 183, baseType: !176, size: 16, offset: 7632)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !381, file: !382, line: 184, baseType: !176, size: 16, offset: 7648)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !381, file: !382, line: 184, baseType: !176, size: 16, offset: 7664)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !381, file: !382, line: 185, baseType: !176, size: 16, offset: 7680)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !381, file: !382, line: 186, baseType: !176, size: 16, offset: 7696)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !381, file: !382, line: 187, baseType: !176, size: 16, offset: 7712)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !381, file: !382, line: 188, baseType: !163, size: 8, offset: 7728)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !381, file: !382, line: 189, baseType: !163, size: 8, offset: 7736)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !381, file: !382, line: 192, baseType: !19, size: 32, offset: 7744)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !381, file: !382, line: 192, baseType: !19, size: 32, offset: 7776)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !381, file: !382, line: 192, baseType: !19, size: 32, offset: 7808)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !381, file: !382, line: 192, baseType: !19, size: 32, offset: 7840)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !381, file: !382, line: 194, baseType: !19, size: 32, offset: 7872)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !381, file: !382, line: 202, baseType: !11, size: 32, offset: 7904)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !381, file: !382, line: 202, baseType: !11, size: 32, offset: 7936)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !381, file: !382, line: 202, baseType: !11, size: 32, offset: 7968)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !381, file: !382, line: 211, baseType: !11, size: 32, offset: 8000)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !381, file: !382, line: 212, baseType: !11, size: 32, offset: 8032)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !381, file: !382, line: 213, baseType: !11, size: 32, offset: 8064)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !381, file: !382, line: 214, baseType: !11, size: 32, offset: 8096)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !381, file: !382, line: 215, baseType: !11, size: 32, offset: 8128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !381, file: !382, line: 216, baseType: !11, size: 32, offset: 8160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !381, file: !382, line: 219, baseType: !11, size: 32, offset: 8192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !381, file: !382, line: 220, baseType: !11, size: 32, offset: 8224)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !381, file: !382, line: 221, baseType: !11, size: 32, offset: 8256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !381, file: !382, line: 224, baseType: !554, size: 16, offset: 8288)
!554 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !381, file: !382, line: 224, baseType: !554, size: 16, offset: 8304)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !381, file: !382, line: 226, baseType: !176, size: 16, offset: 8320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !381, file: !382, line: 228, baseType: !163, size: 8, offset: 8336)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !381, file: !382, line: 229, baseType: !163, size: 8, offset: 8344)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !381, file: !382, line: 231, baseType: !176, size: 16, offset: 8352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !381, file: !382, line: 232, baseType: !163, size: 8, offset: 8368)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !381, file: !382, line: 233, baseType: !163, size: 8, offset: 8376)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !381, file: !382, line: 234, baseType: !11, size: 32, offset: 8384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !381, file: !382, line: 235, baseType: !11, size: 32, offset: 8416)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !381, file: !382, line: 237, baseType: !202, size: 128, offset: 8448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !381, file: !382, line: 238, baseType: !202, size: 128, offset: 8576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !381, file: !382, line: 239, baseType: !202, size: 128, offset: 8704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !381, file: !382, line: 240, baseType: !202, size: 128, offset: 8832)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !381, file: !382, line: 242, baseType: !11, size: 32, offset: 8960)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !381, file: !382, line: 244, baseType: !176, size: 16, offset: 8992)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !381, file: !382, line: 245, baseType: !554, size: 16, offset: 9008)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !381, file: !382, line: 246, baseType: !327, size: 128, offset: 9024)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !381, file: !382, line: 248, baseType: !19, size: 32, offset: 9152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !381, file: !382, line: 249, baseType: !19, size: 32, offset: 9184)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !381, file: !382, line: 251, baseType: !575, size: 64, offset: 9216)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !382, line: 251, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !381, file: !382, line: 253, baseType: !163, size: 8, offset: 9280)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !381, file: !382, line: 254, baseType: !163, size: 8, offset: 9288)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !381, file: !382, line: 255, baseType: !176, size: 16, offset: 9296)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !381, file: !382, line: 256, baseType: !50, size: 96, offset: 9312)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !381, file: !382, line: 258, baseType: !202, size: 128, offset: 9408)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !381, file: !382, line: 259, baseType: !202, size: 128, offset: 9536)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !381, file: !382, line: 260, baseType: !202, size: 128, offset: 9664)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !381, file: !382, line: 261, baseType: !202, size: 128, offset: 9792)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !381, file: !382, line: 263, baseType: !586, size: 64, offset: 9920)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !382, line: 52, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !381, file: !382, line: 264, baseType: !589, size: 64, offset: 9984)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !382, line: 53, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !381, file: !382, line: 265, baseType: !592, size: 64, offset: 10048)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !135, line: 179, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !381, file: !382, line: 267, baseType: !163, size: 8, offset: 10112)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !381, file: !382, line: 268, baseType: !163, size: 8, offset: 10120)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !381, file: !382, line: 269, baseType: !176, size: 16, offset: 10128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !381, file: !382, line: 270, baseType: !11, size: 32, offset: 10144)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !381, file: !382, line: 272, baseType: !599, size: 64, offset: 10176)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !382, line: 54, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !381, file: !382, line: 275, baseType: !602, size: 64, offset: 10240)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !382, line: 275, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !381, file: !382, line: 277, baseType: !605, size: 64, offset: 10304)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !382, line: 56, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !381, file: !382, line: 277, baseType: !605, size: 64, offset: 10368)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !381, file: !382, line: 278, baseType: !609, size: 64, offset: 10432)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !610, line: 27, baseType: !611)
!610 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !612, line: 45, baseType: !613)
!612 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!613 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !381, file: !382, line: 279, baseType: !609, size: 64, offset: 10496)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !381, file: !382, line: 280, baseType: !5, size: 32, offset: 10560)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !381, file: !382, line: 281, baseType: !5, size: 32, offset: 10592)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !381, file: !382, line: 283, baseType: !202, size: 128, offset: 10624)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !381, file: !382, line: 284, baseType: !202, size: 128, offset: 10752)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !381, file: !382, line: 285, baseType: !620, size: 64, offset: 10880)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !381, file: !382, line: 287, baseType: !622, size: 64, offset: 10944)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !382, line: 59, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !381, file: !382, line: 288, baseType: !625, size: 64, offset: 11008)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !382, line: 288, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !381, file: !382, line: 290, baseType: !628, size: 64, offset: 11072)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 2)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !381, file: !382, line: 291, baseType: !632, size: 64, offset: 11136)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !634, line: 65, baseType: !635)
!634 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !634, line: 50, size: 320, elements: !636)
!636 = !{!637, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !635, file: !634, line: 51, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !473, line: 1216, size: 39680, elements: !640)
!640 = !{!641, !642, !643, !644, !743, !744, !745, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !772, !1111, !1114, !1402, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1424, !1425, !1426, !1427, !1428, !1436, !1503, !1510, !1511, !1518, !1521, !1522, !1523, !1524, !1525, !1526}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !639, file: !473, line: 1217, baseType: !143, size: 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !639, file: !473, line: 1218, baseType: !213, size: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !639, file: !473, line: 1220, baseType: !380, size: 64, offset: 1024)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !639, file: !473, line: 1221, baseType: !645, size: 64, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !647, line: 52, size: 4224, elements: !648)
!647 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !724, !740}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !646, file: !647, line: 53, baseType: !143, size: 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !646, file: !647, line: 54, baseType: !213, size: 64, offset: 960)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !646, file: !647, line: 56, baseType: !176, size: 16, offset: 1024)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !646, file: !647, line: 56, baseType: !176, size: 16, offset: 1040)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !646, file: !647, line: 57, baseType: !176, size: 16, offset: 1056)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !646, file: !647, line: 57, baseType: !176, size: 16, offset: 1072)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !646, file: !647, line: 59, baseType: !11, size: 32, offset: 1088)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !646, file: !647, line: 59, baseType: !11, size: 32, offset: 1120)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !646, file: !647, line: 59, baseType: !11, size: 32, offset: 1152)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !646, file: !647, line: 60, baseType: !11, size: 32, offset: 1184)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !646, file: !647, line: 60, baseType: !11, size: 32, offset: 1216)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !646, file: !647, line: 60, baseType: !11, size: 32, offset: 1248)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !646, file: !647, line: 61, baseType: !11, size: 32, offset: 1280)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !646, file: !647, line: 61, baseType: !11, size: 32, offset: 1312)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !646, file: !647, line: 61, baseType: !11, size: 32, offset: 1344)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !646, file: !647, line: 68, baseType: !11, size: 32, offset: 1376)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !646, file: !647, line: 68, baseType: !11, size: 32, offset: 1408)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !646, file: !647, line: 68, baseType: !11, size: 32, offset: 1440)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !646, file: !647, line: 69, baseType: !11, size: 32, offset: 1472)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !646, file: !647, line: 69, baseType: !11, size: 32, offset: 1504)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !646, file: !647, line: 74, baseType: !11, size: 32, offset: 1536)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !646, file: !647, line: 79, baseType: !11, size: 32, offset: 1568)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !646, file: !647, line: 81, baseType: !176, size: 16, offset: 1600)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !646, file: !647, line: 91, baseType: !176, size: 16, offset: 1616)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !646, file: !647, line: 92, baseType: !176, size: 16, offset: 1632)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !646, file: !647, line: 93, baseType: !176, size: 16, offset: 1648)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !646, file: !647, line: 94, baseType: !176, size: 16, offset: 1664)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !646, file: !647, line: 94, baseType: !176, size: 16, offset: 1680)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !646, file: !647, line: 94, baseType: !176, size: 16, offset: 1696)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !646, file: !647, line: 94, baseType: !176, size: 16, offset: 1712)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !646, file: !647, line: 96, baseType: !11, size: 32, offset: 1728)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !646, file: !647, line: 96, baseType: !11, size: 32, offset: 1760)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !646, file: !647, line: 96, baseType: !11, size: 32, offset: 1792)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !646, file: !647, line: 96, baseType: !11, size: 32, offset: 1824)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !646, file: !647, line: 98, baseType: !11, size: 32, offset: 1856)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !646, file: !647, line: 98, baseType: !11, size: 32, offset: 1888)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !646, file: !647, line: 98, baseType: !11, size: 32, offset: 1920)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !646, file: !647, line: 98, baseType: !11, size: 32, offset: 1952)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !646, file: !647, line: 99, baseType: !11, size: 32, offset: 1984)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !646, file: !647, line: 99, baseType: !11, size: 32, offset: 2016)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !646, file: !647, line: 100, baseType: !11, size: 32, offset: 2048)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !646, file: !647, line: 100, baseType: !11, size: 32, offset: 2080)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !646, file: !647, line: 103, baseType: !176, size: 16, offset: 2112)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !646, file: !647, line: 103, baseType: !176, size: 16, offset: 2128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !646, file: !647, line: 103, baseType: !176, size: 16, offset: 2144)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !646, file: !647, line: 103, baseType: !176, size: 16, offset: 2160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !646, file: !647, line: 106, baseType: !11, size: 32, offset: 2176)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !646, file: !647, line: 106, baseType: !11, size: 32, offset: 2208)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !646, file: !647, line: 106, baseType: !11, size: 32, offset: 2240)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !646, file: !647, line: 106, baseType: !11, size: 32, offset: 2272)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !646, file: !647, line: 107, baseType: !176, size: 16, offset: 2304)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !646, file: !647, line: 107, baseType: !176, size: 16, offset: 2320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !646, file: !647, line: 107, baseType: !176, size: 16, offset: 2336)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !646, file: !647, line: 107, baseType: !176, size: 16, offset: 2352)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !646, file: !647, line: 108, baseType: !11, size: 32, offset: 2368)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !646, file: !647, line: 108, baseType: !11, size: 32, offset: 2400)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !646, file: !647, line: 109, baseType: !11, size: 32, offset: 2432)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !646, file: !647, line: 109, baseType: !11, size: 32, offset: 2464)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !646, file: !647, line: 110, baseType: !11, size: 32, offset: 2496)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !646, file: !647, line: 110, baseType: !11, size: 32, offset: 2528)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !646, file: !647, line: 110, baseType: !11, size: 32, offset: 2560)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !646, file: !647, line: 111, baseType: !176, size: 16, offset: 2592)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !646, file: !647, line: 111, baseType: !176, size: 16, offset: 2608)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !646, file: !647, line: 112, baseType: !176, size: 16, offset: 2624)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !646, file: !647, line: 112, baseType: !176, size: 16, offset: 2640)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !646, file: !647, line: 112, baseType: !176, size: 16, offset: 2656)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !646, file: !647, line: 115, baseType: !176, size: 16, offset: 2672)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !646, file: !647, line: 118, baseType: !111, size: 64, offset: 2688)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !646, file: !647, line: 118, baseType: !111, size: 64, offset: 2752)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !646, file: !647, line: 121, baseType: !401, size: 64, offset: 2816)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !646, file: !647, line: 122, baseType: !371, size: 1152, offset: 2880)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !646, file: !647, line: 123, baseType: !176, size: 16, offset: 4032)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !646, file: !647, line: 123, baseType: !176, size: 16, offset: 4048)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !646, file: !647, line: 123, baseType: !723, size: 32, offset: 4064)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 32, elements: !629)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !646, file: !647, line: 126, baseType: !725, size: 64, offset: 4096)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !144, line: 159, size: 448, elements: !727)
!727 = !{!728, !730, !731, !732, !733, !736}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !726, file: !144, line: 161, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !629)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !726, file: !144, line: 162, baseType: !729, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !726, file: !144, line: 163, baseType: !723, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !726, file: !144, line: 164, baseType: !723, size: 32, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !726, file: !144, line: 165, baseType: !734, size: 128, offset: 192)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 128, elements: !629)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !726, file: !144, line: 166, baseType: !737, size: 128, offset: 320)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 128, elements: !629)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !144, line: 46, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !646, file: !647, line: 129, baseType: !741, size: 64, offset: 4160)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !140, line: 47, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !639, file: !473, line: 1223, baseType: !638, size: 64, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !639, file: !473, line: 1225, baseType: !202, size: 128, offset: 1216)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !639, file: !473, line: 1226, baseType: !746, size: 64, offset: 1344)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !473, line: 69, size: 320, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !747, file: !473, line: 70, baseType: !746, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !747, file: !473, line: 70, baseType: !746, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !747, file: !473, line: 71, baseType: !5, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !747, file: !473, line: 71, baseType: !5, size: 32, offset: 160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !747, file: !473, line: 72, baseType: !19, size: 32, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !747, file: !473, line: 73, baseType: !176, size: 16, offset: 224)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !747, file: !473, line: 73, baseType: !176, size: 16, offset: 240)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !747, file: !473, line: 74, baseType: !380, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !639, file: !473, line: 1227, baseType: !380, size: 64, offset: 1408)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !639, file: !473, line: 1229, baseType: !50, size: 96, offset: 1472)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !639, file: !473, line: 1230, baseType: !50, size: 96, offset: 1568)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !639, file: !473, line: 1231, baseType: !50, size: 96, offset: 1664)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !639, file: !473, line: 1231, baseType: !50, size: 96, offset: 1760)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !639, file: !473, line: 1233, baseType: !5, size: 32, offset: 1856)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !639, file: !473, line: 1234, baseType: !19, size: 32, offset: 1888)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !639, file: !473, line: 1235, baseType: !5, size: 32, offset: 1920)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !639, file: !473, line: 1237, baseType: !176, size: 16, offset: 1952)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !639, file: !473, line: 1239, baseType: !163, size: 8, offset: 1968)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !639, file: !473, line: 1240, baseType: !345, size: 8, offset: 1976)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !639, file: !473, line: 1242, baseType: !741, size: 64, offset: 1984)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !639, file: !473, line: 1244, baseType: !770, size: 64, offset: 2048)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !473, line: 59, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !639, file: !473, line: 1246, baseType: !773, size: 64, offset: 2112)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !473, line: 1067, size: 5184, elements: !775)
!775 = !{!776, !806, !807, !822, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !844, !983, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1094}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !774, file: !473, line: 1068, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !473, line: 934, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !473, line: 925, size: 576, elements: !780)
!780 = !{!781, !798, !799, !800, !801, !802, !805}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !779, file: !473, line: 926, baseType: !782, size: 320)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !473, line: 830, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !473, line: 813, size: 320, elements: !784)
!784 = !{!785, !788, !791, !792, !795, !796, !797}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !783, file: !473, line: 814, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !473, line: 51, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !783, file: !473, line: 815, baseType: !789, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !473, line: 815, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !783, file: !473, line: 818, baseType: !10, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !783, file: !473, line: 819, baseType: !793, size: 32, offset: 192)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 32, elements: !328)
!794 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !783, file: !473, line: 822, baseType: !19, size: 32, offset: 224)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !783, file: !473, line: 826, baseType: !19, size: 32, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !783, file: !473, line: 829, baseType: !19, size: 32, offset: 288)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !779, file: !473, line: 928, baseType: !176, size: 16, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !779, file: !473, line: 928, baseType: !176, size: 16, offset: 336)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !779, file: !473, line: 929, baseType: !19, size: 32, offset: 352)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !779, file: !473, line: 930, baseType: !735, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !779, file: !473, line: 931, baseType: !803, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !473, line: 931, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !779, file: !473, line: 933, baseType: !10, size: 64, offset: 512)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !774, file: !473, line: 1069, baseType: !777, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !774, file: !473, line: 1070, baseType: !808, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !473, line: 916, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !473, line: 891, size: 704, elements: !811)
!811 = !{!812, !813, !814, !816, !817, !818, !819, !820, !821}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !810, file: !473, line: 892, baseType: !782, size: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !810, file: !473, line: 896, baseType: !19, size: 32, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !810, file: !473, line: 900, baseType: !815, size: 96, offset: 352)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !51)
