; ModuleID = 'blender/source/blender/editors/object/object_hook.c'
source_filename = "blender/source/blender/editors/object/object_hook.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!1043 = !DIEnumerator(name: "ICON_BRUSH_CLONE", value: 785, isUnsigned: true)
!1044 = !DIEnumerator(name: "ICON_BRUSH_CREASE", value: 786, isUnsigned: true)
!1045 = !DIEnumerator(name: "ICON_BRUSH_DARKEN", value: 787, isUnsigned: true)
!1046 = !DIEnumerator(name: "ICON_BRUSH_FILL", value: 788, isUnsigned: true)
!1047 = !DIEnumerator(name: "ICON_BRUSH_FLATTEN", value: 789, isUnsigned: true)
!1048 = !DIEnumerator(name: "ICON_BRUSH_GRAB", value: 790, isUnsigned: true)
!1049 = !DIEnumerator(name: "ICON_BRUSH_INFLATE", value: 791, isUnsigned: true)
!1050 = !DIEnumerator(name: "ICON_BRUSH_LAYER", value: 792, isUnsigned: true)
!1051 = !DIEnumerator(name: "ICON_BRUSH_LIGHTEN", value: 793, isUnsigned: true)
!1052 = !DIEnumerator(name: "ICON_BRUSH_MASK", value: 794, isUnsigned: true)
!1053 = !DIEnumerator(name: "ICON_BRUSH_MIX", value: 795, isUnsigned: true)
!1054 = !DIEnumerator(name: "ICON_BRUSH_MULTIPLY", value: 796, isUnsigned: true)
!1055 = !DIEnumerator(name: "ICON_BRUSH_NUDGE", value: 797, isUnsigned: true)
!1056 = !DIEnumerator(name: "ICON_BRUSH_PINCH", value: 798, isUnsigned: true)
!1057 = !DIEnumerator(name: "ICON_BRUSH_SCRAPE", value: 799, isUnsigned: true)
!1058 = !DIEnumerator(name: "ICON_BRUSH_SCULPT_DRAW", value: 800, isUnsigned: true)
!1059 = !DIEnumerator(name: "ICON_BRUSH_SMEAR", value: 801, isUnsigned: true)
!1060 = !DIEnumerator(name: "ICON_BRUSH_SMOOTH", value: 802, isUnsigned: true)
!1061 = !DIEnumerator(name: "ICON_BRUSH_SNAKE_HOOK", value: 803, isUnsigned: true)
!1062 = !DIEnumerator(name: "ICON_BRUSH_SOFTEN", value: 804, isUnsigned: true)
!1063 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!1064 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!1065 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!1066 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!1067 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!1068 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!1069 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!1070 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!1071 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!1072 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!1073 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!1074 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!1075 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!1076 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!1077 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!1078 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!1079 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!1080 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!1081 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!1082 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!1083 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!1084 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!1085 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!1086 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!1087 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!1088 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!1089 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!1090 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!1091 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!1092 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!1093 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!1094 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!1095 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!1096 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!1097 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!1098 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!1099 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!1100 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!1101 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!1102 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!1103 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!1104 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!1105 = !{!1106, !2682, !1138, !1233, !2683, !2684, !2685, !2689, !2748, !2750, !2732, !1329}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "HookModifierData", file: !88, line: 551, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HookModifierData", file: !88, line: 537, size: 2752, elements: !1109)
!1109 = !{!1110, !2672, !2673, !2674, !2675, !2676, !2677, !2679, !2680, !2681}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !1108, file: !88, line: 538, baseType: !1111, size: 896)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !88, line: 110, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !88, line: 99, size: 896, elements: !1113)
!1113 = !{!1114, !1116, !1117, !1119, !1120, !1121, !1122, !1127, !2671}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1112, file: !88, line: 100, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1112, file: !88, line: 100, baseType: !1115, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1112, file: !88, line: 102, baseType: !1118, size: 32, offset: 128)
!1118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1112, file: !88, line: 102, baseType: !1118, size: 32, offset: 160)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !1112, file: !88, line: 103, baseType: !1118, size: 32, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1112, file: !88, line: 103, baseType: !1118, size: 32, offset: 224)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1112, file: !88, line: 104, baseType: !1123, size: 512, offset: 256)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1124, size: 512, elements: !1125)
!1124 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1125 = !{!1126}
!1126 = !DISubrange(count: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1112, file: !88, line: 107, baseType: !1128, size: 64, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1130, line: 1216, size: 39680, elements: !1131)
!1130 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1131 = !{!1132, !1199, !1203, !1496, !1499, !1500, !1501, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1527, !1601, !2029, !2254, !2257, !2546, !2558, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2568, !2569, !2570, !2571, !2572, !2580, !2647, !2654, !2655, !2662, !2663, !2664, !2665, !2666, !2667, !2668}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1129, file: !1130, line: 1217, baseType: !1133, size: 960)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1134, line: 130, baseType: !1135)
!1134 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1134, line: 117, size: 960, elements: !1136)
!1136 = !{!1137, !1139, !1140, !1142, !1161, !1165, !1167, !1168, !1169, !1170}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1135, file: !1134, line: 118, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1135, file: !1134, line: 118, baseType: !1138, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1135, file: !1134, line: 119, baseType: !1141, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1135, file: !1134, line: 120, baseType: !1143, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1134, line: 136, size: 17600, elements: !1145)
!1145 = !{!1146, !1147, !1149, !1152, !1156, !1157, !1158}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1144, file: !1134, line: 137, baseType: !1133, size: 960)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1144, file: !1134, line: 138, baseType: !1148, size: 64, offset: 960)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1144, file: !1134, line: 139, baseType: !1150, size: 64, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1134, line: 43, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1144, file: !1134, line: 140, baseType: !1153, size: 8192, offset: 1088)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1124, size: 8192, elements: !1154)
!1154 = !{!1155}
!1155 = !DISubrange(count: 1024)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1144, file: !1134, line: 141, baseType: !1153, size: 8192, offset: 9280)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1144, file: !1134, line: 148, baseType: !1143, size: 64, offset: 17472)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1144, file: !1134, line: 150, baseType: !1159, size: 64, offset: 17536)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1134, line: 45, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1135, file: !1134, line: 121, baseType: !1162, size: 528, offset: 256)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1124, size: 528, elements: !1163)
!1163 = !{!1164}
!1164 = !DISubrange(count: 66)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1135, file: !1134, line: 126, baseType: !1166, size: 16, offset: 784)
!1166 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1135, file: !1134, line: 127, baseType: !1118, size: 32, offset: 800)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1135, file: !1134, line: 128, baseType: !1118, size: 32, offset: 832)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1135, file: !1134, line: 128, baseType: !1118, size: 32, offset: 864)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1135, file: !1134, line: 129, baseType: !1171, size: 64, offset: 896)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1134, line: 75, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1134, line: 62, size: 1024, elements: !1174)
!1174 = !{!1175, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1197, !1198}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1173, file: !1134, line: 63, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1173, file: !1134, line: 63, baseType: !1176, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1173, file: !1134, line: 64, baseType: !1124, size: 8, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1173, file: !1134, line: 64, baseType: !1124, size: 8, offset: 136)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1173, file: !1134, line: 65, baseType: !1166, size: 16, offset: 144)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1173, file: !1134, line: 66, baseType: !1123, size: 512, offset: 160)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1173, file: !1134, line: 67, baseType: !1118, size: 32, offset: 672)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !1134, line: 69, baseType: !1184, size: 256, offset: 704)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1134, line: 60, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1134, line: 48, size: 256, elements: !1186)
!1186 = !{!1187, !1188, !1195, !1196}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1185, file: !1134, line: 49, baseType: !1138, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1185, file: !1134, line: 58, baseType: !1189, size: 128, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1190, line: 71, baseType: !1191)
!1190 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1190, line: 69, size: 128, elements: !1192)
!1192 = !{!1193, !1194}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1191, file: !1190, line: 70, baseType: !1138, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1191, file: !1190, line: 70, baseType: !1138, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1185, file: !1134, line: 59, baseType: !1118, size: 32, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1185, file: !1134, line: 59, baseType: !1118, size: 32, offset: 224)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1173, file: !1134, line: 70, baseType: !1118, size: 32, offset: 960)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1173, file: !1134, line: 74, baseType: !1118, size: 32, offset: 992)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1129, file: !1130, line: 1218, baseType: !1200, size: 64, offset: 960)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1202, line: 37, flags: DIFlagFwdDecl)
!1202 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1129, file: !1130, line: 1220, baseType: !1204, size: 64, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !65, line: 115, size: 11392, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1227, !1239, !1253, !1254, !1297, !1298, !1301, !1302, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1328, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1344, !1345, !1346, !1347, !1348, !1349, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1420, !1423, !1426, !1427, !1428, !1429, !1430, !1433, !1436, !1440, !1441, !1447, !1448, !1449, !1450, !1451, !1452, !1454, !1457, !1460, !1464, !1484, !1485}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1205, file: !65, line: 116, baseType: !1133, size: 960)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1205, file: !65, line: 117, baseType: !1200, size: 64, offset: 960)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1205, file: !65, line: 119, baseType: !1210, size: 64, offset: 1024)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !65, line: 57, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1205, file: !65, line: 121, baseType: !1166, size: 16, offset: 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1205, file: !65, line: 121, baseType: !1166, size: 16, offset: 1104)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1205, file: !65, line: 122, baseType: !1118, size: 32, offset: 1120)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1205, file: !65, line: 122, baseType: !1118, size: 32, offset: 1152)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1205, file: !65, line: 122, baseType: !1118, size: 32, offset: 1184)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1205, file: !65, line: 123, baseType: !1123, size: 512, offset: 1216)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1205, file: !65, line: 124, baseType: !1204, size: 64, offset: 1728)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1205, file: !65, line: 124, baseType: !1204, size: 64, offset: 1792)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1205, file: !65, line: 127, baseType: !1204, size: 64, offset: 1856)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1205, file: !65, line: 127, baseType: !1204, size: 64, offset: 1920)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1205, file: !65, line: 127, baseType: !1204, size: 64, offset: 1984)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1205, file: !65, line: 128, baseType: !1224, size: 64, offset: 2048)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1226, line: 44, flags: DIFlagFwdDecl)
!1226 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1205, file: !65, line: 130, baseType: !1228, size: 64, offset: 2112)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !65, line: 97, size: 832, elements: !1230)
!1230 = !{!1231, !1237, !1238}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1229, file: !65, line: 98, baseType: !1232, size: 768)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 768, elements: !1234)
!1233 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1234 = !{!1235, !1236}
!1235 = !DISubrange(count: 8)
!1236 = !DISubrange(count: 3)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1229, file: !65, line: 99, baseType: !1118, size: 32, offset: 768)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1229, file: !65, line: 99, baseType: !1118, size: 32, offset: 800)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1205, file: !65, line: 131, baseType: !1240, size: 64, offset: 2176)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1242, line: 486, size: 1600, elements: !1243)
!1242 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1241, file: !1242, line: 487, baseType: !1133, size: 960)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1241, file: !1242, line: 489, baseType: !1189, size: 128, offset: 960)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1241, file: !1242, line: 490, baseType: !1189, size: 128, offset: 1088)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1241, file: !1242, line: 491, baseType: !1189, size: 128, offset: 1216)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1241, file: !1242, line: 492, baseType: !1189, size: 128, offset: 1344)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1241, file: !1242, line: 494, baseType: !1118, size: 32, offset: 1472)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1241, file: !1242, line: 495, baseType: !1118, size: 32, offset: 1504)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1241, file: !1242, line: 497, baseType: !1118, size: 32, offset: 1536)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1241, file: !1242, line: 498, baseType: !1118, size: 32, offset: 1568)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1205, file: !65, line: 132, baseType: !1240, size: 64, offset: 2240)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1205, file: !65, line: 133, baseType: !1255, size: 64, offset: 2304)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1242, line: 334, size: 1728, elements: !1257)
!1257 = !{!1258, !1259, !1262, !1263, !1264, !1265, !1266, !1267, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1296}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1256, file: !1242, line: 335, baseType: !1189, size: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1256, file: !1242, line: 336, baseType: !1260, size: 64, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1226, line: 51, flags: DIFlagFwdDecl)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1256, file: !1242, line: 338, baseType: !1166, size: 16, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1256, file: !1242, line: 338, baseType: !1166, size: 16, offset: 208)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1256, file: !1242, line: 339, baseType: !5, size: 32, offset: 224)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1256, file: !1242, line: 340, baseType: !1118, size: 32, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1256, file: !1242, line: 342, baseType: !1233, size: 32, offset: 288)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1256, file: !1242, line: 343, baseType: !1268, size: 96, offset: 320)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 96, elements: !1269)
!1269 = !{!1236}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1256, file: !1242, line: 344, baseType: !1268, size: 96, offset: 416)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1256, file: !1242, line: 347, baseType: !1189, size: 128, offset: 512)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1256, file: !1242, line: 349, baseType: !1118, size: 32, offset: 640)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1256, file: !1242, line: 350, baseType: !1118, size: 32, offset: 672)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1256, file: !1242, line: 351, baseType: !1138, size: 64, offset: 704)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1256, file: !1242, line: 352, baseType: !1138, size: 64, offset: 768)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1256, file: !1242, line: 354, baseType: !1277, size: 384, offset: 832)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1242, line: 116, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1242, line: 94, size: 384, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1278, file: !1242, line: 96, baseType: !1118, size: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1278, file: !1242, line: 96, baseType: !1118, size: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1278, file: !1242, line: 97, baseType: !1118, size: 32, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1278, file: !1242, line: 97, baseType: !1118, size: 32, offset: 96)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1278, file: !1242, line: 99, baseType: !1166, size: 16, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1278, file: !1242, line: 100, baseType: !1166, size: 16, offset: 144)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1278, file: !1242, line: 102, baseType: !1166, size: 16, offset: 160)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1278, file: !1242, line: 105, baseType: !1166, size: 16, offset: 176)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1278, file: !1242, line: 108, baseType: !1166, size: 16, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1278, file: !1242, line: 109, baseType: !1166, size: 16, offset: 208)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1278, file: !1242, line: 111, baseType: !1166, size: 16, offset: 224)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1278, file: !1242, line: 112, baseType: !1166, size: 16, offset: 240)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1278, file: !1242, line: 114, baseType: !1118, size: 32, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1278, file: !1242, line: 114, baseType: !1118, size: 32, offset: 288)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1278, file: !1242, line: 115, baseType: !1118, size: 32, offset: 320)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1278, file: !1242, line: 115, baseType: !1118, size: 32, offset: 352)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1256, file: !1242, line: 355, baseType: !1123, size: 512, offset: 1216)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1205, file: !65, line: 134, baseType: !1138, size: 64, offset: 2368)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1205, file: !65, line: 136, baseType: !1299, size: 64, offset: 2432)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !65, line: 58, flags: DIFlagFwdDecl)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1205, file: !65, line: 138, baseType: !1277, size: 384, offset: 2496)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1205, file: !65, line: 139, baseType: !1303, size: 64, offset: 2880)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1242, line: 80, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1242, line: 72, size: 192, elements: !1306)
!1306 = !{!1307, !1314, !1315, !1316, !1317}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1305, file: !1242, line: 73, baseType: !1308, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1242, line: 59, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1242, line: 56, size: 128, elements: !1311)
!1311 = !{!1312, !1313}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1310, file: !1242, line: 57, baseType: !1268, size: 96)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1310, file: !1242, line: 58, baseType: !1118, size: 32, offset: 96)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1305, file: !1242, line: 74, baseType: !1118, size: 32, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1305, file: !1242, line: 76, baseType: !1118, size: 32, offset: 96)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1305, file: !1242, line: 77, baseType: !1118, size: 32, offset: 128)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1305, file: !1242, line: 79, baseType: !1118, size: 32, offset: 160)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1205, file: !65, line: 141, baseType: !1189, size: 128, offset: 2944)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1205, file: !65, line: 142, baseType: !1189, size: 128, offset: 3072)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1205, file: !65, line: 143, baseType: !1189, size: 128, offset: 3200)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1205, file: !65, line: 144, baseType: !1189, size: 128, offset: 3328)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1205, file: !65, line: 146, baseType: !1118, size: 32, offset: 3456)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1205, file: !65, line: 147, baseType: !1118, size: 32, offset: 3488)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1205, file: !65, line: 150, baseType: !1325, size: 64, offset: 3520)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1226, line: 46, flags: DIFlagFwdDecl)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1205, file: !65, line: 151, baseType: !1329, size: 64, offset: 3584)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1205, file: !65, line: 152, baseType: !1118, size: 32, offset: 3648)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1205, file: !65, line: 153, baseType: !1118, size: 32, offset: 3680)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1205, file: !65, line: 156, baseType: !1268, size: 96, offset: 3712)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1205, file: !65, line: 156, baseType: !1268, size: 96, offset: 3808)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1205, file: !65, line: 156, baseType: !1268, size: 96, offset: 3904)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1205, file: !65, line: 157, baseType: !1268, size: 96, offset: 4000)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1205, file: !65, line: 158, baseType: !1268, size: 96, offset: 4096)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1205, file: !65, line: 159, baseType: !1268, size: 96, offset: 4192)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1205, file: !65, line: 160, baseType: !1268, size: 96, offset: 4288)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1205, file: !65, line: 160, baseType: !1268, size: 96, offset: 4384)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1205, file: !65, line: 161, baseType: !1341, size: 128, offset: 4480)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 128, elements: !1342)
!1342 = !{!1343}
!1343 = !DISubrange(count: 4)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1205, file: !65, line: 161, baseType: !1341, size: 128, offset: 4608)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1205, file: !65, line: 162, baseType: !1268, size: 96, offset: 4736)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1205, file: !65, line: 162, baseType: !1268, size: 96, offset: 4832)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1205, file: !65, line: 163, baseType: !1233, size: 32, offset: 4928)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1205, file: !65, line: 163, baseType: !1233, size: 32, offset: 4960)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1205, file: !65, line: 164, baseType: !1350, size: 512, offset: 4992)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 512, elements: !1351)
!1351 = !{!1343, !1343}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1205, file: !65, line: 165, baseType: !1350, size: 512, offset: 5504)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1205, file: !65, line: 166, baseType: !1350, size: 512, offset: 6016)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1205, file: !65, line: 167, baseType: !1350, size: 512, offset: 6528)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1205, file: !65, line: 176, baseType: !1350, size: 512, offset: 7040)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1205, file: !65, line: 178, baseType: !5, size: 32, offset: 7552)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1205, file: !65, line: 180, baseType: !1166, size: 16, offset: 7584)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1205, file: !65, line: 181, baseType: !1166, size: 16, offset: 7600)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1205, file: !65, line: 183, baseType: !1166, size: 16, offset: 7616)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1205, file: !65, line: 183, baseType: !1166, size: 16, offset: 7632)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1205, file: !65, line: 184, baseType: !1166, size: 16, offset: 7648)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1205, file: !65, line: 184, baseType: !1166, size: 16, offset: 7664)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1205, file: !65, line: 185, baseType: !1166, size: 16, offset: 7680)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1205, file: !65, line: 186, baseType: !1166, size: 16, offset: 7696)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1205, file: !65, line: 187, baseType: !1166, size: 16, offset: 7712)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1205, file: !65, line: 188, baseType: !1124, size: 8, offset: 7728)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1205, file: !65, line: 189, baseType: !1124, size: 8, offset: 7736)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1205, file: !65, line: 192, baseType: !1118, size: 32, offset: 7744)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1205, file: !65, line: 192, baseType: !1118, size: 32, offset: 7776)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1205, file: !65, line: 192, baseType: !1118, size: 32, offset: 7808)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1205, file: !65, line: 192, baseType: !1118, size: 32, offset: 7840)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1205, file: !65, line: 194, baseType: !1118, size: 32, offset: 7872)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1205, file: !65, line: 202, baseType: !1233, size: 32, offset: 7904)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1205, file: !65, line: 202, baseType: !1233, size: 32, offset: 7936)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1205, file: !65, line: 202, baseType: !1233, size: 32, offset: 7968)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1205, file: !65, line: 211, baseType: !1233, size: 32, offset: 8000)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1205, file: !65, line: 212, baseType: !1233, size: 32, offset: 8032)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1205, file: !65, line: 213, baseType: !1233, size: 32, offset: 8064)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1205, file: !65, line: 214, baseType: !1233, size: 32, offset: 8096)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1205, file: !65, line: 215, baseType: !1233, size: 32, offset: 8128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1205, file: !65, line: 216, baseType: !1233, size: 32, offset: 8160)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1205, file: !65, line: 219, baseType: !1233, size: 32, offset: 8192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1205, file: !65, line: 220, baseType: !1233, size: 32, offset: 8224)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1205, file: !65, line: 221, baseType: !1233, size: 32, offset: 8256)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1205, file: !65, line: 224, baseType: !1386, size: 16, offset: 8288)
!1386 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1205, file: !65, line: 224, baseType: !1386, size: 16, offset: 8304)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1205, file: !65, line: 226, baseType: !1166, size: 16, offset: 8320)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1205, file: !65, line: 228, baseType: !1124, size: 8, offset: 8336)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1205, file: !65, line: 229, baseType: !1124, size: 8, offset: 8344)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1205, file: !65, line: 231, baseType: !1166, size: 16, offset: 8352)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1205, file: !65, line: 232, baseType: !1124, size: 8, offset: 8368)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1205, file: !65, line: 233, baseType: !1124, size: 8, offset: 8376)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1205, file: !65, line: 234, baseType: !1233, size: 32, offset: 8384)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1205, file: !65, line: 235, baseType: !1233, size: 32, offset: 8416)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1205, file: !65, line: 237, baseType: !1189, size: 128, offset: 8448)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1205, file: !65, line: 238, baseType: !1189, size: 128, offset: 8576)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1205, file: !65, line: 239, baseType: !1189, size: 128, offset: 8704)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1205, file: !65, line: 240, baseType: !1189, size: 128, offset: 8832)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1205, file: !65, line: 242, baseType: !1233, size: 32, offset: 8960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1205, file: !65, line: 244, baseType: !1166, size: 16, offset: 8992)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1205, file: !65, line: 245, baseType: !1386, size: 16, offset: 9008)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1205, file: !65, line: 246, baseType: !1341, size: 128, offset: 9024)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1205, file: !65, line: 248, baseType: !1118, size: 32, offset: 9152)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1205, file: !65, line: 249, baseType: !1118, size: 32, offset: 9184)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1205, file: !65, line: 251, baseType: !1407, size: 64, offset: 9216)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64)
!1408 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !65, line: 251, flags: DIFlagFwdDecl)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1205, file: !65, line: 253, baseType: !1124, size: 8, offset: 9280)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1205, file: !65, line: 254, baseType: !1124, size: 8, offset: 9288)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1205, file: !65, line: 255, baseType: !1166, size: 16, offset: 9296)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1205, file: !65, line: 256, baseType: !1268, size: 96, offset: 9312)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1205, file: !65, line: 258, baseType: !1189, size: 128, offset: 9408)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1205, file: !65, line: 259, baseType: !1189, size: 128, offset: 9536)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1205, file: !65, line: 260, baseType: !1189, size: 128, offset: 9664)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1205, file: !65, line: 261, baseType: !1189, size: 128, offset: 9792)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1205, file: !65, line: 263, baseType: !1418, size: 64, offset: 9920)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !65, line: 52, flags: DIFlagFwdDecl)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1205, file: !65, line: 264, baseType: !1421, size: 64, offset: 9984)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !65, line: 53, flags: DIFlagFwdDecl)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1205, file: !65, line: 265, baseType: !1424, size: 64, offset: 10048)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1242, line: 46, flags: DIFlagFwdDecl)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1205, file: !65, line: 267, baseType: !1124, size: 8, offset: 10112)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1205, file: !65, line: 268, baseType: !1124, size: 8, offset: 10120)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1205, file: !65, line: 269, baseType: !1166, size: 16, offset: 10128)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1205, file: !65, line: 270, baseType: !1233, size: 32, offset: 10144)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1205, file: !65, line: 272, baseType: !1431, size: 64, offset: 10176)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64)
!1432 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !65, line: 54, flags: DIFlagFwdDecl)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1205, file: !65, line: 275, baseType: !1434, size: 64, offset: 10240)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !65, line: 275, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1205, file: !65, line: 277, baseType: !1437, size: 64, offset: 10304)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !1439, line: 40, flags: DIFlagFwdDecl)
!1439 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1205, file: !65, line: 277, baseType: !1437, size: 64, offset: 10368)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1205, file: !65, line: 278, baseType: !1442, size: 64, offset: 10432)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1443, line: 27, baseType: !1444)
!1443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1445, line: 45, baseType: !1446)
!1445 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1446 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1205, file: !65, line: 279, baseType: !1442, size: 64, offset: 10496)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1205, file: !65, line: 280, baseType: !5, size: 32, offset: 10560)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1205, file: !65, line: 281, baseType: !5, size: 32, offset: 10592)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1205, file: !65, line: 283, baseType: !1189, size: 128, offset: 10624)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1205, file: !65, line: 284, baseType: !1189, size: 128, offset: 10752)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1205, file: !65, line: 285, baseType: !1453, size: 64, offset: 10880)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1205, file: !65, line: 287, baseType: !1455, size: 64, offset: 10944)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !65, line: 59, flags: DIFlagFwdDecl)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1205, file: !65, line: 288, baseType: !1458, size: 64, offset: 11008)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64)
!1459 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !65, line: 288, flags: DIFlagFwdDecl)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1205, file: !65, line: 290, baseType: !1461, size: 64, offset: 11072)
!1461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 64, elements: !1462)
!1462 = !{!1463}
!1463 = !DISubrange(count: 2)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1205, file: !65, line: 291, baseType: !1465, size: 64, offset: 11136)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1467, line: 65, baseType: !1468)
!1467 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1467, line: 50, size: 320, elements: !1469)
!1469 = !{!1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1468, file: !1467, line: 51, baseType: !1128, size: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1468, file: !1467, line: 53, baseType: !1118, size: 32, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1468, file: !1467, line: 54, baseType: !1118, size: 32, offset: 96)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1468, file: !1467, line: 55, baseType: !1118, size: 32, offset: 128)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1468, file: !1467, line: 55, baseType: !1118, size: 32, offset: 160)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1468, file: !1467, line: 56, baseType: !1124, size: 8, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1468, file: !1467, line: 56, baseType: !1124, size: 8, offset: 200)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1468, file: !1467, line: 57, baseType: !1124, size: 8, offset: 208)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1468, file: !1467, line: 57, baseType: !1124, size: 8, offset: 216)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1468, file: !1467, line: 59, baseType: !1166, size: 16, offset: 224)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1468, file: !1467, line: 59, baseType: !1166, size: 16, offset: 240)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1468, file: !1467, line: 59, baseType: !1166, size: 16, offset: 256)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1468, file: !1467, line: 61, baseType: !1166, size: 16, offset: 272)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1468, file: !1467, line: 63, baseType: !1118, size: 32, offset: 288)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !1205, file: !65, line: 293, baseType: !1189, size: 128, offset: 11200)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !1205, file: !65, line: 294, baseType: !1486, size: 64, offset: 11328)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !65, line: 113, baseType: !1488)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !65, line: 108, size: 256, elements: !1489)
!1489 = !{!1490, !1492, !1493, !1494, !1495}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1488, file: !65, line: 109, baseType: !1491, size: 64)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1488, file: !65, line: 109, baseType: !1491, size: 64, offset: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1488, file: !65, line: 110, baseType: !1204, size: 64, offset: 128)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1488, file: !65, line: 111, baseType: !1118, size: 32, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1488, file: !65, line: 112, baseType: !1233, size: 32, offset: 224)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1129, file: !1130, line: 1221, baseType: !1497, size: 64, offset: 1088)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64)
!1498 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1130, line: 52, flags: DIFlagFwdDecl)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1129, file: !1130, line: 1223, baseType: !1128, size: 64, offset: 1152)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1129, file: !1130, line: 1225, baseType: !1189, size: 128, offset: 1216)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1129, file: !1130, line: 1226, baseType: !1502, size: 64, offset: 1344)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1130, line: 69, size: 320, elements: !1504)
!1504 = !{!1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1503, file: !1130, line: 70, baseType: !1502, size: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1503, file: !1130, line: 70, baseType: !1502, size: 64, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1503, file: !1130, line: 71, baseType: !5, size: 32, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1503, file: !1130, line: 71, baseType: !5, size: 32, offset: 160)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1503, file: !1130, line: 72, baseType: !1118, size: 32, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1503, file: !1130, line: 73, baseType: !1166, size: 16, offset: 224)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1503, file: !1130, line: 73, baseType: !1166, size: 16, offset: 240)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1503, file: !1130, line: 74, baseType: !1204, size: 64, offset: 256)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1129, file: !1130, line: 1227, baseType: !1204, size: 64, offset: 1408)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1129, file: !1130, line: 1229, baseType: !1268, size: 96, offset: 1472)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1129, file: !1130, line: 1230, baseType: !1268, size: 96, offset: 1568)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1129, file: !1130, line: 1231, baseType: !1268, size: 96, offset: 1664)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1129, file: !1130, line: 1231, baseType: !1268, size: 96, offset: 1760)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1129, file: !1130, line: 1233, baseType: !5, size: 32, offset: 1856)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1129, file: !1130, line: 1234, baseType: !1118, size: 32, offset: 1888)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1129, file: !1130, line: 1235, baseType: !5, size: 32, offset: 1920)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1129, file: !1130, line: 1237, baseType: !1166, size: 16, offset: 1952)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1129, file: !1130, line: 1239, baseType: !1124, size: 8, offset: 1968)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1129, file: !1130, line: 1240, baseType: !1524, size: 8, offset: 1976)
!1524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1124, size: 8, elements: !1525)
!1525 = !{!1526}
!1526 = !DISubrange(count: 1)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1129, file: !1130, line: 1242, baseType: !1528, size: 64, offset: 1984)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1530, line: 328, size: 3456, elements: !1531)
!1530 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1531 = !{!1532, !1533, !1534, !1538, !1539, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1567, !1568, !1569, !1572, !1577, !1578, !1581, !1585, !1589, !1593, !1597, !1598, !1599, !1600}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1529, file: !1530, line: 329, baseType: !1133, size: 960)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1529, file: !1530, line: 330, baseType: !1200, size: 64, offset: 960)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1529, file: !1530, line: 332, baseType: !1535, size: 64, offset: 1024)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64)
!1536 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1537, line: 32, flags: DIFlagFwdDecl)
!1537 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1529, file: !1530, line: 333, baseType: !1123, size: 512, offset: 1088)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1529, file: !1530, line: 335, baseType: !1540, size: 64, offset: 1600)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64)
!1541 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !4, line: 41, flags: DIFlagFwdDecl)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1529, file: !1530, line: 337, baseType: !1299, size: 64, offset: 1664)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1529, file: !1530, line: 338, baseType: !1461, size: 64, offset: 1728)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1529, file: !1530, line: 340, baseType: !1189, size: 128, offset: 1792)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1529, file: !1530, line: 340, baseType: !1189, size: 128, offset: 1920)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1529, file: !1530, line: 342, baseType: !1118, size: 32, offset: 2048)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1529, file: !1530, line: 342, baseType: !1118, size: 32, offset: 2080)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1529, file: !1530, line: 343, baseType: !1118, size: 32, offset: 2112)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1529, file: !1530, line: 345, baseType: !1118, size: 32, offset: 2144)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1529, file: !1530, line: 346, baseType: !1118, size: 32, offset: 2176)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1529, file: !1530, line: 347, baseType: !1166, size: 16, offset: 2208)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1529, file: !1530, line: 348, baseType: !1166, size: 16, offset: 2224)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1529, file: !1530, line: 349, baseType: !1118, size: 32, offset: 2240)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1529, file: !1530, line: 351, baseType: !1118, size: 32, offset: 2272)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1529, file: !1530, line: 353, baseType: !1166, size: 16, offset: 2304)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1529, file: !1530, line: 354, baseType: !1166, size: 16, offset: 2320)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1529, file: !1530, line: 355, baseType: !1118, size: 32, offset: 2336)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1529, file: !1530, line: 357, baseType: !1559, size: 128, offset: 2368)
!1559 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1560, line: 95, baseType: !1561)
!1560 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1560, line: 92, size: 128, elements: !1562)
!1562 = !{!1563, !1564, !1565, !1566}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1561, file: !1560, line: 93, baseType: !1233, size: 32)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1561, file: !1560, line: 93, baseType: !1233, size: 32, offset: 32)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1561, file: !1560, line: 94, baseType: !1233, size: 32, offset: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1561, file: !1560, line: 94, baseType: !1233, size: 32, offset: 96)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1529, file: !1530, line: 363, baseType: !1189, size: 128, offset: 2496)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1529, file: !1530, line: 363, baseType: !1189, size: 128, offset: 2624)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1529, file: !1530, line: 368, baseType: !1570, size: 64, offset: 2752)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64)
!1571 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1530, line: 48, flags: DIFlagFwdDecl)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1529, file: !1530, line: 372, baseType: !1573, size: 32, offset: 2816)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1530, line: 274, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1530, line: 271, size: 32, elements: !1575)
!1575 = !{!1576}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1574, file: !1530, line: 273, baseType: !5, size: 32)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1529, file: !1530, line: 373, baseType: !1118, size: 32, offset: 2848)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1529, file: !1530, line: 382, baseType: !1579, size: 64, offset: 2880)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64)
!1580 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1530, line: 46, flags: DIFlagFwdDecl)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1529, file: !1530, line: 385, baseType: !1582, size: 64, offset: 2944)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{null, !1138, !1233}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1529, file: !1530, line: 386, baseType: !1586, size: 64, offset: 3008)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{null, !1138, !1329}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1529, file: !1530, line: 387, baseType: !1590, size: 64, offset: 3072)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!1118, !1138}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1529, file: !1530, line: 388, baseType: !1594, size: 64, offset: 3136)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{null, !1138}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1529, file: !1530, line: 389, baseType: !1138, size: 64, offset: 3200)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1529, file: !1530, line: 389, baseType: !1138, size: 64, offset: 3264)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1529, file: !1530, line: 389, baseType: !1138, size: 64, offset: 3328)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1529, file: !1530, line: 389, baseType: !1138, size: 64, offset: 3392)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1129, file: !1130, line: 1244, baseType: !1602, size: 64, offset: 2048)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1604, line: 200, size: 17024, elements: !1605)
!1604 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1605 = !{!1606, !1607, !1608, !1609, !2022, !2023, !2024, !2025, !2026, !2027, !2028}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1603, file: !1604, line: 201, baseType: !1453, size: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1603, file: !1604, line: 202, baseType: !1189, size: 128, offset: 64)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1603, file: !1604, line: 203, baseType: !1189, size: 128, offset: 192)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1603, file: !1604, line: 206, baseType: !1610, size: 64, offset: 320)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64)
!1611 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1604, line: 190, baseType: !1612)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1604, line: 126, size: 2816, elements: !1613)
!1613 = !{!1614, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1712, !1713, !1714, !1715, !1993, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2021}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1612, file: !1604, line: 127, baseType: !1615, size: 64)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1612, file: !1604, line: 127, baseType: !1615, size: 64, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1612, file: !1604, line: 128, baseType: !1138, size: 64, offset: 128)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1612, file: !1604, line: 129, baseType: !1138, size: 64, offset: 192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1612, file: !1604, line: 130, baseType: !1123, size: 512, offset: 256)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1612, file: !1604, line: 132, baseType: !1118, size: 32, offset: 768)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1612, file: !1604, line: 132, baseType: !1118, size: 32, offset: 800)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1612, file: !1604, line: 133, baseType: !1118, size: 32, offset: 832)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1612, file: !1604, line: 134, baseType: !1118, size: 32, offset: 864)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1612, file: !1604, line: 134, baseType: !1118, size: 32, offset: 896)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1612, file: !1604, line: 134, baseType: !1118, size: 32, offset: 928)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1612, file: !1604, line: 135, baseType: !1118, size: 32, offset: 960)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1612, file: !1604, line: 135, baseType: !1118, size: 32, offset: 992)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1612, file: !1604, line: 136, baseType: !1118, size: 32, offset: 1024)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1612, file: !1604, line: 136, baseType: !1118, size: 32, offset: 1056)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1612, file: !1604, line: 137, baseType: !1118, size: 32, offset: 1088)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1612, file: !1604, line: 137, baseType: !1118, size: 32, offset: 1120)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1612, file: !1604, line: 138, baseType: !1233, size: 32, offset: 1152)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1612, file: !1604, line: 139, baseType: !1233, size: 32, offset: 1184)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1612, file: !1604, line: 139, baseType: !1233, size: 32, offset: 1216)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1612, file: !1604, line: 141, baseType: !1166, size: 16, offset: 1248)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1612, file: !1604, line: 142, baseType: !1166, size: 16, offset: 1264)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1612, file: !1604, line: 143, baseType: !1118, size: 32, offset: 1280)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1612, file: !1604, line: 144, baseType: !1118, size: 32, offset: 1312)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1612, file: !1604, line: 146, baseType: !1640, size: 64, offset: 1344)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1604, line: 114, baseType: !1642)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1604, line: 99, size: 7232, elements: !1643)
!1643 = !{!1644, !1646, !1647, !1648, !1649, !1650, !1651, !1662, !1666, !1680, !1689, !1696, !1706}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1642, file: !1604, line: 100, baseType: !1645, size: 64)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1642, file: !1604, line: 100, baseType: !1645, size: 64, offset: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1642, file: !1604, line: 101, baseType: !1118, size: 32, offset: 128)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1642, file: !1604, line: 101, baseType: !1118, size: 32, offset: 160)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1642, file: !1604, line: 102, baseType: !1118, size: 32, offset: 192)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1642, file: !1604, line: 102, baseType: !1118, size: 32, offset: 224)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1642, file: !1604, line: 103, baseType: !1652, size: 64, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64)
!1653 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1604, line: 59, baseType: !1654)
!1654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1604, line: 56, size: 2112, elements: !1655)
!1655 = !{!1656, !1660, !1661}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1654, file: !1604, line: 57, baseType: !1657, size: 2048)
!1657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1124, size: 2048, elements: !1658)
!1658 = !{!1659}
!1659 = !DISubrange(count: 256)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1654, file: !1604, line: 58, baseType: !1118, size: 32, offset: 2048)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1654, file: !1604, line: 58, baseType: !1118, size: 32, offset: 2080)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1642, file: !1604, line: 106, baseType: !1663, size: 6144, offset: 320)
!1663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1124, size: 6144, elements: !1664)
!1664 = !{!1665}
!1665 = !DISubrange(count: 768)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1642, file: !1604, line: 107, baseType: !1667, size: 64, offset: 6464)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64)
!1668 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1604, line: 97, baseType: !1669)
!1669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1604, line: 83, size: 8320, elements: !1670)
!1670 = !{!1671, !1672, !1673, !1676, !1677, !1678, !1679}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1669, file: !1604, line: 84, baseType: !1663, size: 6144)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1669, file: !1604, line: 87, baseType: !1657, size: 2048, offset: 6144)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1669, file: !1604, line: 88, baseType: !1674, size: 64, offset: 8192)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64)
!1675 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1467, line: 41, flags: DIFlagFwdDecl)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1669, file: !1604, line: 90, baseType: !1166, size: 16, offset: 8256)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1669, file: !1604, line: 92, baseType: !1166, size: 16, offset: 8272)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1669, file: !1604, line: 93, baseType: !1166, size: 16, offset: 8288)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1669, file: !1604, line: 95, baseType: !1166, size: 16, offset: 8304)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1642, file: !1604, line: 108, baseType: !1681, size: 64, offset: 6528)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1604, line: 66, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1604, line: 61, size: 128, elements: !1684)
!1684 = !{!1685, !1686, !1687, !1688}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1683, file: !1604, line: 62, baseType: !1118, size: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1683, file: !1604, line: 63, baseType: !1118, size: 32, offset: 32)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1683, file: !1604, line: 64, baseType: !1118, size: 32, offset: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1683, file: !1604, line: 65, baseType: !1118, size: 32, offset: 96)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1642, file: !1604, line: 109, baseType: !1690, size: 64, offset: 6592)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1604, line: 71, baseType: !1692)
!1692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1604, line: 68, size: 64, elements: !1693)
!1693 = !{!1694, !1695}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1692, file: !1604, line: 69, baseType: !1118, size: 32)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1692, file: !1604, line: 70, baseType: !1118, size: 32, offset: 32)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1642, file: !1604, line: 110, baseType: !1697, size: 64, offset: 6656)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64)
!1698 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1604, line: 81, baseType: !1699)
!1699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1604, line: 73, size: 352, elements: !1700)
!1700 = !{!1701, !1702, !1703, !1704, !1705}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1699, file: !1604, line: 74, baseType: !1268, size: 96)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1699, file: !1604, line: 75, baseType: !1268, size: 96, offset: 96)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1699, file: !1604, line: 76, baseType: !1268, size: 96, offset: 192)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1699, file: !1604, line: 77, baseType: !1118, size: 32, offset: 288)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1699, file: !1604, line: 78, baseType: !1118, size: 32, offset: 320)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1642, file: !1604, line: 113, baseType: !1707, size: 512, offset: 6720)
!1707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1708, line: 182, baseType: !1709)
!1708 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1708, line: 180, size: 512, elements: !1710)
!1710 = !{!1711}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1709, file: !1708, line: 181, baseType: !1123, size: 512)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1612, file: !1604, line: 148, baseType: !1224, size: 64, offset: 1408)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1612, file: !1604, line: 151, baseType: !1128, size: 64, offset: 1472)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1612, file: !1604, line: 152, baseType: !1204, size: 64, offset: 1536)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1612, file: !1604, line: 153, baseType: !1716, size: 64, offset: 1600)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64)
!1717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1718, line: 64, size: 19136, elements: !1719)
!1718 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1719 = !{!1720, !1721, !1722, !1723, !1724, !1725, !1727, !1728, !1729, !1730, !1733, !1734, !1979, !1980, !1988, !1989, !1990, !1991, !1992}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1717, file: !1718, line: 65, baseType: !1133, size: 960)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1717, file: !1718, line: 66, baseType: !1200, size: 64, offset: 960)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1717, file: !1718, line: 68, baseType: !1153, size: 8192, offset: 1024)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1717, file: !1718, line: 70, baseType: !1118, size: 32, offset: 9216)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1717, file: !1718, line: 71, baseType: !1118, size: 32, offset: 9248)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1717, file: !1718, line: 72, baseType: !1726, size: 64, offset: 9280)
!1726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1118, size: 64, elements: !1462)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1717, file: !1718, line: 74, baseType: !1233, size: 32, offset: 9344)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1717, file: !1718, line: 74, baseType: !1233, size: 32, offset: 9376)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1717, file: !1718, line: 76, baseType: !1674, size: 64, offset: 9408)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1717, file: !1718, line: 77, baseType: !1731, size: 64, offset: 9472)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64)
!1732 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1718, line: 77, flags: DIFlagFwdDecl)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1717, file: !1718, line: 78, baseType: !1299, size: 64, offset: 9536)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1717, file: !1718, line: 80, baseType: !1735, size: 2624, offset: 9600)
!1735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1736, line: 340, size: 2624, elements: !1737)
!1736 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1737 = !{!1738, !1766, !1784, !1785, !1786, !1801, !1859, !1860, !1959, !1960, !1961, !1962, !1968}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1735, file: !1736, line: 341, baseType: !1739, size: 576)
!1739 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1736, line: 251, baseType: !1740)
!1740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1736, line: 207, size: 576, elements: !1741)
!1741 = !{!1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765}
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1740, file: !1736, line: 208, baseType: !1118, size: 32)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1740, file: !1736, line: 211, baseType: !1166, size: 16, offset: 32)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1740, file: !1736, line: 212, baseType: !1166, size: 16, offset: 48)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1740, file: !1736, line: 213, baseType: !1233, size: 32, offset: 64)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1740, file: !1736, line: 214, baseType: !1166, size: 16, offset: 96)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1740, file: !1736, line: 215, baseType: !1166, size: 16, offset: 112)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1740, file: !1736, line: 216, baseType: !1166, size: 16, offset: 128)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1740, file: !1736, line: 217, baseType: !1166, size: 16, offset: 144)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1740, file: !1736, line: 218, baseType: !1166, size: 16, offset: 160)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1740, file: !1736, line: 219, baseType: !1166, size: 16, offset: 176)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1740, file: !1736, line: 220, baseType: !1233, size: 32, offset: 192)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1740, file: !1736, line: 222, baseType: !1166, size: 16, offset: 224)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1740, file: !1736, line: 225, baseType: !1166, size: 16, offset: 240)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1740, file: !1736, line: 228, baseType: !1118, size: 32, offset: 256)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1740, file: !1736, line: 229, baseType: !1118, size: 32, offset: 288)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1740, file: !1736, line: 233, baseType: !1118, size: 32, offset: 320)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1740, file: !1736, line: 236, baseType: !1166, size: 16, offset: 352)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1740, file: !1736, line: 236, baseType: !1166, size: 16, offset: 368)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1740, file: !1736, line: 241, baseType: !1233, size: 32, offset: 384)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1740, file: !1736, line: 244, baseType: !1118, size: 32, offset: 416)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1740, file: !1736, line: 244, baseType: !1118, size: 32, offset: 448)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1740, file: !1736, line: 245, baseType: !1233, size: 32, offset: 480)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1740, file: !1736, line: 248, baseType: !1233, size: 32, offset: 512)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1740, file: !1736, line: 250, baseType: !1118, size: 32, offset: 544)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1735, file: !1736, line: 342, baseType: !1767, size: 448, offset: 576)
!1767 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1736, line: 79, baseType: !1768)
!1768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1736, line: 61, size: 448, elements: !1769)
!1769 = !{!1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783}
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1768, file: !1736, line: 62, baseType: !1138, size: 64)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1768, file: !1736, line: 64, baseType: !1166, size: 16, offset: 64)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1768, file: !1736, line: 65, baseType: !1166, size: 16, offset: 80)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1768, file: !1736, line: 67, baseType: !1233, size: 32, offset: 96)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1768, file: !1736, line: 68, baseType: !1233, size: 32, offset: 128)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1768, file: !1736, line: 69, baseType: !1233, size: 32, offset: 160)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1768, file: !1736, line: 70, baseType: !1166, size: 16, offset: 192)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1768, file: !1736, line: 71, baseType: !1166, size: 16, offset: 208)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1768, file: !1736, line: 72, baseType: !1461, size: 64, offset: 224)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1768, file: !1736, line: 75, baseType: !1233, size: 32, offset: 288)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1768, file: !1736, line: 75, baseType: !1233, size: 32, offset: 320)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1768, file: !1736, line: 75, baseType: !1233, size: 32, offset: 352)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1768, file: !1736, line: 78, baseType: !1233, size: 32, offset: 384)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1768, file: !1736, line: 78, baseType: !1233, size: 32, offset: 416)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1735, file: !1736, line: 343, baseType: !1189, size: 128, offset: 1024)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1735, file: !1736, line: 344, baseType: !1189, size: 128, offset: 1152)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1735, file: !1736, line: 345, baseType: !1787, size: 192, offset: 1280)
!1787 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1736, line: 278, baseType: !1788)
!1788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1736, line: 270, size: 192, elements: !1789)
!1789 = !{!1790, !1791, !1792, !1793, !1794}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1788, file: !1736, line: 271, baseType: !1118, size: 32)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1788, file: !1736, line: 273, baseType: !1233, size: 32, offset: 32)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1788, file: !1736, line: 275, baseType: !1118, size: 32, offset: 64)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1788, file: !1736, line: 276, baseType: !1118, size: 32, offset: 96)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1788, file: !1736, line: 277, baseType: !1795, size: 64, offset: 128)
!1795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1796, size: 64)
!1796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1736, line: 55, size: 576, elements: !1797)
!1797 = !{!1798, !1799, !1800}
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1796, file: !1736, line: 56, baseType: !1118, size: 32)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1796, file: !1736, line: 57, baseType: !1233, size: 32, offset: 32)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1796, file: !1736, line: 58, baseType: !1350, size: 512, offset: 64)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1735, file: !1736, line: 346, baseType: !1802, size: 384, offset: 1472)
!1802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1736, line: 268, baseType: !1803)
!1803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1736, line: 253, size: 384, elements: !1804)
!1804 = !{!1805, !1806, !1807, !1808, !1809, !1853, !1854, !1855, !1856, !1857, !1858}
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1803, file: !1736, line: 254, baseType: !1118, size: 32)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1803, file: !1736, line: 255, baseType: !1118, size: 32, offset: 32)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1803, file: !1736, line: 255, baseType: !1118, size: 32, offset: 64)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1803, file: !1736, line: 258, baseType: !1233, size: 32, offset: 96)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1803, file: !1736, line: 259, baseType: !1810, size: 64, offset: 128)
!1810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1811, size: 64)
!1811 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1736, line: 164, baseType: !1812)
!1812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1736, line: 108, size: 1664, elements: !1813)
!1813 = !{!1814, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852}
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1812, file: !1736, line: 109, baseType: !1815, size: 64)
!1815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1812, size: 64)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1812, file: !1736, line: 109, baseType: !1815, size: 64, offset: 64)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1812, file: !1736, line: 111, baseType: !1123, size: 512, offset: 128)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1812, file: !1736, line: 119, baseType: !1461, size: 64, offset: 640)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1812, file: !1736, line: 119, baseType: !1461, size: 64, offset: 704)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1812, file: !1736, line: 125, baseType: !1461, size: 64, offset: 768)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1812, file: !1736, line: 125, baseType: !1461, size: 64, offset: 832)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1812, file: !1736, line: 127, baseType: !1461, size: 64, offset: 896)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1812, file: !1736, line: 130, baseType: !1118, size: 32, offset: 960)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1812, file: !1736, line: 131, baseType: !1118, size: 32, offset: 992)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1812, file: !1736, line: 132, baseType: !1826, size: 64, offset: 1024)
!1826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1827, size: 64)
!1827 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1736, line: 106, baseType: !1828)
!1828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1736, line: 81, size: 512, elements: !1829)
!1829 = !{!1830, !1831, !1834, !1835, !1836, !1837}
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1828, file: !1736, line: 82, baseType: !1461, size: 64)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1828, file: !1736, line: 97, baseType: !1832, size: 256, offset: 64)
!1832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 256, elements: !1833)
!1833 = !{!1343, !1463}
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1828, file: !1736, line: 102, baseType: !1461, size: 64, offset: 320)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1828, file: !1736, line: 102, baseType: !1461, size: 64, offset: 384)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1828, file: !1736, line: 104, baseType: !1118, size: 32, offset: 448)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1828, file: !1736, line: 105, baseType: !1118, size: 32, offset: 480)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1812, file: !1736, line: 135, baseType: !1268, size: 96, offset: 1088)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1812, file: !1736, line: 136, baseType: !1233, size: 32, offset: 1184)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1812, file: !1736, line: 139, baseType: !1118, size: 32, offset: 1216)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1812, file: !1736, line: 139, baseType: !1118, size: 32, offset: 1248)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1812, file: !1736, line: 139, baseType: !1118, size: 32, offset: 1280)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1812, file: !1736, line: 140, baseType: !1268, size: 96, offset: 1312)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1812, file: !1736, line: 143, baseType: !1166, size: 16, offset: 1408)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1812, file: !1736, line: 144, baseType: !1166, size: 16, offset: 1424)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1812, file: !1736, line: 145, baseType: !1166, size: 16, offset: 1440)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1812, file: !1736, line: 148, baseType: !1166, size: 16, offset: 1456)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1812, file: !1736, line: 149, baseType: !1118, size: 32, offset: 1472)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1812, file: !1736, line: 150, baseType: !1233, size: 32, offset: 1504)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1812, file: !1736, line: 152, baseType: !1299, size: 64, offset: 1536)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1812, file: !1736, line: 163, baseType: !1233, size: 32, offset: 1600)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1812, file: !1736, line: 163, baseType: !1233, size: 32, offset: 1632)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1803, file: !1736, line: 261, baseType: !1233, size: 32, offset: 192)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1803, file: !1736, line: 261, baseType: !1233, size: 32, offset: 224)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1803, file: !1736, line: 261, baseType: !1233, size: 32, offset: 256)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1803, file: !1736, line: 263, baseType: !1118, size: 32, offset: 288)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1803, file: !1736, line: 266, baseType: !1118, size: 32, offset: 320)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1803, file: !1736, line: 267, baseType: !1233, size: 32, offset: 352)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1735, file: !1736, line: 347, baseType: !1810, size: 64, offset: 1856)
