; ModuleID = 'blender/source/blender/editors/interface/interface_layout.c'
source_filename = "blender/source/blender/editors/interface/interface_layout.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!1049 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!1050 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!1051 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!1052 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!1053 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!1054 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!1055 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!1056 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!1057 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!1058 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!1059 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!1060 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!1061 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!1062 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!1063 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!1064 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!1065 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!1066 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyUnit", file: !958, line: 82, baseType: !6, size: 32, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1068 = !DIEnumerator(name: "PROP_UNIT_NONE", value: 0, isUnsigned: true)
!1069 = !DIEnumerator(name: "PROP_UNIT_LENGTH", value: 65536, isUnsigned: true)
!1070 = !DIEnumerator(name: "PROP_UNIT_AREA", value: 131072, isUnsigned: true)
!1071 = !DIEnumerator(name: "PROP_UNIT_VOLUME", value: 196608, isUnsigned: true)
!1072 = !DIEnumerator(name: "PROP_UNIT_MASS", value: 262144, isUnsigned: true)
!1073 = !DIEnumerator(name: "PROP_UNIT_ROTATION", value: 327680, isUnsigned: true)
!1074 = !DIEnumerator(name: "PROP_UNIT_TIME", value: 393216, isUnsigned: true)
!1075 = !DIEnumerator(name: "PROP_UNIT_VELOCITY", value: 458752, isUnsigned: true)
!1076 = !DIEnumerator(name: "PROP_UNIT_ACCELERATION", value: 524288, isUnsigned: true)
!1077 = !DIEnumerator(name: "PROP_UNIT_CAMERA", value: 589824, isUnsigned: true)
!1078 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1079, line: 123, baseType: !6, size: 32, elements: !1080)
!1079 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1080 = !{!1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!1081 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!1082 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!1083 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!1084 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!1085 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!1086 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!1087 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!1088 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!1089 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!1090 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1012, line: 166, baseType: !6, size: 32, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098}
!1092 = !DIEnumerator(name: "UI_PIE_DEGREES_RANGE_LARGE", value: 1, isUnsigned: true)
!1093 = !DIEnumerator(name: "UI_PIE_INITIAL_DIRECTION", value: 2, isUnsigned: true)
!1094 = !DIEnumerator(name: "UI_PIE_DRAG_STYLE", value: 4, isUnsigned: true)
!1095 = !DIEnumerator(name: "UI_PIE_INVALID_DIR", value: 8, isUnsigned: true)
!1096 = !DIEnumerator(name: "UI_PIE_CLICK_STYLE", value: 16, isUnsigned: true)
!1097 = !DIEnumerator(name: "UI_PIE_ANIMATION_FINISHED", value: 32, isUnsigned: true)
!1098 = !DIEnumerator(name: "UI_PIE_GESTURE_END_WAIT", value: 64, isUnsigned: true)
!1099 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RadialDirection", file: !1012, line: 126, baseType: !1100, size: 32, elements: !1101)
!1100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110}
!1102 = !DIEnumerator(name: "UI_RADIAL_NONE", value: -1)
!1103 = !DIEnumerator(name: "UI_RADIAL_N", value: 0)
!1104 = !DIEnumerator(name: "UI_RADIAL_NE", value: 1)
!1105 = !DIEnumerator(name: "UI_RADIAL_E", value: 2)
!1106 = !DIEnumerator(name: "UI_RADIAL_SE", value: 3)
!1107 = !DIEnumerator(name: "UI_RADIAL_S", value: 4)
!1108 = !DIEnumerator(name: "UI_RADIAL_SW", value: 5)
!1109 = !DIEnumerator(name: "UI_RADIAL_W", value: 6)
!1110 = !DIEnumerator(name: "UI_RADIAL_NW", value: 7)
!1111 = !{!1112, !1113, !2030, !2032, !2057, !2156, !1100, !2159, !1946, !2289, !1855, !2299, !2308, !2314, !2321, !1180, !2327}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiLayout", file: !20, line: 85, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !3, line: 133, size: 704, elements: !1116)
!1116 = !{!1117, !1126, !2007, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !1115, file: !3, line: 134, baseType: !1118, size: 192)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiItem", file: !3, line: 126, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiItem", file: !3, line: 122, size: 192, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1125}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1119, file: !3, line: 123, baseType: !1112, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1119, file: !3, line: 123, baseType: !1112, size: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1119, file: !3, line: 124, baseType: !1124, size: 32, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiItemType", file: !3, line: 120, baseType: !5)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1119, file: !3, line: 125, baseType: !1100, size: 32, offset: 160)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1115, file: !3, line: 136, baseType: !1127, size: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiLayoutRoot", file: !3, line: 94, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayoutRoot", file: !3, line: 79, size: 640, elements: !1130)
!1130 = !{!1131, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1146, !1147, !1196, !2006}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1129, file: !3, line: 80, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1129, file: !3, line: 80, baseType: !1132, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1129, file: !3, line: 82, baseType: !1100, size: 32, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "opcontext", scope: !1129, file: !3, line: 83, baseType: !1100, size: 32, offset: 160)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "emw", scope: !1129, file: !3, line: 85, baseType: !1100, size: 32, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "emh", scope: !1129, file: !3, line: 85, baseType: !1100, size: 32, offset: 224)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !1129, file: !3, line: 86, baseType: !1100, size: 32, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "handlefunc", scope: !1129, file: !3, line: 88, baseType: !1140, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiMenuHandleFunc", file: !20, line: 346, baseType: !1141)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{null, !1144, !1112, !1100}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !958, line: 44, flags: DIFlagFwdDecl)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !1129, file: !3, line: 89, baseType: !1112, size: 64, offset: 384)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1129, file: !3, line: 91, baseType: !1148, size: 64, offset: 448)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiStyle", file: !1150, line: 120, baseType: !1151)
!1150 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiStyle", file: !1150, line: 96, size: 1856, elements: !1152)
!1152 = !{!1153, !1155, !1156, !1161, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1151, file: !1150, line: 97, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1151, file: !1150, line: 97, baseType: !1154, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1151, file: !1150, line: 99, baseType: !1157, size: 512, offset: 128)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 512, elements: !1159)
!1158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1159 = !{!1160}
!1160 = !DISubrange(count: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "paneltitle", scope: !1151, file: !1150, line: 101, baseType: !1162, size: 256, offset: 640)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiFontStyle", file: !1150, line: 84, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiFontStyle", file: !1150, line: 73, size: 256, elements: !1164)
!1164 = !{!1165, !1167, !1168, !1169, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1181}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "uifont_id", scope: !1163, file: !1150, line: 74, baseType: !1166, size: 16)
!1166 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1163, file: !1150, line: 75, baseType: !1166, size: 16, offset: 16)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !1163, file: !1150, line: 76, baseType: !1166, size: 16, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1163, file: !1150, line: 77, baseType: !1170, size: 48, offset: 48)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 48, elements: !1171)
!1171 = !{!1172}
!1172 = !DISubrange(count: 6)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "italic", scope: !1163, file: !1150, line: 78, baseType: !1166, size: 16, offset: 96)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "bold", scope: !1163, file: !1150, line: 78, baseType: !1166, size: 16, offset: 112)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !1163, file: !1150, line: 79, baseType: !1166, size: 16, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "shadx", scope: !1163, file: !1150, line: 80, baseType: !1166, size: 16, offset: 144)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "shady", scope: !1163, file: !1150, line: 80, baseType: !1166, size: 16, offset: 160)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1163, file: !1150, line: 81, baseType: !1166, size: 16, offset: 176)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "shadowalpha", scope: !1163, file: !1150, line: 82, baseType: !1180, size: 32, offset: 192)
!1180 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "shadowcolor", scope: !1163, file: !1150, line: 83, baseType: !1180, size: 32, offset: 224)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "grouplabel", scope: !1151, file: !1150, line: 102, baseType: !1162, size: 256, offset: 896)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "widgetlabel", scope: !1151, file: !1150, line: 103, baseType: !1162, size: 256, offset: 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !1151, file: !1150, line: 104, baseType: !1162, size: 256, offset: 1408)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "panelzoom", scope: !1151, file: !1150, line: 106, baseType: !1180, size: 32, offset: 1664)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "minlabelchars", scope: !1151, file: !1150, line: 108, baseType: !1166, size: 16, offset: 1696)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "minwidgetchars", scope: !1151, file: !1150, line: 109, baseType: !1166, size: 16, offset: 1712)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "columnspace", scope: !1151, file: !1150, line: 111, baseType: !1166, size: 16, offset: 1728)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "templatespace", scope: !1151, file: !1150, line: 112, baseType: !1166, size: 16, offset: 1744)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "boxspace", scope: !1151, file: !1150, line: 113, baseType: !1166, size: 16, offset: 1760)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "buttonspacex", scope: !1151, file: !1150, line: 114, baseType: !1166, size: 16, offset: 1776)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "buttonspacey", scope: !1151, file: !1150, line: 115, baseType: !1166, size: 16, offset: 1792)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "panelspace", scope: !1151, file: !1150, line: 116, baseType: !1166, size: 16, offset: 1808)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "panelouter", scope: !1151, file: !1150, line: 117, baseType: !1166, size: 16, offset: 1824)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1151, file: !1150, line: 119, baseType: !1166, size: 16, offset: 1840)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1129, file: !3, line: 92, baseType: !1197, size: 64, offset: 512)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlock", file: !20, line: 83, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !1012, line: 320, size: 5440, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1210, !1303, !1304, !1305, !1306, !1307, !1308, !1312, !1316, !1325, !1326, !1327, !1332, !1333, !1334, !1336, !1337, !1338, !1339, !1341, !1342, !1394, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1414, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1986, !1987, !1988, !1991, !1993, !1994, !1995}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1199, file: !1012, line: 321, baseType: !1197, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1199, file: !1012, line: 321, baseType: !1197, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buttons", scope: !1199, file: !1012, line: 323, baseType: !1204, size: 128, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1205, line: 71, baseType: !1206)
!1205 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1205, line: 69, size: 128, elements: !1207)
!1207 = !{!1208, !1209}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1206, file: !1205, line: 70, baseType: !1112, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1206, file: !1205, line: 70, baseType: !1112, size: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "panel", scope: !1199, file: !1012, line: 324, baseType: !1211, size: 64, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "Panel", file: !1213, line: 113, baseType: !1214)
!1213 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Panel", file: !1213, line: 97, size: 2176, elements: !1215)
!1215 = !{!1216, !1218, !1219, !1285, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1214, file: !1213, line: 98, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1214, file: !1213, line: 98, baseType: !1217, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1214, file: !1213, line: 100, baseType: !1220, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PanelType", file: !1222, line: 169, size: 3264, elements: !1223)
!1222 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1223 = !{!1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1240, !1244, !1245}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1221, file: !1222, line: 170, baseType: !1220, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1221, file: !1222, line: 170, baseType: !1220, size: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1221, file: !1222, line: 172, baseType: !1157, size: 512, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1221, file: !1222, line: 173, baseType: !1157, size: 512, offset: 640)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1221, file: !1222, line: 174, baseType: !1157, size: 512, offset: 1152)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1221, file: !1222, line: 175, baseType: !1157, size: 512, offset: 1664)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1221, file: !1222, line: 176, baseType: !1157, size: 512, offset: 2176)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "space_type", scope: !1221, file: !1222, line: 177, baseType: !1100, size: 32, offset: 2688)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !1221, file: !1222, line: 178, baseType: !1100, size: 32, offset: 2720)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1221, file: !1222, line: 180, baseType: !1100, size: 32, offset: 2752)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !1221, file: !1222, line: 183, baseType: !1235, size: 64, offset: 2816)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!1100, !1238, !1220}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "draw_header", scope: !1221, file: !1222, line: 185, baseType: !1241, size: 64, offset: 2880)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !1238, !1217}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1221, file: !1222, line: 187, baseType: !1241, size: 64, offset: 2944)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1221, file: !1222, line: 190, baseType: !1246, size: 256, offset: 3008)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !958, line: 436, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !958, line: 430, size: 256, elements: !1248)
!1248 = !{!1249, !1250, !1254, !1280}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1247, file: !958, line: 431, baseType: !1112, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1247, file: !958, line: 432, baseType: !1251, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !958, line: 417, baseType: !1253)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !958, line: 41, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1247, file: !958, line: 433, baseType: !1255, size: 64, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !958, line: 408, baseType: !1256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!1100, !1144, !1259, !1269, !1271}
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !958, line: 55, size: 192, elements: !1261)
!1261 = !{!1262, !1266, !1268}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1260, file: !958, line: 58, baseType: !1263, size: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1260, file: !958, line: 56, size: 64, elements: !1264)
!1264 = !{!1265}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1263, file: !958, line: 57, baseType: !1112, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1260, file: !958, line: 60, baseType: !1267, size: 64, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1260, file: !958, line: 61, baseType: !1112, size: 64, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !958, line: 38, flags: DIFlagFwdDecl)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !958, line: 348, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !958, line: 337, size: 256, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1278, !1279}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1273, file: !958, line: 339, baseType: !1112, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1273, file: !958, line: 342, baseType: !1269, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1273, file: !958, line: 345, baseType: !1100, size: 32, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1273, file: !958, line: 347, baseType: !1100, size: 32, offset: 160)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1273, file: !958, line: 347, baseType: !1100, size: 32, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1247, file: !958, line: 434, baseType: !1281, size: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !958, line: 409, baseType: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{null, !1112}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1214, file: !1213, line: 101, baseType: !1286, size: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "panelname", scope: !1214, file: !1213, line: 103, baseType: !1157, size: 512, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "tabname", scope: !1214, file: !1213, line: 103, baseType: !1157, size: 512, offset: 768)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "drawname", scope: !1214, file: !1213, line: 104, baseType: !1157, size: 512, offset: 1280)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "ofsx", scope: !1214, file: !1213, line: 105, baseType: !1100, size: 32, offset: 1792)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "ofsy", scope: !1214, file: !1213, line: 105, baseType: !1100, size: 32, offset: 1824)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1214, file: !1213, line: 105, baseType: !1100, size: 32, offset: 1856)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1214, file: !1213, line: 105, baseType: !1100, size: 32, offset: 1888)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "labelofs", scope: !1214, file: !1213, line: 106, baseType: !1166, size: 16, offset: 1920)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1214, file: !1213, line: 106, baseType: !1166, size: 16, offset: 1936)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1214, file: !1213, line: 107, baseType: !1166, size: 16, offset: 1952)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_flag", scope: !1214, file: !1213, line: 107, baseType: !1166, size: 16, offset: 1968)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1214, file: !1213, line: 108, baseType: !1166, size: 16, offset: 1984)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "snap", scope: !1214, file: !1213, line: 109, baseType: !1166, size: 16, offset: 2000)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "sortorder", scope: !1214, file: !1213, line: 110, baseType: !1100, size: 32, offset: 2016)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "paneltab", scope: !1214, file: !1213, line: 111, baseType: !1217, size: 64, offset: 2048)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "activedata", scope: !1214, file: !1213, line: 112, baseType: !1112, size: 64, offset: 2112)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "oldblock", scope: !1199, file: !1012, line: 325, baseType: !1197, size: 64, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "butstore", scope: !1199, file: !1012, line: 327, baseType: !1204, size: 128, offset: 384)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "layouts", scope: !1199, file: !1012, line: 329, baseType: !1204, size: 128, offset: 512)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "curlayout", scope: !1199, file: !1012, line: 330, baseType: !1286, size: 64, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "contexts", scope: !1199, file: !1012, line: 332, baseType: !1204, size: 128, offset: 704)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1199, file: !1012, line: 334, baseType: !1309, size: 1024, offset: 832)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 1024, elements: !1310)
!1310 = !{!1311}
!1311 = !DISubrange(count: 128)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !1199, file: !1012, line: 336, baseType: !1313, size: 512, offset: 1856)
!1313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1180, size: 512, elements: !1314)
!1314 = !{!1315, !1315}
!1315 = !DISubrange(count: 4)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1199, file: !1012, line: 338, baseType: !1317, size: 128, offset: 2368)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1318, line: 95, baseType: !1319)
!1318 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1318, line: 92, size: 128, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1324}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1319, file: !1318, line: 93, baseType: !1180, size: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1319, file: !1318, line: 93, baseType: !1180, size: 32, offset: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1319, file: !1318, line: 94, baseType: !1180, size: 32, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1319, file: !1318, line: 94, baseType: !1180, size: 32, offset: 96)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !1199, file: !1012, line: 339, baseType: !1180, size: 32, offset: 2496)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "puphash", scope: !1199, file: !1012, line: 341, baseType: !6, size: 32, offset: 2528)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1199, file: !1012, line: 343, baseType: !1328, size: 64, offset: 2560)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleFunc", file: !20, line: 336, baseType: !1329)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{null, !1144, !1112, !1112}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !1199, file: !1012, line: 344, baseType: !1112, size: 64, offset: 2624)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !1199, file: !1012, line: 345, baseType: !1112, size: 64, offset: 2688)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !1199, file: !1012, line: 347, baseType: !1335, size: 64, offset: 2752)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleNFunc", file: !20, line: 338, baseType: !1329)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !1199, file: !1012, line: 348, baseType: !1112, size: 64, offset: 2816)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func", scope: !1199, file: !1012, line: 350, baseType: !1140, size: 64, offset: 2880)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func_arg", scope: !1199, file: !1012, line: 351, baseType: !1112, size: 64, offset: 2944)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func", scope: !1199, file: !1012, line: 353, baseType: !1340, size: 64, offset: 3008)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockHandleFunc", file: !20, line: 341, baseType: !1141)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func_arg", scope: !1199, file: !1012, line: 354, baseType: !1112, size: 64, offset: 3072)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "block_event_func", scope: !1199, file: !1012, line: 357, baseType: !1343, size: 64, offset: 3136)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!1100, !1238, !1346, !1347}
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !1021, line: 421, size: 960, elements: !1350)
!1350 = !{!1351, !1353, !1354, !1355, !1356, !1357, !1358, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1382, !1390, !1391, !1392, !1393}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1349, file: !1021, line: 422, baseType: !1352, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1349, file: !1021, line: 422, baseType: !1352, size: 64, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1349, file: !1021, line: 424, baseType: !1166, size: 16, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1349, file: !1021, line: 425, baseType: !1166, size: 16, offset: 144)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1349, file: !1021, line: 426, baseType: !1100, size: 32, offset: 160)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1349, file: !1021, line: 426, baseType: !1100, size: 32, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !1349, file: !1021, line: 427, baseType: !1359, size: 64, offset: 224)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 64, elements: !1360)
!1360 = !{!1361}
!1361 = !DISubrange(count: 2)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !1349, file: !1021, line: 428, baseType: !1170, size: 48, offset: 288)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !1349, file: !1021, line: 431, baseType: !1158, size: 8, offset: 336)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1349, file: !1021, line: 432, baseType: !1158, size: 8, offset: 344)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !1349, file: !1021, line: 435, baseType: !1166, size: 16, offset: 352)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !1349, file: !1021, line: 436, baseType: !1166, size: 16, offset: 368)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !1349, file: !1021, line: 437, baseType: !1100, size: 32, offset: 384)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !1349, file: !1021, line: 437, baseType: !1100, size: 32, offset: 416)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !1349, file: !1021, line: 438, baseType: !1370, size: 64, offset: 448)
!1370 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !1349, file: !1021, line: 439, baseType: !1100, size: 32, offset: 512)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !1349, file: !1021, line: 439, baseType: !1100, size: 32, offset: 544)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1349, file: !1021, line: 442, baseType: !1166, size: 16, offset: 576)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !1349, file: !1021, line: 442, baseType: !1166, size: 16, offset: 592)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1349, file: !1021, line: 442, baseType: !1166, size: 16, offset: 608)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !1349, file: !1021, line: 442, baseType: !1166, size: 16, offset: 624)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !1349, file: !1021, line: 443, baseType: !1166, size: 16, offset: 640)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !1349, file: !1021, line: 446, baseType: !1166, size: 16, offset: 656)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !1349, file: !1021, line: 449, baseType: !1380, size: 64, offset: 704)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1158)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !1349, file: !1021, line: 452, baseType: !1383, size: 64, offset: 768)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !1021, line: 463, size: 128, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1389}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1384, file: !1021, line: 464, baseType: !1100, size: 32)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1384, file: !1021, line: 465, baseType: !1180, size: 32, offset: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1384, file: !1021, line: 466, baseType: !1180, size: 32, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1384, file: !1021, line: 467, baseType: !1180, size: 32, offset: 96)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !1349, file: !1021, line: 455, baseType: !1166, size: 16, offset: 832)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !1349, file: !1021, line: 456, baseType: !1166, size: 16, offset: 848)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1349, file: !1021, line: 457, baseType: !1100, size: 32, offset: 864)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1349, file: !1021, line: 458, baseType: !1112, size: 64, offset: 896)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra", scope: !1199, file: !1012, line: 360, baseType: !1395, size: 64, offset: 3200)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{null, !1238, !1112, !1112, !1112, !1398}
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1318, line: 89, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1318, line: 86, size: 128, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1400, file: !1318, line: 87, baseType: !1100, size: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1400, file: !1318, line: 87, baseType: !1100, size: 32, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1400, file: !1318, line: 88, baseType: !1100, size: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1400, file: !1318, line: 88, baseType: !1100, size: 32, offset: 96)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg1", scope: !1199, file: !1012, line: 361, baseType: !1112, size: 64, offset: 3264)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg2", scope: !1199, file: !1012, line: 362, baseType: !1112, size: 64, offset: 3328)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1199, file: !1012, line: 364, baseType: !1100, size: 32, offset: 3392)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !1199, file: !1012, line: 365, baseType: !1166, size: 16, offset: 3424)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1199, file: !1012, line: 367, baseType: !1158, size: 8, offset: 3440)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1199, file: !1012, line: 368, baseType: !1158, size: 8, offset: 3448)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open", scope: !1199, file: !1012, line: 369, baseType: !1413, size: 8, offset: 3456)
!1413 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1199, file: !1012, line: 370, baseType: !1415, size: 56, offset: 3464)
!1415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 56, elements: !1416)
!1416 = !{!1417}
!1417 = !DISubrange(count: 7)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open_last", scope: !1199, file: !1012, line: 371, baseType: !1370, size: 64, offset: 3520)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !1199, file: !1012, line: 373, baseType: !1380, size: 64, offset: 3584)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1199, file: !1012, line: 375, baseType: !1158, size: 8, offset: 3648)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1199, file: !1012, line: 376, baseType: !1158, size: 8, offset: 3656)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "tooltipdisabled", scope: !1199, file: !1012, line: 377, baseType: !1158, size: 8, offset: 3664)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "endblock", scope: !1199, file: !1012, line: 378, baseType: !1158, size: 8, offset: 3672)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "bounds_type", scope: !1199, file: !1012, line: 380, baseType: !1425, size: 32, offset: 3680)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBlockBoundsCalc", file: !20, line: 434, baseType: !19)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !1199, file: !1012, line: 381, baseType: !1100, size: 32, offset: 3712)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "my", scope: !1199, file: !1012, line: 381, baseType: !1100, size: 32, offset: 3744)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1199, file: !1012, line: 382, baseType: !1100, size: 32, offset: 3776)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "minbounds", scope: !1199, file: !1012, line: 382, baseType: !1100, size: 32, offset: 3808)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !1199, file: !1012, line: 384, baseType: !1317, size: 128, offset: 3840)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "saferct", scope: !1199, file: !1012, line: 385, baseType: !1204, size: 128, offset: 3968)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1199, file: !1012, line: 387, baseType: !1433, size: 64, offset: 4096)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiPopupBlockHandle", file: !20, line: 84, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiPopupBlockHandle", file: !1012, line: 491, size: 1536, elements: !1436)
!1436 = !{!1437, !1857, !1858, !1859, !1860, !1861, !1862, !1866, !1867, !1886, !1887, !1892, !1972, !1975, !1976, !1977, !1978, !1979, !1980, !1983, !1984, !1985}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1435, file: !1012, line: 493, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !1213, line: 230, size: 3072, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1856}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1439, file: !1213, line: 231, baseType: !1438, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1439, file: !1213, line: 231, baseType: !1438, size: 64, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1439, file: !1213, line: 233, baseType: !1444, size: 1280, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1445, line: 71, baseType: !1446)
!1445 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1445, line: 40, size: 1280, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1452, !1453, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1472, !1473, !1474, !1477}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1446, file: !1445, line: 41, baseType: !1317, size: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1446, file: !1445, line: 41, baseType: !1317, size: 128, offset: 128)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1446, file: !1445, line: 42, baseType: !1399, size: 128, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1446, file: !1445, line: 42, baseType: !1399, size: 128, offset: 384)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1446, file: !1445, line: 43, baseType: !1399, size: 128, offset: 512)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1446, file: !1445, line: 45, baseType: !1454, size: 64, offset: 640)
!1454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1180, size: 64, elements: !1360)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1446, file: !1445, line: 45, baseType: !1454, size: 64, offset: 704)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1446, file: !1445, line: 46, baseType: !1180, size: 32, offset: 768)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1446, file: !1445, line: 46, baseType: !1180, size: 32, offset: 800)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1446, file: !1445, line: 48, baseType: !1166, size: 16, offset: 832)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1446, file: !1445, line: 49, baseType: !1166, size: 16, offset: 848)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1446, file: !1445, line: 51, baseType: !1166, size: 16, offset: 864)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1446, file: !1445, line: 52, baseType: !1166, size: 16, offset: 880)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1446, file: !1445, line: 53, baseType: !1166, size: 16, offset: 896)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1446, file: !1445, line: 55, baseType: !1166, size: 16, offset: 912)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1446, file: !1445, line: 56, baseType: !1166, size: 16, offset: 928)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1446, file: !1445, line: 58, baseType: !1166, size: 16, offset: 944)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1446, file: !1445, line: 58, baseType: !1166, size: 16, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1446, file: !1445, line: 59, baseType: !1166, size: 16, offset: 976)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1446, file: !1445, line: 59, baseType: !1166, size: 16, offset: 992)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1446, file: !1445, line: 61, baseType: !1166, size: 16, offset: 1008)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1446, file: !1445, line: 63, baseType: !1471, size: 64, offset: 1024)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1446, file: !1445, line: 64, baseType: !1100, size: 32, offset: 1088)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1446, file: !1445, line: 65, baseType: !1100, size: 32, offset: 1120)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1446, file: !1445, line: 68, baseType: !1475, size: 64, offset: 1152)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64)
!1476 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1445, line: 68, flags: DIFlagFwdDecl)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1446, file: !1445, line: 69, baseType: !1478, size: 64, offset: 1216)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1021, line: 490, size: 768, elements: !1480)
!1480 = !{!1481, !1482, !1483, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1479, file: !1021, line: 491, baseType: !1478, size: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1479, file: !1021, line: 491, baseType: !1478, size: 64, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1479, file: !1021, line: 493, baseType: !1484, size: 64, offset: 128)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1486, line: 169, size: 2048, elements: !1487)
!1486 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1487 = !{!1488, !1489, !1490, !1491, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1599, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1485, file: !1486, line: 170, baseType: !1484, size: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1485, file: !1486, line: 170, baseType: !1484, size: 64, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1485, file: !1486, line: 172, baseType: !1112, size: 64, offset: 128)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1485, file: !1486, line: 174, baseType: !1492, size: 64, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1213, line: 49, size: 1984, elements: !1494)
!1494 = !{!1495, !1554, !1555, !1556, !1557, !1558, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1493, file: !1213, line: 50, baseType: !1496, size: 960)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1497, line: 130, baseType: !1498)
!1497 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1497, line: 117, size: 960, elements: !1499)
!1499 = !{!1500, !1501, !1502, !1504, !1523, !1527, !1528, !1529, !1530, !1531}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1498, file: !1497, line: 118, baseType: !1112, size: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1498, file: !1497, line: 118, baseType: !1112, size: 64, offset: 64)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1498, file: !1497, line: 119, baseType: !1503, size: 64, offset: 128)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1498, file: !1497, line: 120, baseType: !1505, size: 64, offset: 192)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1497, line: 136, size: 17600, elements: !1507)
!1507 = !{!1508, !1509, !1511, !1514, !1518, !1519, !1520}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1506, file: !1497, line: 137, baseType: !1496, size: 960)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1506, file: !1497, line: 138, baseType: !1510, size: 64, offset: 960)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1506, file: !1497, line: 139, baseType: !1512, size: 64, offset: 1024)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64)
!1513 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1497, line: 43, flags: DIFlagFwdDecl)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1506, file: !1497, line: 140, baseType: !1515, size: 8192, offset: 1088)
!1515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 8192, elements: !1516)
!1516 = !{!1517}
!1517 = !DISubrange(count: 1024)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1506, file: !1497, line: 141, baseType: !1515, size: 8192, offset: 9280)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1506, file: !1497, line: 148, baseType: !1505, size: 64, offset: 17472)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1506, file: !1497, line: 150, baseType: !1521, size: 64, offset: 17536)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1497, line: 45, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1498, file: !1497, line: 121, baseType: !1524, size: 528, offset: 256)
!1524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 528, elements: !1525)
!1525 = !{!1526}
!1526 = !DISubrange(count: 66)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1498, file: !1497, line: 126, baseType: !1166, size: 16, offset: 784)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1498, file: !1497, line: 127, baseType: !1100, size: 32, offset: 800)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1498, file: !1497, line: 128, baseType: !1100, size: 32, offset: 832)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1498, file: !1497, line: 128, baseType: !1100, size: 32, offset: 864)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1498, file: !1497, line: 129, baseType: !1532, size: 64, offset: 896)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1497, line: 75, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1497, line: 62, size: 1024, elements: !1535)
!1535 = !{!1536, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1552, !1553}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1534, file: !1497, line: 63, baseType: !1537, size: 64)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1534, file: !1497, line: 63, baseType: !1537, size: 64, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1534, file: !1497, line: 64, baseType: !1158, size: 8, offset: 128)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1534, file: !1497, line: 64, baseType: !1158, size: 8, offset: 136)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1534, file: !1497, line: 65, baseType: !1166, size: 16, offset: 144)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1534, file: !1497, line: 66, baseType: !1157, size: 512, offset: 160)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1534, file: !1497, line: 67, baseType: !1100, size: 32, offset: 672)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1534, file: !1497, line: 69, baseType: !1545, size: 256, offset: 704)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1497, line: 60, baseType: !1546)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1497, line: 48, size: 256, elements: !1547)
!1547 = !{!1548, !1549, !1550, !1551}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1546, file: !1497, line: 49, baseType: !1112, size: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1546, file: !1497, line: 58, baseType: !1204, size: 128, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1546, file: !1497, line: 59, baseType: !1100, size: 32, offset: 192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1546, file: !1497, line: 59, baseType: !1100, size: 32, offset: 224)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1534, file: !1497, line: 70, baseType: !1100, size: 32, offset: 960)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1534, file: !1497, line: 74, baseType: !1100, size: 32, offset: 992)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1493, file: !1213, line: 52, baseType: !1204, size: 128, offset: 960)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1493, file: !1213, line: 53, baseType: !1204, size: 128, offset: 1088)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1493, file: !1213, line: 54, baseType: !1204, size: 128, offset: 1216)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1493, file: !1213, line: 55, baseType: !1204, size: 128, offset: 1344)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1493, file: !1213, line: 57, baseType: !1559, size: 64, offset: 1472)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64)
!1560 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1213, line: 45, flags: DIFlagFwdDecl)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "newscene", scope: !1493, file: !1213, line: 58, baseType: !1559, size: 64, offset: 1536)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "redraws_flag", scope: !1493, file: !1213, line: 60, baseType: !1100, size: 32, offset: 1600)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1493, file: !1213, line: 61, baseType: !1100, size: 32, offset: 1632)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1493, file: !1213, line: 63, baseType: !1166, size: 16, offset: 1664)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1493, file: !1213, line: 64, baseType: !1166, size: 16, offset: 1680)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !1493, file: !1213, line: 65, baseType: !1166, size: 16, offset: 1696)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !1493, file: !1213, line: 66, baseType: !1166, size: 16, offset: 1712)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !1493, file: !1213, line: 67, baseType: !1166, size: 16, offset: 1728)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_gesture", scope: !1493, file: !1213, line: 68, baseType: !1166, size: 16, offset: 1744)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_paintcursor", scope: !1493, file: !1213, line: 69, baseType: !1166, size: 16, offset: 1760)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_drag", scope: !1493, file: !1213, line: 70, baseType: !1166, size: 16, offset: 1776)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !1493, file: !1213, line: 71, baseType: !1166, size: 16, offset: 1792)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mainwin", scope: !1493, file: !1213, line: 73, baseType: !1166, size: 16, offset: 1808)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "subwinactive", scope: !1493, file: !1213, line: 74, baseType: !1166, size: 16, offset: 1824)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1493, file: !1213, line: 76, baseType: !1166, size: 16, offset: 1840)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "animtimer", scope: !1493, file: !1213, line: 78, baseType: !1478, size: 64, offset: 1856)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1493, file: !1213, line: 79, baseType: !1112, size: 64, offset: 1920)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !1485, file: !1486, line: 175, baseType: !1492, size: 64, offset: 256)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !1485, file: !1486, line: 176, baseType: !1157, size: 512, offset: 320)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !1485, file: !1486, line: 178, baseType: !1166, size: 16, offset: 832)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !1485, file: !1486, line: 178, baseType: !1166, size: 16, offset: 848)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1485, file: !1486, line: 178, baseType: !1166, size: 16, offset: 864)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1485, file: !1486, line: 178, baseType: !1166, size: 16, offset: 880)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !1485, file: !1486, line: 179, baseType: !1166, size: 16, offset: 896)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !1485, file: !1486, line: 180, baseType: !1166, size: 16, offset: 912)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1485, file: !1486, line: 181, baseType: !1166, size: 16, offset: 928)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1485, file: !1486, line: 182, baseType: !1166, size: 16, offset: 944)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !1485, file: !1486, line: 183, baseType: !1166, size: 16, offset: 960)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !1485, file: !1486, line: 184, baseType: !1166, size: 16, offset: 976)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !1485, file: !1486, line: 185, baseType: !1166, size: 16, offset: 992)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !1485, file: !1486, line: 186, baseType: !1166, size: 16, offset: 1008)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !1485, file: !1486, line: 188, baseType: !1100, size: 32, offset: 1024)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !1485, file: !1486, line: 190, baseType: !1166, size: 16, offset: 1056)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !1485, file: !1486, line: 191, baseType: !1166, size: 16, offset: 1072)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !1485, file: !1486, line: 194, baseType: !1352, size: 64, offset: 1088)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !1485, file: !1486, line: 196, baseType: !1597, size: 64, offset: 1152)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64)
!1598 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !1486, line: 55, flags: DIFlagFwdDecl)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !1485, file: !1486, line: 198, baseType: !1600, size: 64, offset: 1216)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64)
!1601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !1021, line: 398, size: 448, elements: !1602)
!1602 = !{!1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1601, file: !1021, line: 399, baseType: !1600, size: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1601, file: !1021, line: 399, baseType: !1600, size: 64, offset: 64)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !1601, file: !1021, line: 400, baseType: !1100, size: 32, offset: 128)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1601, file: !1021, line: 401, baseType: !1100, size: 32, offset: 160)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1601, file: !1021, line: 402, baseType: !1100, size: 32, offset: 192)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1601, file: !1021, line: 403, baseType: !1100, size: 32, offset: 224)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1601, file: !1021, line: 404, baseType: !1100, size: 32, offset: 256)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1601, file: !1021, line: 405, baseType: !1100, size: 32, offset: 288)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1601, file: !1021, line: 407, baseType: !1112, size: 64, offset: 320)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !1601, file: !1021, line: 414, baseType: !1112, size: 64, offset: 384)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !1485, file: !1486, line: 200, baseType: !1100, size: 32, offset: 1280)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !1485, file: !1486, line: 200, baseType: !1100, size: 32, offset: 1312)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !1485, file: !1486, line: 201, baseType: !1112, size: 64, offset: 1344)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !1485, file: !1486, line: 203, baseType: !1204, size: 128, offset: 1408)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !1485, file: !1486, line: 204, baseType: !1204, size: 128, offset: 1536)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !1485, file: !1486, line: 205, baseType: !1204, size: 128, offset: 1664)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !1485, file: !1486, line: 207, baseType: !1204, size: 128, offset: 1792)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !1485, file: !1486, line: 208, baseType: !1204, size: 128, offset: 1920)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !1479, file: !1021, line: 495, baseType: !1370, size: 64, offset: 192)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !1479, file: !1021, line: 496, baseType: !1100, size: 32, offset: 256)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1479, file: !1021, line: 497, baseType: !1112, size: 64, offset: 320)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1479, file: !1021, line: 499, baseType: !1370, size: 64, offset: 384)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !1479, file: !1021, line: 500, baseType: !1370, size: 64, offset: 448)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !1479, file: !1021, line: 502, baseType: !1370, size: 64, offset: 512)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !1479, file: !1021, line: 503, baseType: !1370, size: 64, offset: 576)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !1479, file: !1021, line: 504, baseType: !1370, size: 64, offset: 640)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !1479, file: !1021, line: 505, baseType: !1100, size: 32, offset: 704)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !1439, file: !1213, line: 234, baseType: !1399, size: 128, offset: 1408)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !1439, file: !1213, line: 235, baseType: !1399, size: 128, offset: 1536)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1439, file: !1213, line: 236, baseType: !1166, size: 16, offset: 1664)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1439, file: !1213, line: 236, baseType: !1166, size: 16, offset: 1680)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1439, file: !1213, line: 238, baseType: !1166, size: 16, offset: 1696)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !1439, file: !1213, line: 239, baseType: !1166, size: 16, offset: 1712)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1439, file: !1213, line: 240, baseType: !1166, size: 16, offset: 1728)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1439, file: !1213, line: 241, baseType: !1166, size: 16, offset: 1744)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !1439, file: !1213, line: 243, baseType: !1180, size: 32, offset: 1760)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1439, file: !1213, line: 244, baseType: !1166, size: 16, offset: 1792)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1439, file: !1213, line: 244, baseType: !1166, size: 16, offset: 1808)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !1439, file: !1213, line: 246, baseType: !1166, size: 16, offset: 1824)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !1439, file: !1213, line: 247, baseType: !1166, size: 16, offset: 1840)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !1439, file: !1213, line: 248, baseType: !1166, size: 16, offset: 1856)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !1439, file: !1213, line: 249, baseType: !1166, size: 16, offset: 1872)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !1439, file: !1213, line: 250, baseType: !1166, size: 16, offset: 1888)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1439, file: !1213, line: 251, baseType: !1166, size: 16, offset: 1904)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1439, file: !1213, line: 253, baseType: !1648, size: 64, offset: 1920)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !1222, line: 116, size: 1472, elements: !1650)
!1650 = !{!1651, !1652, !1653, !1654, !1700, !1701, !1705, !1820, !1824, !1828, !1829, !1830, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1649, file: !1222, line: 117, baseType: !1648, size: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1649, file: !1222, line: 117, baseType: !1648, size: 64, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !1649, file: !1222, line: 119, baseType: !1100, size: 32, offset: 128)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1649, file: !1222, line: 122, baseType: !1655, size: 64, offset: 192)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{null, !1658, !1438}
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !1486, line: 128, size: 2816, elements: !1660)
!1660 = !{!1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1679, !1680, !1681, !1682, !1683, !1694, !1695, !1696, !1697, !1698, !1699}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1659, file: !1486, line: 129, baseType: !1496, size: 960)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !1659, file: !1486, line: 131, baseType: !1484, size: 64, offset: 960)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "winactive", scope: !1659, file: !1486, line: 131, baseType: !1484, size: 64, offset: 1024)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !1659, file: !1486, line: 132, baseType: !1204, size: 128, offset: 1088)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1659, file: !1486, line: 134, baseType: !1100, size: 32, offset: 1216)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "file_saved", scope: !1659, file: !1486, line: 135, baseType: !1166, size: 16, offset: 1248)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "op_undo_depth", scope: !1659, file: !1486, line: 136, baseType: !1166, size: 16, offset: 1264)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "operators", scope: !1659, file: !1486, line: 138, baseType: !1204, size: 128, offset: 1280)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !1659, file: !1486, line: 140, baseType: !1204, size: 128, offset: 1408)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !1659, file: !1486, line: 142, baseType: !1671, size: 320, offset: 1536)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !1486, line: 106, size: 320, elements: !1672)
!1672 = !{!1673, !1674, !1675, !1676, !1677, !1678}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1671, file: !1486, line: 107, baseType: !1204, size: 128)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !1671, file: !1486, line: 108, baseType: !1100, size: 32, offset: 128)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !1671, file: !1486, line: 109, baseType: !1100, size: 32, offset: 160)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1671, file: !1486, line: 110, baseType: !1100, size: 32, offset: 192)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1671, file: !1486, line: 110, baseType: !1100, size: 32, offset: 224)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !1671, file: !1486, line: 111, baseType: !1478, size: 64, offset: 256)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !1659, file: !1486, line: 144, baseType: !1204, size: 128, offset: 1856)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursors", scope: !1659, file: !1486, line: 146, baseType: !1204, size: 128, offset: 1984)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "drags", scope: !1659, file: !1486, line: 148, baseType: !1204, size: 128, offset: 2112)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "keyconfigs", scope: !1659, file: !1486, line: 150, baseType: !1204, size: 128, offset: 2240)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "defaultconf", scope: !1659, file: !1486, line: 151, baseType: !1684, size: 64, offset: 2368)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64)
!1685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !1486, line: 310, size: 1344, elements: !1686)
!1686 = !{!1687, !1688, !1689, !1690, !1691, !1692, !1693}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1685, file: !1486, line: 311, baseType: !1684, size: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1685, file: !1486, line: 311, baseType: !1684, size: 64, offset: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1685, file: !1486, line: 313, baseType: !1157, size: 512, offset: 128)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !1685, file: !1486, line: 314, baseType: !1157, size: 512, offset: 640)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !1685, file: !1486, line: 316, baseType: !1204, size: 128, offset: 1152)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !1685, file: !1486, line: 317, baseType: !1100, size: 32, offset: 1280)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1685, file: !1486, line: 317, baseType: !1100, size: 32, offset: 1312)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "addonconf", scope: !1659, file: !1486, line: 152, baseType: !1684, size: 64, offset: 2432)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "userconf", scope: !1659, file: !1486, line: 153, baseType: !1684, size: 64, offset: 2496)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "timers", scope: !1659, file: !1486, line: 155, baseType: !1204, size: 128, offset: 2560)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "autosavetimer", scope: !1659, file: !1486, line: 156, baseType: !1478, size: 64, offset: 2688)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "is_interface_locked", scope: !1659, file: !1486, line: 158, baseType: !1158, size: 8, offset: 2752)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1659, file: !1486, line: 159, baseType: !1415, size: 56, offset: 2760)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !1649, file: !1222, line: 124, baseType: !1655, size: 64, offset: 256)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1649, file: !1222, line: 126, baseType: !1702, size: 64, offset: 320)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{null, !1238, !1438}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !1649, file: !1222, line: 128, baseType: !1706, size: 64, offset: 384)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{null, !1492, !1709, !1438, !1776}
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64)
!1710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !1213, line: 203, size: 1280, elements: !1711)
!1711 = !{!1712, !1713, !1714, !1731, !1732, !1733, !1734, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1816, !1817, !1818, !1819}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1710, file: !1213, line: 204, baseType: !1709, size: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1710, file: !1213, line: 204, baseType: !1709, size: 64, offset: 64)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !1710, file: !1213, line: 206, baseType: !1715, size: 64, offset: 128)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64)
!1716 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !1213, line: 87, baseType: !1717)
!1717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !1213, line: 82, size: 256, elements: !1718)
!1718 = !{!1719, !1721, !1722, !1723, !1729, !1730}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1717, file: !1213, line: 83, baseType: !1720, size: 64)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1717, file: !1213, line: 83, baseType: !1720, size: 64, offset: 64)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !1717, file: !1213, line: 83, baseType: !1720, size: 64, offset: 128)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1717, file: !1213, line: 84, baseType: !1724, size: 32, offset: 192)
!1724 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !1318, line: 43, baseType: !1725)
!1725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !1318, line: 41, size: 32, elements: !1726)
!1726 = !{!1727, !1728}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1725, file: !1318, line: 42, baseType: !1166, size: 16)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1725, file: !1318, line: 42, baseType: !1166, size: 16, offset: 16)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1717, file: !1213, line: 86, baseType: !1166, size: 16, offset: 224)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !1717, file: !1213, line: 86, baseType: !1166, size: 16, offset: 240)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !1710, file: !1213, line: 206, baseType: !1715, size: 64, offset: 192)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !1710, file: !1213, line: 206, baseType: !1715, size: 64, offset: 256)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !1710, file: !1213, line: 206, baseType: !1715, size: 64, offset: 320)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1710, file: !1213, line: 207, baseType: !1735, size: 64, offset: 384)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64)
!1736 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !1213, line: 80, baseType: !1493)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "totrct", scope: !1710, file: !1213, line: 209, baseType: !1399, size: 128, offset: 448)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1710, file: !1213, line: 211, baseType: !1158, size: 8, offset: 576)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "butspacetype", scope: !1710, file: !1213, line: 211, baseType: !1158, size: 8, offset: 584)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1710, file: !1213, line: 212, baseType: !1166, size: 16, offset: 592)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1710, file: !1213, line: 212, baseType: !1166, size: 16, offset: 608)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "headertype", scope: !1710, file: !1213, line: 214, baseType: !1166, size: 16, offset: 624)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !1710, file: !1213, line: 215, baseType: !1166, size: 16, offset: 640)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1710, file: !1213, line: 216, baseType: !1166, size: 16, offset: 656)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "region_active_win", scope: !1710, file: !1213, line: 217, baseType: !1166, size: 16, offset: 672)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1710, file: !1213, line: 219, baseType: !1158, size: 8, offset: 688)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1710, file: !1213, line: 219, baseType: !1158, size: 8, offset: 696)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1710, file: !1213, line: 221, baseType: !1749, size: 64, offset: 704)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1750, size: 64)
!1750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !1222, line: 66, size: 1728, elements: !1751)
!1751 = !{!1752, !1753, !1754, !1755, !1756, !1757, !1763, !1767, !1771, !1772, !1789, !1793, !1797, !1801, !1805, !1806, !1813, !1814, !1815}
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1750, file: !1222, line: 67, baseType: !1749, size: 64)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1750, file: !1222, line: 67, baseType: !1749, size: 64, offset: 64)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1750, file: !1222, line: 69, baseType: !1157, size: 512, offset: 128)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !1750, file: !1222, line: 70, baseType: !1100, size: 32, offset: 640)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "iconid", scope: !1750, file: !1222, line: 71, baseType: !1100, size: 32, offset: 672)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !1750, file: !1222, line: 74, baseType: !1758, size: 64, offset: 704)
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1759, size: 64)
!1759 = !DISubroutineType(types: !1760)
!1760 = !{!1761, !1238}
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64)
!1762 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !1213, line: 40, flags: DIFlagFwdDecl)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1750, file: !1222, line: 76, baseType: !1764, size: 64, offset: 768)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64)
!1765 = !DISubroutineType(types: !1766)
!1766 = !{null, !1761}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1750, file: !1222, line: 79, baseType: !1768, size: 64, offset: 832)
!1768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1769, size: 64)
!1769 = !DISubroutineType(types: !1770)
!1770 = !{null, !1658, !1709}
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !1750, file: !1222, line: 81, baseType: !1768, size: 64, offset: 896)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !1750, file: !1222, line: 83, baseType: !1773, size: 64, offset: 960)
!1773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1774, size: 64)
!1774 = !DISubroutineType(types: !1775)
!1775 = !{null, !1492, !1709, !1776}
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64)
!1777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmNotifier", file: !1021, line: 195, size: 512, elements: !1778)
!1778 = !{!1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788}
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1777, file: !1021, line: 196, baseType: !1776, size: 64)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1777, file: !1021, line: 196, baseType: !1776, size: 64, offset: 64)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !1777, file: !1021, line: 198, baseType: !1658, size: 64, offset: 128)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1777, file: !1021, line: 199, baseType: !1484, size: 64, offset: 192)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !1777, file: !1021, line: 201, baseType: !1100, size: 32, offset: 256)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1777, file: !1021, line: 202, baseType: !6, size: 32, offset: 288)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1777, file: !1021, line: 202, baseType: !6, size: 32, offset: 320)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1777, file: !1021, line: 202, baseType: !6, size: 32, offset: 352)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1777, file: !1021, line: 202, baseType: !6, size: 32, offset: 384)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1777, file: !1021, line: 204, baseType: !1112, size: 64, offset: 448)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "refresh", scope: !1750, file: !1222, line: 86, baseType: !1790, size: 64, offset: 1024)
!1790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64)
!1791 = !DISubroutineType(types: !1792)
!1792 = !{null, !1238, !1709}
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !1750, file: !1222, line: 89, baseType: !1794, size: 64, offset: 1088)
!1794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1795, size: 64)
!1795 = !DISubroutineType(types: !1796)
!1796 = !{!1761, !1761}
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "operatortypes", scope: !1750, file: !1222, line: 92, baseType: !1798, size: 64, offset: 1152)
!1798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1799, size: 64)
!1799 = !DISubroutineType(types: !1800)
!1800 = !{null}
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "keymap", scope: !1750, file: !1222, line: 94, baseType: !1802, size: 64, offset: 1216)
!1802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1803, size: 64)
!1803 = !DISubroutineType(types: !1804)
!1804 = !{null, !1684}
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "dropboxes", scope: !1750, file: !1222, line: 96, baseType: !1798, size: 64, offset: 1280)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1750, file: !1222, line: 99, baseType: !1807, size: 64, offset: 1344)
!1807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1808, size: 64)
!1808 = !DISubroutineType(types: !1809)
!1809 = !{!1100, !1238, !1380, !1810}
!1810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1811, size: 64)
!1811 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContextDataResult", file: !1812, line: 71, flags: DIFlagFwdDecl)
!1812 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "regiontypes", scope: !1750, file: !1222, line: 102, baseType: !1204, size: 128, offset: 1408)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "toolshelf", scope: !1750, file: !1222, line: 105, baseType: !1204, size: 128, offset: 1536)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "keymapflag", scope: !1750, file: !1222, line: 110, baseType: !1100, size: 32, offset: 1664)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "spacedata", scope: !1710, file: !1213, line: 223, baseType: !1204, size: 128, offset: 768)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1710, file: !1213, line: 224, baseType: !1204, size: 128, offset: 896)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !1710, file: !1213, line: 225, baseType: !1204, size: 128, offset: 1024)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "actionzones", scope: !1710, file: !1213, line: 227, baseType: !1204, size: 128, offset: 1152)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1649, file: !1222, line: 130, baseType: !1821, size: 64, offset: 448)
!1821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1822, size: 64)
!1822 = !DISubroutineType(types: !1823)
!1823 = !{null, !1438}
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !1649, file: !1222, line: 133, baseType: !1825, size: 64, offset: 512)
!1825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1826, size: 64)
!1826 = !DISubroutineType(types: !1827)
!1827 = !{!1112, !1112}
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "operatortypes", scope: !1649, file: !1222, line: 137, baseType: !1798, size: 64, offset: 576)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "keymap", scope: !1649, file: !1222, line: 139, baseType: !1802, size: 64, offset: 640)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1649, file: !1222, line: 141, baseType: !1831, size: 64, offset: 704)
!1831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1832, size: 64)
!1832 = !DISubroutineType(types: !1833)
!1833 = !{null, !1484, !1709, !1438}
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1649, file: !1222, line: 144, baseType: !1807, size: 64, offset: 768)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "drawcalls", scope: !1649, file: !1222, line: 147, baseType: !1204, size: 128, offset: 832)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "paneltypes", scope: !1649, file: !1222, line: 150, baseType: !1204, size: 128, offset: 960)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "headertypes", scope: !1649, file: !1222, line: 153, baseType: !1204, size: 128, offset: 1088)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "minsizex", scope: !1649, file: !1222, line: 156, baseType: !1100, size: 32, offset: 1216)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "minsizey", scope: !1649, file: !1222, line: 156, baseType: !1100, size: 32, offset: 1248)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "prefsizex", scope: !1649, file: !1222, line: 158, baseType: !1100, size: 32, offset: 1280)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "prefsizey", scope: !1649, file: !1222, line: 158, baseType: !1100, size: 32, offset: 1312)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "keymapflag", scope: !1649, file: !1222, line: 160, baseType: !1100, size: 32, offset: 1344)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "do_lock", scope: !1649, file: !1222, line: 162, baseType: !1166, size: 16, offset: 1376)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1649, file: !1222, line: 162, baseType: !1166, size: 16, offset: 1392)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "event_cursor", scope: !1649, file: !1222, line: 164, baseType: !1166, size: 16, offset: 1408)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !1439, file: !1213, line: 255, baseType: !1204, size: 128, offset: 1984)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !1439, file: !1213, line: 256, baseType: !1204, size: 128, offset: 2112)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !1439, file: !1213, line: 257, baseType: !1204, size: 128, offset: 2240)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !1439, file: !1213, line: 258, baseType: !1204, size: 128, offset: 2368)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !1439, file: !1213, line: 259, baseType: !1204, size: 128, offset: 2496)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !1439, file: !1213, line: 260, baseType: !1204, size: 128, offset: 2624)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !1439, file: !1213, line: 261, baseType: !1204, size: 128, offset: 2752)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !1439, file: !1213, line: 263, baseType: !1478, size: 64, offset: 2880)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !1439, file: !1213, line: 265, baseType: !1855, size: 64, offset: 2944)
!1855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !1439, file: !1213, line: 266, baseType: !1112, size: 64, offset: 3008)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "towards_xy", scope: !1435, file: !1012, line: 496, baseType: !1454, size: 64, offset: 64)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "towardstime", scope: !1435, file: !1012, line: 497, baseType: !1370, size: 64, offset: 128)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "dotowards", scope: !1435, file: !1012, line: 498, baseType: !1413, size: 8, offset: 192)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !1435, file: !1012, line: 500, baseType: !1413, size: 8, offset: 200)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "popup_func", scope: !1435, file: !1012, line: 501, baseType: !1141, size: 64, offset: 256)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "cancel_func", scope: !1435, file: !1012, line: 502, baseType: !1863, size: 64, offset: 320)
!1863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1864, size: 64)
!1864 = !DISubroutineType(types: !1865)
!1865 = !{null, !1144, !1112}
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "popup_arg", scope: !1435, file: !1012, line: 503, baseType: !1112, size: 64, offset: 384)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "popup_create_vars", scope: !1435, file: !1012, line: 506, baseType: !1868, size: 320, offset: 448)
!1868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiPopupBlockCreate", file: !1012, line: 480, size: 320, elements: !1869)
!1869 = !{!1870, !1875, !1881, !1882, !1883}
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "create_func", scope: !1868, file: !1012, line: 481, baseType: !1871, size: 64)
!1871 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockCreateFunc", file: !20, line: 380, baseType: !1872)
!1872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1873, size: 64)
!1873 = !DISubroutineType(types: !1874)
!1874 = !{!1197, !1144, !1438, !1112}
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "handle_create_func", scope: !1868, file: !1012, line: 482, baseType: !1876, size: 64, offset: 64)
!1876 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockHandleCreateFunc", file: !1012, line: 478, baseType: !1877)
!1877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1878, size: 64)
!1878 = !DISubroutineType(types: !1879)
!1879 = !{!1197, !1144, !1880, !1112}
!1880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1868, file: !1012, line: 483, baseType: !1112, size: 64, offset: 128)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "event_xy", scope: !1868, file: !1012, line: 485, baseType: !1359, size: 64, offset: 192)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "butregion", scope: !1868, file: !1012, line: 488, baseType: !1884, size: 64, offset: 256)
!1884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1885, size: 64)
!1885 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !1213, line: 267, baseType: !1439)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "scrolltimer", scope: !1435, file: !1012, line: 508, baseType: !1478, size: 64, offset: 768)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "keynav_state", scope: !1435, file: !1012, line: 510, baseType: !1888, size: 96, offset: 832)
!1888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiKeyNavLock", file: !1012, line: 471, size: 96, elements: !1889)
!1889 = !{!1890, !1891}
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "is_keynav", scope: !1888, file: !1012, line: 473, baseType: !1413, size: 8)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "event_xy", scope: !1888, file: !1012, line: 475, baseType: !1359, size: 64, offset: 32)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "optype", scope: !1435, file: !1012, line: 513, baseType: !1893, size: 64, offset: 960)
!1893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1894, size: 64)
!1894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !1021, line: 508, size: 1536, elements: !1895)
!1895 = !{!1896, !1897, !1898, !1899, !1900, !1925, !1929, !1933, !1937, !1938, !1942, !1943, !1944, !1945, !1949, !1950, !1965, !1966, !1970, !1971}
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1894, file: !1021, line: 509, baseType: !1380, size: 64)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1894, file: !1021, line: 510, baseType: !1380, size: 64, offset: 64)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1894, file: !1021, line: 511, baseType: !1380, size: 64, offset: 128)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1894, file: !1021, line: 512, baseType: !1380, size: 64, offset: 192)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1894, file: !1021, line: 518, baseType: !1901, size: 64, offset: 256)
!1901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1902, size: 64)
!1902 = !DISubroutineType(types: !1903)
!1903 = !{!1100, !1144, !1904}
!1904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1905, size: 64)
!1905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !1486, line: 328, size: 1344, elements: !1906)
!1906 = !{!1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1917, !1918, !1919, !1920, !1921}
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1905, file: !1486, line: 329, baseType: !1904, size: 64)
