; ModuleID = 'blender/source/blender/imbuf/intern/util.c'
source_filename = "blender/source/blender/imbuf/intern/util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImFileType = type { void ()*, void ()*, i32 (i8*)*, i32 (i8*)*, i32 (%struct.ImFileType*, %struct.ImBuf*)*, %struct.ImBuf* (i8*, i64, i32, i8*)*, %struct.ImBuf* (i8*, i32, i8*)*, i32 (%struct.ImBuf*, i8*, i32)*, void (%struct.ImBuf*, i8*, i64, i32, i32, i32*)*, i32, i32, i32 }
%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [5 x i8] c".png\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "imb_ext_image", scope: !2, file: !3, line: 80, type: !32, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/imbuf/intern/util.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!0, !9, !17, !22, !27}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "imb_ext_image_filepath_only", scope: !2, file: !3, line: 112, type: !11, isLocal: false, isDefinition: true)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !15)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !{!16}
!16 = !DISubrange(count: 1)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "imb_ext_image_qt", scope: !2, file: !3, line: 119, type: !19, isLocal: false, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 448, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 7)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "imb_ext_movie", scope: !2, file: !3, line: 141, type: !24, isLocal: false, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1856, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 29)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "imb_ext_audio", scope: !2, file: !3, line: 174, type: !29, isLocal: false, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 960, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 15)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 576, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 9)
!35 = !{i32 7, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 1, !"wchar_size", i32 4}
!38 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!39 = distinct !DISubprogram(name: "IMB_ispic_type", scope: !3, file: !3, line: 192, type: !40, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!40 = !DISubroutineType(types: !41)
!41 = !{!7, !12}
!42 = !DILocalVariable(name: "name", arg: 1, scope: !39, file: !3, line: 192, type: !12)
!43 = !DILocation(line: 192, column: 32, scope: !39)
!44 = !DILocalVariable(name: "buf", scope: !39, file: !3, line: 197, type: !45)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 512, elements: !47)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !{!48}
!48 = !DISubrange(count: 64)
!49 = !DILocation(line: 197, column: 16, scope: !39)
!50 = !DILocalVariable(name: "type", scope: !39, file: !3, line: 198, type: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImFileType", file: !53, line: 52, baseType: !54)
!53 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_filetype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImFileType", file: !53, line: 37, size: 704, elements: !55)
!55 = !{!56, !60, !61, !66, !68, !156, !164, !168, !172, !176, !177, !178}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !54, file: !53, line: 38, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !54, file: !53, line: 39, baseType: !57, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "is_a", scope: !54, file: !53, line: 41, baseType: !62, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!7, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "is_a_filepath", scope: !54, file: !53, line: 42, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !54, file: !53, line: 43, baseType: !69, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!7, !72, !73}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !75, line: 70, size: 19840, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !88, !91, !96, !97, !98, !99, !100, !102, !103, !104, !105, !109, !110, !111, !112, !113, !116, !118, !119, !123, !124, !127, !128, !129, !130, !131, !134, !135, !136, !139, !140, !149}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !75, line: 71, baseType: !73, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !74, file: !75, line: 71, baseType: !73, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !74, file: !75, line: 74, baseType: !7, size: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !74, file: !75, line: 74, baseType: !7, size: 32, offset: 160)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !74, file: !75, line: 79, baseType: !46, size: 8, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !74, file: !75, line: 80, baseType: !7, size: 32, offset: 224)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !74, file: !75, line: 83, baseType: !7, size: 32, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !74, file: !75, line: 84, baseType: !7, size: 32, offset: 288)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !74, file: !75, line: 87, baseType: !86, size: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !74, file: !75, line: 88, baseType: !89, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !74, file: !75, line: 93, baseType: !92, size: 128, offset: 448)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !94)
!93 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!94 = !{!95}
!95 = !DISubrange(count: 2)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !74, file: !75, line: 96, baseType: !7, size: 32, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !74, file: !75, line: 96, baseType: !7, size: 32, offset: 608)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !74, file: !75, line: 97, baseType: !7, size: 32, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !74, file: !75, line: 97, baseType: !7, size: 32, offset: 672)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !74, file: !75, line: 98, baseType: !101, size: 64, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !74, file: !75, line: 101, baseType: !6, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !74, file: !75, line: 102, baseType: !89, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !74, file: !75, line: 105, baseType: !90, size: 32, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !74, file: !75, line: 108, baseType: !106, size: 1280, offset: 960)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 1280, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !74, file: !75, line: 109, baseType: !7, size: 32, offset: 2240)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !74, file: !75, line: 109, baseType: !7, size: 32, offset: 2272)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !74, file: !75, line: 112, baseType: !7, size: 32, offset: 2304)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !74, file: !75, line: 113, baseType: !7, size: 32, offset: 2336)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !74, file: !75, line: 114, baseType: !114, size: 64, offset: 2368)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !75, line: 50, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !74, file: !75, line: 115, baseType: !117, size: 64, offset: 2432)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !74, file: !75, line: 118, baseType: !7, size: 32, offset: 2496)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !75, line: 119, baseType: !120, size: 8192, offset: 2528)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 1024)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !74, file: !75, line: 120, baseType: !120, size: 8192, offset: 10720)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !74, file: !75, line: 123, baseType: !125, size: 64, offset: 18944)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !75, line: 123, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !74, file: !75, line: 124, baseType: !7, size: 32, offset: 19008)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !74, file: !75, line: 127, baseType: !65, size: 64, offset: 19072)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !74, file: !75, line: 128, baseType: !87, size: 32, offset: 19136)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !74, file: !75, line: 129, baseType: !87, size: 32, offset: 19168)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !74, file: !75, line: 132, baseType: !132, size: 64, offset: 19200)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !75, line: 132, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !74, file: !75, line: 133, baseType: !132, size: 64, offset: 19264)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !74, file: !75, line: 134, baseType: !86, size: 64, offset: 19328)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !74, file: !75, line: 135, baseType: !137, size: 64, offset: 19392)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !75, line: 135, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !74, file: !75, line: 136, baseType: !7, size: 32, offset: 19456)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !74, file: !75, line: 137, baseType: !141, size: 128, offset: 19488)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !142, line: 89, baseType: !143)
!142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !142, line: 86, size: 128, elements: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !143, file: !142, line: 87, baseType: !7, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !143, file: !142, line: 87, baseType: !7, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !143, file: !142, line: 88, baseType: !7, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !143, file: !142, line: 88, baseType: !7, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !74, file: !75, line: 140, baseType: !150, size: 192, offset: 19648)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !75, line: 55, size: 192, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !150, file: !75, line: 56, baseType: !87, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !150, file: !75, line: 57, baseType: !87, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !75, line: 58, baseType: !65, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !150, file: !75, line: 59, baseType: !87, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !54, file: !53, line: 44, baseType: !157, size: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!73, !65, !160, !7, !163}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !161, line: 46, baseType: !162)
!161 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!162 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "load_filepath", scope: !54, file: !53, line: 45, baseType: !165, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!73, !12, !7, !163}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !54, file: !53, line: 46, baseType: !169, size: 64, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!7, !73, !12, !7}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "load_tile", scope: !54, file: !53, line: 47, baseType: !173, size: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !73, !65, !160, !7, !7, !86}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !54, file: !53, line: 49, baseType: !7, size: 32, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !54, file: !53, line: 50, baseType: !7, size: 32, offset: 608)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "default_save_role", scope: !54, file: !53, line: 51, baseType: !7, size: 32, offset: 640)
!179 = !DILocation(line: 198, column: 14, scope: !39)
!180 = !DILocalVariable(name: "st", scope: !39, file: !3, line: 199, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_stat_t", file: !182, line: 73, baseType: !183)
!182 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !184, line: 46, size: 1152, elements: !185)
!184 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!185 = !{!186, !189, !191, !193, !195, !197, !199, !200, !201, !204, !206, !208, !216, !217, !218}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !183, file: !184, line: 48, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !188, line: 145, baseType: !162)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !183, file: !184, line: 53, baseType: !190, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !188, line: 148, baseType: !162)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !183, file: !184, line: 61, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !188, line: 151, baseType: !162)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !183, file: !184, line: 62, baseType: !194, size: 32, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !188, line: 150, baseType: !87)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !183, file: !184, line: 64, baseType: !196, size: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !188, line: 146, baseType: !87)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !183, file: !184, line: 65, baseType: !198, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !188, line: 147, baseType: !87)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !183, file: !184, line: 67, baseType: !7, size: 32, offset: 288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !183, file: !184, line: 69, baseType: !187, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !183, file: !184, line: 74, baseType: !202, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !188, line: 152, baseType: !203)
!203 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !183, file: !184, line: 78, baseType: !205, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !188, line: 174, baseType: !203)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !183, file: !184, line: 80, baseType: !207, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !188, line: 179, baseType: !203)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !183, file: !184, line: 91, baseType: !209, size: 128, offset: 576)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !210, line: 10, size: 128, elements: !211)
!210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!211 = !{!212, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !209, file: !210, line: 12, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !188, line: 160, baseType: !203)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !209, file: !210, line: 16, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !188, line: 196, baseType: !203)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !183, file: !184, line: 92, baseType: !209, size: 128, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !183, file: !184, line: 93, baseType: !209, size: 128, offset: 832)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !183, file: !184, line: 106, baseType: !219, size: 192, offset: 960)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 192, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 3)
!222 = !DILocation(line: 199, column: 13, scope: !39)
!223 = !DILocalVariable(name: "fp", scope: !39, file: !3, line: 200, type: !7)
!224 = !DILocation(line: 200, column: 6, scope: !39)
!225 = !DILocation(line: 204, column: 15, scope: !226)
!226 = distinct !DILexicalBlock(scope: !39, file: !3, line: 204, column: 6)
!227 = !DILocation(line: 204, column: 6, scope: !226)
!228 = !DILocation(line: 204, column: 26, scope: !226)
!229 = !DILocation(line: 204, column: 6, scope: !39)
!230 = !DILocation(line: 205, column: 3, scope: !226)
!231 = !DILocation(line: 209, column: 7, scope: !232)
!232 = distinct !DILexicalBlock(scope: !39, file: !3, line: 209, column: 6)
!233 = !DILocation(line: 209, column: 6, scope: !39)
!234 = !DILocation(line: 211, column: 3, scope: !232)
!235 = !DILocation(line: 213, column: 21, scope: !236)
!236 = distinct !DILexicalBlock(scope: !39, file: !3, line: 213, column: 6)
!237 = !DILocation(line: 213, column: 12, scope: !236)
!238 = !DILocation(line: 213, column: 10, scope: !236)
!239 = !DILocation(line: 213, column: 52, scope: !236)
!240 = !DILocation(line: 213, column: 6, scope: !39)
!241 = !DILocation(line: 214, column: 3, scope: !236)
!242 = !DILocation(line: 216, column: 2, scope: !39)
!243 = !DILocation(line: 217, column: 11, scope: !244)
!244 = distinct !DILexicalBlock(scope: !39, file: !3, line: 217, column: 6)
!245 = !DILocation(line: 217, column: 15, scope: !244)
!246 = !DILocation(line: 217, column: 6, scope: !244)
!247 = !DILocation(line: 217, column: 33, scope: !244)
!248 = !DILocation(line: 217, column: 6, scope: !39)
!249 = !DILocation(line: 218, column: 9, scope: !250)
!250 = distinct !DILexicalBlock(scope: !244, file: !3, line: 217, column: 39)
!251 = !DILocation(line: 218, column: 3, scope: !250)
!252 = !DILocation(line: 219, column: 3, scope: !250)
!253 = !DILocation(line: 222, column: 8, scope: !39)
!254 = !DILocation(line: 222, column: 2, scope: !39)
!255 = !DILocation(line: 225, column: 7, scope: !256)
!256 = distinct !DILexicalBlock(scope: !39, file: !3, line: 225, column: 6)
!257 = !DILocation(line: 225, column: 33, scope: !256)
!258 = !DILocation(line: 225, column: 47, scope: !256)
!259 = !DILocation(line: 225, column: 6, scope: !39)
!260 = !DILocation(line: 226, column: 3, scope: !256)
!261 = !DILocation(line: 228, column: 12, scope: !262)
!262 = distinct !DILexicalBlock(scope: !39, file: !3, line: 228, column: 2)
!263 = !DILocation(line: 228, column: 7, scope: !262)
!264 = !DILocation(line: 228, column: 30, scope: !265)
!265 = distinct !DILexicalBlock(scope: !262, file: !3, line: 228, column: 2)
!266 = !DILocation(line: 228, column: 37, scope: !265)
!267 = !DILocation(line: 228, column: 35, scope: !265)
!268 = !DILocation(line: 228, column: 2, scope: !262)
!269 = !DILocation(line: 229, column: 7, scope: !270)
!270 = distinct !DILexicalBlock(scope: !271, file: !3, line: 229, column: 7)
!271 = distinct !DILexicalBlock(scope: !265, file: !3, line: 228, column: 66)
!272 = !DILocation(line: 229, column: 13, scope: !270)
!273 = !DILocation(line: 229, column: 7, scope: !271)
!274 = !DILocation(line: 230, column: 8, scope: !275)
!275 = distinct !DILexicalBlock(scope: !276, file: !3, line: 230, column: 8)
!276 = distinct !DILexicalBlock(scope: !270, file: !3, line: 229, column: 19)
!277 = !DILocation(line: 230, column: 14, scope: !275)
!278 = !DILocation(line: 230, column: 19, scope: !275)
!279 = !DILocation(line: 230, column: 8, scope: !276)
!280 = !DILocation(line: 231, column: 12, scope: !281)
!281 = distinct !DILexicalBlock(scope: !275, file: !3, line: 230, column: 25)
!282 = !DILocation(line: 231, column: 18, scope: !281)
!283 = !DILocation(line: 231, column: 5, scope: !281)
!284 = !DILocation(line: 233, column: 3, scope: !276)
