; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_edgesplit.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_edgesplit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57}
!51 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !59, line: 57, baseType: !5, size: 32, elements: !60)
!59 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!61 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!75 = !{!76, !77, !78, !82, !86, !152, !154, !136, !98}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !59, line: 79, baseType: !58)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !59, line: 158, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !76}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !59, line: 159, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!76, !76}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !89)
!89 = !{!90, !101, !107, !112, !113}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !88, file: !43, line: 91, baseType: !91, size: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !93)
!93 = !{!94, !95, !97, !99, !100}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !43, line: 65, baseType: !76, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !92, file: !43, line: 66, baseType: !96, size: 32, offset: 64)
!96 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !92, file: !43, line: 73, baseType: !98, size: 8, offset: 96)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !92, file: !43, line: 74, baseType: !98, size: 8, offset: 104)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !92, file: !43, line: 80, baseType: !98, size: 8, offset: 112)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !88, file: !43, line: 92, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !104)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !103, file: !43, line: 181, baseType: !106, size: 16)
!106 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !88, file: !43, line: 94, baseType: !108, size: 96, offset: 192)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 96, elements: !110)
!109 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!110 = !{!111}
!111 = !DISubrange(count: 3)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !88, file: !43, line: 95, baseType: !108, size: 96, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !88, file: !43, line: 102, baseType: !114, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !116)
!116 = !{!117, !118, !119, !121, !122, !145, !151}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !115, file: !43, line: 111, baseType: !91, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !115, file: !43, line: 112, baseType: !102, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !115, file: !43, line: 114, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !115, file: !43, line: 114, baseType: !120, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !115, file: !43, line: 118, baseType: !123, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !125)
!125 = !{!126, !127, !128, !129, !141, !142, !143, !144}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !124, file: !43, line: 126, baseType: !91, size: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !124, file: !43, line: 129, baseType: !120, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !124, file: !43, line: 130, baseType: !114, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !124, file: !43, line: 131, baseType: !130, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !132)
!132 = !{!133, !134, !135, !138, !139, !140}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !43, line: 165, baseType: !91, size: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !131, file: !43, line: 166, baseType: !102, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !131, file: !43, line: 172, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !124)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !131, file: !43, line: 174, baseType: !96, size: 32, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !131, file: !43, line: 175, baseType: !108, size: 96, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !131, file: !43, line: 176, baseType: !106, size: 16, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !124, file: !43, line: 135, baseType: !123, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !124, file: !43, line: 135, baseType: !123, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !43, line: 139, baseType: !123, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !124, file: !43, line: 139, baseType: !123, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !115, file: !43, line: 122, baseType: !146, size: 128, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !43, line: 107, baseType: !114, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !43, line: 107, baseType: !114, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !115, file: !43, line: 122, baseType: !146, size: 128, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !115)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !131)
!156 = !{i32 7, !"Dwarf Version", i32 4}
!157 = !{i32 2, !"Debug Info Version", i32 3}
!158 = !{i32 1, !"wchar_size", i32 4}
!159 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!160 = distinct !DISubprogram(name: "BM_mesh_edgesplit", scope: !1, file: !1, line: 101, type: !161, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !306)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163, !304, !304, !304}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !180, !181, !182, !183, !185, !187, !189, !190, !191, !192, !193, !194, !195, !196, !248, !287, !288, !289, !290, !291, !292, !293, !294, !301, !302, !303}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !165, file: !43, line: 187, baseType: !96, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !165, file: !43, line: 187, baseType: !96, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !165, file: !43, line: 187, baseType: !96, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !165, file: !43, line: 187, baseType: !96, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !165, file: !43, line: 188, baseType: !96, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !165, file: !43, line: 188, baseType: !96, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !165, file: !43, line: 188, baseType: !96, size: 32, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !165, file: !43, line: 193, baseType: !98, size: 8, offset: 224)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !165, file: !43, line: 197, baseType: !98, size: 8, offset: 232)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !165, file: !43, line: 201, baseType: !177, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !179, line: 71, flags: DIFlagFwdDecl)
!179 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !165, file: !43, line: 201, baseType: !177, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !165, file: !43, line: 201, baseType: !177, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !165, file: !43, line: 201, baseType: !177, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !165, file: !43, line: 208, baseType: !184, size: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !165, file: !43, line: 209, baseType: !186, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !165, file: !43, line: 210, baseType: !188, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !165, file: !43, line: 213, baseType: !96, size: 32, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !165, file: !43, line: 214, baseType: !96, size: 32, offset: 736)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !165, file: !43, line: 215, baseType: !96, size: 32, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !165, file: !43, line: 218, baseType: !177, size: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !165, file: !43, line: 218, baseType: !177, size: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !165, file: !43, line: 218, baseType: !177, size: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !165, file: !43, line: 220, baseType: !96, size: 32, offset: 1024)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !165, file: !43, line: 221, baseType: !197, size: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !199)
!199 = !{!200, !236, !237, !241, !244, !245, !247}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !198, file: !4, line: 191, baseType: !201, size: 5120)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 5120, elements: !234)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !203)
!203 = !{!204, !207, !209, !219, !220}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !202, file: !4, line: 148, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !202, file: !4, line: 149, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !202, file: !4, line: 150, baseType: !210, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !212)
!212 = !{!213, !215, !217}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !211, file: !4, line: 139, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !211, file: !4, line: 140, baseType: !216, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !211, file: !4, line: 141, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !202, file: !4, line: 152, baseType: !96, size: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !4, line: 162, baseType: !221, size: 128, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !4, line: 155, size: 128, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !229}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !221, file: !4, line: 156, baseType: !96, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !221, file: !4, line: 157, baseType: !109, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !221, file: !4, line: 158, baseType: !76, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !221, file: !4, line: 159, baseType: !108, size: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !221, file: !4, line: 160, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !221, file: !4, line: 161, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !232, line: 48, baseType: !233)
!232 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !232, line: 48, flags: DIFlagFwdDecl)
!234 = !{!235}
!235 = !DISubrange(count: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !198, file: !4, line: 192, baseType: !201, size: 5120, offset: 5120)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !198, file: !4, line: 193, baseType: !238, size: 64, offset: 10240)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !163, !197}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !198, file: !4, line: 194, baseType: !242, size: 64, offset: 10304)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !4, line: 195, baseType: !96, size: 32, offset: 10368)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !198, file: !4, line: 196, baseType: !246, size: 32, offset: 10400)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !198, file: !4, line: 197, baseType: !96, size: 32, offset: 10432)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !165, file: !43, line: 223, baseType: !249, size: 1600, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !179, line: 73, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !179, line: 64, size: 1600, elements: !251)
!251 = !{!252, !270, !274, !275, !276, !277, !278}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !250, file: !179, line: 65, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !179, line: 53, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !179, line: 42, size: 832, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265, !269}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !179, line: 43, baseType: !96, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !255, file: !179, line: 44, baseType: !96, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !255, file: !179, line: 45, baseType: !96, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !255, file: !179, line: 46, baseType: !96, size: 32, offset: 96)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !255, file: !179, line: 47, baseType: !96, size: 32, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !255, file: !179, line: 48, baseType: !96, size: 32, offset: 160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !255, file: !179, line: 49, baseType: !96, size: 32, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !255, file: !179, line: 50, baseType: !96, size: 32, offset: 224)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !255, file: !179, line: 51, baseType: !266, size: 512, offset: 256)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 512, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !255, file: !179, line: 52, baseType: !76, size: 64, offset: 768)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !250, file: !179, line: 66, baseType: !271, size: 1312, offset: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1312, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 41)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !250, file: !179, line: 69, baseType: !96, size: 32, offset: 1376)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !250, file: !179, line: 69, baseType: !96, size: 32, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !250, file: !179, line: 70, baseType: !96, size: 32, offset: 1440)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !250, file: !179, line: 71, baseType: !177, size: 64, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !250, file: !179, line: 72, baseType: !279, size: 64, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !179, line: 59, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !179, line: 57, size: 8192, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !281, file: !179, line: 58, baseType: !284, size: 8192)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8192, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 1024)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !165, file: !43, line: 223, baseType: !249, size: 1600, offset: 2752)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !165, file: !43, line: 223, baseType: !249, size: 1600, offset: 4352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !165, file: !43, line: 223, baseType: !249, size: 1600, offset: 5952)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !165, file: !43, line: 233, baseType: !106, size: 16, offset: 7552)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !165, file: !43, line: 236, baseType: !96, size: 32, offset: 7584)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !165, file: !43, line: 238, baseType: !96, size: 32, offset: 7616)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !165, file: !43, line: 238, baseType: !96, size: 32, offset: 7648)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !165, file: !43, line: 239, baseType: !295, size: 128, offset: 7680)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !296, line: 71, baseType: !297)
!296 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !296, line: 69, size: 128, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !297, file: !296, line: 70, baseType: !76, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !297, file: !296, line: 70, baseType: !76, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !165, file: !43, line: 241, baseType: !154, size: 64, offset: 7808)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !165, file: !43, line: 243, baseType: !295, size: 128, offset: 7872)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !165, file: !43, line: 245, baseType: !76, size: 64, offset: 8000)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!306 = !{}
!307 = !DILocalVariable(name: "bm", arg: 1, scope: !160, file: !1, line: 101, type: !163)
!308 = !DILocation(line: 101, column: 31, scope: !160)
!309 = !DILocalVariable(name: "use_verts", arg: 2, scope: !160, file: !1, line: 101, type: !304)
!310 = !DILocation(line: 101, column: 46, scope: !160)
!311 = !DILocalVariable(name: "tag_only", arg: 3, scope: !160, file: !1, line: 101, type: !304)
!312 = !DILocation(line: 101, column: 68, scope: !160)
!313 = !DILocalVariable(name: "copy_select", arg: 4, scope: !160, file: !1, line: 101, type: !304)
!314 = !DILocation(line: 101, column: 89, scope: !160)
!315 = !DILocalVariable(name: "iter", scope: !160, file: !1, line: 103, type: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !59, line: 186, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !59, line: 164, size: 512, elements: !318)
!318 = !{!319, !399, !400, !401, !402}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !59, line: 179, baseType: !320, size: 320)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !59, line: 166, size: 320, elements: !321)
!321 = !{!322, !337, !343, !351, !359, !365, !371, !377, !381, !387, !393}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !320, file: !59, line: 167, baseType: !323, size: 192)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !59, line: 113, size: 192, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !323, file: !59, line: 114, baseType: !326, size: 192)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !327, line: 80, baseType: !328)
!327 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !327, line: 76, size: 192, elements: !329)
!329 = !{!330, !333, !336}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !328, file: !327, line: 77, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !327, line: 47, baseType: !178)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !328, file: !327, line: 78, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !327, line: 45, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !328, file: !327, line: 79, baseType: !5, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !320, file: !59, line: 169, baseType: !338, size: 192)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !59, line: 116, size: 192, elements: !339)
!339 = !{!340, !341, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !338, file: !59, line: 117, baseType: !86, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !338, file: !59, line: 118, baseType: !152, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !338, file: !59, line: 118, baseType: !152, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !320, file: !59, line: 170, baseType: !344, size: 320)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !59, line: 120, size: 320, elements: !345)
!345 = !{!346, !347, !348, !349, !350}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !344, file: !59, line: 121, baseType: !86, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !344, file: !59, line: 122, baseType: !136, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !344, file: !59, line: 122, baseType: !136, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !344, file: !59, line: 123, baseType: !152, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !344, file: !59, line: 123, baseType: !152, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !320, file: !59, line: 171, baseType: !352, size: 320)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !59, line: 125, size: 320, elements: !353)
!353 = !{!354, !355, !356, !357, !358}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !352, file: !59, line: 126, baseType: !86, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !352, file: !59, line: 127, baseType: !136, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !352, file: !59, line: 127, baseType: !136, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !352, file: !59, line: 128, baseType: !152, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !352, file: !59, line: 128, baseType: !152, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !320, file: !59, line: 172, baseType: !360, size: 192)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !59, line: 130, size: 192, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !360, file: !59, line: 131, baseType: !152, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !360, file: !59, line: 132, baseType: !136, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !360, file: !59, line: 132, baseType: !136, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !320, file: !59, line: 173, baseType: !366, size: 192)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !59, line: 134, size: 192, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !366, file: !59, line: 135, baseType: !136, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !366, file: !59, line: 136, baseType: !136, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !366, file: !59, line: 136, baseType: !136, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !320, file: !59, line: 174, baseType: !372, size: 192)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !59, line: 138, size: 192, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !372, file: !59, line: 139, baseType: !152, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !372, file: !59, line: 140, baseType: !136, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !372, file: !59, line: 140, baseType: !136, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !320, file: !59, line: 175, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !59, line: 142, size: 64, elements: !379)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !378, file: !59, line: 143, baseType: !152, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !320, file: !59, line: 176, baseType: !382, size: 192)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !59, line: 145, size: 192, elements: !383)
!383 = !{!384, !385, !386}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !382, file: !59, line: 146, baseType: !154, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !382, file: !59, line: 147, baseType: !136, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !382, file: !59, line: 147, baseType: !136, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !320, file: !59, line: 177, baseType: !388, size: 192)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !59, line: 149, size: 192, elements: !389)
!389 = !{!390, !391, !392}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !388, file: !59, line: 150, baseType: !154, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !388, file: !59, line: 151, baseType: !136, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !388, file: !59, line: 151, baseType: !136, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !320, file: !59, line: 178, baseType: !394, size: 192)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !59, line: 153, size: 192, elements: !395)
!395 = !{!396, !397, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !394, file: !59, line: 154, baseType: !154, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !394, file: !59, line: 155, baseType: !136, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !394, file: !59, line: 155, baseType: !136, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !317, file: !59, line: 181, baseType: !78, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !317, file: !59, line: 182, baseType: !82, size: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !317, file: !59, line: 184, baseType: !96, size: 32, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !317, file: !59, line: 185, baseType: !98, size: 8, offset: 480)
!403 = !DILocation(line: 103, column: 9, scope: !160)
!404 = !DILocalVariable(name: "e", scope: !160, file: !1, line: 104, type: !152)
!405 = !DILocation(line: 104, column: 10, scope: !160)
!406 = !DILocalVariable(name: "use_ese", scope: !160, file: !1, line: 106, type: !305)
!407 = !DILocation(line: 106, column: 7, scope: !160)
!408 = !DILocalVariable(name: "ese_gh", scope: !160, file: !1, line: 107, type: !230)
!409 = !DILocation(line: 107, column: 9, scope: !160)
!410 = !DILocation(line: 109, column: 6, scope: !411)
!411 = distinct !DILexicalBlock(scope: !160, file: !1, line: 109, column: 6)
!412 = !DILocation(line: 109, column: 18, scope: !411)
!413 = !DILocation(line: 109, column: 21, scope: !411)
!414 = !DILocation(line: 109, column: 25, scope: !411)
!415 = !DILocation(line: 109, column: 34, scope: !411)
!416 = !DILocation(line: 109, column: 6, scope: !160)
!417 = !DILocalVariable(name: "ese", scope: !418, file: !1, line: 110, type: !419)
!418 = distinct !DILexicalBlock(scope: !411, file: !1, line: 109, column: 41)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEditSelection", file: !421, line: 34, baseType: !422)
!421 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_marking.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditSelection", file: !421, line: 30, size: 256, elements: !423)
!423 = !{!424, !426, !427, !433}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !421, line: 31, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !422, file: !421, line: 31, baseType: !425, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ele", scope: !422, file: !421, line: 32, baseType: !428, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !43, line: 154, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !43, line: 152, size: 128, elements: !431)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !430, file: !43, line: 153, baseType: !91, size: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !422, file: !421, line: 33, baseType: !98, size: 8, offset: 192)
!434 = !DILocation(line: 110, column: 20, scope: !418)
!435 = !DILocation(line: 112, column: 12, scope: !418)
!436 = !DILocation(line: 112, column: 10, scope: !418)
!437 = !DILocation(line: 113, column: 14, scope: !438)
!438 = distinct !DILexicalBlock(scope: !418, file: !1, line: 113, column: 3)
!439 = !DILocation(line: 113, column: 18, scope: !438)
!440 = !DILocation(line: 113, column: 27, scope: !438)
!441 = !DILocation(line: 113, column: 12, scope: !438)
!442 = !DILocation(line: 113, column: 8, scope: !438)
!443 = !DILocation(line: 113, column: 34, scope: !444)
!444 = distinct !DILexicalBlock(scope: !438, file: !1, line: 113, column: 3)
!445 = !DILocation(line: 113, column: 3, scope: !438)
!446 = !DILocation(line: 114, column: 8, scope: !447)
!447 = distinct !DILexicalBlock(scope: !448, file: !1, line: 114, column: 8)
!448 = distinct !DILexicalBlock(scope: !444, file: !1, line: 113, column: 56)
!449 = !DILocation(line: 114, column: 13, scope: !447)
!450 = !DILocation(line: 114, column: 19, scope: !447)
!451 = !DILocation(line: 114, column: 8, scope: !448)
!452 = !DILocation(line: 115, column: 22, scope: !453)
!453 = distinct !DILexicalBlock(scope: !447, file: !1, line: 114, column: 31)
!454 = !DILocation(line: 115, column: 30, scope: !453)
!455 = !DILocation(line: 115, column: 35, scope: !453)
!456 = !DILocation(line: 115, column: 40, scope: !453)
!457 = !DILocation(line: 115, column: 5, scope: !453)
!458 = !DILocation(line: 116, column: 4, scope: !453)
!459 = !DILocation(line: 117, column: 3, scope: !448)
!460 = !DILocation(line: 113, column: 45, scope: !444)
!461 = !DILocation(line: 113, column: 50, scope: !444)
!462 = !DILocation(line: 113, column: 43, scope: !444)
!463 = !DILocation(line: 113, column: 3, scope: !444)
!464 = distinct !{!464, !445, !465}
!465 = !DILocation(line: 117, column: 3, scope: !438)
!466 = !DILocation(line: 119, column: 11, scope: !418)
!467 = !DILocation(line: 120, column: 2, scope: !418)
!468 = !DILocation(line: 122, column: 6, scope: !469)
!469 = distinct !DILexicalBlock(scope: !160, file: !1, line: 122, column: 6)
!470 = !DILocation(line: 122, column: 15, scope: !469)
!471 = !DILocation(line: 122, column: 6, scope: !160)
!472 = !DILocation(line: 123, column: 33, scope: !473)
!473 = distinct !DILexicalBlock(scope: !469, file: !1, line: 122, column: 25)
!474 = !DILocation(line: 123, column: 48, scope: !473)
!475 = !DILocation(line: 123, column: 45, scope: !473)
!476 = !DILocation(line: 123, column: 37, scope: !473)
!477 = !DILocation(line: 123, column: 3, scope: !473)
!478 = !DILocation(line: 124, column: 2, scope: !473)
!479 = !DILocation(line: 126, column: 6, scope: !480)
!480 = distinct !DILexicalBlock(scope: !160, file: !1, line: 126, column: 6)
!481 = !DILocation(line: 126, column: 6, scope: !160)
!482 = !DILocation(line: 133, column: 3, scope: !483)
!483 = distinct !DILexicalBlock(scope: !484, file: !1, line: 133, column: 3)
!484 = distinct !DILexicalBlock(scope: !480, file: !1, line: 126, column: 17)
!485 = !DILocation(line: 133, column: 3, scope: !486)
!486 = distinct !DILexicalBlock(scope: !483, file: !1, line: 133, column: 3)
!487 = !DILocation(line: 134, column: 8, scope: !488)
!488 = distinct !DILexicalBlock(scope: !489, file: !1, line: 134, column: 8)
!489 = distinct !DILexicalBlock(scope: !486, file: !1, line: 133, column: 49)
!490 = !DILocation(line: 134, column: 8, scope: !489)
!491 = !DILocation(line: 135, column: 9, scope: !492)
!492 = distinct !DILexicalBlock(scope: !493, file: !1, line: 135, column: 9)
!493 = distinct !DILexicalBlock(scope: !488, file: !1, line: 134, column: 43)
!494 = !DILocation(line: 135, column: 9, scope: !493)
!495 = !DILocation(line: 138, column: 6, scope: !496)
!496 = distinct !DILexicalBlock(scope: !492, file: !1, line: 137, column: 5)
!497 = !DILocation(line: 139, column: 6, scope: !496)
!498 = !DILocation(line: 140, column: 5, scope: !496)
