; ModuleID = 'blender/source/blender/editors/gpencil/gpencil_ops.c'
source_filename = "blender/source/blender/editors/gpencil/gpencil_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmKeyConfig = type { %struct.wmKeyConfig*, %struct.wmKeyConfig*, [64 x i8], [64 x i8], %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.wmKeyMap = type { %struct.wmKeyMap*, %struct.wmKeyMap*, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i32 (%struct.bContext*)*, i8* }
%struct.bContext = type opaque
%struct.wmKeyMapItem = type { %struct.wmKeyMapItem*, %struct.wmKeyMapItem*, [64 x i8], %struct.IDProperty*, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, %struct.PointerRNA* }
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.StructRNA = type opaque

!152 = !DIEnumerator(name: "NDOF_BUTTON_ROLL_CCW", value: 412, isUnsigned: true)
!153 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CW", value: 413, isUnsigned: true)
!154 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CCW", value: 414, isUnsigned: true)
!155 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CW", value: 415, isUnsigned: true)
!156 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CCW", value: 416, isUnsigned: true)
!157 = !DIEnumerator(name: "NDOF_BUTTON_ROTATE", value: 417, isUnsigned: true)
!158 = !DIEnumerator(name: "NDOF_BUTTON_PANZOOM", value: 418, isUnsigned: true)
!159 = !DIEnumerator(name: "NDOF_BUTTON_DOMINANT", value: 419, isUnsigned: true)
!160 = !DIEnumerator(name: "NDOF_BUTTON_PLUS", value: 420, isUnsigned: true)
!161 = !DIEnumerator(name: "NDOF_BUTTON_MINUS", value: 421, isUnsigned: true)
!162 = !DIEnumerator(name: "NDOF_BUTTON_ESC", value: 422, isUnsigned: true)
!163 = !DIEnumerator(name: "NDOF_BUTTON_ALT", value: 423, isUnsigned: true)
!164 = !DIEnumerator(name: "NDOF_BUTTON_SHIFT", value: 424, isUnsigned: true)
!165 = !DIEnumerator(name: "NDOF_BUTTON_CTRL", value: 425, isUnsigned: true)
!166 = !DIEnumerator(name: "NDOF_BUTTON_1", value: 426, isUnsigned: true)
!167 = !DIEnumerator(name: "NDOF_BUTTON_2", value: 427, isUnsigned: true)
!168 = !DIEnumerator(name: "NDOF_BUTTON_3", value: 428, isUnsigned: true)
!169 = !DIEnumerator(name: "NDOF_BUTTON_4", value: 429, isUnsigned: true)
!170 = !DIEnumerator(name: "NDOF_BUTTON_5", value: 430, isUnsigned: true)
!171 = !DIEnumerator(name: "NDOF_BUTTON_6", value: 431, isUnsigned: true)
!172 = !DIEnumerator(name: "NDOF_BUTTON_7", value: 432, isUnsigned: true)
!173 = !DIEnumerator(name: "NDOF_BUTTON_8", value: 433, isUnsigned: true)
!174 = !DIEnumerator(name: "NDOF_BUTTON_9", value: 434, isUnsigned: true)
!175 = !DIEnumerator(name: "NDOF_BUTTON_10", value: 435, isUnsigned: true)
!176 = !DIEnumerator(name: "NDOF_BUTTON_A", value: 436, isUnsigned: true)
!177 = !DIEnumerator(name: "NDOF_BUTTON_B", value: 437, isUnsigned: true)
!178 = !DIEnumerator(name: "NDOF_BUTTON_C", value: 438, isUnsigned: true)
!179 = !DIEnumerator(name: "NDOF_LAST", value: 439, isUnsigned: true)
!180 = !DIEnumerator(name: "INPUTCHANGE", value: 259, isUnsigned: true)
!181 = !DIEnumerator(name: "WINDEACTIVATE", value: 260, isUnsigned: true)
!182 = !DIEnumerator(name: "TIMER", value: 272, isUnsigned: true)
!183 = !DIEnumerator(name: "TIMER0", value: 273, isUnsigned: true)
!184 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!185 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!186 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!187 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!188 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!189 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!190 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!191 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!192 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!193 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!194 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!195 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!196 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!197 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!198 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!199 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!200 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!201 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!202 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!203 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!204 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eGPencil_PaintModes", file: !206, line: 48, baseType: !5, size: 32, elements: !207)
!206 = !DIFile(filename: "blender/source/blender/editors/gpencil/gpencil_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!207 = !{!208, !209, !210, !211}
!208 = !DIEnumerator(name: "GP_PAINTMODE_DRAW", value: 0, isUnsigned: true)
!209 = !DIEnumerator(name: "GP_PAINTMODE_ERASER", value: 1, isUnsigned: true)
!210 = !DIEnumerator(name: "GP_PAINTMODE_DRAW_STRAIGHT", value: 2, isUnsigned: true)
!211 = !DIEnumerator(name: "GP_PAINTMODE_DRAW_POLY", value: 3, isUnsigned: true)
!212 = !{i32 7, !"Dwarf Version", i32 4}
!213 = !{i32 2, !"Debug Info Version", i32 3}
!214 = !{i32 1, !"wchar_size", i32 4}
!215 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!216 = distinct !DISubprogram(name: "ED_keymap_gpencil", scope: !1, file: !1, line: 51, type: !217, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmKeyConfig", file: !221, line: 318, baseType: !222)
!221 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !221, line: 310, size: 1344, elements: !223)
!223 = !{!224, !226, !227, !232, !233, !241, !243}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !221, line: 311, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !222, file: !221, line: 311, baseType: !225, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !222, file: !221, line: 313, baseType: !228, size: 512, offset: 128)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 512, elements: !230)
!229 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!230 = !{!231}
!231 = !DISubrange(count: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !222, file: !221, line: 314, baseType: !228, size: 512, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !222, file: !221, line: 316, baseType: !234, size: 128, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !235, line: 71, baseType: !236)
!235 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !235, line: 69, size: 128, elements: !237)
!237 = !{!238, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !236, file: !235, line: 70, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !236, file: !235, line: 70, baseType: !239, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !222, file: !221, line: 317, baseType: !242, size: 32, offset: 1280)
!242 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !222, file: !221, line: 317, baseType: !242, size: 32, offset: 1312)
!244 = !{}
!245 = !DILocalVariable(name: "keyconf", arg: 1, scope: !216, file: !1, line: 51, type: !219)
!246 = !DILocation(line: 51, column: 37, scope: !216)
!247 = !DILocalVariable(name: "keymap", scope: !216, file: !1, line: 53, type: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmKeyMap", file: !221, line: 297, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !221, line: 281, size: 1088, elements: !251)
!251 = !{!252, !254, !255, !256, !257, !258, !260, !261, !262, !263, !269}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !221, line: 282, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !250, file: !221, line: 282, baseType: !253, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !250, file: !221, line: 284, baseType: !234, size: 128, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !250, file: !221, line: 285, baseType: !234, size: 128, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !250, file: !221, line: 287, baseType: !228, size: 512, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !250, file: !221, line: 288, baseType: !259, size: 16, offset: 896)
!259 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !250, file: !221, line: 289, baseType: !259, size: 16, offset: 912)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !250, file: !221, line: 291, baseType: !259, size: 16, offset: 928)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !250, file: !221, line: 292, baseType: !259, size: 16, offset: 944)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !250, file: !221, line: 295, baseType: !264, size: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!242, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !221, line: 51, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !250, file: !221, line: 296, baseType: !239, size: 64, offset: 1024)
!270 = !DILocation(line: 53, column: 12, scope: !216)
!271 = !DILocation(line: 53, column: 36, scope: !216)
!272 = !DILocation(line: 53, column: 21, scope: !216)
!273 = !DILocalVariable(name: "kmi", scope: !216, file: !1, line: 54, type: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmKeyMapItem", file: !221, line: 252, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMapItem", file: !221, line: 227, size: 1472, elements: !277)
!277 = !{!278, !280, !281, !282, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !276, file: !221, line: 228, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !276, file: !221, line: 228, baseType: !279, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !276, file: !221, line: 231, baseType: !228, size: 512, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !276, file: !221, line: 232, baseType: !283, size: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !285, line: 75, baseType: !286)
!285 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !285, line: 62, size: 1024, elements: !287)
!287 = !{!288, !290, !291, !292, !293, !294, !295, !296, !304, !305}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !285, line: 63, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !286, file: !285, line: 63, baseType: !289, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !285, line: 64, baseType: !229, size: 8, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !286, file: !285, line: 64, baseType: !229, size: 8, offset: 136)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !286, file: !285, line: 65, baseType: !259, size: 16, offset: 144)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !286, file: !285, line: 66, baseType: !228, size: 512, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !286, file: !285, line: 67, baseType: !242, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !286, file: !285, line: 69, baseType: !297, size: 256, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !285, line: 60, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !285, line: 48, size: 256, elements: !299)
!299 = !{!300, !301, !302, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !298, file: !285, line: 49, baseType: !239, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !298, file: !285, line: 58, baseType: !234, size: 128, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !298, file: !285, line: 59, baseType: !242, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !298, file: !285, line: 59, baseType: !242, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !286, file: !285, line: 70, baseType: !242, size: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !286, file: !285, line: 74, baseType: !242, size: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "propvalue_str", scope: !276, file: !221, line: 235, baseType: !228, size: 512, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "propvalue", scope: !276, file: !221, line: 236, baseType: !259, size: 16, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !221, line: 239, baseType: !259, size: 16, offset: 1232)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !276, file: !221, line: 240, baseType: !259, size: 16, offset: 1248)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !276, file: !221, line: 241, baseType: !259, size: 16, offset: 1264)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !276, file: !221, line: 241, baseType: !259, size: 16, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !276, file: !221, line: 241, baseType: !259, size: 16, offset: 1296)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !276, file: !221, line: 241, baseType: !259, size: 16, offset: 1312)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !276, file: !221, line: 242, baseType: !259, size: 16, offset: 1328)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !276, file: !221, line: 245, baseType: !259, size: 16, offset: 1344)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "maptype", scope: !276, file: !221, line: 248, baseType: !259, size: 16, offset: 1360)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !276, file: !221, line: 249, baseType: !259, size: 16, offset: 1376)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !276, file: !221, line: 250, baseType: !259, size: 16, offset: 1392)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !276, file: !221, line: 251, baseType: !320, size: 64, offset: 1408)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !322, line: 55, size: 192, elements: !323)
!322 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!323 = !{!324, !328, !331}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !321, file: !322, line: 58, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !321, file: !322, line: 56, size: 64, elements: !326)
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !325, file: !322, line: 57, baseType: !239, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !321, file: !322, line: 60, baseType: !329, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !221, line: 57, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !322, line: 61, baseType: !239, size: 64, offset: 128)
!332 = !DILocation(line: 54, column: 16, scope: !216)
!333 = !DILocation(line: 59, column: 27, scope: !216)
!334 = !DILocation(line: 59, column: 8, scope: !216)
!335 = !DILocation(line: 59, column: 6, scope: !216)
!336 = !DILocation(line: 60, column: 15, scope: !216)
!337 = !DILocation(line: 60, column: 20, scope: !216)
!338 = !DILocation(line: 60, column: 2, scope: !216)
!339 = !DILocation(line: 63, column: 27, scope: !216)
!340 = !DILocation(line: 63, column: 8, scope: !216)
!341 = !DILocation(line: 63, column: 6, scope: !216)
!342 = !DILocation(line: 64, column: 15, scope: !216)
!343 = !DILocation(line: 64, column: 20, scope: !216)
!344 = !DILocation(line: 64, column: 2, scope: !216)
!345 = !DILocation(line: 67, column: 27, scope: !216)
!346 = !DILocation(line: 67, column: 8, scope: !216)
!347 = !DILocation(line: 67, column: 6, scope: !216)
!348 = !DILocation(line: 68, column: 15, scope: !216)
!349 = !DILocation(line: 68, column: 20, scope: !216)
!350 = !DILocation(line: 68, column: 2, scope: !216)
!351 = !DILocation(line: 71, column: 27, scope: !216)
!352 = !DILocation(line: 71, column: 8, scope: !216)
!353 = !DILocation(line: 71, column: 6, scope: !216)
!354 = !DILocation(line: 72, column: 15, scope: !216)
!355 = !DILocation(line: 72, column: 20, scope: !216)
!356 = !DILocation(line: 72, column: 2, scope: !216)
!357 = !DILocation(line: 73, column: 1, scope: !216)
!358 = distinct !DISubprogram(name: "ED_operatortypes_gpencil", scope: !1, file: !1, line: 77, type: !359, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!359 = !DISubroutineType(types: !360)
!360 = !{null}
!361 = !DILocation(line: 81, column: 2, scope: !358)
!362 = !DILocation(line: 85, column: 2, scope: !358)
!363 = !DILocation(line: 86, column: 2, scope: !358)
!364 = !DILocation(line: 88, column: 2, scope: !358)
!365 = !DILocation(line: 90, column: 2, scope: !358)
!366 = !DILocation(line: 92, column: 2, scope: !358)
!367 = !DILocation(line: 95, column: 1, scope: !358)
