; ModuleID = 'blender/source/blender/bmesh/operators/bmo_primitive.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_primitive.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !6, line: 116, baseType: !7, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22}
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !6, line: 131, baseType: !7, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!27 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!28 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !6, line: 123, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36}
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!35 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!36 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 182, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !45, line: 33, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 249, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !58, line: 57, baseType: !7, size: 32, elements: !59)
!58 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!60 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!74 = !{!75, !100, !85, !143, !144, !148, !76, !152, !154, !127}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !51, line: 103, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !51, line: 90, size: 448, elements: !79)
!79 = !{!80, !92, !98, !103, !104}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !78, file: !51, line: 91, baseType: !81, size: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !51, line: 82, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !51, line: 64, size: 128, elements: !83)
!83 = !{!84, !86, !88, !90, !91}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !82, file: !51, line: 65, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !82, file: !51, line: 66, baseType: !87, size: 32, offset: 64)
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !82, file: !51, line: 73, baseType: !89, size: 8, offset: 96)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !82, file: !51, line: 74, baseType: !89, size: 8, offset: 104)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !82, file: !51, line: 80, baseType: !89, size: 8, offset: 112)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !78, file: !51, line: 92, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !51, line: 180, size: 16, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !94, file: !51, line: 181, baseType: !97, size: 16)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !78, file: !51, line: 94, baseType: !99, size: 96, offset: 192)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 96, elements: !101)
!100 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!101 = !{!102}
!102 = !DISubrange(count: 3)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !78, file: !51, line: 95, baseType: !99, size: 96, offset: 288)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !78, file: !51, line: 102, baseType: !105, size: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !51, line: 110, size: 640, elements: !107)
!107 = !{!108, !109, !110, !112, !113, !136, !142}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !106, file: !51, line: 111, baseType: !81, size: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !106, file: !51, line: 112, baseType: !93, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !106, file: !51, line: 114, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !106, file: !51, line: 114, baseType: !111, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !106, file: !51, line: 118, baseType: !114, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !51, line: 125, size: 576, elements: !116)
!116 = !{!117, !118, !119, !120, !132, !133, !134, !135}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !115, file: !51, line: 126, baseType: !81, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !115, file: !51, line: 129, baseType: !111, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !115, file: !51, line: 130, baseType: !105, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !115, file: !51, line: 131, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !51, line: 164, size: 448, elements: !123)
!123 = !{!124, !125, !126, !129, !130, !131}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !122, file: !51, line: 165, baseType: !81, size: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !122, file: !51, line: 166, baseType: !93, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !122, file: !51, line: 172, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !51, line: 140, baseType: !115)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !122, file: !51, line: 174, baseType: !87, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !122, file: !51, line: 175, baseType: !99, size: 96, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !122, file: !51, line: 176, baseType: !97, size: 16, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !115, file: !51, line: 135, baseType: !114, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !115, file: !51, line: 135, baseType: !114, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !51, line: 139, baseType: !114, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !51, line: 139, baseType: !114, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !106, file: !51, line: 122, baseType: !137, size: 128, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !51, line: 108, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !51, line: 106, size: 128, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !51, line: 107, baseType: !105, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !51, line: 107, baseType: !105, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !106, file: !51, line: 122, baseType: !137, size: 128, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !58, line: 79, baseType: !57)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !58, line: 158, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !85}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !58, line: 159, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!85, !85}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !51, line: 123, baseType: !106)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !51, line: 178, baseType: !122)
!156 = !{!157, !160, !162, !0, !164, !170, !177}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression(DW_OP_constu, 271, DW_OP_stack_value))
!158 = distinct !DIGlobalVariable(name: "monkeynv", scope: !2, file: !3, line: 82, type: !159, isLocal: true, isDefinition: true)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression(DW_OP_constu, 250, DW_OP_stack_value))
!161 = distinct !DIGlobalVariable(name: "monkeynf", scope: !2, file: !3, line: 83, type: !159, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!163 = distinct !DIGlobalVariable(name: "monkeyo", scope: !2, file: !3, line: 81, type: !159, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "icoface", scope: !2, file: !3, line: 54, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 960, elements: !168)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!168 = !{!169, !102}
!169 = !DISubrange(count: 20)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "monkeyv", scope: !2, file: !3, line: 84, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 6504, elements: !175)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!175 = !{!176, !102}
!176 = !DISubrange(count: 271)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "monkeyf", scope: !2, file: !3, line: 155, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 8000, elements: !180)
!180 = !{!181, !182}
!181 = !DISubrange(count: 250)
!182 = !DISubrange(count: 4)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 1152, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!185 = !{!186, !102}
!186 = !DISubrange(count: 12)
!187 = !{i32 7, !"Dwarf Version", i32 4}
!188 = !{i32 2, !"Debug Info Version", i32 3}
!189 = !{i32 1, !"wchar_size", i32 4}
!190 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!191 = distinct !DISubprogram(name: "bmo_create_grid_exec", scope: !3, file: !3, line: 229, type: !192, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !336)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194, !334}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !51, line: 246, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !51, line: 186, size: 8064, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !211, !212, !213, !214, !215, !217, !219, !220, !221, !222, !223, !224, !225, !226, !278, !317, !318, !319, !320, !321, !322, !323, !324, !331, !332, !333}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !196, file: !51, line: 187, baseType: !87, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !196, file: !51, line: 187, baseType: !87, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !196, file: !51, line: 187, baseType: !87, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !196, file: !51, line: 187, baseType: !87, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !196, file: !51, line: 188, baseType: !87, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !196, file: !51, line: 188, baseType: !87, size: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !196, file: !51, line: 188, baseType: !87, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !196, file: !51, line: 193, baseType: !89, size: 8, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !196, file: !51, line: 197, baseType: !89, size: 8, offset: 232)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !196, file: !51, line: 201, baseType: !208, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !210, line: 71, flags: DIFlagFwdDecl)
!210 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!211 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !196, file: !51, line: 201, baseType: !208, size: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !196, file: !51, line: 201, baseType: !208, size: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !196, file: !51, line: 201, baseType: !208, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !196, file: !51, line: 208, baseType: !75, size: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !196, file: !51, line: 209, baseType: !216, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !196, file: !51, line: 210, baseType: !218, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !196, file: !51, line: 213, baseType: !87, size: 32, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !196, file: !51, line: 214, baseType: !87, size: 32, offset: 736)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !196, file: !51, line: 215, baseType: !87, size: 32, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !196, file: !51, line: 218, baseType: !208, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !196, file: !51, line: 218, baseType: !208, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !196, file: !51, line: 218, baseType: !208, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !196, file: !51, line: 220, baseType: !87, size: 32, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !196, file: !51, line: 221, baseType: !227, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !229)
!229 = !{!230, !266, !267, !271, !274, !275, !277}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !228, file: !6, line: 191, baseType: !231, size: 5120)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 5120, elements: !264)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !233)
!233 = !{!234, !237, !239, !249, !250}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !232, file: !6, line: 148, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !232, file: !6, line: 149, baseType: !238, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !232, file: !6, line: 150, baseType: !240, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !242)
!242 = !{!243, !245, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !241, file: !6, line: 139, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !241, file: !6, line: 140, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !241, file: !6, line: 141, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !232, file: !6, line: 152, baseType: !87, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !6, line: 162, baseType: !251, size: 128, offset: 192)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !6, line: 155, size: 128, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !259}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !251, file: !6, line: 156, baseType: !87, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !251, file: !6, line: 157, baseType: !100, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !251, file: !6, line: 158, baseType: !85, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !251, file: !6, line: 159, baseType: !99, size: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !251, file: !6, line: 160, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !251, file: !6, line: 161, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !262, line: 48, baseType: !263)
!262 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !262, line: 48, flags: DIFlagFwdDecl)
!264 = !{!265}
!265 = !DISubrange(count: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !228, file: !6, line: 192, baseType: !231, size: 5120, offset: 5120)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !228, file: !6, line: 193, baseType: !268, size: 64, offset: 10240)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !194, !227}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !228, file: !6, line: 194, baseType: !272, size: 64, offset: 10304)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !6, line: 194, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !6, line: 195, baseType: !87, size: 32, offset: 10368)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !228, file: !6, line: 196, baseType: !276, size: 32, offset: 10400)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !228, file: !6, line: 197, baseType: !87, size: 32, offset: 10432)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !196, file: !51, line: 223, baseType: !279, size: 1600, offset: 1152)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !210, line: 73, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !210, line: 64, size: 1600, elements: !281)
!281 = !{!282, !300, !304, !305, !306, !307, !308}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !280, file: !210, line: 65, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !210, line: 53, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !210, line: 42, size: 832, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !299}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !285, file: !210, line: 43, baseType: !87, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !285, file: !210, line: 44, baseType: !87, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !210, line: 45, baseType: !87, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !285, file: !210, line: 46, baseType: !87, size: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !285, file: !210, line: 47, baseType: !87, size: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !285, file: !210, line: 48, baseType: !87, size: 32, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !285, file: !210, line: 49, baseType: !87, size: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !285, file: !210, line: 50, baseType: !87, size: 32, offset: 224)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !285, file: !210, line: 51, baseType: !296, size: 512, offset: 256)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 512, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !285, file: !210, line: 52, baseType: !85, size: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !280, file: !210, line: 66, baseType: !301, size: 1312, offset: 64)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1312, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 41)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !280, file: !210, line: 69, baseType: !87, size: 32, offset: 1376)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !280, file: !210, line: 69, baseType: !87, size: 32, offset: 1408)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !280, file: !210, line: 70, baseType: !87, size: 32, offset: 1440)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !280, file: !210, line: 71, baseType: !208, size: 64, offset: 1472)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !280, file: !210, line: 72, baseType: !309, size: 64, offset: 1536)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !210, line: 59, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !210, line: 57, size: 8192, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !311, file: !210, line: 58, baseType: !314, size: 8192)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 1024)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !196, file: !51, line: 223, baseType: !279, size: 1600, offset: 2752)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !196, file: !51, line: 223, baseType: !279, size: 1600, offset: 4352)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !196, file: !51, line: 223, baseType: !279, size: 1600, offset: 5952)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !196, file: !51, line: 233, baseType: !97, size: 16, offset: 7552)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !196, file: !51, line: 236, baseType: !87, size: 32, offset: 7584)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !196, file: !51, line: 238, baseType: !87, size: 32, offset: 7616)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !196, file: !51, line: 238, baseType: !87, size: 32, offset: 7648)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !196, file: !51, line: 239, baseType: !325, size: 128, offset: 7680)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !326, line: 71, baseType: !327)
!326 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !326, line: 69, size: 128, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !327, file: !326, line: 70, baseType: !85, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !327, file: !326, line: 70, baseType: !85, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !196, file: !51, line: 241, baseType: !154, size: 64, offset: 7808)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !196, file: !51, line: 243, baseType: !325, size: 128, offset: 7872)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !196, file: !51, line: 245, baseType: !85, size: 64, offset: 8000)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !6, line: 198, baseType: !228)
!336 = !{}
!337 = !DILocalVariable(name: "bm", arg: 1, scope: !191, file: !3, line: 229, type: !194)
!338 = !DILocation(line: 229, column: 34, scope: !191)
!339 = !DILocalVariable(name: "op", arg: 2, scope: !191, file: !3, line: 229, type: !334)
!340 = !DILocation(line: 229, column: 50, scope: !191)
!341 = !DILocalVariable(name: "slot_verts_out", scope: !191, file: !3, line: 231, type: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !6, line: 163, baseType: !232)
!344 = !DILocation(line: 231, column: 12, scope: !191)
!345 = !DILocation(line: 231, column: 42, scope: !191)
!346 = !DILocation(line: 231, column: 46, scope: !191)
!347 = !DILocation(line: 231, column: 29, scope: !191)
!348 = !DILocalVariable(name: "dia", scope: !191, file: !3, line: 233, type: !184)
!349 = !DILocation(line: 233, column: 14, scope: !191)
!350 = !DILocation(line: 233, column: 39, scope: !191)
!351 = !DILocation(line: 233, column: 43, scope: !191)
!352 = !DILocation(line: 233, column: 20, scope: !191)
!353 = !DILocalVariable(name: "xtot", scope: !191, file: !3, line: 234, type: !354)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!355 = !DILocation(line: 234, column: 21, scope: !191)
!356 = !DILocation(line: 234, column: 55, scope: !191)
!357 = !DILocation(line: 234, column: 59, scope: !191)
!358 = !DILocation(line: 234, column: 38, scope: !191)
!359 = !DILocation(line: 234, column: 28, scope: !191)
!360 = !DILocalVariable(name: "ytot", scope: !191, file: !3, line: 235, type: !354)
!361 = !DILocation(line: 235, column: 21, scope: !191)
!362 = !DILocation(line: 235, column: 55, scope: !191)
!363 = !DILocation(line: 235, column: 59, scope: !191)
!364 = !DILocation(line: 235, column: 38, scope: !191)
!365 = !DILocation(line: 235, column: 28, scope: !191)
!366 = !DILocalVariable(name: "xtot_inv2", scope: !191, file: !3, line: 236, type: !184)
!367 = !DILocation(line: 236, column: 14, scope: !191)
!368 = !DILocation(line: 236, column: 34, scope: !191)
!369 = !DILocation(line: 236, column: 39, scope: !191)
!370 = !DILocation(line: 236, column: 33, scope: !191)
!371 = !DILocation(line: 236, column: 31, scope: !191)
!372 = !DILocalVariable(name: "ytot_inv2", scope: !191, file: !3, line: 237, type: !184)
!373 = !DILocation(line: 237, column: 14, scope: !191)
!374 = !DILocation(line: 237, column: 34, scope: !191)
!375 = !DILocation(line: 237, column: 39, scope: !191)
!376 = !DILocation(line: 237, column: 33, scope: !191)
!377 = !DILocation(line: 237, column: 31, scope: !191)
!378 = !DILocalVariable(name: "varr", scope: !191, file: !3, line: 239, type: !75)
!379 = !DILocation(line: 239, column: 11, scope: !191)
!380 = !DILocalVariable(name: "vquad", scope: !191, file: !3, line: 240, type: !381)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !382)
!382 = !{!182}
!383 = !DILocation(line: 240, column: 10, scope: !191)
!384 = !DILocalVariable(name: "mat", scope: !191, file: !3, line: 242, type: !385)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 512, elements: !386)
!386 = !{!182, !182}
!387 = !DILocation(line: 242, column: 8, scope: !191)
!388 = !DILocalVariable(name: "vec", scope: !191, file: !3, line: 243, type: !99)
!389 = !DILocation(line: 243, column: 8, scope: !191)
!390 = !DILocalVariable(name: "tvec", scope: !191, file: !3, line: 243, type: !99)
!391 = !DILocation(line: 243, column: 16, scope: !191)
!392 = !DILocalVariable(name: "x", scope: !191, file: !3, line: 245, type: !7)
!393 = !DILocation(line: 245, column: 15, scope: !191)
!394 = !DILocalVariable(name: "y", scope: !191, file: !3, line: 245, type: !7)
!395 = !DILocation(line: 245, column: 18, scope: !191)
!396 = !DILocalVariable(name: "i", scope: !191, file: !3, line: 245, type: !7)
!397 = !DILocation(line: 245, column: 21, scope: !191)
!398 = !DILocation(line: 248, column: 20, scope: !191)
!399 = !DILocation(line: 248, column: 24, scope: !191)
!400 = !DILocation(line: 248, column: 44, scope: !191)
!401 = !DILocation(line: 248, column: 2, scope: !191)
!402 = !DILocation(line: 250, column: 24, scope: !191)
!403 = !DILocation(line: 250, column: 28, scope: !191)
!404 = !DILocation(line: 250, column: 32, scope: !191)
!405 = !DILocation(line: 250, column: 56, scope: !191)
!406 = !DILocation(line: 250, column: 63, scope: !191)
!407 = !DILocation(line: 250, column: 61, scope: !191)
!408 = !DILocation(line: 250, column: 2, scope: !191)
!409 = !DILocation(line: 251, column: 20, scope: !191)
!410 = !DILocation(line: 251, column: 36, scope: !191)
!411 = !DILocation(line: 251, column: 41, scope: !191)
!412 = !DILocation(line: 251, column: 9, scope: !191)
!413 = !DILocation(line: 251, column: 7, scope: !191)
!414 = !DILocation(line: 253, column: 4, scope: !191)
!415 = !DILocation(line: 254, column: 2, scope: !191)
!416 = !DILocation(line: 254, column: 9, scope: !191)
!417 = !DILocation(line: 255, column: 9, scope: !418)
!418 = distinct !DILexicalBlock(scope: !191, file: !3, line: 255, column: 2)
!419 = !DILocation(line: 255, column: 7, scope: !418)
!420 = !DILocation(line: 255, column: 14, scope: !421)
!421 = distinct !DILexicalBlock(scope: !418, file: !3, line: 255, column: 2)
!422 = !DILocation(line: 255, column: 18, scope: !421)
!423 = !DILocation(line: 255, column: 16, scope: !421)
!424 = !DILocation(line: 255, column: 2, scope: !418)
!425 = !DILocation(line: 256, column: 14, scope: !426)
!426 = distinct !DILexicalBlock(scope: !421, file: !3, line: 255, column: 29)
!427 = !DILocation(line: 256, column: 18, scope: !426)
!428 = !DILocation(line: 256, column: 16, scope: !426)
!429 = !DILocation(line: 256, column: 29, scope: !426)
!430 = !DILocation(line: 256, column: 39, scope: !426)
!431 = !DILocation(line: 256, column: 37, scope: !426)
!432 = !DILocation(line: 256, column: 3, scope: !426)
!433 = !DILocation(line: 256, column: 10, scope: !426)
!434 = !DILocation(line: 257, column: 10, scope: !435)
!435 = distinct !DILexicalBlock(scope: !426, file: !3, line: 257, column: 3)
!436 = !DILocation(line: 257, column: 8, scope: !435)
!437 = !DILocation(line: 257, column: 15, scope: !438)
!438 = distinct !DILexicalBlock(scope: !435, file: !3, line: 257, column: 3)
!439 = !DILocation(line: 257, column: 19, scope: !438)
!440 = !DILocation(line: 257, column: 17, scope: !438)
!441 = !DILocation(line: 257, column: 3, scope: !435)
!442 = !DILocation(line: 258, column: 15, scope: !443)
!443 = distinct !DILexicalBlock(scope: !438, file: !3, line: 257, column: 30)
!444 = !DILocation(line: 258, column: 19, scope: !443)
!445 = !DILocation(line: 258, column: 17, scope: !443)
!446 = !DILocation(line: 258, column: 30, scope: !443)
!447 = !DILocation(line: 258, column: 40, scope: !443)
!448 = !DILocation(line: 258, column: 38, scope: !443)
!449 = !DILocation(line: 258, column: 4, scope: !443)
!450 = !DILocation(line: 258, column: 11, scope: !443)
!451 = !DILocation(line: 259, column: 16, scope: !443)
!452 = !DILocation(line: 259, column: 22, scope: !443)
!453 = !DILocation(line: 259, column: 27, scope: !443)
!454 = !DILocation(line: 259, column: 4, scope: !443)
!455 = !DILocation(line: 260, column: 31, scope: !443)
!456 = !DILocation(line: 260, column: 35, scope: !443)
!457 = !DILocation(line: 260, column: 16, scope: !443)
!458 = !DILocation(line: 260, column: 4, scope: !443)
!459 = !DILocation(line: 260, column: 10, scope: !443)
!460 = !DILocation(line: 260, column: 14, scope: !443)
!461 = !DILocation(line: 261, column: 3, scope: !443)
!462 = !DILocation(line: 257, column: 26, scope: !438)
!463 = !DILocation(line: 257, column: 3, scope: !438)
!464 = distinct !{!464, !441, !465}
!465 = !DILocation(line: 261, column: 3, scope: !435)
!466 = !DILocation(line: 262, column: 2, scope: !426)
!467 = !DILocation(line: 255, column: 25, scope: !421)
!468 = !DILocation(line: 255, column: 2, scope: !421)
!469 = distinct !{!469, !424, !470}
!470 = !DILocation(line: 262, column: 2, scope: !418)
!471 = !DILocation(line: 266, column: 9, scope: !472)
!472 = distinct !DILexicalBlock(scope: !191, file: !3, line: 266, column: 2)
!473 = !DILocation(line: 266, column: 7, scope: !472)
!474 = !DILocation(line: 266, column: 14, scope: !475)
!475 = distinct !DILexicalBlock(scope: !472, file: !3, line: 266, column: 2)
!476 = !DILocation(line: 266, column: 18, scope: !475)
!477 = !DILocation(line: 266, column: 16, scope: !475)
!478 = !DILocation(line: 266, column: 2, scope: !472)
!479 = !DILocation(line: 267, column: 10, scope: !480)
!480 = distinct !DILexicalBlock(scope: !481, file: !3, line: 267, column: 3)
!481 = distinct !DILexicalBlock(scope: !475, file: !3, line: 266, column: 29)
!482 = !DILocation(line: 267, column: 8, scope: !480)
!483 = !DILocation(line: 267, column: 15, scope: !484)
!484 = distinct !DILexicalBlock(scope: !480, file: !3, line: 267, column: 3)
!485 = !DILocation(line: 267, column: 19, scope: !484)
!486 = !DILocation(line: 267, column: 17, scope: !484)
!487 = !DILocation(line: 267, column: 3, scope: !480)
!488 = !DILocation(line: 268, column: 15, scope: !489)
!489 = distinct !DILexicalBlock(scope: !484, file: !3, line: 267, column: 30)
!490 = !DILocation(line: 268, column: 20, scope: !489)
!491 = !DILocation(line: 268, column: 4, scope: !489)
!492 = !DILocation(line: 268, column: 13, scope: !489)
!493 = !DILocation(line: 269, column: 15, scope: !489)
!494 = !DILocation(line: 269, column: 20, scope: !489)
!495 = !DILocation(line: 269, column: 4, scope: !489)
!496 = !DILocation(line: 269, column: 13, scope: !489)
!497 = !DILocation(line: 270, column: 15, scope: !489)
!498 = !DILocation(line: 270, column: 20, scope: !489)
!499 = !DILocation(line: 270, column: 4, scope: !489)
!500 = !DILocation(line: 270, column: 13, scope: !489)
!501 = !DILocation(line: 271, column: 15, scope: !489)
!502 = !DILocation(line: 271, column: 20, scope: !489)
!503 = !DILocation(line: 271, column: 4, scope: !489)
!504 = !DILocation(line: 271, column: 13, scope: !489)
!505 = !DILocation(line: 273, column: 25, scope: !489)
!506 = !DILocation(line: 273, column: 29, scope: !489)
!507 = !DILocation(line: 273, column: 4, scope: !489)
!508 = !DILocation(line: 274, column: 3, scope: !489)
!509 = !DILocation(line: 267, column: 26, scope: !484)
!510 = !DILocation(line: 267, column: 3, scope: !484)
!511 = distinct !{!511, !487, !512}
!512 = !DILocation(line: 274, column: 3, scope: !480)
!513 = !DILocation(line: 275, column: 2, scope: !481)
!514 = !DILocation(line: 266, column: 25, scope: !475)
!515 = !DILocation(line: 266, column: 2, scope: !475)
!516 = distinct !{!516, !478, !517}
!517 = !DILocation(line: 275, column: 2, scope: !472)
!518 = !DILocation(line: 279, column: 1, scope: !191)
!519 = distinct !DISubprogram(name: "max_ii", scope: !520, file: !520, line: 215, type: !521, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !336)
!520 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_base_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!521 = !DISubroutineType(types: !522)
!522 = !{!87, !87, !87}
!523 = !DILocalVariable(name: "a", arg: 1, scope: !519, file: !520, line: 215, type: !87)
!524 = !DILocation(line: 215, column: 24, scope: !519)
!525 = !DILocalVariable(name: "b", arg: 2, scope: !519, file: !520, line: 215, type: !87)
!526 = !DILocation(line: 215, column: 31, scope: !519)
!527 = !DILocation(line: 217, column: 10, scope: !519)
!528 = !DILocation(line: 217, column: 14, scope: !519)
!529 = !DILocation(line: 217, column: 12, scope: !519)
!530 = !DILocation(line: 217, column: 9, scope: !519)
!531 = !DILocation(line: 217, column: 19, scope: !519)
!532 = !DILocation(line: 217, column: 23, scope: !519)
!533 = !DILocation(line: 217, column: 2, scope: !519)
!534 = distinct !DISubprogram(name: "bmo_create_uvsphere_exec", scope: !3, file: !3, line: 281, type: !192, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !336)
!535 = !DILocalVariable(name: "bm", arg: 1, scope: !534, file: !3, line: 281, type: !194)
!536 = !DILocation(line: 281, column: 38, scope: !534)
!537 = !DILocalVariable(name: "op", arg: 2, scope: !534, file: !3, line: 281, type: !334)
!538 = !DILocation(line: 281, column: 54, scope: !534)
!539 = !DILocalVariable(name: "dia", scope: !534, file: !3, line: 283, type: !184)
!540 = !DILocation(line: 283, column: 14, scope: !534)
!541 = !DILocation(line: 283, column: 39, scope: !534)
!542 = !DILocation(line: 283, column: 43, scope: !534)
!543 = !DILocation(line: 283, column: 20, scope: !534)
!544 = !DILocalVariable(name: "seg", scope: !534, file: !3, line: 284, type: !159)
!545 = !DILocation(line: 284, column: 12, scope: !534)
!546 = !DILocation(line: 284, column: 35, scope: !534)
!547 = !DILocation(line: 284, column: 39, scope: !534)
!548 = !DILocation(line: 284, column: 18, scope: !534)
!549 = !DILocalVariable(name: "tot", scope: !534, file: !3, line: 285, type: !159)
!550 = !DILocation(line: 285, column: 12, scope: !534)
!551 = !DILocation(line: 285, column: 35, scope: !534)
!552 = !DILocation(line: 285, column: 39, scope: !534)
!553 = !DILocation(line: 285, column: 18, scope: !534)
!554 = !DILocalVariable(name: "bmop", scope: !534, file: !3, line: 287, type: !335)
!555 = !DILocation(line: 287, column: 13, scope: !534)
!556 = !DILocalVariable(name: "prevop", scope: !534, file: !3, line: 287, type: !335)
!557 = !DILocation(line: 287, column: 19, scope: !534)
!558 = !DILocalVariable(name: "eve", scope: !534, file: !3, line: 288, type: !76)
!559 = !DILocation(line: 288, column: 10, scope: !534)
!560 = !DILocalVariable(name: "preveve", scope: !534, file: !3, line: 288, type: !76)
!561 = !DILocation(line: 288, column: 16, scope: !534)
!562 = !DILocalVariable(name: "e", scope: !534, file: !3, line: 289, type: !152)
!563 = !DILocation(line: 289, column: 10, scope: !534)
!564 = !DILocalVariable(name: "iter", scope: !534, file: !3, line: 290, type: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !58, line: 186, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !58, line: 164, size: 512, elements: !567)
!567 = !{!568, !648, !649, !650, !651}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !566, file: !58, line: 179, baseType: !569, size: 320)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !566, file: !58, line: 166, size: 320, elements: !570)
!570 = !{!571, !586, !592, !600, !608, !614, !620, !626, !630, !636, !642}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !569, file: !58, line: 167, baseType: !572, size: 192)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !58, line: 113, size: 192, elements: !573)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !572, file: !58, line: 114, baseType: !575, size: 192)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !576, line: 80, baseType: !577)
!576 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !576, line: 76, size: 192, elements: !578)
!578 = !{!579, !582, !585}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !577, file: !576, line: 77, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !576, line: 47, baseType: !209)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !577, file: !576, line: 78, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !576, line: 45, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !577, file: !576, line: 79, baseType: !7, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !569, file: !58, line: 169, baseType: !587, size: 192)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !58, line: 116, size: 192, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !587, file: !58, line: 117, baseType: !76, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !587, file: !58, line: 118, baseType: !152, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !587, file: !58, line: 118, baseType: !152, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !569, file: !58, line: 170, baseType: !593, size: 320)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !58, line: 120, size: 320, elements: !594)
!594 = !{!595, !596, !597, !598, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !593, file: !58, line: 121, baseType: !76, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !593, file: !58, line: 122, baseType: !127, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !593, file: !58, line: 122, baseType: !127, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !593, file: !58, line: 123, baseType: !152, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !593, file: !58, line: 123, baseType: !152, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !569, file: !58, line: 171, baseType: !601, size: 320)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !58, line: 125, size: 320, elements: !602)
!602 = !{!603, !604, !605, !606, !607}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !601, file: !58, line: 126, baseType: !76, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !601, file: !58, line: 127, baseType: !127, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !601, file: !58, line: 127, baseType: !127, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !601, file: !58, line: 128, baseType: !152, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !601, file: !58, line: 128, baseType: !152, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !569, file: !58, line: 172, baseType: !609, size: 192)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !58, line: 130, size: 192, elements: !610)
!610 = !{!611, !612, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !609, file: !58, line: 131, baseType: !152, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !609, file: !58, line: 132, baseType: !127, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !609, file: !58, line: 132, baseType: !127, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !569, file: !58, line: 173, baseType: !615, size: 192)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !58, line: 134, size: 192, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !615, file: !58, line: 135, baseType: !127, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !615, file: !58, line: 136, baseType: !127, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !615, file: !58, line: 136, baseType: !127, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !569, file: !58, line: 174, baseType: !621, size: 192)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !58, line: 138, size: 192, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !621, file: !58, line: 139, baseType: !152, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !621, file: !58, line: 140, baseType: !127, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !621, file: !58, line: 140, baseType: !127, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !569, file: !58, line: 175, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !58, line: 142, size: 64, elements: !628)
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !627, file: !58, line: 143, baseType: !152, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !569, file: !58, line: 176, baseType: !631, size: 192)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !58, line: 145, size: 192, elements: !632)
!632 = !{!633, !634, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !631, file: !58, line: 146, baseType: !154, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !631, file: !58, line: 147, baseType: !127, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !631, file: !58, line: 147, baseType: !127, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !569, file: !58, line: 177, baseType: !637, size: 192)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !58, line: 149, size: 192, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !637, file: !58, line: 150, baseType: !154, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !637, file: !58, line: 151, baseType: !127, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !637, file: !58, line: 151, baseType: !127, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !569, file: !58, line: 178, baseType: !643, size: 192)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !58, line: 153, size: 192, elements: !644)
!644 = !{!645, !646, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !643, file: !58, line: 154, baseType: !154, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !643, file: !58, line: 155, baseType: !127, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !643, file: !58, line: 155, baseType: !127, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !566, file: !58, line: 181, baseType: !144, size: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !566, file: !58, line: 182, baseType: !148, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !566, file: !58, line: 184, baseType: !87, size: 32, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !566, file: !58, line: 185, baseType: !89, size: 8, offset: 480)
!652 = !DILocation(line: 290, column: 9, scope: !534)
!653 = !DILocalVariable(name: "axis", scope: !534, file: !3, line: 291, type: !654)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 96, elements: !101)
!655 = !DILocation(line: 291, column: 14, scope: !534)
!656 = !DILocalVariable(name: "vec", scope: !534, file: !3, line: 292, type: !99)
!657 = !DILocation(line: 292, column: 8, scope: !534)
!658 = !DILocalVariable(name: "mat", scope: !534, file: !3, line: 292, type: !385)
!659 = !DILocation(line: 292, column: 16, scope: !534)
!660 = !DILocalVariable(name: "cmat", scope: !534, file: !3, line: 292, type: !661)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 288, elements: !662)
!662 = !{!102, !102}
!663 = !DILocation(line: 292, column: 27, scope: !534)
!664 = !DILocalVariable(name: "phi", scope: !534, file: !3, line: 293, type: !100)
!665 = !DILocation(line: 293, column: 8, scope: !534)
!666 = !DILocalVariable(name: "phid", scope: !534, file: !3, line: 293, type: !100)
!667 = !DILocation(line: 293, column: 13, scope: !534)
!668 = !DILocalVariable(name: "a", scope: !534, file: !3, line: 294, type: !87)
!669 = !DILocation(line: 294, column: 6, scope: !534)
!670 = !DILocation(line: 296, column: 20, scope: !534)
!671 = !DILocation(line: 296, column: 24, scope: !534)
!672 = !DILocation(line: 296, column: 44, scope: !534)
!673 = !DILocation(line: 296, column: 2, scope: !534)
!674 = !DILocation(line: 298, column: 30, scope: !534)
!675 = !DILocation(line: 298, column: 28, scope: !534)
!676 = !DILocation(line: 298, column: 7, scope: !534)
!677 = !DILocation(line: 302, column: 6, scope: !534)
!678 = !DILocation(line: 303, column: 7, scope: !534)
!679 = !DILocation(line: 304, column: 9, scope: !680)
!680 = distinct !DILexicalBlock(scope: !534, file: !3, line: 304, column: 2)
!681 = !DILocation(line: 304, column: 7, scope: !680)
!682 = !DILocation(line: 304, column: 14, scope: !683)
!683 = distinct !DILexicalBlock(scope: !680, file: !3, line: 304, column: 2)
!684 = !DILocation(line: 304, column: 19, scope: !683)
!685 = !DILocation(line: 304, column: 16, scope: !683)
!686 = !DILocation(line: 304, column: 2, scope: !680)
!687 = !DILocation(line: 306, column: 13, scope: !688)
!688 = distinct !DILexicalBlock(scope: !683, file: !3, line: 304, column: 29)
!689 = !DILocation(line: 306, column: 12, scope: !688)
!690 = !DILocation(line: 306, column: 24, scope: !688)
!691 = !DILocation(line: 306, column: 19, scope: !688)
!692 = !DILocation(line: 306, column: 17, scope: !688)
!693 = !DILocation(line: 306, column: 3, scope: !688)
!694 = !DILocation(line: 306, column: 10, scope: !688)
!695 = !DILocation(line: 307, column: 3, scope: !688)
!696 = !DILocation(line: 307, column: 10, scope: !688)
!697 = !DILocation(line: 308, column: 12, scope: !688)
!698 = !DILocation(line: 308, column: 23, scope: !688)
!699 = !DILocation(line: 308, column: 18, scope: !688)
!700 = !DILocation(line: 308, column: 16, scope: !688)
!701 = !DILocation(line: 308, column: 3, scope: !688)
!702 = !DILocation(line: 308, column: 10, scope: !688)
!703 = !DILocation(line: 309, column: 24, scope: !688)
!704 = !DILocation(line: 309, column: 28, scope: !688)
!705 = !DILocation(line: 309, column: 9, scope: !688)
!706 = !DILocation(line: 309, column: 7, scope: !688)
!707 = !DILocation(line: 310, column: 3, scope: !688)
!708 = !DILocation(line: 312, column: 7, scope: !709)
!709 = distinct !DILexicalBlock(scope: !688, file: !3, line: 312, column: 7)
!710 = !DILocation(line: 312, column: 9, scope: !709)
!711 = !DILocation(line: 312, column: 7, scope: !688)
!712 = !DILocation(line: 313, column: 23, scope: !713)
!713 = distinct !DILexicalBlock(scope: !709, file: !3, line: 312, column: 15)
!714 = !DILocation(line: 313, column: 27, scope: !713)
!715 = !DILocation(line: 313, column: 36, scope: !713)
!716 = !DILocation(line: 313, column: 8, scope: !713)
