; ModuleID = 'blender/source/blender/blenkernel/intern/sca.c'
source_filename = "blender/source/blender/blenkernel/intern/sca.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/sca.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 420, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "OB_POSX", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "OB_POSY", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "OB_POSZ", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "OB_NEGX", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "OB_NEGY", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "OB_NEGZ", value: 5, isUnsigned: true)
!13 = !{!14, !15, !16, !17, !56, !33}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "bSoundActuator", file: !19, line: 87, baseType: !20)
!19 = !DIFile(filename: "blender/source/blender/makesdna/DNA_actuator_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bSoundActuator", file: !19, line: 78, size: 576, elements: !21)
!21 = !{!22, !24, !25, !27, !28, !32, !34, !35, !38, !49, !50, !51, !52}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !20, file: !19, line: 79, baseType: !23, size: 16)
!23 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sndnr", scope: !20, file: !19, line: 79, baseType: !23, size: 16, offset: 16)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !20, file: !19, line: 80, baseType: !26, size: 32, offset: 32)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !20, file: !19, line: 80, baseType: !26, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !20, file: !19, line: 81, baseType: !29, size: 32, offset: 96)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 2)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !20, file: !19, line: 82, baseType: !33, size: 32, offset: 128)
!33 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !20, file: !19, line: 82, baseType: !33, size: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !20, file: !19, line: 83, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !19, line: 83, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sound3D", scope: !20, file: !19, line: 84, baseType: !39, size: 256, offset: 256)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sound3D", file: !19, line: 67, size: 256, elements: !40)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "min_gain", scope: !39, file: !19, line: 68, baseType: !33, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "max_gain", scope: !39, file: !19, line: 69, baseType: !33, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "reference_distance", scope: !39, file: !19, line: 70, baseType: !33, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "max_distance", scope: !39, file: !19, line: 71, baseType: !33, size: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rolloff_factor", scope: !39, file: !19, line: 72, baseType: !33, size: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cone_inner_angle", scope: !39, file: !19, line: 73, baseType: !33, size: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cone_outer_angle", scope: !39, file: !19, line: 74, baseType: !33, size: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "cone_outer_gain", scope: !39, file: !19, line: 75, baseType: !33, size: 32, offset: 224)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !19, line: 85, baseType: !23, size: 16, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !20, file: !19, line: 85, baseType: !23, size: 16, offset: 528)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !20, file: !19, line: 86, baseType: !23, size: 16, offset: 544)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !20, file: !19, line: 86, baseType: !53, size: 16, offset: 560)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 1)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !58, line: 130, baseType: !59)
!58 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !58, line: 117, size: 960, elements: !60)
!60 = !{!61, !62, !63, !65, !84, !88, !89, !90, !91, !92}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !58, line: 118, baseType: !14, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !58, line: 118, baseType: !14, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !59, file: !58, line: 119, baseType: !64, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !59, file: !58, line: 120, baseType: !66, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !58, line: 136, size: 17600, elements: !68)
!68 = !{!69, !70, !71, !74, !79, !80, !81}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !67, file: !58, line: 137, baseType: !57, size: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !67, file: !58, line: 138, baseType: !56, size: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !67, file: !58, line: 139, baseType: !72, size: 64, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !58, line: 43, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !58, line: 140, baseType: !75, size: 8192, offset: 1088)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8192, elements: !77)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !{!78}
!78 = !DISubrange(count: 1024)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !67, file: !58, line: 141, baseType: !75, size: 8192, offset: 9280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !67, file: !58, line: 148, baseType: !66, size: 64, offset: 17472)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !67, file: !58, line: 150, baseType: !82, size: 64, offset: 17536)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !58, line: 45, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !58, line: 121, baseType: !85, size: 528, offset: 256)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 528, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 66)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !58, line: 126, baseType: !23, size: 16, offset: 784)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !59, file: !58, line: 127, baseType: !26, size: 32, offset: 800)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !59, file: !58, line: 128, baseType: !26, size: 32, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !59, file: !58, line: 128, baseType: !26, size: 32, offset: 864)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !59, file: !58, line: 129, baseType: !93, size: 64, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !58, line: 75, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !58, line: 62, size: 1024, elements: !96)
!96 = !{!97, !99, !100, !101, !102, !103, !107, !108, !122, !123}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !58, line: 63, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !58, line: 63, baseType: !98, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !58, line: 64, baseType: !76, size: 8, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !95, file: !58, line: 64, baseType: !76, size: 8, offset: 136)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !95, file: !58, line: 65, baseType: !23, size: 16, offset: 144)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !58, line: 66, baseType: !104, size: 512, offset: 160)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !95, file: !58, line: 67, baseType: !26, size: 32, offset: 672)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !95, file: !58, line: 69, baseType: !109, size: 256, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !58, line: 60, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !58, line: 48, size: 256, elements: !111)
!111 = !{!112, !113, !120, !121}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !110, file: !58, line: 49, baseType: !14, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !110, file: !58, line: 58, baseType: !114, size: 128, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !115, line: 71, baseType: !116)
!115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !115, line: 69, size: 128, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !116, file: !115, line: 70, baseType: !14, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !116, file: !115, line: 70, baseType: !14, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !110, file: !58, line: 59, baseType: !26, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !110, file: !58, line: 59, baseType: !26, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !95, file: !58, line: 70, baseType: !26, size: 32, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !95, file: !58, line: 74, baseType: !26, size: 32, offset: 992)
!124 = !{i32 7, !"Dwarf Version", i32 4}
!125 = !{i32 2, !"Debug Info Version", i32 3}
!126 = !{i32 1, !"wchar_size", i32 4}
!127 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!128 = distinct !DISubprogram(name: "free_sensor", scope: !1, file: !1, line: 55, type: !129, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "bSensor", file: !133, line: 180, baseType: !134)
!133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sensor_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bSensor", file: !133, line: 163, size: 1024, elements: !135)
!135 = !{!136, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !480, !481, !482, !483, !484}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !133, line: 164, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !133, line: 164, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !133, line: 166, baseType: !23, size: 16, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "otype", scope: !134, file: !133, line: 166, baseType: !23, size: 16, offset: 144)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !133, line: 166, baseType: !23, size: 16, offset: 160)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pulse", scope: !134, file: !133, line: 166, baseType: !23, size: 16, offset: 176)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !134, file: !133, line: 167, baseType: !23, size: 16, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "totlinks", scope: !134, file: !133, line: 167, baseType: !23, size: 16, offset: 208)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !134, file: !133, line: 167, baseType: !23, size: 16, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !134, file: !133, line: 167, baseType: !23, size: 16, offset: 240)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !133, line: 168, baseType: !104, size: 512, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !133, line: 169, baseType: !14, size: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !134, file: !133, line: 171, baseType: !150, size: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bController", file: !153, line: 54, size: 1088, elements: !154)
!153 = !DIFile(filename: "blender/source/blender/makesdna/DNA_controller_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !475, !477, !478, !479}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !153, line: 55, baseType: !151, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !153, line: 55, baseType: !151, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mynew", scope: !152, file: !153, line: 55, baseType: !151, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !153, line: 56, baseType: !23, size: 16, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !152, file: !153, line: 56, baseType: !23, size: 16, offset: 208)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !152, file: !153, line: 56, baseType: !23, size: 16, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "totlinks", scope: !152, file: !153, line: 56, baseType: !23, size: 16, offset: 240)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "otype", scope: !152, file: !153, line: 57, baseType: !23, size: 16, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "totslinks", scope: !152, file: !153, line: 57, baseType: !23, size: 16, offset: 272)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !152, file: !153, line: 57, baseType: !23, size: 16, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !152, file: !153, line: 57, baseType: !23, size: 16, offset: 304)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !153, line: 59, baseType: !104, size: 512, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !153, line: 60, baseType: !14, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !152, file: !153, line: 62, baseType: !169, size: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActuator", file: !19, line: 262, size: 896, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !19, line: 263, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !19, line: 263, baseType: !170, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mynew", scope: !171, file: !19, line: 263, baseType: !170, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !19, line: 264, baseType: !23, size: 16, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !19, line: 268, baseType: !23, size: 16, offset: 208)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "otype", scope: !171, file: !19, line: 269, baseType: !23, size: 16, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "go", scope: !171, file: !19, line: 269, baseType: !23, size: 16, offset: 240)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !19, line: 270, baseType: !104, size: 512, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !19, line: 275, baseType: !14, size: 64, offset: 768)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !171, file: !19, line: 280, baseType: !183, size: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !4, line: 115, size: 11392, elements: !185)
!185 = !{!186, !187, !191, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !208, !219, !233, !234, !277, !278, !281, !282, !298, !299, !300, !301, !302, !303, !304, !308, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !324, !325, !326, !327, !328, !329, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !389, !390, !391, !392, !393, !394, !395, !396, !397, !400, !403, !406, !407, !408, !409, !410, !413, !416, !419, !420, !426, !427, !428, !429, !430, !431, !433, !436, !439, !441, !463, !464}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !184, file: !4, line: 116, baseType: !57, size: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !184, file: !4, line: 117, baseType: !188, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !190, line: 45, flags: DIFlagFwdDecl)
!190 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !184, file: !4, line: 119, baseType: !192, size: 64, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !4, line: 57, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !4, line: 121, baseType: !23, size: 16, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !184, file: !4, line: 121, baseType: !23, size: 16, offset: 1104)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !184, file: !4, line: 122, baseType: !26, size: 32, offset: 1120)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !184, file: !4, line: 122, baseType: !26, size: 32, offset: 1152)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !184, file: !4, line: 122, baseType: !26, size: 32, offset: 1184)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !184, file: !4, line: 123, baseType: !104, size: 512, offset: 1216)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !184, file: !4, line: 124, baseType: !183, size: 64, offset: 1728)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !184, file: !4, line: 124, baseType: !183, size: 64, offset: 1792)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !184, file: !4, line: 127, baseType: !183, size: 64, offset: 1856)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !184, file: !4, line: 127, baseType: !183, size: 64, offset: 1920)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !184, file: !4, line: 127, baseType: !183, size: 64, offset: 1984)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !184, file: !4, line: 128, baseType: !206, size: 64, offset: 2048)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !190, line: 46, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !184, file: !4, line: 130, baseType: !209, size: 64, offset: 2112)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !4, line: 97, size: 832, elements: !211)
!211 = !{!212, !217, !218}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !210, file: !4, line: 98, baseType: !213, size: 768)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 768, elements: !214)
!214 = !{!215, !216}
!215 = !DISubrange(count: 8)
!216 = !DISubrange(count: 3)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !210, file: !4, line: 99, baseType: !26, size: 32, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !210, file: !4, line: 99, baseType: !26, size: 32, offset: 800)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !184, file: !4, line: 131, baseType: !220, size: 64, offset: 2176)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !222, line: 486, size: 1600, elements: !223)
!222 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !221, file: !222, line: 487, baseType: !57, size: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !221, file: !222, line: 489, baseType: !114, size: 128, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !221, file: !222, line: 490, baseType: !114, size: 128, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !221, file: !222, line: 491, baseType: !114, size: 128, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !221, file: !222, line: 492, baseType: !114, size: 128, offset: 1344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !222, line: 494, baseType: !26, size: 32, offset: 1472)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !221, file: !222, line: 495, baseType: !26, size: 32, offset: 1504)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !221, file: !222, line: 497, baseType: !26, size: 32, offset: 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !221, file: !222, line: 498, baseType: !26, size: 32, offset: 1568)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !184, file: !4, line: 132, baseType: !220, size: 64, offset: 2240)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !184, file: !4, line: 133, baseType: !235, size: 64, offset: 2304)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !222, line: 334, size: 1728, elements: !237)
!237 = !{!238, !239, !242, !243, !244, !245, !246, !247, !250, !251, !252, !253, !254, !255, !256, !276}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !236, file: !222, line: 335, baseType: !114, size: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !236, file: !222, line: 336, baseType: !240, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !222, line: 47, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !222, line: 338, baseType: !23, size: 16, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !236, file: !222, line: 338, baseType: !23, size: 16, offset: 208)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !236, file: !222, line: 339, baseType: !5, size: 32, offset: 224)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !236, file: !222, line: 340, baseType: !26, size: 32, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !236, file: !222, line: 342, baseType: !33, size: 32, offset: 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !236, file: !222, line: 343, baseType: !248, size: 96, offset: 320)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 96, elements: !249)
!249 = !{!216}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !236, file: !222, line: 344, baseType: !248, size: 96, offset: 416)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !236, file: !222, line: 347, baseType: !114, size: 128, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !236, file: !222, line: 349, baseType: !26, size: 32, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !236, file: !222, line: 350, baseType: !26, size: 32, offset: 672)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !236, file: !222, line: 351, baseType: !14, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !236, file: !222, line: 352, baseType: !14, size: 64, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !236, file: !222, line: 354, baseType: !257, size: 384, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !222, line: 116, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !222, line: 94, size: 384, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !258, file: !222, line: 96, baseType: !26, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !258, file: !222, line: 96, baseType: !26, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !258, file: !222, line: 97, baseType: !26, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !258, file: !222, line: 97, baseType: !26, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !258, file: !222, line: 99, baseType: !23, size: 16, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !258, file: !222, line: 100, baseType: !23, size: 16, offset: 144)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !258, file: !222, line: 102, baseType: !23, size: 16, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !258, file: !222, line: 105, baseType: !23, size: 16, offset: 176)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !258, file: !222, line: 108, baseType: !23, size: 16, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !258, file: !222, line: 109, baseType: !23, size: 16, offset: 208)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !258, file: !222, line: 111, baseType: !23, size: 16, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !258, file: !222, line: 112, baseType: !23, size: 16, offset: 240)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !258, file: !222, line: 114, baseType: !26, size: 32, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !258, file: !222, line: 114, baseType: !26, size: 32, offset: 288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !258, file: !222, line: 115, baseType: !26, size: 32, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !258, file: !222, line: 115, baseType: !26, size: 32, offset: 352)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !236, file: !222, line: 355, baseType: !104, size: 512, offset: 1216)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !4, line: 134, baseType: !14, size: 64, offset: 2368)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !184, file: !4, line: 136, baseType: !279, size: 64, offset: 2432)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 58, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !184, file: !4, line: 138, baseType: !257, size: 384, offset: 2496)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !184, file: !4, line: 139, baseType: !283, size: 64, offset: 2880)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !222, line: 80, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !222, line: 72, size: 192, elements: !286)
!286 = !{!287, !294, !295, !296, !297}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !285, file: !222, line: 73, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !222, line: 59, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !222, line: 56, size: 128, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !290, file: !222, line: 57, baseType: !248, size: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !290, file: !222, line: 58, baseType: !26, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !285, file: !222, line: 74, baseType: !26, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !285, file: !222, line: 76, baseType: !26, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !285, file: !222, line: 77, baseType: !26, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !222, line: 79, baseType: !26, size: 32, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !184, file: !4, line: 141, baseType: !114, size: 128, offset: 2944)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !184, file: !4, line: 142, baseType: !114, size: 128, offset: 3072)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !184, file: !4, line: 143, baseType: !114, size: 128, offset: 3200)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !184, file: !4, line: 144, baseType: !114, size: 128, offset: 3328)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !184, file: !4, line: 146, baseType: !26, size: 32, offset: 3456)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !184, file: !4, line: 147, baseType: !26, size: 32, offset: 3488)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !184, file: !4, line: 150, baseType: !305, size: 64, offset: 3520)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !133, line: 40, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !184, file: !4, line: 151, baseType: !309, size: 64, offset: 3584)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !184, file: !4, line: 152, baseType: !26, size: 32, offset: 3648)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !184, file: !4, line: 153, baseType: !26, size: 32, offset: 3680)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !184, file: !4, line: 156, baseType: !248, size: 96, offset: 3712)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !184, file: !4, line: 156, baseType: !248, size: 96, offset: 3808)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !184, file: !4, line: 156, baseType: !248, size: 96, offset: 3904)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !184, file: !4, line: 157, baseType: !248, size: 96, offset: 4000)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !184, file: !4, line: 158, baseType: !248, size: 96, offset: 4096)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !184, file: !4, line: 159, baseType: !248, size: 96, offset: 4192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !184, file: !4, line: 160, baseType: !248, size: 96, offset: 4288)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !184, file: !4, line: 160, baseType: !248, size: 96, offset: 4384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !184, file: !4, line: 161, baseType: !321, size: 128, offset: 4480)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 4)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !184, file: !4, line: 161, baseType: !321, size: 128, offset: 4608)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !184, file: !4, line: 162, baseType: !248, size: 96, offset: 4736)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !184, file: !4, line: 162, baseType: !248, size: 96, offset: 4832)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !184, file: !4, line: 163, baseType: !33, size: 32, offset: 4928)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !184, file: !4, line: 163, baseType: !33, size: 32, offset: 4960)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !184, file: !4, line: 164, baseType: !330, size: 512, offset: 4992)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !331)
!331 = !{!323, !323}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !184, file: !4, line: 165, baseType: !330, size: 512, offset: 5504)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !184, file: !4, line: 166, baseType: !330, size: 512, offset: 6016)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !184, file: !4, line: 167, baseType: !330, size: 512, offset: 6528)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !184, file: !4, line: 176, baseType: !330, size: 512, offset: 7040)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !184, file: !4, line: 178, baseType: !5, size: 32, offset: 7552)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !184, file: !4, line: 180, baseType: !23, size: 16, offset: 7584)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !184, file: !4, line: 181, baseType: !23, size: 16, offset: 7600)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !184, file: !4, line: 183, baseType: !23, size: 16, offset: 7616)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !184, file: !4, line: 183, baseType: !23, size: 16, offset: 7632)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !184, file: !4, line: 184, baseType: !23, size: 16, offset: 7648)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !184, file: !4, line: 184, baseType: !23, size: 16, offset: 7664)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !184, file: !4, line: 185, baseType: !23, size: 16, offset: 7680)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !184, file: !4, line: 186, baseType: !23, size: 16, offset: 7696)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !184, file: !4, line: 187, baseType: !23, size: 16, offset: 7712)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !184, file: !4, line: 188, baseType: !76, size: 8, offset: 7728)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !184, file: !4, line: 189, baseType: !76, size: 8, offset: 7736)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !184, file: !4, line: 192, baseType: !26, size: 32, offset: 7744)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !184, file: !4, line: 192, baseType: !26, size: 32, offset: 7776)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !184, file: !4, line: 192, baseType: !26, size: 32, offset: 7808)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !184, file: !4, line: 192, baseType: !26, size: 32, offset: 7840)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !184, file: !4, line: 194, baseType: !26, size: 32, offset: 7872)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !184, file: !4, line: 202, baseType: !33, size: 32, offset: 7904)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !184, file: !4, line: 202, baseType: !33, size: 32, offset: 7936)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !184, file: !4, line: 202, baseType: !33, size: 32, offset: 7968)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !184, file: !4, line: 211, baseType: !33, size: 32, offset: 8000)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !184, file: !4, line: 212, baseType: !33, size: 32, offset: 8032)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !184, file: !4, line: 213, baseType: !33, size: 32, offset: 8064)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !184, file: !4, line: 214, baseType: !33, size: 32, offset: 8096)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !184, file: !4, line: 215, baseType: !33, size: 32, offset: 8128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !184, file: !4, line: 216, baseType: !33, size: 32, offset: 8160)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !184, file: !4, line: 219, baseType: !33, size: 32, offset: 8192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !184, file: !4, line: 220, baseType: !33, size: 32, offset: 8224)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !184, file: !4, line: 221, baseType: !33, size: 32, offset: 8256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !184, file: !4, line: 224, baseType: !366, size: 16, offset: 8288)
!366 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !184, file: !4, line: 224, baseType: !366, size: 16, offset: 8304)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !184, file: !4, line: 226, baseType: !23, size: 16, offset: 8320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !184, file: !4, line: 228, baseType: !76, size: 8, offset: 8336)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !184, file: !4, line: 229, baseType: !76, size: 8, offset: 8344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !184, file: !4, line: 231, baseType: !23, size: 16, offset: 8352)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !184, file: !4, line: 232, baseType: !76, size: 8, offset: 8368)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !184, file: !4, line: 233, baseType: !76, size: 8, offset: 8376)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !184, file: !4, line: 234, baseType: !33, size: 32, offset: 8384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !184, file: !4, line: 235, baseType: !33, size: 32, offset: 8416)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !184, file: !4, line: 237, baseType: !114, size: 128, offset: 8448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !184, file: !4, line: 238, baseType: !114, size: 128, offset: 8576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !184, file: !4, line: 239, baseType: !114, size: 128, offset: 8704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !184, file: !4, line: 240, baseType: !114, size: 128, offset: 8832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !184, file: !4, line: 242, baseType: !33, size: 32, offset: 8960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !184, file: !4, line: 244, baseType: !23, size: 16, offset: 8992)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !184, file: !4, line: 245, baseType: !366, size: 16, offset: 9008)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !184, file: !4, line: 246, baseType: !321, size: 128, offset: 9024)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !184, file: !4, line: 248, baseType: !26, size: 32, offset: 9152)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !184, file: !4, line: 249, baseType: !26, size: 32, offset: 9184)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !184, file: !4, line: 251, baseType: !387, size: 64, offset: 9216)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !4, line: 251, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !184, file: !4, line: 253, baseType: !76, size: 8, offset: 9280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !184, file: !4, line: 254, baseType: !76, size: 8, offset: 9288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !184, file: !4, line: 255, baseType: !23, size: 16, offset: 9296)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !184, file: !4, line: 256, baseType: !248, size: 96, offset: 9312)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !184, file: !4, line: 258, baseType: !114, size: 128, offset: 9408)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !184, file: !4, line: 259, baseType: !114, size: 128, offset: 9536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !184, file: !4, line: 260, baseType: !114, size: 128, offset: 9664)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !184, file: !4, line: 261, baseType: !114, size: 128, offset: 9792)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !184, file: !4, line: 263, baseType: !398, size: 64, offset: 9920)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !4, line: 52, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !184, file: !4, line: 264, baseType: !401, size: 64, offset: 9984)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !4, line: 53, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !184, file: !4, line: 265, baseType: !404, size: 64, offset: 10048)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !19, line: 40, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !184, file: !4, line: 267, baseType: !76, size: 8, offset: 10112)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !184, file: !4, line: 268, baseType: !76, size: 8, offset: 10120)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !184, file: !4, line: 269, baseType: !23, size: 16, offset: 10128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !184, file: !4, line: 270, baseType: !33, size: 32, offset: 10144)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !184, file: !4, line: 272, baseType: !411, size: 64, offset: 10176)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !4, line: 54, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !184, file: !4, line: 275, baseType: !414, size: 64, offset: 10240)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !4, line: 275, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !184, file: !4, line: 277, baseType: !417, size: 64, offset: 10304)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 56, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !184, file: !4, line: 277, baseType: !417, size: 64, offset: 10368)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !184, file: !4, line: 278, baseType: !421, size: 64, offset: 10432)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !422, line: 27, baseType: !423)
!422 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !424, line: 45, baseType: !425)
!424 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!425 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !184, file: !4, line: 279, baseType: !421, size: 64, offset: 10496)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !184, file: !4, line: 280, baseType: !5, size: 32, offset: 10560)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !184, file: !4, line: 281, baseType: !5, size: 32, offset: 10592)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !184, file: !4, line: 283, baseType: !114, size: 128, offset: 10624)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !184, file: !4, line: 284, baseType: !114, size: 128, offset: 10752)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !184, file: !4, line: 285, baseType: !432, size: 64, offset: 10880)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !184, file: !4, line: 287, baseType: !434, size: 64, offset: 10944)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !4, line: 59, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !184, file: !4, line: 288, baseType: !437, size: 64, offset: 11008)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !4, line: 288, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !184, file: !4, line: 290, baseType: !440, size: 64, offset: 11072)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !30)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !184, file: !4, line: 291, baseType: !442, size: 64, offset: 11136)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !444, line: 65, baseType: !445)
!444 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !444, line: 50, size: 320, elements: !446)
!446 = !{!447, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !445, file: !444, line: 51, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !19, line: 39, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !445, file: !444, line: 53, baseType: !26, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !445, file: !444, line: 54, baseType: !26, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !445, file: !444, line: 55, baseType: !26, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !445, file: !444, line: 55, baseType: !26, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !445, file: !444, line: 56, baseType: !76, size: 8, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !445, file: !444, line: 56, baseType: !76, size: 8, offset: 200)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !445, file: !444, line: 57, baseType: !76, size: 8, offset: 208)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !445, file: !444, line: 57, baseType: !76, size: 8, offset: 216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !445, file: !444, line: 59, baseType: !23, size: 16, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !445, file: !444, line: 59, baseType: !23, size: 16, offset: 240)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !445, file: !444, line: 59, baseType: !23, size: 16, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !444, line: 61, baseType: !23, size: 16, offset: 272)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !445, file: !444, line: 63, baseType: !26, size: 32, offset: 288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !184, file: !4, line: 293, baseType: !114, size: 128, offset: 11200)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !184, file: !4, line: 294, baseType: !465, size: 64, offset: 11328)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !4, line: 113, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !4, line: 108, size: 256, elements: !468)
!468 = !{!469, !471, !472, !473, !474}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !467, file: !4, line: 109, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !467, file: !4, line: 109, baseType: !470, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !467, file: !4, line: 110, baseType: !183, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !467, file: !4, line: 111, baseType: !26, size: 32, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !467, file: !4, line: 112, baseType: !33, size: 32, offset: 224)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "slinks", scope: !152, file: !153, line: 64, baseType: !476, size: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !152, file: !153, line: 65, baseType: !23, size: 16, offset: 1024)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "valo", scope: !152, file: !153, line: 65, baseType: !23, size: 16, offset: 1040)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "state_mask", scope: !152, file: !153, line: 66, baseType: !5, size: 32, offset: 1056)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !134, file: !133, line: 173, baseType: !183, size: 64, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !134, file: !133, line: 176, baseType: !23, size: 16, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !134, file: !133, line: 177, baseType: !23, size: 16, offset: 976)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tap", scope: !134, file: !133, line: 178, baseType: !23, size: 16, offset: 992)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !134, file: !133, line: 179, baseType: !23, size: 16, offset: 1008)
!485 = !{}
!486 = !DILocalVariable(name: "sens", arg: 1, scope: !128, file: !1, line: 55, type: !131)
!487 = !DILocation(line: 55, column: 27, scope: !128)
!488 = !DILocation(line: 57, column: 6, scope: !489)
!489 = distinct !DILexicalBlock(scope: !128, file: !1, line: 57, column: 6)
!490 = !DILocation(line: 57, column: 12, scope: !489)
!491 = !DILocation(line: 57, column: 6, scope: !128)
!492 = !DILocation(line: 57, column: 19, scope: !489)
!493 = !DILocation(line: 57, column: 29, scope: !489)
!494 = !DILocation(line: 57, column: 35, scope: !489)
!495 = !DILocation(line: 58, column: 6, scope: !496)
!496 = distinct !DILexicalBlock(scope: !128, file: !1, line: 58, column: 6)
!497 = !DILocation(line: 58, column: 12, scope: !496)
!498 = !DILocation(line: 58, column: 6, scope: !128)
!499 = !DILocation(line: 58, column: 18, scope: !496)
!500 = !DILocation(line: 58, column: 28, scope: !496)
!501 = !DILocation(line: 58, column: 34, scope: !496)
!502 = !DILocation(line: 59, column: 2, scope: !128)
!503 = !DILocation(line: 59, column: 12, scope: !128)
!504 = !DILocation(line: 61, column: 1, scope: !128)
!505 = distinct !DISubprogram(name: "free_sensors", scope: !1, file: !1, line: 63, type: !506, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !432}
!508 = !DILocalVariable(name: "lb", arg: 1, scope: !505, file: !1, line: 63, type: !432)
!509 = !DILocation(line: 63, column: 29, scope: !505)
!510 = !DILocalVariable(name: "sens", scope: !505, file: !1, line: 65, type: !131)
!511 = !DILocation(line: 65, column: 11, scope: !505)
!512 = !DILocation(line: 67, column: 2, scope: !505)
!513 = !DILocation(line: 67, column: 29, scope: !505)
!514 = !DILocation(line: 67, column: 17, scope: !505)
!515 = !DILocation(line: 67, column: 15, scope: !505)
!516 = !DILocation(line: 68, column: 15, scope: !517)
!517 = distinct !DILexicalBlock(scope: !505, file: !1, line: 67, column: 35)
!518 = !DILocation(line: 68, column: 3, scope: !517)
!519 = distinct !{!519, !512, !520}
!520 = !DILocation(line: 69, column: 2, scope: !505)
!521 = !DILocation(line: 70, column: 1, scope: !505)
!522 = distinct !DISubprogram(name: "copy_sensor", scope: !1, file: !1, line: 72, type: !523, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!523 = !DISubroutineType(types: !524)
!524 = !{!137, !131}
!525 = !DILocalVariable(name: "sens", arg: 1, scope: !522, file: !1, line: 72, type: !131)
!526 = !DILocation(line: 72, column: 31, scope: !522)
!527 = !DILocalVariable(name: "sensn", scope: !522, file: !1, line: 74, type: !131)
!528 = !DILocation(line: 74, column: 11, scope: !522)
!529 = !DILocation(line: 76, column: 9, scope: !522)
!530 = !DILocation(line: 76, column: 23, scope: !522)
!531 = !DILocation(line: 76, column: 7, scope: !522)
!532 = !DILocation(line: 77, column: 2, scope: !522)
!533 = !DILocation(line: 77, column: 9, scope: !522)
!534 = !DILocation(line: 77, column: 14, scope: !522)
!535 = !DILocation(line: 78, column: 6, scope: !536)
!536 = distinct !DILexicalBlock(scope: !522, file: !1, line: 78, column: 6)
!537 = !DILocation(line: 78, column: 12, scope: !536)
!538 = !DILocation(line: 78, column: 6, scope: !522)
!539 = !DILocation(line: 79, column: 16, scope: !540)
!540 = distinct !DILexicalBlock(scope: !536, file: !1, line: 78, column: 18)
!541 = !DILocation(line: 79, column: 30, scope: !540)
!542 = !DILocation(line: 79, column: 36, scope: !540)
!543 = !DILocation(line: 79, column: 3, scope: !540)
!544 = !DILocation(line: 79, column: 10, scope: !540)
!545 = !DILocation(line: 79, column: 14, scope: !540)
!546 = !DILocation(line: 80, column: 2, scope: !540)
!547 = !DILocation(line: 82, column: 6, scope: !548)
!548 = distinct !DILexicalBlock(scope: !522, file: !1, line: 82, column: 6)
!549 = !DILocation(line: 82, column: 12, scope: !548)
!550 = !DILocation(line: 82, column: 6, scope: !522)
!551 = !DILocation(line: 82, column: 33, scope: !548)
!552 = !DILocation(line: 82, column: 47, scope: !548)
!553 = !DILocation(line: 82, column: 53, scope: !548)
!554 = !DILocation(line: 82, column: 19, scope: !548)
!555 = !DILocation(line: 82, column: 26, scope: !548)
!556 = !DILocation(line: 82, column: 31, scope: !548)
!557 = !DILocation(line: 84, column: 9, scope: !522)
!558 = !DILocation(line: 84, column: 2, scope: !522)
!559 = distinct !DISubprogram(name: "copy_sensors", scope: !1, file: !1, line: 87, type: !560, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !432, !432}
!562 = !DILocalVariable(name: "lbn", arg: 1, scope: !559, file: !1, line: 87, type: !432)
!563 = !DILocation(line: 87, column: 29, scope: !559)
!564 = !DILocalVariable(name: "lbo", arg: 2, scope: !559, file: !1, line: 87, type: !432)
!565 = !DILocation(line: 87, column: 44, scope: !559)
!566 = !DILocalVariable(name: "sens", scope: !559, file: !1, line: 89, type: !131)
!567 = !DILocation(line: 89, column: 11, scope: !559)
!568 = !DILocalVariable(name: "sensn", scope: !559, file: !1, line: 89, type: !131)
!569 = !DILocation(line: 89, column: 18, scope: !559)
!570 = !DILocation(line: 91, column: 14, scope: !559)
!571 = !DILocation(line: 91, column: 19, scope: !559)
!572 = !DILocation(line: 91, column: 23, scope: !559)
!573 = !DILocation(line: 91, column: 2, scope: !559)
!574 = !DILocation(line: 91, column: 7, scope: !559)
!575 = !DILocation(line: 91, column: 12, scope: !559)
!576 = !DILocation(line: 92, column: 8, scope: !559)
!577 = !DILocation(line: 92, column: 13, scope: !559)
!578 = !DILocation(line: 92, column: 6, scope: !559)
!579 = !DILocation(line: 93, column: 2, scope: !559)
!580 = !DILocation(line: 93, column: 9, scope: !559)
!581 = !DILocation(line: 94, column: 22, scope: !582)
!582 = distinct !DILexicalBlock(scope: !559, file: !1, line: 93, column: 15)
!583 = !DILocation(line: 94, column: 10, scope: !582)
!584 = !DILocation(line: 94, column: 8, scope: !582)
!585 = !DILocation(line: 95, column: 15, scope: !582)
!586 = !DILocation(line: 95, column: 20, scope: !582)
!587 = !DILocation(line: 95, column: 3, scope: !582)
!588 = !DILocation(line: 96, column: 9, scope: !582)
!589 = !DILocation(line: 96, column: 15, scope: !582)
!590 = !DILocation(line: 96, column: 7, scope: !582)
!591 = distinct !{!591, !579, !592}
!592 = !DILocation(line: 97, column: 2, scope: !559)
!593 = !DILocation(line: 98, column: 1, scope: !559)
!594 = distinct !DISubprogram(name: "init_sensor", scope: !1, file: !1, line: 100, type: !129, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!595 = !DILocalVariable(name: "sens", arg: 1, scope: !594, file: !1, line: 100, type: !131)
!596 = !DILocation(line: 100, column: 27, scope: !594)
!597 = !DILocalVariable(name: "ns", scope: !594, file: !1, line: 103, type: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNearSensor", file: !133, line: 48, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNearSensor", file: !133, line: 44, size: 640, elements: !601)
!601 = !{!602, !603, !604, !605, !606}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !133, line: 45, baseType: !104, size: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !600, file: !133, line: 46, baseType: !33, size: 32, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "resetdist", scope: !600, file: !133, line: 46, baseType: !33, size: 32, offset: 544)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lastval", scope: !600, file: !133, line: 47, baseType: !26, size: 32, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !600, file: !133, line: 47, baseType: !26, size: 32, offset: 608)
!607 = !DILocation(line: 103, column: 15, scope: !594)
!608 = !DILocalVariable(name: "ms", scope: !594, file: !1, line: 104, type: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMouseSensor", file: !133, line: 63, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMouseSensor", file: !133, line: 53, size: 1088, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !611, file: !133, line: 57, baseType: !23, size: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !611, file: !133, line: 58, baseType: !23, size: 16, offset: 16)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !611, file: !133, line: 59, baseType: !23, size: 16, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !611, file: !133, line: 60, baseType: !23, size: 16, offset: 48)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "propname", scope: !611, file: !133, line: 61, baseType: !104, size: 512, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "matname", scope: !611, file: !133, line: 62, baseType: !104, size: 512, offset: 576)
!619 = !DILocation(line: 104, column: 16, scope: !594)
!620 = !DILocalVariable(name: "js", scope: !594, file: !1, line: 105, type: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "bJoystickSensor", file: !133, line: 194, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bJoystickSensor", file: !133, line: 182, size: 736, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !133, line: 183, baseType: !104, size: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !623, file: !133, line: 184, baseType: !76, size: 8, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "joyindex", scope: !623, file: !133, line: 185, baseType: !76, size: 8, offset: 520)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !623, file: !133, line: 186, baseType: !23, size: 16, offset: 528)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !623, file: !133, line: 187, baseType: !23, size: 16, offset: 544)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "axis_single", scope: !623, file: !133, line: 188, baseType: !23, size: 16, offset: 560)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "axisf", scope: !623, file: !133, line: 189, baseType: !26, size: 32, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !623, file: !133, line: 190, baseType: !26, size: 32, offset: 608)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "hat", scope: !623, file: !133, line: 191, baseType: !26, size: 32, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "hatf", scope: !623, file: !133, line: 192, baseType: !26, size: 32, offset: 672)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !623, file: !133, line: 193, baseType: !26, size: 32, offset: 704)
!636 = !DILocation(line: 105, column: 19, scope: !594)
!637 = !DILocalVariable(name: "rs", scope: !594, file: !1, line: 106, type: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "bRaySensor", file: !133, line: 137, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bRaySensor", file: !133, line: 128, size: 1632, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !640, file: !133, line: 129, baseType: !104, size: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !640, file: !133, line: 130, baseType: !33, size: 32, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "propname", scope: !640, file: !133, line: 131, baseType: !104, size: 512, offset: 544)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "matname", scope: !640, file: !133, line: 132, baseType: !104, size: 512, offset: 1056)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !640, file: !133, line: 134, baseType: !23, size: 16, offset: 1568)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !640, file: !133, line: 135, baseType: !23, size: 16, offset: 1584)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "axisflag", scope: !640, file: !133, line: 136, baseType: !26, size: 32, offset: 1600)
!649 = !DILocation(line: 106, column: 14, scope: !594)
!650 = !DILocation(line: 108, column: 6, scope: !651)
!651 = distinct !DILexicalBlock(scope: !594, file: !1, line: 108, column: 6)
!652 = !DILocation(line: 108, column: 12, scope: !651)
!653 = !DILocation(line: 108, column: 6, scope: !594)
!654 = !DILocation(line: 108, column: 18, scope: !651)
!655 = !DILocation(line: 108, column: 28, scope: !651)
!656 = !DILocation(line: 108, column: 34, scope: !651)
!657 = !DILocation(line: 109, column: 2, scope: !594)
!658 = !DILocation(line: 109, column: 8, scope: !594)
!659 = !DILocation(line: 109, column: 12, scope: !594)
!660 = !DILocation(line: 110, column: 2, scope: !594)
!661 = !DILocation(line: 110, column: 8, scope: !594)
!662 = !DILocation(line: 110, column: 14, scope: !594)
!663 = !DILocation(line: 112, column: 10, scope: !594)
!664 = !DILocation(line: 112, column: 16, scope: !594)
!665 = !DILocation(line: 112, column: 2, scope: !594)
!666 = !DILocation(line: 114, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !594, file: !1, line: 112, column: 22)
!668 = !DILocation(line: 114, column: 9, scope: !667)
!669 = !DILocation(line: 114, column: 15, scope: !667)
!670 = !DILocation(line: 115, column: 3, scope: !667)
!671 = !DILocation(line: 117, column: 18, scope: !667)
!672 = !DILocation(line: 117, column: 6, scope: !667)
!673 = !DILocation(line: 117, column: 12, scope: !667)
!674 = !DILocation(line: 117, column: 16, scope: !667)
!675 = !DILocation(line: 117, column: 5, scope: !667)
!676 = !DILocation(line: 118, column: 3, scope: !667)
!677 = !DILocation(line: 118, column: 7, scope: !667)
!678 = !DILocation(line: 118, column: 11, scope: !667)
!679 = !DILocation(line: 119, column: 3, scope: !667)
!680 = !DILocation(line: 119, column: 7, scope: !667)
!681 = !DILocation(line: 119, column: 16, scope: !667)
!682 = !DILocation(line: 120, column: 3, scope: !667)
!683 = !DILocation(line: 122, column: 15, scope: !667)
!684 = !DILocation(line: 122, column: 3, scope: !667)
!685 = !DILocation(line: 122, column: 9, scope: !667)
!686 = !DILocation(line: 122, column: 13, scope: !667)
!687 = !DILocation(line: 123, column: 3, scope: !667)
!688 = !DILocation(line: 125, column: 15, scope: !667)
!689 = !DILocation(line: 125, column: 3, scope: !667)
!690 = !DILocation(line: 125, column: 9, scope: !667)
!691 = !DILocation(line: 125, column: 13, scope: !667)
!692 = !DILocation(line: 126, column: 3, scope: !667)
!693 = !DILocation(line: 128, column: 15, scope: !667)
!694 = !DILocation(line: 128, column: 3, scope: !667)
!695 = !DILocation(line: 128, column: 9, scope: !667)
!696 = !DILocation(line: 128, column: 13, scope: !667)
!697 = !DILocation(line: 129, column: 3, scope: !667)
!698 = !DILocation(line: 131, column: 15, scope: !667)
!699 = !DILocation(line: 131, column: 3, scope: !667)
!700 = !DILocation(line: 131, column: 9, scope: !667)
!701 = !DILocation(line: 131, column: 13, scope: !667)
!702 = !DILocation(line: 132, column: 3, scope: !667)
!703 = !DILocation(line: 134, column: 15, scope: !667)
!704 = !DILocation(line: 134, column: 3, scope: !667)
!705 = !DILocation(line: 134, column: 9, scope: !667)
!706 = !DILocation(line: 134, column: 13, scope: !667)
!707 = !DILocation(line: 135, column: 3, scope: !667)
!708 = !DILocation(line: 137, column: 18, scope: !667)
!709 = !DILocation(line: 137, column: 6, scope: !667)
!710 = !DILocation(line: 137, column: 12, scope: !667)
!711 = !DILocation(line: 137, column: 16, scope: !667)
!712 = !DILocation(line: 137, column: 5, scope: !667)
!713 = !DILocation(line: 138, column: 3, scope: !667)
!714 = !DILocation(line: 138, column: 7, scope: !667)
!715 = !DILocation(line: 138, column: 11, scope: !667)
!716 = !DILocation(line: 139, column: 3, scope: !667)
!717 = !DILocation(line: 141, column: 15, scope: !667)
!718 = !DILocation(line: 141, column: 3, scope: !667)
!719 = !DILocation(line: 141, column: 9, scope: !667)
!720 = !DILocation(line: 141, column: 13, scope: !667)
!721 = !DILocation(line: 142, column: 3, scope: !667)
!722 = !DILocation(line: 144, column: 15, scope: !667)
!723 = !DILocation(line: 144, column: 3, scope: !667)
!724 = !DILocation(line: 144, column: 9, scope: !667)
!725 = !DILocation(line: 144, column: 13, scope: !667)
!726 = !DILocation(line: 145, column: 3, scope: !667)
!727 = !DILocation(line: 147, column: 15, scope: !667)
!728 = !DILocation(line: 147, column: 3, scope: !667)
!729 = !DILocation(line: 147, column: 9, scope: !667)
!730 = !DILocation(line: 147, column: 13, scope: !667)
!731 = !DILocation(line: 148, column: 3, scope: !667)
!732 = !DILocation(line: 150, column: 15, scope: !667)
!733 = !DILocation(line: 150, column: 3, scope: !667)
!734 = !DILocation(line: 150, column: 9, scope: !667)
!735 = !DILocation(line: 150, column: 13, scope: !667)
!736 = !DILocation(line: 151, column: 8, scope: !667)
!737 = !DILocation(line: 151, column: 14, scope: !667)
!738 = !DILocation(line: 151, column: 6, scope: !667)
!739 = !DILocation(line: 152, column: 3, scope: !667)
!740 = !DILocation(line: 152, column: 7, scope: !667)
!741 = !DILocation(line: 152, column: 13, scope: !667)
!742 = !DILocation(line: 153, column: 3, scope: !667)
!743 = !DILocation(line: 155, column: 15, scope: !667)
!744 = !DILocation(line: 155, column: 3, scope: !667)
!745 = !DILocation(line: 155, column: 9, scope: !667)
!746 = !DILocation(line: 155, column: 13, scope: !667)
!747 = !DILocation(line: 156, column: 3, scope: !667)
!748 = !DILocation(line: 158, column: 15, scope: !667)
!749 = !DILocation(line: 158, column: 3, scope: !667)
!750 = !DILocation(line: 158, column: 9, scope: !667)
!751 = !DILocation(line: 158, column: 13, scope: !667)
!752 = !DILocation(line: 159, column: 7, scope: !667)
!753 = !DILocation(line: 159, column: 13, scope: !667)
!754 = !DILocation(line: 159, column: 5, scope: !667)
!755 = !DILocation(line: 160, column: 3, scope: !667)
!756 = !DILocation(line: 160, column: 7, scope: !667)
!757 = !DILocation(line: 160, column: 12, scope: !667)
!758 = !DILocation(line: 161, column: 3, scope: !667)
!759 = !DILocation(line: 161, column: 7, scope: !667)
!760 = !DILocation(line: 161, column: 12, scope: !667)
!761 = !DILocation(line: 162, column: 3, scope: !667)
!762 = !DILocation(line: 162, column: 7, scope: !667)
!763 = !DILocation(line: 162, column: 11, scope: !667)
!764 = !DILocation(line: 163, column: 3, scope: !667)
!765 = !DILocation(line: 167, column: 2, scope: !667)
!766 = !DILocation(line: 168, column: 1, scope: !594)
!767 = distinct !DISubprogram(name: "new_sensor", scope: !1, file: !1, line: 170, type: !768, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!768 = !DISubroutineType(types: !769)
!769 = !{!137, !26}
!770 = !DILocalVariable(name: "type", arg: 1, scope: !767, file: !1, line: 170, type: !26)
!771 = !DILocation(line: 170, column: 25, scope: !767)
!772 = !DILocalVariable(name: "sens", scope: !767, file: !1, line: 172, type: !131)
!773 = !DILocation(line: 172, column: 11, scope: !767)
!774 = !DILocation(line: 174, column: 8, scope: !767)
!775 = !DILocation(line: 174, column: 6, scope: !767)
!776 = !DILocation(line: 175, column: 14, scope: !767)
!777 = !DILocation(line: 175, column: 2, scope: !767)
!778 = !DILocation(line: 175, column: 8, scope: !767)
!779 = !DILocation(line: 175, column: 12, scope: !767)
!780 = !DILocation(line: 176, column: 2, scope: !767)
!781 = !DILocation(line: 176, column: 8, scope: !767)
!782 = !DILocation(line: 176, column: 12, scope: !767)
!783 = !DILocation(line: 178, column: 14, scope: !767)
!784 = !DILocation(line: 178, column: 2, scope: !767)
!785 = !DILocation(line: 180, column: 9, scope: !767)
!786 = !DILocation(line: 180, column: 15, scope: !767)
!787 = !DILocation(line: 180, column: 2, scope: !767)
!788 = !DILocation(line: 183, column: 9, scope: !767)
!789 = !DILocation(line: 183, column: 2, scope: !767)
!790 = distinct !DISubprogram(name: "unlink_controller", scope: !1, file: !1, line: 188, type: !791, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "bController", file: !153, line: 68, baseType: !152)
!795 = !DILocalVariable(name: "cont", arg: 1, scope: !790, file: !1, line: 188, type: !793)
!796 = !DILocation(line: 188, column: 37, scope: !790)
!797 = !DILocalVariable(name: "sens", scope: !790, file: !1, line: 190, type: !131)
!798 = !DILocation(line: 190, column: 11, scope: !790)
!799 = !DILocalVariable(name: "ob", scope: !790, file: !1, line: 191, type: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !4, line: 295, baseType: !184)
!802 = !DILocation(line: 191, column: 10, scope: !790)
!803 = !DILocation(line: 194, column: 8, scope: !790)
!804 = !DILocation(line: 194, column: 14, scope: !790)
!805 = !DILocation(line: 194, column: 21, scope: !790)
!806 = !DILocation(line: 194, column: 6, scope: !790)
!807 = !DILocation(line: 194, column: 4, scope: !790)
!808 = !DILocation(line: 195, column: 2, scope: !790)
!809 = !DILocation(line: 195, column: 9, scope: !790)
!810 = !DILocation(line: 196, column: 9, scope: !811)
!811 = distinct !DILexicalBlock(scope: !790, file: !1, line: 195, column: 13)
!812 = !DILocation(line: 196, column: 13, scope: !811)
!813 = !DILocation(line: 196, column: 21, scope: !811)
!814 = !DILocation(line: 196, column: 7, scope: !811)
!815 = !DILocation(line: 197, column: 3, scope: !811)
!816 = !DILocation(line: 197, column: 10, scope: !811)
!817 = !DILocation(line: 198, column: 23, scope: !818)
!818 = distinct !DILexicalBlock(scope: !811, file: !1, line: 197, column: 16)
!819 = !DILocation(line: 198, column: 51, scope: !818)
!820 = !DILocation(line: 198, column: 57, scope: !818)
!821 = !DILocation(line: 198, column: 39, scope: !818)
!822 = !DILocation(line: 198, column: 66, scope: !818)
!823 = !DILocation(line: 198, column: 72, scope: !818)
!824 = !DILocation(line: 198, column: 4, scope: !818)
!825 = !DILocation(line: 199, column: 10, scope: !818)
!826 = !DILocation(line: 199, column: 16, scope: !818)
!827 = !DILocation(line: 199, column: 8, scope: !818)
!828 = distinct !{!828, !815, !829}
!829 = !DILocation(line: 200, column: 3, scope: !811)
!830 = !DILocation(line: 201, column: 7, scope: !811)
!831 = !DILocation(line: 201, column: 11, scope: !811)
!832 = !DILocation(line: 201, column: 14, scope: !811)
!833 = !DILocation(line: 201, column: 5, scope: !811)
!834 = distinct !{!834, !808, !835}
!835 = !DILocation(line: 202, column: 2, scope: !790)
!836 = !DILocation(line: 203, column: 1, scope: !790)
!837 = distinct !DISubprogram(name: "unlink_logicbricks", scope: !1, file: !1, line: 868, type: !838, scopeLine: 869, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !15, !16, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!841 = !DILocalVariable(name: "poin", arg: 1, scope: !837, file: !1, line: 868, type: !15)
!842 = !DILocation(line: 868, column: 32, scope: !837)
!843 = !DILocalVariable(name: "ppoin", arg: 2, scope: !837, file: !1, line: 868, type: !16)
!844 = !DILocation(line: 868, column: 46, scope: !837)
!845 = !DILocalVariable(name: "tot", arg: 3, scope: !837, file: !1, line: 868, type: !840)
!846 = !DILocation(line: 868, column: 60, scope: !837)
!847 = !DILocalVariable(name: "ibrick", scope: !837, file: !1, line: 870, type: !26)
!848 = !DILocation(line: 870, column: 6, scope: !837)
!849 = !DILocalVariable(name: "removed", scope: !837, file: !1, line: 870, type: !26)
!850 = !DILocation(line: 870, column: 14, scope: !837)
!851 = !DILocation(line: 872, column: 9, scope: !837)
!852 = !DILocation(line: 873, column: 13, scope: !853)
!853 = distinct !DILexicalBlock(scope: !837, file: !1, line: 873, column: 2)
!854 = !DILocation(line: 873, column: 7, scope: !853)
!855 = !DILocation(line: 873, column: 17, scope: !856)
!856 = distinct !DILexicalBlock(scope: !853, file: !1, line: 873, column: 2)
!857 = !DILocation(line: 873, column: 27, scope: !856)
!858 = !DILocation(line: 873, column: 26, scope: !856)
!859 = !DILocation(line: 873, column: 24, scope: !856)
!860 = !DILocation(line: 873, column: 2, scope: !853)
!861 = !DILocation(line: 874, column: 7, scope: !862)
!862 = distinct !DILexicalBlock(scope: !863, file: !1, line: 874, column: 7)
!863 = distinct !DILexicalBlock(scope: !856, file: !1, line: 873, column: 42)
!864 = !DILocation(line: 874, column: 7, scope: !863)
!865 = !DILocation(line: 874, column: 47, scope: !862)
!866 = !DILocation(line: 874, column: 46, scope: !862)
!867 = !DILocation(line: 874, column: 54, scope: !862)
!868 = !DILocation(line: 874, column: 45, scope: !862)
!869 = !DILocation(line: 874, column: 18, scope: !862)
!870 = !DILocation(line: 874, column: 17, scope: !862)
!871 = !DILocation(line: 874, column: 25, scope: !862)
!872 = !DILocation(line: 874, column: 34, scope: !862)
!873 = !DILocation(line: 874, column: 32, scope: !862)
!874 = !DILocation(line: 874, column: 16, scope: !862)
!875 = !DILocation(line: 874, column: 43, scope: !862)
!876 = !DILocation(line: 875, column: 14, scope: !877)
!877 = distinct !DILexicalBlock(scope: !862, file: !1, line: 875, column: 12)
!878 = !DILocation(line: 875, column: 13, scope: !877)
!879 = !DILocation(line: 875, column: 21, scope: !877)
!880 = !DILocation(line: 875, column: 12, scope: !877)
!881 = !DILocation(line: 875, column: 33, scope: !877)
!882 = !DILocation(line: 875, column: 32, scope: !877)
!883 = !DILocation(line: 875, column: 29, scope: !877)
!884 = !DILocation(line: 875, column: 12, scope: !862)
!885 = !DILocation(line: 875, column: 47, scope: !877)
!886 = !DILocation(line: 875, column: 39, scope: !877)
!887 = !DILocation(line: 876, column: 2, scope: !863)
!888 = !DILocation(line: 873, column: 38, scope: !856)
!889 = !DILocation(line: 873, column: 2, scope: !856)
!890 = distinct !{!890, !860, !891}
!891 = !DILocation(line: 876, column: 2, scope: !853)
!892 = !DILocation(line: 878, column: 6, scope: !893)
!893 = distinct !DILexicalBlock(scope: !837, file: !1, line: 878, column: 6)
!894 = !DILocation(line: 878, column: 6, scope: !837)
!895 = !DILocation(line: 879, column: 5, scope: !896)
!896 = distinct !DILexicalBlock(scope: !893, file: !1, line: 878, column: 15)
!897 = !DILocation(line: 879, column: 10, scope: !896)
!898 = !DILocation(line: 881, column: 8, scope: !899)
!899 = distinct !DILexicalBlock(scope: !896, file: !1, line: 881, column: 7)
!900 = !DILocation(line: 881, column: 7, scope: !899)
!901 = !DILocation(line: 881, column: 12, scope: !899)
!902 = !DILocation(line: 881, column: 7, scope: !896)
!903 = !DILocation(line: 882, column: 4, scope: !904)
!904 = distinct !DILexicalBlock(scope: !899, file: !1, line: 881, column: 18)
!905 = !DILocation(line: 882, column: 15, scope: !904)
!906 = !DILocation(line: 882, column: 14, scope: !904)
!907 = !DILocation(line: 883, column: 6, scope: !904)
!908 = !DILocation(line: 883, column: 12, scope: !904)
!909 = !DILocation(line: 884, column: 3, scope: !904)
!910 = !DILocation(line: 885, column: 3, scope: !896)
!911 = !DILocation(line: 887, column: 1, scope: !837)
!912 = distinct !DISubprogram(name: "unlink_controllers", scope: !1, file: !1, line: 205, type: !506, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!913 = !DILocalVariable(name: "lb", arg: 1, scope: !912, file: !1, line: 205, type: !432)
!914 = !DILocation(line: 205, column: 35, scope: !912)
!915 = !DILocalVariable(name: "cont", scope: !912, file: !1, line: 207, type: !793)
!916 = !DILocation(line: 207, column: 15, scope: !912)
!917 = !DILocation(line: 209, column: 13, scope: !918)
!918 = distinct !DILexicalBlock(scope: !912, file: !1, line: 209, column: 2)
!919 = !DILocation(line: 209, column: 17, scope: !918)
!920 = !DILocation(line: 209, column: 11, scope: !918)
!921 = !DILocation(line: 209, column: 7, scope: !918)
!922 = !DILocation(line: 209, column: 24, scope: !923)
!923 = distinct !DILexicalBlock(scope: !918, file: !1, line: 209, column: 2)
!924 = !DILocation(line: 209, column: 2, scope: !918)
!925 = !DILocation(line: 210, column: 21, scope: !923)
!926 = !DILocation(line: 210, column: 3, scope: !923)
!927 = !DILocation(line: 209, column: 36, scope: !923)
!928 = !DILocation(line: 209, column: 42, scope: !923)
!929 = !DILocation(line: 209, column: 34, scope: !923)
!930 = !DILocation(line: 209, column: 2, scope: !923)
!931 = distinct !{!931, !924, !932}
!932 = !DILocation(line: 210, column: 25, scope: !918)
!933 = !DILocation(line: 211, column: 1, scope: !912)
!934 = distinct !DISubprogram(name: "free_controller", scope: !1, file: !1, line: 213, type: !791, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!935 = !DILocalVariable(name: "cont", arg: 1, scope: !934, file: !1, line: 213, type: !793)
!936 = !DILocation(line: 213, column: 35, scope: !934)
!937 = !DILocation(line: 215, column: 6, scope: !938)
!938 = distinct !DILexicalBlock(scope: !934, file: !1, line: 215, column: 6)
!939 = !DILocation(line: 215, column: 12, scope: !938)
!940 = !DILocation(line: 215, column: 6, scope: !934)
!941 = !DILocation(line: 215, column: 19, scope: !938)
!942 = !DILocation(line: 215, column: 29, scope: !938)
!943 = !DILocation(line: 215, column: 35, scope: !938)
!944 = !DILocation(line: 218, column: 6, scope: !945)
!945 = distinct !DILexicalBlock(scope: !934, file: !1, line: 218, column: 6)
!946 = !DILocation(line: 218, column: 12, scope: !945)
!947 = !DILocation(line: 218, column: 6, scope: !934)
!948 = !DILocation(line: 218, column: 18, scope: !945)
!949 = !DILocation(line: 218, column: 28, scope: !945)
!950 = !DILocation(line: 218, column: 34, scope: !945)
!951 = !DILocation(line: 219, column: 2, scope: !934)
!952 = !DILocation(line: 219, column: 12, scope: !934)
!953 = !DILocation(line: 221, column: 1, scope: !934)
!954 = distinct !DISubprogram(name: "free_controllers", scope: !1, file: !1, line: 223, type: !506, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!955 = !DILocalVariable(name: "lb", arg: 1, scope: !954, file: !1, line: 223, type: !432)
!956 = !DILocation(line: 223, column: 33, scope: !954)
!957 = !DILocalVariable(name: "cont", scope: !954, file: !1, line: 225, type: !793)
!958 = !DILocation(line: 225, column: 15, scope: !954)
!959 = !DILocation(line: 227, column: 2, scope: !954)
!960 = !DILocation(line: 227, column: 29, scope: !954)
!961 = !DILocation(line: 227, column: 17, scope: !954)
!962 = !DILocation(line: 227, column: 15, scope: !954)
!963 = !DILocation(line: 228, column: 7, scope: !964)
!964 = distinct !DILexicalBlock(scope: !965, file: !1, line: 228, column: 7)
!965 = distinct !DILexicalBlock(scope: !954, file: !1, line: 227, column: 35)
!966 = !DILocation(line: 228, column: 13, scope: !964)
!967 = !DILocation(line: 228, column: 7, scope: !965)
!968 = !DILocation(line: 229, column: 4, scope: !964)
!969 = !DILocation(line: 229, column: 14, scope: !964)
!970 = !DILocation(line: 229, column: 20, scope: !964)
!971 = !DILocation(line: 230, column: 19, scope: !965)
!972 = !DILocation(line: 230, column: 3, scope: !965)
!973 = distinct !{!973, !959, !974}
!974 = !DILocation(line: 231, column: 2, scope: !954)
!975 = !DILocation(line: 232, column: 1, scope: !954)
!976 = distinct !DISubprogram(name: "copy_controller", scope: !1, file: !1, line: 234, type: !977, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!977 = !DISubroutineType(types: !978)
!978 = !{!151, !793}
!979 = !DILocalVariable(name: "cont", arg: 1, scope: !976, file: !1, line: 234, type: !793)
!980 = !DILocation(line: 234, column: 43, scope: !976)
!981 = !DILocalVariable(name: "contn", scope: !976, file: !1, line: 236, type: !793)
!982 = !DILocation(line: 236, column: 15, scope: !976)
!983 = !DILocation(line: 238, column: 21, scope: !976)
!984 = !DILocation(line: 238, column: 35, scope: !976)
!985 = !DILocation(line: 238, column: 19, scope: !976)
!986 = !DILocation(line: 238, column: 2, scope: !976)
!987 = !DILocation(line: 238, column: 8, scope: !976)
!988 = !DILocation(line: 238, column: 13, scope: !976)
!989 = !DILocation(line: 239, column: 2, scope: !976)
!990 = !DILocation(line: 239, column: 9, scope: !976)
!991 = !DILocation(line: 239, column: 14, scope: !976)
!992 = !DILocation(line: 240, column: 6, scope: !993)
!993 = distinct !DILexicalBlock(scope: !976, file: !1, line: 240, column: 6)
!994 = !DILocation(line: 240, column: 12, scope: !993)
!995 = !DILocation(line: 240, column: 6, scope: !976)
!996 = !DILocation(line: 241, column: 16, scope: !997)
!997 = distinct !DILexicalBlock(scope: !993, file: !1, line: 240, column: 18)
!998 = !DILocation(line: 241, column: 30, scope: !997)
!999 = !DILocation(line: 241, column: 36, scope: !997)
!1000 = !DILocation(line: 241, column: 3, scope: !997)
!1001 = !DILocation(line: 241, column: 10, scope: !997)
!1002 = !DILocation(line: 241, column: 14, scope: !997)
!1003 = !DILocation(line: 242, column: 2, scope: !997)
!1004 = !DILocation(line: 244, column: 6, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !976, file: !1, line: 244, column: 6)
!1006 = !DILocation(line: 244, column: 12, scope: !1005)
!1007 = !DILocation(line: 244, column: 6, scope: !976)
!1008 = !DILocation(line: 244, column: 33, scope: !1005)
!1009 = !DILocation(line: 244, column: 47, scope: !1005)
!1010 = !DILocation(line: 244, column: 53, scope: !1005)
!1011 = !DILocation(line: 244, column: 19, scope: !1005)
!1012 = !DILocation(line: 244, column: 26, scope: !1005)
!1013 = !DILocation(line: 244, column: 31, scope: !1005)
!1014 = !DILocation(line: 245, column: 2, scope: !976)
!1015 = !DILocation(line: 245, column: 9, scope: !976)
!1016 = !DILocation(line: 245, column: 15, scope: !976)
!1017 = !DILocation(line: 246, column: 2, scope: !976)
!1018 = !DILocation(line: 246, column: 9, scope: !976)
!1019 = !DILocation(line: 246, column: 18, scope: !976)
!1020 = !DILocation(line: 248, column: 9, scope: !976)
!1021 = !DILocation(line: 248, column: 2, scope: !976)
!1022 = distinct !DISubprogram(name: "copy_controllers", scope: !1, file: !1, line: 251, type: !560, scopeLine: 252, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!1023 = !DILocalVariable(name: "lbn", arg: 1, scope: !1022, file: !1, line: 251, type: !432)
!1024 = !DILocation(line: 251, column: 33, scope: !1022)
!1025 = !DILocalVariable(name: "lbo", arg: 2, scope: !1022, file: !1, line: 251, type: !432)
!1026 = !DILocation(line: 251, column: 48, scope: !1022)
!1027 = !DILocalVariable(name: "cont", scope: !1022, file: !1, line: 253, type: !793)
!1028 = !DILocation(line: 253, column: 15, scope: !1022)
!1029 = !DILocalVariable(name: "contn", scope: !1022, file: !1, line: 253, type: !793)
!1030 = !DILocation(line: 253, column: 22, scope: !1022)
!1031 = !DILocation(line: 255, column: 14, scope: !1022)
!1032 = !DILocation(line: 255, column: 19, scope: !1022)
!1033 = !DILocation(line: 255, column: 23, scope: !1022)
!1034 = !DILocation(line: 255, column: 2, scope: !1022)
!1035 = !DILocation(line: 255, column: 7, scope: !1022)
!1036 = !DILocation(line: 255, column: 12, scope: !1022)
!1037 = !DILocation(line: 256, column: 8, scope: !1022)
!1038 = !DILocation(line: 256, column: 13, scope: !1022)
!1039 = !DILocation(line: 256, column: 6, scope: !1022)
!1040 = !DILocation(line: 257, column: 2, scope: !1022)
!1041 = !DILocation(line: 257, column: 9, scope: !1022)
!1042 = !DILocation(line: 258, column: 26, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1022, file: !1, line: 257, column: 15)
!1044 = !DILocation(line: 258, column: 10, scope: !1043)
!1045 = !DILocation(line: 258, column: 8, scope: !1043)
!1046 = !DILocation(line: 259, column: 15, scope: !1043)
!1047 = !DILocation(line: 259, column: 20, scope: !1043)
!1048 = !DILocation(line: 259, column: 3, scope: !1043)
!1049 = !DILocation(line: 260, column: 9, scope: !1043)
!1050 = !DILocation(line: 260, column: 15, scope: !1043)
!1051 = !DILocation(line: 260, column: 7, scope: !1043)
!1052 = distinct !{!1052, !1040, !1053}
!1053 = !DILocation(line: 261, column: 2, scope: !1022)
!1054 = !DILocation(line: 262, column: 1, scope: !1022)
!1055 = distinct !DISubprogram(name: "init_controller", scope: !1, file: !1, line: 264, type: !791, scopeLine: 265, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!1056 = !DILocalVariable(name: "cont", arg: 1, scope: !1055, file: !1, line: 264, type: !793)
!1057 = !DILocation(line: 264, column: 35, scope: !1055)
!1058 = !DILocation(line: 268, column: 6, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1055, file: !1, line: 268, column: 6)
!1060 = !DILocation(line: 268, column: 12, scope: !1059)
!1061 = !DILocation(line: 268, column: 6, scope: !1055)
!1062 = !DILocation(line: 268, column: 18, scope: !1059)
!1063 = !DILocation(line: 268, column: 28, scope: !1059)
!1064 = !DILocation(line: 268, column: 34, scope: !1059)
!1065 = !DILocation(line: 269, column: 2, scope: !1055)
!1066 = !DILocation(line: 269, column: 8, scope: !1055)
!1067 = !DILocation(line: 269, column: 12, scope: !1055)
!1068 = !DILocation(line: 271, column: 10, scope: !1055)
!1069 = !DILocation(line: 271, column: 16, scope: !1055)
!1070 = !DILocation(line: 271, column: 2, scope: !1055)
!1071 = !DILocation(line: 273, column: 15, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1055, file: !1, line: 271, column: 22)
!1073 = !DILocation(line: 273, column: 3, scope: !1072)
!1074 = !DILocation(line: 273, column: 9, scope: !1072)
!1075 = !DILocation(line: 273, column: 13, scope: !1072)
!1076 = !DILocation(line: 274, column: 3, scope: !1072)
!1077 = !DILocation(line: 276, column: 15, scope: !1072)
!1078 = !DILocation(line: 276, column: 3, scope: !1072)
!1079 = !DILocation(line: 276, column: 9, scope: !1072)
!1080 = !DILocation(line: 276, column: 13, scope: !1072)
!1081 = !DILocation(line: 277, column: 3, scope: !1072)
!1082 = !DILocation(line: 279, column: 1, scope: !1055)
!1083 = distinct !DISubprogram(name: "new_controller", scope: !1, file: !1, line: 281, type: !1084, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!151, !26}
!1086 = !DILocalVariable(name: "type", arg: 1, scope: !1083, file: !1, line: 281, type: !26)
!1087 = !DILocation(line: 281, column: 33, scope: !1083)
!1088 = !DILocalVariable(name: "cont", scope: !1083, file: !1, line: 283, type: !793)
!1089 = !DILocation(line: 283, column: 15, scope: !1083)
!1090 = !DILocation(line: 285, column: 8, scope: !1083)
!1091 = !DILocation(line: 285, column: 6, scope: !1083)
!1092 = !DILocation(line: 286, column: 14, scope: !1083)
!1093 = !DILocation(line: 286, column: 2, scope: !1083)
!1094 = !DILocation(line: 286, column: 8, scope: !1083)
!1095 = !DILocation(line: 286, column: 12, scope: !1083)
!1096 = !DILocation(line: 287, column: 2, scope: !1083)
!1097 = !DILocation(line: 287, column: 8, scope: !1083)
!1098 = !DILocation(line: 287, column: 12, scope: !1083)
!1099 = !DILocation(line: 289, column: 18, scope: !1083)
!1100 = !DILocation(line: 289, column: 2, scope: !1083)
!1101 = !DILocation(line: 291, column: 9, scope: !1083)
!1102 = !DILocation(line: 291, column: 15, scope: !1083)
!1103 = !DILocation(line: 291, column: 2, scope: !1083)
!1104 = !DILocation(line: 294, column: 9, scope: !1083)
!1105 = !DILocation(line: 294, column: 2, scope: !1083)
!1106 = distinct !DISubprogram(name: "unlink_actuator", scope: !1, file: !1, line: 299, type: !1107, scopeLine: 300, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !485)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{null, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActuator", file: !19, line: 282, baseType: !171)
!1111 = !DILocalVariable(name: "act", arg: 1, scope: !1106, file: !1, line: 299, type: !1109)
!1112 = !DILocation(line: 299, column: 33, scope: !1106)
!1113 = !DILocalVariable(name: "cont", scope: !1106, file: !1, line: 301, type: !793)
!1114 = !DILocation(line: 301, column: 15, scope: !1106)
!1115 = !DILocalVariable(name: "ob", scope: !1106, file: !1, line: 302, type: !800)
!1116 = !DILocation(line: 302, column: 10, scope: !1106)
!1117 = !DILocation(line: 305, column: 8, scope: !1106)
!1118 = !DILocation(line: 305, column: 14, scope: !1106)
!1119 = !DILocation(line: 305, column: 21, scope: !1106)
!1120 = !DILocation(line: 305, column: 6, scope: !1106)
!1121 = !DILocation(line: 305, column: 4, scope: !1106)
!1122 = !DILocation(line: 306, column: 2, scope: !1106)
!1123 = !DILocation(line: 306, column: 9, scope: !1106)
!1124 = !DILocation(line: 307, column: 9, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 306, column: 13)
!1126 = !DILocation(line: 307, column: 13, scope: !1125)
!1127 = !DILocation(line: 307, column: 25, scope: !1125)
!1128 = !DILocation(line: 307, column: 7, scope: !1125)
