; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_context_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_context_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rna_Context_rna_properties", scope: !2, file: !3, line: 1122, type: !1256, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !1154, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_context_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !{!57, !1151, !215}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !60, line: 157, size: 1344, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !64, !65, !66, !70, !71, !72, !73, !74, !75, !77, !79, !339, !340, !344, !345, !1135, !1136, !1141, !1146, !1147, !1149, !1150}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !60, line: 158, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !60, line: 158, baseType: !63, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !59, file: !60, line: 161, baseType: !48, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !59, file: !60, line: 164, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !60, line: 166, baseType: !48, size: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !60, line: 169, baseType: !67, size: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !59, file: !60, line: 171, baseType: !67, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !59, file: !60, line: 173, baseType: !48, size: 32, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !59, file: !60, line: 175, baseType: !67, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !60, line: 178, baseType: !76, size: 32, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !59, file: !60, line: 180, baseType: !78, size: 32, offset: 608)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !59, file: !60, line: 182, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !60, line: 73, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!48, !84, !285}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !86)
!86 = !{!87, !92, !338}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !85, file: !6, line: 58, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !85, file: !6, line: 56, size: 64, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !6, line: 57, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !6, line: 60, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !60, line: 339, size: 1600, elements: !95)
!95 = !{!96, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !129, !135, !320, !325, !331, !337}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !94, file: !60, line: 341, baseType: !97, size: 320)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !60, line: 135, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !60, line: 130, size: 320, elements: !99)
!99 = !{!100, !101, !102, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !60, line: 131, baseType: !91, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !98, file: !60, line: 131, baseType: !91, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !98, file: !60, line: 133, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !60, line: 46, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !98, file: !60, line: 134, baseType: !106, size: 128, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !107, line: 71, baseType: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !107, line: 69, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !108, file: !107, line: 70, baseType: !91, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !108, file: !107, line: 70, baseType: !91, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !94, file: !60, line: 344, baseType: !67, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !94, file: !60, line: 348, baseType: !91, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !94, file: !60, line: 349, baseType: !91, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !60, line: 352, baseType: !48, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !60, line: 355, baseType: !67, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !94, file: !60, line: 357, baseType: !67, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !94, file: !60, line: 359, baseType: !67, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !94, file: !60, line: 361, baseType: !48, size: 32, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !94, file: !60, line: 364, baseType: !57, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !94, file: !60, line: 367, baseType: !57, size: 64, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !94, file: !60, line: 370, baseType: !93, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !94, file: !60, line: 376, baseType: !93, size: 64, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !94, file: !60, line: 379, baseType: !125, size: 64, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !60, line: 70, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!93, !84}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !94, file: !60, line: 382, baseType: !130, size: 64, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !60, line: 71, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !84}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !94, file: !60, line: 385, baseType: !136, size: 64, offset: 1216)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!93, !140, !269, !91, !67, !281, !286, !316}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !142, line: 53, size: 15232, elements: !143)
!142 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = !{!144, !145, !146, !150, !152, !153, !154, !155, !161, !165, !166, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !263, !266}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !142, line: 54, baseType: !140, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !142, line: 54, baseType: !140, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !142, line: 55, baseType: !147, size: 8192, offset: 128)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8192, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !141, file: !142, line: 56, baseType: !151, size: 16, offset: 8320)
!151 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !141, file: !142, line: 56, baseType: !151, size: 16, offset: 8336)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !141, file: !142, line: 57, baseType: !151, size: 16, offset: 8352)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !141, file: !142, line: 57, baseType: !151, size: 16, offset: 8368)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !141, file: !142, line: 58, baseType: !156, size: 64, offset: 8384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !157, line: 27, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !159, line: 45, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!160 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !141, file: !142, line: 59, baseType: !162, size: 128, offset: 8448)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !141, file: !142, line: 60, baseType: !151, size: 16, offset: 8576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !141, file: !142, line: 62, baseType: !167, size: 64, offset: 8640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !169, line: 136, size: 17600, elements: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !{!171, !214, !216, !219, !220, !221, !222}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !169, line: 137, baseType: !172, size: 960)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !169, line: 130, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !169, line: 117, size: 960, elements: !174)
!174 = !{!175, !176, !177, !179, !180, !184, !185, !186, !187, !188}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !169, line: 118, baseType: !91, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !173, file: !169, line: 118, baseType: !91, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !173, file: !169, line: 119, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !173, file: !169, line: 120, baseType: !167, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !169, line: 121, baseType: !181, size: 528, offset: 256)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 528, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 66)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !169, line: 126, baseType: !151, size: 16, offset: 784)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !173, file: !169, line: 127, baseType: !48, size: 32, offset: 800)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !173, file: !169, line: 128, baseType: !48, size: 32, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !173, file: !169, line: 128, baseType: !48, size: 32, offset: 864)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !173, file: !169, line: 129, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !169, line: 75, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !169, line: 62, size: 1024, elements: !192)
!192 = !{!193, !195, !196, !197, !198, !199, !203, !204, !212, !213}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !169, line: 63, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !169, line: 63, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !169, line: 64, baseType: !69, size: 8, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !191, file: !169, line: 64, baseType: !69, size: 8, offset: 136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !169, line: 65, baseType: !151, size: 16, offset: 144)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !169, line: 66, baseType: !200, size: 512, offset: 160)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !191, file: !169, line: 67, baseType: !48, size: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !169, line: 69, baseType: !205, size: 256, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !169, line: 60, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !169, line: 48, size: 256, elements: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !206, file: !169, line: 49, baseType: !91, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !206, file: !169, line: 58, baseType: !106, size: 128, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !206, file: !169, line: 59, baseType: !48, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !206, file: !169, line: 59, baseType: !48, size: 32, offset: 224)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, file: !169, line: 70, baseType: !48, size: 32, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !191, file: !169, line: 74, baseType: !48, size: 32, offset: 992)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !168, file: !169, line: 138, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !168, file: !169, line: 139, baseType: !217, size: 64, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !169, line: 43, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !169, line: 140, baseType: !147, size: 8192, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !168, file: !169, line: 141, baseType: !147, size: 8192, offset: 9280)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !168, file: !169, line: 148, baseType: !167, size: 64, offset: 17472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !168, file: !169, line: 150, baseType: !223, size: 64, offset: 17536)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !169, line: 45, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !141, file: !142, line: 63, baseType: !106, size: 128, offset: 8704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !141, file: !142, line: 64, baseType: !106, size: 128, offset: 8832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !141, file: !142, line: 65, baseType: !106, size: 128, offset: 8960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !141, file: !142, line: 66, baseType: !106, size: 128, offset: 9088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !141, file: !142, line: 67, baseType: !106, size: 128, offset: 9216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !141, file: !142, line: 68, baseType: !106, size: 128, offset: 9344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !141, file: !142, line: 69, baseType: !106, size: 128, offset: 9472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !141, file: !142, line: 70, baseType: !106, size: 128, offset: 9600)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !141, file: !142, line: 71, baseType: !106, size: 128, offset: 9728)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !141, file: !142, line: 72, baseType: !106, size: 128, offset: 9856)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !141, file: !142, line: 73, baseType: !106, size: 128, offset: 9984)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !141, file: !142, line: 74, baseType: !106, size: 128, offset: 10112)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !141, file: !142, line: 75, baseType: !106, size: 128, offset: 10240)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !141, file: !142, line: 76, baseType: !106, size: 128, offset: 10368)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !141, file: !142, line: 77, baseType: !106, size: 128, offset: 10496)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !141, file: !142, line: 78, baseType: !106, size: 128, offset: 10624)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !141, file: !142, line: 79, baseType: !106, size: 128, offset: 10752)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !141, file: !142, line: 80, baseType: !106, size: 128, offset: 10880)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !141, file: !142, line: 81, baseType: !106, size: 128, offset: 11008)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !141, file: !142, line: 82, baseType: !106, size: 128, offset: 11136)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !141, file: !142, line: 83, baseType: !106, size: 128, offset: 11264)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !141, file: !142, line: 84, baseType: !106, size: 128, offset: 11392)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !141, file: !142, line: 85, baseType: !106, size: 128, offset: 11520)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !141, file: !142, line: 86, baseType: !106, size: 128, offset: 11648)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !141, file: !142, line: 87, baseType: !106, size: 128, offset: 11776)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !141, file: !142, line: 88, baseType: !106, size: 128, offset: 11904)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !141, file: !142, line: 89, baseType: !106, size: 128, offset: 12032)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !141, file: !142, line: 90, baseType: !106, size: 128, offset: 12160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !141, file: !142, line: 91, baseType: !106, size: 128, offset: 12288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !141, file: !142, line: 92, baseType: !106, size: 128, offset: 12416)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !141, file: !142, line: 93, baseType: !106, size: 128, offset: 12544)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !141, file: !142, line: 94, baseType: !106, size: 128, offset: 12672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !141, file: !142, line: 95, baseType: !106, size: 128, offset: 12800)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !141, file: !142, line: 96, baseType: !106, size: 128, offset: 12928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !141, file: !142, line: 98, baseType: !260, size: 2048, offset: 13056)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2048, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !141, file: !142, line: 101, baseType: !264, size: 64, offset: 15104)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !142, line: 49, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !141, file: !142, line: 103, baseType: !267, size: 64, offset: 15168)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !142, line: 51, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !271, line: 106, size: 320, elements: !272)
!271 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!272 = !{!273, !274, !275, !276, !277, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !270, file: !271, line: 107, baseType: !106, size: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !270, file: !271, line: 108, baseType: !48, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !270, file: !271, line: 109, baseType: !48, size: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !271, line: 110, baseType: !48, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !270, file: !271, line: 110, baseType: !48, size: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !270, file: !271, line: 111, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !271, line: 56, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!48, !84, !91, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!48, !290, !84, !292, !306}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !60, line: 137, size: 640, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !315}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !293, file: !60, line: 139, baseType: !97, size: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !293, file: !60, line: 142, baseType: !67, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !60, line: 144, baseType: !48, size: 32, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !293, file: !60, line: 147, baseType: !67, size: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !293, file: !60, line: 150, baseType: !300, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !290, !269, !304, !306}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !85)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !309)
!309 = !{!310, !311, !312, !313, !314}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !6, line: 339, baseType: !91, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !308, file: !6, line: 342, baseType: !292, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !308, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !308, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !308, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !293, file: !60, line: 154, baseType: !57, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !91}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !94, file: !60, line: 386, baseType: !321, size: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !140, !93}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !94, file: !60, line: 387, baseType: !326, size: 64, offset: 1344)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!330, !304}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !94, file: !60, line: 390, baseType: !332, size: 64, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !60, line: 69, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!194, !84, !336}
!336 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !94, file: !60, line: 393, baseType: !106, size: 128, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !6, line: 61, baseType: !91, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !59, file: !60, line: 184, baseType: !7, size: 32, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !59, file: !60, line: 186, baseType: !341, size: 96, offset: 736)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 3)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !59, file: !60, line: 187, baseType: !7, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !59, file: !60, line: 190, baseType: !346, size: 64, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !60, line: 64, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !140, !350, !84}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !352, line: 1216, size: 39680, elements: !353)
!352 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!353 = !{!354, !355, !358, !361, !364, !365, !366, !378, !379, !382, !383, !384, !385, !386, !387, !388, !389, !390, !394, !397, !400, !703, !706, !1006, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1028, !1029, !1030, !1031, !1032, !1040, !1107, !1114, !1117, !1124, !1127, !1128, !1129, !1130, !1131, !1132}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !351, file: !352, line: 1217, baseType: !172, size: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !351, file: !352, line: 1218, baseType: !356, size: 64, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !352, line: 58, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !351, file: !352, line: 1220, baseType: !359, size: 64, offset: 1024)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !352, line: 50, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !351, file: !352, line: 1221, baseType: !362, size: 64, offset: 1088)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !352, line: 52, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !351, file: !352, line: 1223, baseType: !350, size: 64, offset: 1152)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !351, file: !352, line: 1225, baseType: !106, size: 128, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !351, file: !352, line: 1226, baseType: !367, size: 64, offset: 1344)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !352, line: 69, size: 320, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !352, line: 70, baseType: !367, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !368, file: !352, line: 70, baseType: !367, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !368, file: !352, line: 71, baseType: !7, size: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !368, file: !352, line: 71, baseType: !7, size: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !368, file: !352, line: 72, baseType: !48, size: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !368, file: !352, line: 73, baseType: !151, size: 16, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !368, file: !352, line: 73, baseType: !151, size: 16, offset: 240)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !368, file: !352, line: 74, baseType: !359, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !351, file: !352, line: 1227, baseType: !359, size: 64, offset: 1408)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !351, file: !352, line: 1229, baseType: !380, size: 96, offset: 1472)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 96, elements: !342)
!381 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !351, file: !352, line: 1230, baseType: !380, size: 96, offset: 1568)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !351, file: !352, line: 1231, baseType: !380, size: 96, offset: 1664)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !351, file: !352, line: 1231, baseType: !380, size: 96, offset: 1760)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !351, file: !352, line: 1233, baseType: !7, size: 32, offset: 1856)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !351, file: !352, line: 1234, baseType: !48, size: 32, offset: 1888)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !351, file: !352, line: 1235, baseType: !7, size: 32, offset: 1920)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !351, file: !352, line: 1237, baseType: !151, size: 16, offset: 1952)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !351, file: !352, line: 1239, baseType: !69, size: 8, offset: 1968)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !351, file: !352, line: 1240, baseType: !391, size: 8, offset: 1976)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 1)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !351, file: !352, line: 1242, baseType: !395, size: 64, offset: 1984)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !352, line: 57, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !351, file: !352, line: 1244, baseType: !398, size: 64, offset: 2048)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !352, line: 59, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !351, file: !352, line: 1246, baseType: !401, size: 64, offset: 2112)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !352, line: 1067, size: 5184, elements: !403)
!403 = !{!404, !436, !437, !452, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !474, !574, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !623, !624, !625, !626, !627, !628, !629, !630, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !686}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !402, file: !352, line: 1068, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !352, line: 934, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !352, line: 925, size: 576, elements: !408)
!408 = !{!409, !427, !428, !429, !430, !432, !435}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !407, file: !352, line: 926, baseType: !410, size: 320)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !352, line: 830, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !352, line: 813, size: 320, elements: !412)
!412 = !{!413, !416, !419, !420, !424, !425, !426}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !411, file: !352, line: 814, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !352, line: 51, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !411, file: !352, line: 815, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !352, line: 815, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !411, file: !352, line: 818, baseType: !91, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !411, file: !352, line: 819, baseType: !421, size: 32, offset: 192)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 32, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 4)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !411, file: !352, line: 822, baseType: !48, size: 32, offset: 224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !411, file: !352, line: 826, baseType: !48, size: 32, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !411, file: !352, line: 829, baseType: !48, size: 32, offset: 288)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !407, file: !352, line: 928, baseType: !151, size: 16, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !407, file: !352, line: 928, baseType: !151, size: 16, offset: 336)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !407, file: !352, line: 929, baseType: !48, size: 32, offset: 352)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !407, file: !352, line: 930, baseType: !431, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !407, file: !352, line: 931, baseType: !433, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !352, line: 931, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !407, file: !352, line: 933, baseType: !91, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !402, file: !352, line: 1069, baseType: !405, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !402, file: !352, line: 1070, baseType: !438, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !352, line: 916, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !352, line: 891, size: 704, elements: !441)
!441 = !{!442, !443, !444, !446, !447, !448, !449, !450, !451}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !440, file: !352, line: 892, baseType: !410, size: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !440, file: !352, line: 896, baseType: !48, size: 32, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !440, file: !352, line: 900, baseType: !445, size: 96, offset: 352)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !342)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !440, file: !352, line: 903, baseType: !381, size: 32, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !440, file: !352, line: 906, baseType: !48, size: 32, offset: 480)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !440, file: !352, line: 909, baseType: !381, size: 32, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !440, file: !352, line: 912, baseType: !381, size: 32, offset: 544)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !440, file: !352, line: 914, baseType: !359, size: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !440, file: !352, line: 915, baseType: !91, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !402, file: !352, line: 1071, baseType: !453, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !352, line: 920, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !352, line: 918, size: 320, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !455, file: !352, line: 919, baseType: !410, size: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !402, file: !352, line: 1075, baseType: !381, size: 32, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !402, file: !352, line: 1077, baseType: !381, size: 32, offset: 288)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !402, file: !352, line: 1078, baseType: !381, size: 32, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !402, file: !352, line: 1079, baseType: !151, size: 16, offset: 352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !402, file: !352, line: 1082, baseType: !151, size: 16, offset: 368)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !402, file: !352, line: 1085, baseType: !69, size: 8, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !402, file: !352, line: 1086, baseType: !69, size: 8, offset: 392)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !402, file: !352, line: 1087, baseType: !69, size: 8, offset: 400)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !402, file: !352, line: 1088, baseType: !69, size: 8, offset: 408)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !402, file: !352, line: 1090, baseType: !381, size: 32, offset: 416)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !402, file: !352, line: 1093, baseType: !151, size: 16, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !402, file: !352, line: 1096, baseType: !69, size: 8, offset: 464)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !352, line: 1098, baseType: !471, size: 40, offset: 472)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 40, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 5)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !402, file: !352, line: 1101, baseType: !475, size: 832, offset: 512)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !352, line: 836, size: 832, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !486, !487, !488, !570, !571, !572, !573}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !475, file: !352, line: 837, baseType: !410, size: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !475, file: !352, line: 839, baseType: !151, size: 16, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !475, file: !352, line: 839, baseType: !151, size: 16, offset: 336)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !475, file: !352, line: 842, baseType: !151, size: 16, offset: 352)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !475, file: !352, line: 842, baseType: !151, size: 16, offset: 368)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !475, file: !352, line: 843, baseType: !483, size: 32, offset: 384)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 2)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !475, file: !352, line: 845, baseType: !48, size: 32, offset: 416)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !475, file: !352, line: 847, baseType: !91, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !475, file: !352, line: 848, baseType: !489, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !491, line: 77, size: 15424, elements: !492)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !494, !495, !498, !501, !504, !507, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !551, !552, !553, !559, !560, !564}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !490, file: !491, line: 78, baseType: !172, size: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !491, line: 80, baseType: !147, size: 8192, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !490, file: !491, line: 82, baseType: !496, size: 64, offset: 9152)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !491, line: 43, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !490, file: !491, line: 83, baseType: !499, size: 64, offset: 9216)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !169, line: 46, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !490, file: !491, line: 86, baseType: !502, size: 64, offset: 9280)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !491, line: 41, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !490, file: !491, line: 87, baseType: !505, size: 64, offset: 9344)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !491, line: 44, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !490, file: !491, line: 89, baseType: !508, size: 512, offset: 9408)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 512, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !490, file: !491, line: 90, baseType: !151, size: 16, offset: 9920)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !490, file: !491, line: 90, baseType: !151, size: 16, offset: 9936)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !490, file: !491, line: 92, baseType: !151, size: 16, offset: 9952)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !491, line: 92, baseType: !151, size: 16, offset: 9968)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !490, file: !491, line: 93, baseType: !151, size: 16, offset: 9984)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !491, line: 93, baseType: !151, size: 16, offset: 10000)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !490, file: !491, line: 94, baseType: !48, size: 32, offset: 10016)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !490, file: !491, line: 97, baseType: !151, size: 16, offset: 10048)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !490, file: !491, line: 97, baseType: !151, size: 16, offset: 10064)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !490, file: !491, line: 98, baseType: !151, size: 16, offset: 10080)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !490, file: !491, line: 98, baseType: !151, size: 16, offset: 10096)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !490, file: !491, line: 99, baseType: !151, size: 16, offset: 10112)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !490, file: !491, line: 99, baseType: !151, size: 16, offset: 10128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !490, file: !491, line: 100, baseType: !7, size: 32, offset: 10144)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !490, file: !491, line: 101, baseType: !431, size: 64, offset: 10176)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !490, file: !491, line: 103, baseType: !223, size: 64, offset: 10240)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !490, file: !491, line: 104, baseType: !528, size: 64, offset: 10304)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !169, line: 159, size: 448, elements: !530)
!530 = !{!531, !533, !534, !535, !536, !538}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !529, file: !169, line: 161, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !484)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !529, file: !169, line: 162, baseType: !532, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !529, file: !169, line: 163, baseType: !483, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !529, file: !169, line: 164, baseType: !483, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !529, file: !169, line: 165, baseType: !537, size: 128, offset: 192)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 128, elements: !484)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !529, file: !169, line: 166, baseType: !539, size: 128, offset: 320)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 128, elements: !484)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !490, file: !491, line: 107, baseType: !381, size: 32, offset: 10368)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !490, file: !491, line: 108, baseType: !48, size: 32, offset: 10400)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !490, file: !491, line: 109, baseType: !151, size: 16, offset: 10432)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !490, file: !491, line: 110, baseType: !151, size: 16, offset: 10448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !490, file: !491, line: 113, baseType: !48, size: 32, offset: 10464)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !490, file: !491, line: 113, baseType: !48, size: 32, offset: 10496)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !490, file: !491, line: 114, baseType: !69, size: 8, offset: 10528)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !490, file: !491, line: 114, baseType: !69, size: 8, offset: 10536)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !490, file: !491, line: 115, baseType: !151, size: 16, offset: 10544)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !490, file: !491, line: 116, baseType: !550, size: 128, offset: 10560)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 128, elements: !422)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !490, file: !491, line: 119, baseType: !381, size: 32, offset: 10688)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !490, file: !491, line: 119, baseType: !381, size: 32, offset: 10720)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !490, file: !491, line: 122, baseType: !554, size: 512, offset: 10752)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !555, line: 182, baseType: !556)
!555 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !555, line: 180, size: 512, elements: !557)
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !556, file: !555, line: 181, baseType: !200, size: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !490, file: !491, line: 123, baseType: !69, size: 8, offset: 11264)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !490, file: !491, line: 125, baseType: !561, size: 56, offset: 11272)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 56, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 7)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !490, file: !491, line: 126, baseType: !565, size: 4096, offset: 11328)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 4096, elements: !509)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !491, line: 69, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !491, line: 67, size: 512, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !491, line: 68, baseType: !200, size: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !475, file: !352, line: 849, baseType: !489, size: 64, offset: 576)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !475, file: !352, line: 850, baseType: !489, size: 64, offset: 640)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !475, file: !352, line: 851, baseType: !380, size: 96, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !475, file: !352, line: 852, baseType: !381, size: 32, offset: 800)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !402, file: !352, line: 1104, baseType: !575, size: 1344, offset: 1344)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !352, line: 867, size: 1344, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !575, file: !352, line: 868, baseType: !151, size: 16)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !575, file: !352, line: 869, baseType: !151, size: 16, offset: 16)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !575, file: !352, line: 870, baseType: !151, size: 16, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !575, file: !352, line: 871, baseType: !151, size: 16, offset: 48)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !575, file: !352, line: 873, baseType: !582, size: 896, offset: 64)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 896, elements: !562)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !352, line: 864, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !352, line: 859, size: 128, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !584, file: !352, line: 860, baseType: !151, size: 16)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !584, file: !352, line: 861, baseType: !151, size: 16, offset: 16)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !584, file: !352, line: 861, baseType: !151, size: 16, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !584, file: !352, line: 861, baseType: !151, size: 16, offset: 48)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !584, file: !352, line: 862, baseType: !48, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !584, file: !352, line: 863, baseType: !381, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !575, file: !352, line: 874, baseType: !91, size: 64, offset: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !575, file: !352, line: 876, baseType: !381, size: 32, offset: 1024)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !575, file: !352, line: 876, baseType: !381, size: 32, offset: 1056)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !575, file: !352, line: 878, baseType: !48, size: 32, offset: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !575, file: !352, line: 879, baseType: !48, size: 32, offset: 1120)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !575, file: !352, line: 881, baseType: !48, size: 32, offset: 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !575, file: !352, line: 881, baseType: !48, size: 32, offset: 1184)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !575, file: !352, line: 883, baseType: !350, size: 64, offset: 1216)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !575, file: !352, line: 884, baseType: !359, size: 64, offset: 1280)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !402, file: !352, line: 1107, baseType: !381, size: 32, offset: 2688)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !402, file: !352, line: 1110, baseType: !381, size: 32, offset: 2720)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !402, file: !352, line: 1113, baseType: !151, size: 16, offset: 2752)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !402, file: !352, line: 1113, baseType: !151, size: 16, offset: 2768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !402, file: !352, line: 1116, baseType: !69, size: 8, offset: 2784)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !402, file: !352, line: 1117, baseType: !391, size: 8, offset: 2792)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !402, file: !352, line: 1120, baseType: !151, size: 16, offset: 2800)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !402, file: !352, line: 1121, baseType: !381, size: 32, offset: 2816)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !402, file: !352, line: 1122, baseType: !381, size: 32, offset: 2848)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !402, file: !352, line: 1123, baseType: !381, size: 32, offset: 2880)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !402, file: !352, line: 1124, baseType: !381, size: 32, offset: 2912)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !402, file: !352, line: 1125, baseType: !381, size: 32, offset: 2944)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !402, file: !352, line: 1126, baseType: !381, size: 32, offset: 2976)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !402, file: !352, line: 1127, baseType: !381, size: 32, offset: 3008)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !402, file: !352, line: 1128, baseType: !381, size: 32, offset: 3040)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !402, file: !352, line: 1129, baseType: !381, size: 32, offset: 3072)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !402, file: !352, line: 1130, baseType: !381, size: 32, offset: 3104)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !402, file: !352, line: 1131, baseType: !151, size: 16, offset: 3136)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !402, file: !352, line: 1132, baseType: !69, size: 8, offset: 3152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !402, file: !352, line: 1133, baseType: !69, size: 8, offset: 3160)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !402, file: !352, line: 1134, baseType: !622, size: 24, offset: 3168)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 24, elements: !342)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !402, file: !352, line: 1135, baseType: !69, size: 8, offset: 3192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !402, file: !352, line: 1138, baseType: !359, size: 64, offset: 3200)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !402, file: !352, line: 1139, baseType: !69, size: 8, offset: 3264)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !402, file: !352, line: 1140, baseType: !69, size: 8, offset: 3272)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !402, file: !352, line: 1141, baseType: !69, size: 8, offset: 3280)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !402, file: !352, line: 1142, baseType: !69, size: 8, offset: 3288)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !402, file: !352, line: 1143, baseType: !69, size: 8, offset: 3296)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !402, file: !352, line: 1144, baseType: !631, size: 64, offset: 3304)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !509)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !402, file: !352, line: 1145, baseType: !631, size: 64, offset: 3368)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !402, file: !352, line: 1148, baseType: !69, size: 8, offset: 3432)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !402, file: !352, line: 1149, baseType: !69, size: 8, offset: 3440)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !402, file: !352, line: 1152, baseType: !69, size: 8, offset: 3448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !402, file: !352, line: 1152, baseType: !69, size: 8, offset: 3456)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !402, file: !352, line: 1153, baseType: !69, size: 8, offset: 3464)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !402, file: !352, line: 1154, baseType: !151, size: 16, offset: 3472)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !402, file: !352, line: 1154, baseType: !151, size: 16, offset: 3488)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !402, file: !352, line: 1155, baseType: !151, size: 16, offset: 3504)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !402, file: !352, line: 1155, baseType: !151, size: 16, offset: 3520)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !402, file: !352, line: 1156, baseType: !69, size: 8, offset: 3536)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !402, file: !352, line: 1157, baseType: !69, size: 8, offset: 3544)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !402, file: !352, line: 1159, baseType: !69, size: 8, offset: 3552)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !402, file: !352, line: 1160, baseType: !69, size: 8, offset: 3560)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !402, file: !352, line: 1161, baseType: !69, size: 8, offset: 3568)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !402, file: !352, line: 1162, baseType: !69, size: 8, offset: 3576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !402, file: !352, line: 1165, baseType: !48, size: 32, offset: 3584)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !402, file: !352, line: 1166, baseType: !48, size: 32, offset: 3616)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !402, file: !352, line: 1167, baseType: !48, size: 32, offset: 3648)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !402, file: !352, line: 1168, baseType: !48, size: 32, offset: 3680)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !402, file: !352, line: 1171, baseType: !151, size: 16, offset: 3712)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !402, file: !352, line: 1171, baseType: !151, size: 16, offset: 3728)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !402, file: !352, line: 1172, baseType: !48, size: 32, offset: 3744)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !402, file: !352, line: 1173, baseType: !381, size: 32, offset: 3776)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !402, file: !352, line: 1174, baseType: !381, size: 32, offset: 3808)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !402, file: !352, line: 1177, baseType: !658, size: 1024, offset: 3840)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !352, line: 963, size: 1024, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !684, !685}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !658, file: !352, line: 965, baseType: !48, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !658, file: !352, line: 968, baseType: !381, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !658, file: !352, line: 971, baseType: !381, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !658, file: !352, line: 974, baseType: !381, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !658, file: !352, line: 977, baseType: !380, size: 96, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !658, file: !352, line: 979, baseType: !380, size: 96, offset: 224)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !658, file: !352, line: 982, baseType: !48, size: 32, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !658, file: !352, line: 987, baseType: !668, size: 64, offset: 352)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 64, elements: !484)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !658, file: !352, line: 989, baseType: !381, size: 32, offset: 416)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !658, file: !352, line: 994, baseType: !48, size: 32, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !658, file: !352, line: 995, baseType: !48, size: 32, offset: 480)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !658, file: !352, line: 997, baseType: !69, size: 8, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !658, file: !352, line: 998, baseType: !561, size: 56, offset: 520)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !658, file: !352, line: 1000, baseType: !381, size: 32, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !658, file: !352, line: 1003, baseType: !668, size: 64, offset: 608)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !658, file: !352, line: 1006, baseType: !48, size: 32, offset: 672)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !658, file: !352, line: 1009, baseType: !381, size: 32, offset: 704)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !658, file: !352, line: 1012, baseType: !668, size: 64, offset: 736)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !658, file: !352, line: 1015, baseType: !668, size: 64, offset: 800)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !658, file: !352, line: 1018, baseType: !48, size: 32, offset: 864)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !658, file: !352, line: 1019, baseType: !682, size: 64, offset: 896)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !352, line: 63, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !658, file: !352, line: 1023, baseType: !381, size: 32, offset: 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !658, file: !352, line: 1024, baseType: !48, size: 32, offset: 992)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !402, file: !352, line: 1179, baseType: !687, size: 320, offset: 4864)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !352, line: 1043, size: 320, elements: !688)
!688 = !{!689, !690, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !687, file: !352, line: 1044, baseType: !69, size: 8)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !687, file: !352, line: 1045, baseType: !691, size: 16, offset: 8)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !484)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !687, file: !352, line: 1048, baseType: !69, size: 8, offset: 24)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !687, file: !352, line: 1049, baseType: !381, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !687, file: !352, line: 1049, baseType: !381, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !687, file: !352, line: 1052, baseType: !381, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !687, file: !352, line: 1052, baseType: !381, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !687, file: !352, line: 1053, baseType: !69, size: 8, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !687, file: !352, line: 1054, baseType: !622, size: 24, offset: 168)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !687, file: !352, line: 1057, baseType: !381, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !687, file: !352, line: 1057, baseType: !381, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !687, file: !352, line: 1060, baseType: !381, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !687, file: !352, line: 1060, baseType: !381, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !351, file: !352, line: 1247, baseType: !704, size: 64, offset: 2176)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !352, line: 60, flags: DIFlagFwdDecl)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !351, file: !352, line: 1251, baseType: !707, size: 31872, offset: 2240)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !352, line: 403, size: 31872, elements: !708)
!708 = !{!709, !792, !812, !821, !841, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !982, !983, !984, !988, !1004, !1005}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !707, file: !352, line: 404, baseType: !710, size: 1984)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !352, line: 259, size: 1984, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !729, !787}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !710, file: !352, line: 260, baseType: !69, size: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !710, file: !352, line: 263, baseType: !69, size: 8, offset: 8)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !710, file: !352, line: 266, baseType: !69, size: 8, offset: 16)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !710, file: !352, line: 267, baseType: !69, size: 8, offset: 24)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !710, file: !352, line: 269, baseType: !69, size: 8, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !710, file: !352, line: 270, baseType: !69, size: 8, offset: 40)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !710, file: !352, line: 276, baseType: !69, size: 8, offset: 48)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !710, file: !352, line: 279, baseType: !69, size: 8, offset: 56)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !710, file: !352, line: 280, baseType: !151, size: 16, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !710, file: !352, line: 280, baseType: !151, size: 16, offset: 80)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !710, file: !352, line: 281, baseType: !381, size: 32, offset: 96)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !710, file: !352, line: 284, baseType: !69, size: 8, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !710, file: !352, line: 285, baseType: !69, size: 8, offset: 136)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !710, file: !352, line: 287, baseType: !726, size: 48, offset: 144)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 48, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 6)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !710, file: !352, line: 290, baseType: !730, size: 1280, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !555, line: 174, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !555, line: 166, size: 1280, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !786}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !731, file: !555, line: 167, baseType: !48, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !731, file: !555, line: 167, baseType: !48, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !731, file: !555, line: 168, baseType: !200, size: 512, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !731, file: !555, line: 169, baseType: !200, size: 512, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !731, file: !555, line: 170, baseType: !381, size: 32, offset: 1088)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !731, file: !555, line: 171, baseType: !381, size: 32, offset: 1120)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !731, file: !555, line: 172, baseType: !740, size: 64, offset: 1152)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !555, line: 72, size: 3072, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !756, !757, !782, !783, !784, !785}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !741, file: !555, line: 73, baseType: !48, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !741, file: !555, line: 73, baseType: !48, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !741, file: !555, line: 74, baseType: !48, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !741, file: !555, line: 75, baseType: !48, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !741, file: !555, line: 77, baseType: !748, size: 128, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !749, line: 95, baseType: !750)
!749 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !749, line: 92, size: 128, elements: !751)
!751 = !{!752, !753, !754, !755}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !750, file: !749, line: 93, baseType: !381, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !750, file: !749, line: 93, baseType: !381, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !750, file: !749, line: 94, baseType: !381, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !750, file: !749, line: 94, baseType: !381, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !741, file: !555, line: 77, baseType: !748, size: 128, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !741, file: !555, line: 79, baseType: !758, size: 2304, offset: 384)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 2304, elements: !422)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !555, line: 67, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !555, line: 55, size: 576, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !778, !779, !780, !781}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !760, file: !555, line: 56, baseType: !151, size: 16)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !760, file: !555, line: 56, baseType: !151, size: 16, offset: 16)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !760, file: !555, line: 58, baseType: !381, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !760, file: !555, line: 59, baseType: !381, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !760, file: !555, line: 59, baseType: !381, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !760, file: !555, line: 60, baseType: !668, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !760, file: !555, line: 60, baseType: !668, size: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !760, file: !555, line: 61, baseType: !770, size: 64, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !555, line: 47, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !555, line: 44, size: 96, elements: !773)
!773 = !{!774, !775, !776, !777}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !772, file: !555, line: 45, baseType: !381, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !772, file: !555, line: 45, baseType: !381, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !772, file: !555, line: 46, baseType: !151, size: 16, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !772, file: !555, line: 46, baseType: !151, size: 16, offset: 80)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !760, file: !555, line: 62, baseType: !770, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !760, file: !555, line: 64, baseType: !770, size: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !760, file: !555, line: 65, baseType: !668, size: 64, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !760, file: !555, line: 66, baseType: !668, size: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !741, file: !555, line: 80, baseType: !380, size: 96, offset: 2688)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !741, file: !555, line: 80, baseType: !380, size: 96, offset: 2784)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !741, file: !555, line: 81, baseType: !380, size: 96, offset: 2880)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !741, file: !555, line: 83, baseType: !380, size: 96, offset: 2976)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !731, file: !555, line: 173, baseType: !91, size: 64, offset: 1216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !710, file: !352, line: 291, baseType: !788, size: 512, offset: 1472)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !555, line: 178, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !555, line: 176, size: 512, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !789, file: !555, line: 177, baseType: !200, size: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !707, file: !352, line: 406, baseType: !793, size: 64, offset: 1984)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !352, line: 80, size: 1472, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !794, file: !352, line: 81, baseType: !91, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !794, file: !352, line: 82, baseType: !91, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !794, file: !352, line: 83, baseType: !7, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !794, file: !352, line: 84, baseType: !7, size: 32, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !794, file: !352, line: 86, baseType: !7, size: 32, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !794, file: !352, line: 87, baseType: !7, size: 32, offset: 224)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !794, file: !352, line: 88, baseType: !7, size: 32, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !794, file: !352, line: 89, baseType: !7, size: 32, offset: 288)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !794, file: !352, line: 90, baseType: !7, size: 32, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !794, file: !352, line: 91, baseType: !7, size: 32, offset: 352)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !794, file: !352, line: 92, baseType: !7, size: 32, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !794, file: !352, line: 93, baseType: !7, size: 32, offset: 416)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecname", scope: !794, file: !352, line: 95, baseType: !809, size: 1024, offset: 448)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1024, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecdata", scope: !707, file: !352, line: 407, baseType: !813, size: 64, offset: 2048)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecData", file: !352, line: 98, size: 1216, elements: !815)
!815 = !{!816, !817, !818, !819, !820}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cdParms", scope: !814, file: !352, line: 100, baseType: !91, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !814, file: !352, line: 101, baseType: !91, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cdSize", scope: !814, file: !352, line: 103, baseType: !7, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !814, file: !352, line: 104, baseType: !7, size: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecname", scope: !814, file: !352, line: 106, baseType: !809, size: 1024, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecsettings", scope: !707, file: !352, line: 408, baseType: !822, size: 512, offset: 2112)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecSettings", file: !352, line: 109, size: 512, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "codecType", scope: !822, file: !352, line: 111, baseType: !48, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "codecSpatialQuality", scope: !822, file: !352, line: 112, baseType: !48, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !822, file: !352, line: 115, baseType: !48, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "codecFlags", scope: !822, file: !352, line: 116, baseType: !48, size: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "colorDepth", scope: !822, file: !352, line: 117, baseType: !48, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "codecTemporalQuality", scope: !822, file: !352, line: 118, baseType: !48, size: 32, offset: 160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "minSpatialQuality", scope: !822, file: !352, line: 119, baseType: !48, size: 32, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "minTemporalQuality", scope: !822, file: !352, line: 120, baseType: !48, size: 32, offset: 224)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "keyFrameRate", scope: !822, file: !352, line: 121, baseType: !48, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "bitRate", scope: !822, file: !352, line: 122, baseType: !48, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "audiocodecType", scope: !822, file: !352, line: 125, baseType: !48, size: 32, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "audioSampleRate", scope: !822, file: !352, line: 126, baseType: !48, size: 32, offset: 352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitDepth", scope: !822, file: !352, line: 127, baseType: !151, size: 16, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "audioChannels", scope: !822, file: !352, line: 128, baseType: !151, size: 16, offset: 400)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "audioCodecFlags", scope: !822, file: !352, line: 129, baseType: !48, size: 32, offset: 416)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitRate", scope: !822, file: !352, line: 130, baseType: !48, size: 32, offset: 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !822, file: !352, line: 131, baseType: !48, size: 32, offset: 480)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ffcodecdata", scope: !707, file: !352, line: 409, baseType: !842, size: 576, offset: 2624)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFMpegCodecData", file: !352, line: 134, size: 576, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !842, file: !352, line: 135, baseType: !48, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !842, file: !352, line: 136, baseType: !48, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !842, file: !352, line: 137, baseType: !48, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "video_bitrate", scope: !842, file: !352, line: 138, baseType: !48, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "audio_bitrate", scope: !842, file: !352, line: 139, baseType: !48, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mixrate", scope: !842, file: !352, line: 140, baseType: !48, size: 32, offset: 160)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "audio_channels", scope: !842, file: !352, line: 141, baseType: !48, size: 32, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pad", scope: !842, file: !352, line: 142, baseType: !48, size: 32, offset: 224)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "audio_volume", scope: !842, file: !352, line: 143, baseType: !381, size: 32, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !842, file: !352, line: 144, baseType: !48, size: 32, offset: 288)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !842, file: !352, line: 145, baseType: !48, size: 32, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !842, file: !352, line: 147, baseType: !48, size: 32, offset: 352)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !842, file: !352, line: 148, baseType: !48, size: 32, offset: 384)
