; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_packedfile_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_packedfile_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "unpack_method_items", scope: !2, file: !1301, line: 38, type: !1302, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !1092, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_packedfile_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !{!57, !1088, !48, !1090}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !60, line: 157, size: 1344, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !64, !65, !66, !70, !71, !72, !73, !74, !75, !77, !79, !344, !345, !349, !350, !1072, !1073, !1078, !1083, !1084, !1086, !1087}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !60, line: 158, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !60, line: 158, baseType: !63, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !59, file: !60, line: 161, baseType: !48, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !59, file: !60, line: 164, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !60, line: 166, baseType: !48, size: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !60, line: 169, baseType: !67, size: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !59, file: !60, line: 171, baseType: !67, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !59, file: !60, line: 173, baseType: !48, size: 32, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !59, file: !60, line: 175, baseType: !67, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !60, line: 178, baseType: !76, size: 32, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !59, file: !60, line: 180, baseType: !78, size: 32, offset: 608)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !59, file: !60, line: 182, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !60, line: 73, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!48, !84, !290}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !86)
!86 = !{!87, !92, !343}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !85, file: !6, line: 58, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !85, file: !6, line: 56, size: 64, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !6, line: 57, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !6, line: 60, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !60, line: 339, size: 1600, elements: !95)
!95 = !{!96, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !129, !135, !325, !330, !336, !342}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !94, file: !60, line: 341, baseType: !97, size: 320)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !60, line: 135, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !60, line: 130, size: 320, elements: !99)
!99 = !{!100, !101, !102, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !60, line: 131, baseType: !91, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !98, file: !60, line: 131, baseType: !91, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !98, file: !60, line: 133, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !60, line: 46, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !98, file: !60, line: 134, baseType: !106, size: 128, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !107, line: 71, baseType: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !107, line: 69, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !108, file: !107, line: 70, baseType: !91, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !108, file: !107, line: 70, baseType: !91, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !94, file: !60, line: 344, baseType: !67, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !94, file: !60, line: 348, baseType: !91, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !94, file: !60, line: 349, baseType: !91, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !60, line: 352, baseType: !48, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !60, line: 355, baseType: !67, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !94, file: !60, line: 357, baseType: !67, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !94, file: !60, line: 359, baseType: !67, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !94, file: !60, line: 361, baseType: !48, size: 32, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !94, file: !60, line: 364, baseType: !57, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !94, file: !60, line: 367, baseType: !57, size: 64, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !94, file: !60, line: 370, baseType: !93, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !94, file: !60, line: 376, baseType: !93, size: 64, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !94, file: !60, line: 379, baseType: !125, size: 64, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !60, line: 70, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!93, !84}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !94, file: !60, line: 382, baseType: !130, size: 64, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !60, line: 71, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !84}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !94, file: !60, line: 385, baseType: !136, size: 64, offset: 1216)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!93, !140, !274, !91, !67, !286, !291, !321}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !142, line: 53, size: 15232, elements: !143)
!142 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = !{!144, !145, !146, !150, !152, !153, !154, !155, !161, !165, !166, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !268, !271}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !142, line: 54, baseType: !140, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !142, line: 54, baseType: !140, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !142, line: 55, baseType: !147, size: 8192, offset: 128)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8192, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !141, file: !142, line: 56, baseType: !151, size: 16, offset: 8320)
!151 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !141, file: !142, line: 56, baseType: !151, size: 16, offset: 8336)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !141, file: !142, line: 57, baseType: !151, size: 16, offset: 8352)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !141, file: !142, line: 57, baseType: !151, size: 16, offset: 8368)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !141, file: !142, line: 58, baseType: !156, size: 64, offset: 8384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !157, line: 27, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !159, line: 45, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!160 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !141, file: !142, line: 59, baseType: !162, size: 128, offset: 8448)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !141, file: !142, line: 60, baseType: !151, size: 16, offset: 8576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !141, file: !142, line: 62, baseType: !167, size: 64, offset: 8640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !169, line: 136, size: 17600, elements: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !{!171, !214, !216, !219, !220, !221, !222}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !169, line: 137, baseType: !172, size: 960)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !169, line: 130, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !169, line: 117, size: 960, elements: !174)
!174 = !{!175, !176, !177, !179, !180, !184, !185, !186, !187, !188}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !169, line: 118, baseType: !91, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !173, file: !169, line: 118, baseType: !91, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !173, file: !169, line: 119, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !173, file: !169, line: 120, baseType: !167, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !169, line: 121, baseType: !181, size: 528, offset: 256)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 528, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 66)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !169, line: 126, baseType: !151, size: 16, offset: 784)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !173, file: !169, line: 127, baseType: !48, size: 32, offset: 800)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !173, file: !169, line: 128, baseType: !48, size: 32, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !173, file: !169, line: 128, baseType: !48, size: 32, offset: 864)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !173, file: !169, line: 129, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !169, line: 75, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !169, line: 62, size: 1024, elements: !192)
!192 = !{!193, !195, !196, !197, !198, !199, !203, !204, !212, !213}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !169, line: 63, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !169, line: 63, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !169, line: 64, baseType: !69, size: 8, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !191, file: !169, line: 64, baseType: !69, size: 8, offset: 136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !169, line: 65, baseType: !151, size: 16, offset: 144)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !169, line: 66, baseType: !200, size: 512, offset: 160)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !191, file: !169, line: 67, baseType: !48, size: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !169, line: 69, baseType: !205, size: 256, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !169, line: 60, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !169, line: 48, size: 256, elements: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !206, file: !169, line: 49, baseType: !91, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !206, file: !169, line: 58, baseType: !106, size: 128, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !206, file: !169, line: 59, baseType: !48, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !206, file: !169, line: 59, baseType: !48, size: 32, offset: 224)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, file: !169, line: 70, baseType: !48, size: 32, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !191, file: !169, line: 74, baseType: !48, size: 32, offset: 992)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !168, file: !169, line: 138, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !168, file: !169, line: 139, baseType: !217, size: 64, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !169, line: 43, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !169, line: 140, baseType: !147, size: 8192, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !168, file: !169, line: 141, baseType: !147, size: 8192, offset: 9280)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !168, file: !169, line: 148, baseType: !167, size: 64, offset: 17472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !168, file: !169, line: 150, baseType: !223, size: 64, offset: 17536)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !225, line: 37, size: 128, elements: !226)
!225 = !DIFile(filename: "blender/source/blender/makesdna/DNA_packedFile_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !224, file: !225, line: 38, baseType: !48, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !224, file: !225, line: 39, baseType: !48, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !224, file: !225, line: 40, baseType: !91, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !141, file: !142, line: 63, baseType: !106, size: 128, offset: 8704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !141, file: !142, line: 64, baseType: !106, size: 128, offset: 8832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !141, file: !142, line: 65, baseType: !106, size: 128, offset: 8960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !141, file: !142, line: 66, baseType: !106, size: 128, offset: 9088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !141, file: !142, line: 67, baseType: !106, size: 128, offset: 9216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !141, file: !142, line: 68, baseType: !106, size: 128, offset: 9344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !141, file: !142, line: 69, baseType: !106, size: 128, offset: 9472)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !141, file: !142, line: 70, baseType: !106, size: 128, offset: 9600)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !141, file: !142, line: 71, baseType: !106, size: 128, offset: 9728)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !141, file: !142, line: 72, baseType: !106, size: 128, offset: 9856)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !141, file: !142, line: 73, baseType: !106, size: 128, offset: 9984)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !141, file: !142, line: 74, baseType: !106, size: 128, offset: 10112)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !141, file: !142, line: 75, baseType: !106, size: 128, offset: 10240)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !141, file: !142, line: 76, baseType: !106, size: 128, offset: 10368)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !141, file: !142, line: 77, baseType: !106, size: 128, offset: 10496)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !141, file: !142, line: 78, baseType: !106, size: 128, offset: 10624)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !141, file: !142, line: 79, baseType: !106, size: 128, offset: 10752)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !141, file: !142, line: 80, baseType: !106, size: 128, offset: 10880)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !141, file: !142, line: 81, baseType: !106, size: 128, offset: 11008)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !141, file: !142, line: 82, baseType: !106, size: 128, offset: 11136)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !141, file: !142, line: 83, baseType: !106, size: 128, offset: 11264)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !141, file: !142, line: 84, baseType: !106, size: 128, offset: 11392)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !141, file: !142, line: 85, baseType: !106, size: 128, offset: 11520)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !141, file: !142, line: 86, baseType: !106, size: 128, offset: 11648)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !141, file: !142, line: 87, baseType: !106, size: 128, offset: 11776)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !141, file: !142, line: 88, baseType: !106, size: 128, offset: 11904)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !141, file: !142, line: 89, baseType: !106, size: 128, offset: 12032)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !141, file: !142, line: 90, baseType: !106, size: 128, offset: 12160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !141, file: !142, line: 91, baseType: !106, size: 128, offset: 12288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !141, file: !142, line: 92, baseType: !106, size: 128, offset: 12416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !141, file: !142, line: 93, baseType: !106, size: 128, offset: 12544)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !141, file: !142, line: 94, baseType: !106, size: 128, offset: 12672)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !141, file: !142, line: 95, baseType: !106, size: 128, offset: 12800)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !141, file: !142, line: 96, baseType: !106, size: 128, offset: 12928)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !141, file: !142, line: 98, baseType: !265, size: 2048, offset: 13056)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2048, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !141, file: !142, line: 101, baseType: !269, size: 64, offset: 15104)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !142, line: 49, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !141, file: !142, line: 103, baseType: !272, size: 64, offset: 15168)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !142, line: 51, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !276, line: 106, size: 320, elements: !277)
!276 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!277 = !{!278, !279, !280, !281, !282, !283}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !275, file: !276, line: 107, baseType: !106, size: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !275, file: !276, line: 108, baseType: !48, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !275, file: !276, line: 109, baseType: !48, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !276, line: 110, baseType: !48, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !275, file: !276, line: 110, baseType: !48, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !275, file: !276, line: 111, baseType: !284, size: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !276, line: 56, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!48, !84, !91, !290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!48, !295, !84, !297, !311}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !60, line: 137, size: 640, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !320}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !298, file: !60, line: 139, baseType: !97, size: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !298, file: !60, line: 142, baseType: !67, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !60, line: 144, baseType: !48, size: 32, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !298, file: !60, line: 147, baseType: !67, size: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !298, file: !60, line: 150, baseType: !305, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !295, !274, !309, !311}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !85)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !314)
!314 = !{!315, !316, !317, !318, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !313, file: !6, line: 339, baseType: !91, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !313, file: !6, line: 342, baseType: !297, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !313, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !313, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !313, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !298, file: !60, line: 154, baseType: !57, size: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !91}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !94, file: !60, line: 386, baseType: !326, size: 64, offset: 1280)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !140, !93}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !94, file: !60, line: 387, baseType: !331, size: 64, offset: 1344)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !309}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !94, file: !60, line: 390, baseType: !337, size: 64, offset: 1408)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !60, line: 69, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!194, !84, !341}
!341 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !94, file: !60, line: 393, baseType: !106, size: 128, offset: 1472)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !6, line: 61, baseType: !91, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !59, file: !60, line: 184, baseType: !7, size: 32, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !59, file: !60, line: 186, baseType: !346, size: 96, offset: 736)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 3)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !59, file: !60, line: 187, baseType: !7, size: 32, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !59, file: !60, line: 190, baseType: !351, size: 64, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !60, line: 64, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !140, !355, !84}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !357, line: 1216, size: 39680, elements: !358)
!357 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!358 = !{!359, !360, !363, !366, !369, !370, !371, !383, !384, !387, !388, !389, !390, !391, !392, !393, !394, !395, !399, !402, !405, !634, !637, !939, !951, !952, !953, !954, !955, !956, !957, !958, !961, !962, !963, !964, !965, !973, !1040, !1047, !1050, !1057, !1060, !1061, !1062, !1063, !1064, !1069}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !356, file: !357, line: 1217, baseType: !172, size: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !356, file: !357, line: 1218, baseType: !361, size: 64, offset: 960)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !357, line: 58, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !356, file: !357, line: 1220, baseType: !364, size: 64, offset: 1024)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !357, line: 50, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !356, file: !357, line: 1221, baseType: !367, size: 64, offset: 1088)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !357, line: 52, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !356, file: !357, line: 1223, baseType: !355, size: 64, offset: 1152)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !356, file: !357, line: 1225, baseType: !106, size: 128, offset: 1216)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !356, file: !357, line: 1226, baseType: !372, size: 64, offset: 1344)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !357, line: 69, size: 320, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !373, file: !357, line: 70, baseType: !372, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !373, file: !357, line: 70, baseType: !372, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !373, file: !357, line: 71, baseType: !7, size: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !373, file: !357, line: 71, baseType: !7, size: 32, offset: 160)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !373, file: !357, line: 72, baseType: !48, size: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !373, file: !357, line: 73, baseType: !151, size: 16, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !373, file: !357, line: 73, baseType: !151, size: 16, offset: 240)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !373, file: !357, line: 74, baseType: !364, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !356, file: !357, line: 1227, baseType: !364, size: 64, offset: 1408)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !356, file: !357, line: 1229, baseType: !385, size: 96, offset: 1472)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 96, elements: !347)
!386 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !356, file: !357, line: 1230, baseType: !385, size: 96, offset: 1568)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !356, file: !357, line: 1231, baseType: !385, size: 96, offset: 1664)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !356, file: !357, line: 1231, baseType: !385, size: 96, offset: 1760)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !356, file: !357, line: 1233, baseType: !7, size: 32, offset: 1856)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !356, file: !357, line: 1234, baseType: !48, size: 32, offset: 1888)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !356, file: !357, line: 1235, baseType: !7, size: 32, offset: 1920)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !356, file: !357, line: 1237, baseType: !151, size: 16, offset: 1952)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !356, file: !357, line: 1239, baseType: !69, size: 8, offset: 1968)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !356, file: !357, line: 1240, baseType: !396, size: 8, offset: 1976)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 1)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !356, file: !357, line: 1242, baseType: !400, size: 64, offset: 1984)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !357, line: 57, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !356, file: !357, line: 1244, baseType: !403, size: 64, offset: 2048)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !357, line: 59, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !356, file: !357, line: 1246, baseType: !406, size: 64, offset: 2112)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !357, line: 1067, size: 5184, elements: !408)
!408 = !{!409, !441, !442, !457, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !479, !500, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !551, !552, !553, !554, !555, !556, !557, !558, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !617}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !407, file: !357, line: 1068, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !357, line: 934, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !357, line: 925, size: 576, elements: !413)
!413 = !{!414, !432, !433, !434, !435, !437, !440}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !412, file: !357, line: 926, baseType: !415, size: 320)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !357, line: 830, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !357, line: 813, size: 320, elements: !417)
!417 = !{!418, !421, !424, !425, !429, !430, !431}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !416, file: !357, line: 814, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !357, line: 51, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !416, file: !357, line: 815, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !357, line: 815, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !416, file: !357, line: 818, baseType: !91, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !416, file: !357, line: 819, baseType: !426, size: 32, offset: 192)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 32, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 4)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !416, file: !357, line: 822, baseType: !48, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !416, file: !357, line: 826, baseType: !48, size: 32, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !416, file: !357, line: 829, baseType: !48, size: 32, offset: 288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !412, file: !357, line: 928, baseType: !151, size: 16, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !412, file: !357, line: 928, baseType: !151, size: 16, offset: 336)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !412, file: !357, line: 929, baseType: !48, size: 32, offset: 352)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !412, file: !357, line: 930, baseType: !436, size: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !412, file: !357, line: 931, baseType: !438, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !357, line: 931, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !412, file: !357, line: 933, baseType: !91, size: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !407, file: !357, line: 1069, baseType: !410, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !407, file: !357, line: 1070, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !357, line: 916, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !357, line: 891, size: 704, elements: !446)
!446 = !{!447, !448, !449, !451, !452, !453, !454, !455, !456}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !445, file: !357, line: 892, baseType: !415, size: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !445, file: !357, line: 896, baseType: !48, size: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !445, file: !357, line: 900, baseType: !450, size: 96, offset: 352)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !347)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !445, file: !357, line: 903, baseType: !386, size: 32, offset: 448)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !445, file: !357, line: 906, baseType: !48, size: 32, offset: 480)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !445, file: !357, line: 909, baseType: !386, size: 32, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !445, file: !357, line: 912, baseType: !386, size: 32, offset: 544)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !445, file: !357, line: 914, baseType: !364, size: 64, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !445, file: !357, line: 915, baseType: !91, size: 64, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !407, file: !357, line: 1071, baseType: !458, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !357, line: 920, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !357, line: 918, size: 320, elements: !461)
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !460, file: !357, line: 919, baseType: !415, size: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !407, file: !357, line: 1075, baseType: !386, size: 32, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !407, file: !357, line: 1077, baseType: !386, size: 32, offset: 288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !407, file: !357, line: 1078, baseType: !386, size: 32, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !407, file: !357, line: 1079, baseType: !151, size: 16, offset: 352)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !407, file: !357, line: 1082, baseType: !151, size: 16, offset: 368)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !407, file: !357, line: 1085, baseType: !69, size: 8, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !407, file: !357, line: 1086, baseType: !69, size: 8, offset: 392)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !407, file: !357, line: 1087, baseType: !69, size: 8, offset: 400)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !407, file: !357, line: 1088, baseType: !69, size: 8, offset: 408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !407, file: !357, line: 1090, baseType: !386, size: 32, offset: 416)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !407, file: !357, line: 1093, baseType: !151, size: 16, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !407, file: !357, line: 1096, baseType: !69, size: 8, offset: 464)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !407, file: !357, line: 1098, baseType: !476, size: 40, offset: 472)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 40, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 5)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !407, file: !357, line: 1101, baseType: !480, size: 832, offset: 512)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !357, line: 836, size: 832, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !487, !491, !492, !493, !496, !497, !498, !499}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !480, file: !357, line: 837, baseType: !415, size: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !480, file: !357, line: 839, baseType: !151, size: 16, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !480, file: !357, line: 839, baseType: !151, size: 16, offset: 336)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !480, file: !357, line: 842, baseType: !151, size: 16, offset: 352)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !480, file: !357, line: 842, baseType: !151, size: 16, offset: 368)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !480, file: !357, line: 843, baseType: !488, size: 32, offset: 384)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 2)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !480, file: !357, line: 845, baseType: !48, size: 32, offset: 416)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !480, file: !357, line: 847, baseType: !91, size: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !480, file: !357, line: 848, baseType: !494, size: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !357, line: 54, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !480, file: !357, line: 849, baseType: !494, size: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !480, file: !357, line: 850, baseType: !494, size: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !480, file: !357, line: 851, baseType: !385, size: 96, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !480, file: !357, line: 852, baseType: !386, size: 32, offset: 800)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !407, file: !357, line: 1104, baseType: !501, size: 1344, offset: 1344)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !357, line: 867, size: 1344, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !357, line: 868, baseType: !151, size: 16)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !501, file: !357, line: 869, baseType: !151, size: 16, offset: 16)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !501, file: !357, line: 870, baseType: !151, size: 16, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !501, file: !357, line: 871, baseType: !151, size: 16, offset: 48)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !501, file: !357, line: 873, baseType: !508, size: 896, offset: 64)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 896, elements: !518)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !357, line: 864, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !357, line: 859, size: 128, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !510, file: !357, line: 860, baseType: !151, size: 16)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !510, file: !357, line: 861, baseType: !151, size: 16, offset: 16)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !510, file: !357, line: 861, baseType: !151, size: 16, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !510, file: !357, line: 861, baseType: !151, size: 16, offset: 48)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !510, file: !357, line: 862, baseType: !48, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !510, file: !357, line: 863, baseType: !386, size: 32, offset: 96)
!518 = !{!519}
!519 = !DISubrange(count: 7)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !501, file: !357, line: 874, baseType: !91, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !501, file: !357, line: 876, baseType: !386, size: 32, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !501, file: !357, line: 876, baseType: !386, size: 32, offset: 1056)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !501, file: !357, line: 878, baseType: !48, size: 32, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !501, file: !357, line: 879, baseType: !48, size: 32, offset: 1120)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !501, file: !357, line: 881, baseType: !48, size: 32, offset: 1152)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !501, file: !357, line: 881, baseType: !48, size: 32, offset: 1184)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !501, file: !357, line: 883, baseType: !355, size: 64, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !501, file: !357, line: 884, baseType: !364, size: 64, offset: 1280)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !407, file: !357, line: 1107, baseType: !386, size: 32, offset: 2688)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !407, file: !357, line: 1110, baseType: !386, size: 32, offset: 2720)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !407, file: !357, line: 1113, baseType: !151, size: 16, offset: 2752)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !407, file: !357, line: 1113, baseType: !151, size: 16, offset: 2768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !407, file: !357, line: 1116, baseType: !69, size: 8, offset: 2784)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !407, file: !357, line: 1117, baseType: !396, size: 8, offset: 2792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !407, file: !357, line: 1120, baseType: !151, size: 16, offset: 2800)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !407, file: !357, line: 1121, baseType: !386, size: 32, offset: 2816)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !407, file: !357, line: 1122, baseType: !386, size: 32, offset: 2848)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !407, file: !357, line: 1123, baseType: !386, size: 32, offset: 2880)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !407, file: !357, line: 1124, baseType: !386, size: 32, offset: 2912)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !407, file: !357, line: 1125, baseType: !386, size: 32, offset: 2944)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !407, file: !357, line: 1126, baseType: !386, size: 32, offset: 2976)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !407, file: !357, line: 1127, baseType: !386, size: 32, offset: 3008)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !407, file: !357, line: 1128, baseType: !386, size: 32, offset: 3040)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !407, file: !357, line: 1129, baseType: !386, size: 32, offset: 3072)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !407, file: !357, line: 1130, baseType: !386, size: 32, offset: 3104)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !407, file: !357, line: 1131, baseType: !151, size: 16, offset: 3136)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !407, file: !357, line: 1132, baseType: !69, size: 8, offset: 3152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !407, file: !357, line: 1133, baseType: !69, size: 8, offset: 3160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !407, file: !357, line: 1134, baseType: !550, size: 24, offset: 3168)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 24, elements: !347)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !407, file: !357, line: 1135, baseType: !69, size: 8, offset: 3192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !407, file: !357, line: 1138, baseType: !364, size: 64, offset: 3200)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !407, file: !357, line: 1139, baseType: !69, size: 8, offset: 3264)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !407, file: !357, line: 1140, baseType: !69, size: 8, offset: 3272)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !407, file: !357, line: 1141, baseType: !69, size: 8, offset: 3280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !407, file: !357, line: 1142, baseType: !69, size: 8, offset: 3288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !407, file: !357, line: 1143, baseType: !69, size: 8, offset: 3296)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !407, file: !357, line: 1144, baseType: !559, size: 64, offset: 3304)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 8)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !407, file: !357, line: 1145, baseType: !559, size: 64, offset: 3368)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !407, file: !357, line: 1148, baseType: !69, size: 8, offset: 3432)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !407, file: !357, line: 1149, baseType: !69, size: 8, offset: 3440)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !407, file: !357, line: 1152, baseType: !69, size: 8, offset: 3448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !407, file: !357, line: 1152, baseType: !69, size: 8, offset: 3456)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !407, file: !357, line: 1153, baseType: !69, size: 8, offset: 3464)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !407, file: !357, line: 1154, baseType: !151, size: 16, offset: 3472)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !407, file: !357, line: 1154, baseType: !151, size: 16, offset: 3488)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !407, file: !357, line: 1155, baseType: !151, size: 16, offset: 3504)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !407, file: !357, line: 1155, baseType: !151, size: 16, offset: 3520)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !407, file: !357, line: 1156, baseType: !69, size: 8, offset: 3536)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !407, file: !357, line: 1157, baseType: !69, size: 8, offset: 3544)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !407, file: !357, line: 1159, baseType: !69, size: 8, offset: 3552)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !407, file: !357, line: 1160, baseType: !69, size: 8, offset: 3560)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !407, file: !357, line: 1161, baseType: !69, size: 8, offset: 3568)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !407, file: !357, line: 1162, baseType: !69, size: 8, offset: 3576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !407, file: !357, line: 1165, baseType: !48, size: 32, offset: 3584)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !407, file: !357, line: 1166, baseType: !48, size: 32, offset: 3616)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !407, file: !357, line: 1167, baseType: !48, size: 32, offset: 3648)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !407, file: !357, line: 1168, baseType: !48, size: 32, offset: 3680)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !407, file: !357, line: 1171, baseType: !151, size: 16, offset: 3712)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !407, file: !357, line: 1171, baseType: !151, size: 16, offset: 3728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !407, file: !357, line: 1172, baseType: !48, size: 32, offset: 3744)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !407, file: !357, line: 1173, baseType: !386, size: 32, offset: 3776)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !407, file: !357, line: 1174, baseType: !386, size: 32, offset: 3808)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !407, file: !357, line: 1177, baseType: !588, size: 1024, offset: 3840)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !357, line: 963, size: 1024, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !599, !600, !601, !602, !603, !605, !606, !607, !608, !609, !610, !611, !612, !615, !616}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !588, file: !357, line: 965, baseType: !48, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !588, file: !357, line: 968, baseType: !386, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !588, file: !357, line: 971, baseType: !386, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !588, file: !357, line: 974, baseType: !386, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !588, file: !357, line: 977, baseType: !385, size: 96, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !588, file: !357, line: 979, baseType: !385, size: 96, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !588, file: !357, line: 982, baseType: !48, size: 32, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !588, file: !357, line: 987, baseType: !598, size: 64, offset: 352)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 64, elements: !489)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !588, file: !357, line: 989, baseType: !386, size: 32, offset: 416)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !588, file: !357, line: 994, baseType: !48, size: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !588, file: !357, line: 995, baseType: !48, size: 32, offset: 480)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !588, file: !357, line: 997, baseType: !69, size: 8, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !588, file: !357, line: 998, baseType: !604, size: 56, offset: 520)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 56, elements: !518)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !588, file: !357, line: 1000, baseType: !386, size: 32, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !588, file: !357, line: 1003, baseType: !598, size: 64, offset: 608)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !588, file: !357, line: 1006, baseType: !48, size: 32, offset: 672)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !588, file: !357, line: 1009, baseType: !386, size: 32, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !588, file: !357, line: 1012, baseType: !598, size: 64, offset: 736)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !588, file: !357, line: 1015, baseType: !598, size: 64, offset: 800)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !588, file: !357, line: 1018, baseType: !48, size: 32, offset: 864)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !588, file: !357, line: 1019, baseType: !613, size: 64, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !357, line: 63, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !588, file: !357, line: 1023, baseType: !386, size: 32, offset: 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !588, file: !357, line: 1024, baseType: !48, size: 32, offset: 992)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !407, file: !357, line: 1179, baseType: !618, size: 320, offset: 4864)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !357, line: 1043, size: 320, elements: !619)
!619 = !{!620, !621, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !618, file: !357, line: 1044, baseType: !69, size: 8)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !618, file: !357, line: 1045, baseType: !622, size: 16, offset: 8)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !489)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !618, file: !357, line: 1048, baseType: !69, size: 8, offset: 24)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !618, file: !357, line: 1049, baseType: !386, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !618, file: !357, line: 1049, baseType: !386, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !618, file: !357, line: 1052, baseType: !386, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !618, file: !357, line: 1052, baseType: !386, size: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !618, file: !357, line: 1053, baseType: !69, size: 8, offset: 160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !618, file: !357, line: 1054, baseType: !550, size: 24, offset: 168)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !618, file: !357, line: 1057, baseType: !386, size: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !618, file: !357, line: 1057, baseType: !386, size: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !618, file: !357, line: 1060, baseType: !386, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !618, file: !357, line: 1060, baseType: !386, size: 32, offset: 288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !356, file: !357, line: 1247, baseType: !635, size: 64, offset: 2176)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !357, line: 60, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !356, file: !357, line: 1251, baseType: !638, size: 31872, offset: 2240)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !357, line: 403, size: 31872, elements: !639)
!639 = !{!640, !724, !744, !753, !773, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !887, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !915, !916, !917, !921, !937, !938}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !638, file: !357, line: 404, baseType: !641, size: 1984)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !357, line: 259, size: 1984, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !660, !719}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !641, file: !357, line: 260, baseType: !69, size: 8)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !641, file: !357, line: 263, baseType: !69, size: 8, offset: 8)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !641, file: !357, line: 266, baseType: !69, size: 8, offset: 16)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !641, file: !357, line: 267, baseType: !69, size: 8, offset: 24)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !641, file: !357, line: 269, baseType: !69, size: 8, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !641, file: !357, line: 270, baseType: !69, size: 8, offset: 40)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !641, file: !357, line: 276, baseType: !69, size: 8, offset: 48)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !641, file: !357, line: 279, baseType: !69, size: 8, offset: 56)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !641, file: !357, line: 280, baseType: !151, size: 16, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !641, file: !357, line: 280, baseType: !151, size: 16, offset: 80)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !641, file: !357, line: 281, baseType: !386, size: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !641, file: !357, line: 284, baseType: !69, size: 8, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !641, file: !357, line: 285, baseType: !69, size: 8, offset: 136)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !641, file: !357, line: 287, baseType: !657, size: 48, offset: 144)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 48, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 6)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !641, file: !357, line: 290, baseType: !661, size: 1280, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !662, line: 174, baseType: !663)
!662 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !662, line: 166, size: 1280, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !718}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !663, file: !662, line: 167, baseType: !48, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !663, file: !662, line: 167, baseType: !48, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !663, file: !662, line: 168, baseType: !200, size: 512, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !663, file: !662, line: 169, baseType: !200, size: 512, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !663, file: !662, line: 170, baseType: !386, size: 32, offset: 1088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !663, file: !662, line: 171, baseType: !386, size: 32, offset: 1120)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !663, file: !662, line: 172, baseType: !672, size: 64, offset: 1152)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !662, line: 72, size: 3072, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !688, !689, !714, !715, !716, !717}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !673, file: !662, line: 73, baseType: !48, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !673, file: !662, line: 73, baseType: !48, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !673, file: !662, line: 74, baseType: !48, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !673, file: !662, line: 75, baseType: !48, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !673, file: !662, line: 77, baseType: !680, size: 128, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !681, line: 95, baseType: !682)
!681 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !681, line: 92, size: 128, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !682, file: !681, line: 93, baseType: !386, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !682, file: !681, line: 93, baseType: !386, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !682, file: !681, line: 94, baseType: !386, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !682, file: !681, line: 94, baseType: !386, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !673, file: !662, line: 77, baseType: !680, size: 128, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !673, file: !662, line: 79, baseType: !690, size: 2304, offset: 384)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 2304, elements: !427)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !662, line: 67, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !662, line: 55, size: 576, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !710, !711, !712, !713}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !692, file: !662, line: 56, baseType: !151, size: 16)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !692, file: !662, line: 56, baseType: !151, size: 16, offset: 16)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !692, file: !662, line: 58, baseType: !386, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !692, file: !662, line: 59, baseType: !386, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !692, file: !662, line: 59, baseType: !386, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !692, file: !662, line: 60, baseType: !598, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !692, file: !662, line: 60, baseType: !598, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !692, file: !662, line: 61, baseType: !702, size: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !662, line: 47, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !662, line: 44, size: 96, elements: !705)
!705 = !{!706, !707, !708, !709}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !704, file: !662, line: 45, baseType: !386, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !704, file: !662, line: 45, baseType: !386, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !704, file: !662, line: 46, baseType: !151, size: 16, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !704, file: !662, line: 46, baseType: !151, size: 16, offset: 80)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !692, file: !662, line: 62, baseType: !702, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !692, file: !662, line: 64, baseType: !702, size: 64, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !692, file: !662, line: 65, baseType: !598, size: 64, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !692, file: !662, line: 66, baseType: !598, size: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !673, file: !662, line: 80, baseType: !385, size: 96, offset: 2688)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !673, file: !662, line: 80, baseType: !385, size: 96, offset: 2784)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !673, file: !662, line: 81, baseType: !385, size: 96, offset: 2880)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !673, file: !662, line: 83, baseType: !385, size: 96, offset: 2976)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !663, file: !662, line: 173, baseType: !91, size: 64, offset: 1216)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !641, file: !357, line: 291, baseType: !720, size: 512, offset: 1472)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !662, line: 178, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !662, line: 176, size: 512, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !721, file: !662, line: 177, baseType: !200, size: 512)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !638, file: !357, line: 406, baseType: !725, size: 64, offset: 1984)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !357, line: 80, size: 1472, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !726, file: !357, line: 81, baseType: !91, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !726, file: !357, line: 82, baseType: !91, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !726, file: !357, line: 83, baseType: !7, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !726, file: !357, line: 84, baseType: !7, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !726, file: !357, line: 86, baseType: !7, size: 32, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !726, file: !357, line: 87, baseType: !7, size: 32, offset: 224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !726, file: !357, line: 88, baseType: !7, size: 32, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !726, file: !357, line: 89, baseType: !7, size: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !726, file: !357, line: 90, baseType: !7, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !726, file: !357, line: 91, baseType: !7, size: 32, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !726, file: !357, line: 92, baseType: !7, size: 32, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !726, file: !357, line: 93, baseType: !7, size: 32, offset: 416)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecname", scope: !726, file: !357, line: 95, baseType: !741, size: 1024, offset: 448)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1024, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecdata", scope: !638, file: !357, line: 407, baseType: !745, size: 64, offset: 2048)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecData", file: !357, line: 98, size: 1216, elements: !747)
!747 = !{!748, !749, !750, !751, !752}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "cdParms", scope: !746, file: !357, line: 100, baseType: !91, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !746, file: !357, line: 101, baseType: !91, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "cdSize", scope: !746, file: !357, line: 103, baseType: !7, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !746, file: !357, line: 104, baseType: !7, size: 32, offset: 160)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecname", scope: !746, file: !357, line: 106, baseType: !741, size: 1024, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecsettings", scope: !638, file: !357, line: 408, baseType: !754, size: 512, offset: 2112)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecSettings", file: !357, line: 109, size: 512, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "codecType", scope: !754, file: !357, line: 111, baseType: !48, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "codecSpatialQuality", scope: !754, file: !357, line: 112, baseType: !48, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !754, file: !357, line: 115, baseType: !48, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "codecFlags", scope: !754, file: !357, line: 116, baseType: !48, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "colorDepth", scope: !754, file: !357, line: 117, baseType: !48, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "codecTemporalQuality", scope: !754, file: !357, line: 118, baseType: !48, size: 32, offset: 160)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "minSpatialQuality", scope: !754, file: !357, line: 119, baseType: !48, size: 32, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "minTemporalQuality", scope: !754, file: !357, line: 120, baseType: !48, size: 32, offset: 224)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "keyFrameRate", scope: !754, file: !357, line: 121, baseType: !48, size: 32, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bitRate", scope: !754, file: !357, line: 122, baseType: !48, size: 32, offset: 288)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "audiocodecType", scope: !754, file: !357, line: 125, baseType: !48, size: 32, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "audioSampleRate", scope: !754, file: !357, line: 126, baseType: !48, size: 32, offset: 352)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitDepth", scope: !754, file: !357, line: 127, baseType: !151, size: 16, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "audioChannels", scope: !754, file: !357, line: 128, baseType: !151, size: 16, offset: 400)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "audioCodecFlags", scope: !754, file: !357, line: 129, baseType: !48, size: 32, offset: 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitRate", scope: !754, file: !357, line: 130, baseType: !48, size: 32, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !754, file: !357, line: 131, baseType: !48, size: 32, offset: 480)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ffcodecdata", scope: !638, file: !357, line: 409, baseType: !774, size: 576, offset: 2624)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFMpegCodecData", file: !357, line: 134, size: 576, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !774, file: !357, line: 135, baseType: !48, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !774, file: !357, line: 136, baseType: !48, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !774, file: !357, line: 137, baseType: !48, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "video_bitrate", scope: !774, file: !357, line: 138, baseType: !48, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "audio_bitrate", scope: !774, file: !357, line: 139, baseType: !48, size: 32, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mixrate", scope: !774, file: !357, line: 140, baseType: !48, size: 32, offset: 160)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "audio_channels", scope: !774, file: !357, line: 141, baseType: !48, size: 32, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pad", scope: !774, file: !357, line: 142, baseType: !48, size: 32, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "audio_volume", scope: !774, file: !357, line: 143, baseType: !386, size: 32, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !774, file: !357, line: 144, baseType: !48, size: 32, offset: 288)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !774, file: !357, line: 145, baseType: !48, size: 32, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !774, file: !357, line: 147, baseType: !48, size: 32, offset: 352)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !774, file: !357, line: 148, baseType: !48, size: 32, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !774, file: !357, line: 149, baseType: !48, size: 32, offset: 416)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mux_packet_size", scope: !774, file: !357, line: 150, baseType: !48, size: 32, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mux_rate", scope: !774, file: !357, line: 151, baseType: !48, size: 32, offset: 480)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !774, file: !357, line: 152, baseType: !189, size: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !638, file: !357, line: 411, baseType: !48, size: 32, offset: 3200)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !638, file: !357, line: 411, baseType: !48, size: 32, offset: 3232)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !638, file: !357, line: 411, baseType: !48, size: 32, offset: 3264)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "subframe", scope: !638, file: !357, line: 412, baseType: !386, size: 32, offset: 3296)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "psfra", scope: !638, file: !357, line: 413, baseType: !48, size: 32, offset: 3328)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pefra", scope: !638, file: !357, line: 413, baseType: !48, size: 32, offset: 3360)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !638, file: !357, line: 415, baseType: !48, size: 32, offset: 3392)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "framapto", scope: !638, file: !357, line: 415, baseType: !48, size: 32, offset: 3424)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !638, file: !357, line: 416, baseType: !151, size: 16, offset: 3456)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !638, file: !357, line: 416, baseType: !151, size: 16, offset: 3472)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "framelen", scope: !638, file: !357, line: 418, baseType: !386, size: 32, offset: 3488)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "blurfac", scope: !638, file: !357, line: 418, baseType: !386, size: 32, offset: 3520)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "edgeR", scope: !638, file: !357, line: 421, baseType: !386, size: 32, offset: 3552)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "edgeG", scope: !638, file: !357, line: 421, baseType: !386, size: 32, offset: 3584)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "edgeB", scope: !638, file: !357, line: 421, baseType: !386, size: 32, offset: 3616)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fullscreen", scope: !638, file: !357, line: 425, baseType: !151, size: 16, offset: 3648)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "xplay", scope: !638, file: !357, line: 425, baseType: !151, size: 16, offset: 3664)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "yplay", scope: !638, file: !357, line: 425, baseType: !151, size: 16, offset: 3680)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "freqplay", scope: !638, file: !357, line: 426, baseType: !151, size: 16, offset: 3696)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !638, file: !357, line: 428, baseType: !151, size: 16, offset: 3712)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !638, file: !357, line: 428, baseType: !151, size: 16, offset: 3728)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "frame_step", scope: !638, file: !357, line: 431, baseType: !48, size: 32, offset: 3744)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "stereomode", scope: !638, file: !357, line: 433, baseType: !151, size: 16, offset: 3776)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "dimensionspreset", scope: !638, file: !357, line: 435, baseType: !151, size: 16, offset: 3792)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "filtertype", scope: !638, file: !357, line: 437, baseType: !151, size: 16, offset: 3808)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !357, line: 439, baseType: !151, size: 16, offset: 3824)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "maximsize", scope: !638, file: !357, line: 441, baseType: !151, size: 16, offset: 3840)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !638, file: !357, line: 443, baseType: !151, size: 16, offset: 3856)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "xsch", scope: !638, file: !357, line: 449, baseType: !48, size: 32, offset: 3872)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ysch", scope: !638, file: !357, line: 453, baseType: !48, size: 32, offset: 3904)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "xparts", scope: !638, file: !357, line: 458, baseType: !151, size: 16, offset: 3936)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "yparts", scope: !638, file: !357, line: 462, baseType: !151, size: 16, offset: 3952)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !638, file: !357, line: 467, baseType: !48, size: 32, offset: 3968)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !638, file: !357, line: 467, baseType: !48, size: 32, offset: 4000)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !638, file: !357, line: 469, baseType: !151, size: 16, offset: 4032)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !638, file: !357, line: 469, baseType: !151, size: 16, offset: 4048)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "subimtype", scope: !638, file: !357, line: 469, baseType: !151, size: 16, offset: 4064)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !638, file: !357, line: 469, baseType: !151, size: 16, offset: 4080)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "displaymode", scope: !638, file: !357, line: 474, baseType: !151, size: 16, offset: 4096)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "use_lock_interface", scope: !638, file: !357, line: 475, baseType: !69, size: 8, offset: 4112)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !638, file: !357, line: 476, baseType: !69, size: 8, offset: 4120)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "scemode", scope: !638, file: !357, line: 481, baseType: !48, size: 32, offset: 4128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !638, file: !357, line: 486, baseType: !48, size: 32, offset: 4160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "raytrace_options", scope: !638, file: !357, line: 491, baseType: !48, size: 32, offset: 4192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "raytrace_structure", scope: !638, file: !357, line: 496, baseType: !151, size: 16, offset: 4224)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !638, file: !357, line: 498, baseType: !151, size: 16, offset: 4240)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ocres", scope: !638, file: !357, line: 501, baseType: !151, size: 16, offset: 4256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !638, file: !357, line: 502, baseType: !151, size: 16, offset: 4272)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "alphamode", scope: !638, file: !357, line: 508, baseType: !151, size: 16, offset: 4288)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !638, file: !357, line: 513, baseType: !151, size: 16, offset: 4304)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "frs_sec", scope: !638, file: !357, line: 515, baseType: !151, size: 16, offset: 4320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "edgeint", scope: !638, file: !357, line: 515, baseType: !151, size: 16, offset: 4336)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !638, file: !357, line: 519, baseType: !680, size: 128, offset: 4352)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "border", scope: !638, file: !357, line: 519, baseType: !680, size: 128, offset: 4480)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "disprect", scope: !638, file: !357, line: 520, baseType: !848, size: 128, offset: 4608)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !681, line: 89, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !681, line: 86, size: 128, elements: !850)
!850 = !{!851, !852, !853, !854}
