; ModuleID = 'blender/source/blender/editors/animation/anim_deps.c'
source_filename = "blender/source/blender/editors/animation/anim_deps.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimCont_Types", file: !11, line: 92, baseType: !5, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!49 = !DIEnumerator(name: "ANIMCONT_NONE", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "ANIMCONT_ACTION", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "ANIMCONT_SHAPEKEY", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "ANIMCONT_GPENCIL", value: 3, isUnsigned: true)
!53 = !DIEnumerator(name: "ANIMCONT_DOPESHEET", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "ANIMCONT_FCURVES", value: 5, isUnsigned: true)
!55 = !DIEnumerator(name: "ANIMCONT_DRIVERS", value: 6, isUnsigned: true)
!56 = !DIEnumerator(name: "ANIMCONT_NLA", value: 7, isUnsigned: true)
!57 = !DIEnumerator(name: "ANIMCONT_CHANNEL", value: 8, isUnsigned: true)
!58 = !DIEnumerator(name: "ANIMCONT_MASK", value: 9, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnim_Update_Flags", file: !11, line: 197, baseType: !5, size: 32, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIEnumerator(name: "ANIM_UPDATE_DEPS", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "ANIM_UPDATE_ORDER", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "ANIM_UPDATE_HANDLES", value: 4, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBone_Flag", file: !65, line: 187, baseType: !5, size: 32, elements: !66)
!65 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!67 = !DIEnumerator(name: "BONE_SELECTED", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "BONE_ROOTSEL", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "BONE_TIPSEL", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "BONE_TRANSFORM", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "BONE_CONNECTED", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!73 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!74 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!75 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!76 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!77 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!78 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!79 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!80 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!81 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!82 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!83 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!84 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!85 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!86 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!87 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!88 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!89 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eActionGroup_Flag", file: !91, line: 453, baseType: !31, size: 32, elements: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101}
!93 = !DIEnumerator(name: "AGRP_SELECTED", value: 1)
!94 = !DIEnumerator(name: "AGRP_ACTIVE", value: 2)
!95 = !DIEnumerator(name: "AGRP_PROTECTED", value: 4)
!96 = !DIEnumerator(name: "AGRP_EXPANDED", value: 8)
!97 = !DIEnumerator(name: "AGRP_MUTED", value: 16)
!98 = !DIEnumerator(name: "AGRP_NOTVISIBLE", value: 32)
!99 = !DIEnumerator(name: "AGRP_EXPANDED_G", value: 64)
!100 = !DIEnumerator(name: "AGRP_TEMP", value: 1073741824)
!101 = !DIEnumerator(name: "AGRP_MOVED", value: -2147483648)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFCurve_Flags", file: !4, line: 467, baseType: !5, size: 32, elements: !103)
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!104 = !DIEnumerator(name: "FCURVE_VISIBLE", value: 1, isUnsigned: true)
!105 = !DIEnumerator(name: "FCURVE_SELECTED", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "FCURVE_ACTIVE", value: 4, isUnsigned: true)
!107 = !DIEnumerator(name: "FCURVE_PROTECTED", value: 8, isUnsigned: true)
!108 = !DIEnumerator(name: "FCURVE_MUTED", value: 16, isUnsigned: true)
!109 = !DIEnumerator(name: "FCURVE_AUTO_HANDLES", value: 32, isUnsigned: true)
!110 = !DIEnumerator(name: "FCURVE_DISABLED", value: 1024, isUnsigned: true)
!111 = !DIEnumerator(name: "FCURVE_INT_VALUES", value: 2048, isUnsigned: true)
!112 = !DIEnumerator(name: "FCURVE_DISCRETE_VALUES", value: 4096, isUnsigned: true)
!113 = !DIEnumerator(name: "FCURVE_TAGGED", value: 32768, isUnsigned: true)
!114 = !{!115, !116, !151, !152, !153, !2386, !2447, !2514, !2516}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !91, line: 450, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !91, line: 440, size: 960, elements: !119)
!119 = !{!120, !122, !123, !130, !131, !132, !137}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !91, line: 441, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !118, file: !91, line: 441, baseType: !121, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !118, file: !91, line: 443, baseType: !124, size: 128, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !125, line: 71, baseType: !126)
!125 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !125, line: 69, size: 128, elements: !127)
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !126, file: !125, line: 70, baseType: !115, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !126, file: !125, line: 70, baseType: !115, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !118, file: !91, line: 445, baseType: !31, size: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !118, file: !91, line: 446, baseType: !31, size: 32, offset: 288)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !91, line: 447, baseType: !133, size: 512, offset: 320)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !135)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !{!136}
!136 = !DISubrange(count: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !118, file: !91, line: 449, baseType: !138, size: 128, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !139, line: 347, baseType: !140)
!139 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !139, line: 340, size: 128, elements: !141)
!141 = !{!142, !146, !147, !148, !150}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !140, file: !139, line: 341, baseType: !143, size: 32)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 4)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !140, file: !139, line: 342, baseType: !143, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !140, file: !139, line: 343, baseType: !143, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !139, line: 345, baseType: !149, size: 16, offset: 96)
!149 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !140, file: !139, line: 346, baseType: !149, size: 16, offset: 112)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !24, line: 295, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !24, line: 115, size: 11392, elements: !156)
!156 = !{!157, !216, !285, !288, !289, !290, !291, !292, !293, !294, !296, !297, !298, !299, !300, !304, !315, !317, !318, !361, !362, !365, !366, !382, !383, !384, !385, !386, !387, !388, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2339, !2342, !2343, !2344, !2345, !2346, !2347, !2350, !2353, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2367, !2370, !2371, !2374, !2375}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !155, file: !24, line: 116, baseType: !158, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !159, line: 130, baseType: !160)
!159 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !159, line: 117, size: 960, elements: !161)
!161 = !{!162, !163, !164, !166, !185, !189, !190, !191, !192, !193}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !159, line: 118, baseType: !115, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !159, line: 118, baseType: !115, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !160, file: !159, line: 119, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !160, file: !159, line: 120, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !159, line: 136, size: 17600, elements: !169)
!169 = !{!170, !171, !173, !176, !180, !181, !182}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !159, line: 137, baseType: !158, size: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !168, file: !159, line: 138, baseType: !172, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !168, file: !159, line: 139, baseType: !174, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !159, line: 43, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !159, line: 140, baseType: !177, size: 8192, offset: 1088)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 8192, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !168, file: !159, line: 141, baseType: !177, size: 8192, offset: 9280)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !168, file: !159, line: 148, baseType: !167, size: 64, offset: 17472)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !168, file: !159, line: 150, baseType: !183, size: 64, offset: 17536)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !159, line: 45, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !159, line: 121, baseType: !186, size: 528, offset: 256)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 528, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 66)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !159, line: 126, baseType: !149, size: 16, offset: 784)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !160, file: !159, line: 127, baseType: !31, size: 32, offset: 800)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !160, file: !159, line: 128, baseType: !31, size: 32, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !160, file: !159, line: 128, baseType: !31, size: 32, offset: 864)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !160, file: !159, line: 129, baseType: !194, size: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !159, line: 75, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !159, line: 62, size: 1024, elements: !197)
!197 = !{!198, !200, !201, !202, !203, !204, !205, !206, !214, !215}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !159, line: 63, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !196, file: !159, line: 63, baseType: !199, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !159, line: 64, baseType: !134, size: 8, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !196, file: !159, line: 64, baseType: !134, size: 8, offset: 136)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !196, file: !159, line: 65, baseType: !149, size: 16, offset: 144)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !159, line: 66, baseType: !133, size: 512, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !196, file: !159, line: 67, baseType: !31, size: 32, offset: 672)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !159, line: 69, baseType: !207, size: 256, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !159, line: 60, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !159, line: 48, size: 256, elements: !209)
!209 = !{!210, !211, !212, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !208, file: !159, line: 49, baseType: !115, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !208, file: !159, line: 58, baseType: !124, size: 128, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !208, file: !159, line: 59, baseType: !31, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !208, file: !159, line: 59, baseType: !31, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !196, file: !159, line: 70, baseType: !31, size: 32, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !196, file: !159, line: 74, baseType: !31, size: 32, offset: 992)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !155, file: !24, line: 117, baseType: !217, size: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !4, line: 838, size: 768, elements: !219)
!219 = !{!220, !234, !235, !245, !246, !278, !279, !280, !281, !282, !283, !284}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !218, file: !4, line: 840, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !91, line: 499, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !91, line: 486, size: 1600, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !223, file: !91, line: 487, baseType: !158, size: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !223, file: !91, line: 489, baseType: !124, size: 128, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !223, file: !91, line: 490, baseType: !124, size: 128, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !223, file: !91, line: 491, baseType: !124, size: 128, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !223, file: !91, line: 492, baseType: !124, size: 128, offset: 1344)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !223, file: !91, line: 494, baseType: !31, size: 32, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !223, file: !91, line: 495, baseType: !31, size: 32, offset: 1504)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !223, file: !91, line: 497, baseType: !31, size: 32, offset: 1536)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !223, file: !91, line: 498, baseType: !31, size: 32, offset: 1568)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !218, file: !4, line: 844, baseType: !221, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !218, file: !4, line: 848, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !4, line: 549, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !4, line: 544, size: 320, elements: !239)
!239 = !{!240, !242, !243, !244}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !4, line: 545, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !238, file: !4, line: 545, baseType: !241, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !238, file: !4, line: 547, baseType: !221, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !238, file: !4, line: 548, baseType: !124, size: 128, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !218, file: !4, line: 851, baseType: !124, size: 128, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !218, file: !4, line: 853, baseType: !247, size: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !4, line: 594, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !4, line: 561, size: 1664, elements: !250)
!250 = !{!251, !253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !4, line: 562, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !249, file: !4, line: 562, baseType: !252, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !249, file: !4, line: 564, baseType: !124, size: 128, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !249, file: !4, line: 565, baseType: !221, size: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !249, file: !4, line: 566, baseType: !236, size: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !249, file: !4, line: 568, baseType: !124, size: 128, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !249, file: !4, line: 569, baseType: !124, size: 128, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !249, file: !4, line: 571, baseType: !133, size: 512, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !249, file: !4, line: 573, baseType: !261, size: 32, offset: 1152)
!261 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !249, file: !4, line: 574, baseType: !261, size: 32, offset: 1184)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !249, file: !4, line: 576, baseType: !261, size: 32, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !249, file: !4, line: 576, baseType: !261, size: 32, offset: 1248)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !249, file: !4, line: 577, baseType: !261, size: 32, offset: 1280)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !249, file: !4, line: 577, baseType: !261, size: 32, offset: 1312)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !249, file: !4, line: 579, baseType: !261, size: 32, offset: 1344)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !249, file: !4, line: 580, baseType: !261, size: 32, offset: 1376)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !249, file: !4, line: 582, baseType: !261, size: 32, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !249, file: !4, line: 582, baseType: !261, size: 32, offset: 1440)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !249, file: !4, line: 583, baseType: !149, size: 16, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !249, file: !4, line: 585, baseType: !149, size: 16, offset: 1488)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !249, file: !4, line: 586, baseType: !149, size: 16, offset: 1504)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !249, file: !4, line: 588, baseType: !149, size: 16, offset: 1520)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !249, file: !4, line: 590, baseType: !115, size: 64, offset: 1536)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !249, file: !4, line: 592, baseType: !31, size: 32, offset: 1600)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !249, file: !4, line: 593, baseType: !31, size: 32, offset: 1632)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !218, file: !4, line: 858, baseType: !124, size: 128, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !218, file: !4, line: 859, baseType: !124, size: 128, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !218, file: !4, line: 862, baseType: !31, size: 32, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !218, file: !4, line: 863, baseType: !31, size: 32, offset: 672)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !218, file: !4, line: 866, baseType: !149, size: 16, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !218, file: !4, line: 867, baseType: !149, size: 16, offset: 720)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !218, file: !4, line: 868, baseType: !261, size: 32, offset: 736)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !155, file: !24, line: 119, baseType: !286, size: 64, offset: 1024)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !24, line: 57, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !24, line: 121, baseType: !149, size: 16, offset: 1088)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !155, file: !24, line: 121, baseType: !149, size: 16, offset: 1104)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !155, file: !24, line: 122, baseType: !31, size: 32, offset: 1120)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !155, file: !24, line: 122, baseType: !31, size: 32, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !155, file: !24, line: 122, baseType: !31, size: 32, offset: 1184)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !155, file: !24, line: 123, baseType: !133, size: 512, offset: 1216)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !155, file: !24, line: 124, baseType: !295, size: 64, offset: 1728)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !155, file: !24, line: 124, baseType: !295, size: 64, offset: 1792)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !155, file: !24, line: 127, baseType: !295, size: 64, offset: 1856)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !155, file: !24, line: 127, baseType: !295, size: 64, offset: 1920)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !155, file: !24, line: 127, baseType: !295, size: 64, offset: 1984)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !155, file: !24, line: 128, baseType: !301, size: 64, offset: 2048)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !303, line: 46, flags: DIFlagFwdDecl)
!303 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !155, file: !24, line: 130, baseType: !305, size: 64, offset: 2112)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !24, line: 97, size: 832, elements: !307)
!307 = !{!308, !313, !314}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !306, file: !24, line: 98, baseType: !309, size: 768)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 768, elements: !310)
!310 = !{!311, !312}
!311 = !DISubrange(count: 8)
!312 = !DISubrange(count: 3)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !306, file: !24, line: 99, baseType: !31, size: 32, offset: 768)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !306, file: !24, line: 99, baseType: !31, size: 32, offset: 800)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !155, file: !24, line: 131, baseType: !316, size: 64, offset: 2176)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !155, file: !24, line: 132, baseType: !316, size: 64, offset: 2240)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !155, file: !24, line: 133, baseType: !319, size: 64, offset: 2304)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !91, line: 334, size: 1728, elements: !321)
!321 = !{!322, !323, !326, !327, !328, !329, !330, !331, !334, !335, !336, !337, !338, !339, !340, !360}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !320, file: !91, line: 335, baseType: !124, size: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !320, file: !91, line: 336, baseType: !324, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !91, line: 47, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !320, file: !91, line: 338, baseType: !149, size: 16, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !320, file: !91, line: 338, baseType: !149, size: 16, offset: 208)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !320, file: !91, line: 339, baseType: !5, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !320, file: !91, line: 340, baseType: !31, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !320, file: !91, line: 342, baseType: !261, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !320, file: !91, line: 343, baseType: !332, size: 96, offset: 320)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 96, elements: !333)
!333 = !{!312}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !320, file: !91, line: 344, baseType: !332, size: 96, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !320, file: !91, line: 347, baseType: !124, size: 128, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !320, file: !91, line: 349, baseType: !31, size: 32, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !320, file: !91, line: 350, baseType: !31, size: 32, offset: 672)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !320, file: !91, line: 351, baseType: !115, size: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !320, file: !91, line: 352, baseType: !115, size: 64, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !320, file: !91, line: 354, baseType: !341, size: 384, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !91, line: 116, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !91, line: 94, size: 384, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !342, file: !91, line: 96, baseType: !31, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !342, file: !91, line: 96, baseType: !31, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !342, file: !91, line: 97, baseType: !31, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !342, file: !91, line: 97, baseType: !31, size: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !342, file: !91, line: 99, baseType: !149, size: 16, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !342, file: !91, line: 100, baseType: !149, size: 16, offset: 144)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !342, file: !91, line: 102, baseType: !149, size: 16, offset: 160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !342, file: !91, line: 105, baseType: !149, size: 16, offset: 176)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !342, file: !91, line: 108, baseType: !149, size: 16, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !342, file: !91, line: 109, baseType: !149, size: 16, offset: 208)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !342, file: !91, line: 111, baseType: !149, size: 16, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !342, file: !91, line: 112, baseType: !149, size: 16, offset: 240)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !342, file: !91, line: 114, baseType: !31, size: 32, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !342, file: !91, line: 114, baseType: !31, size: 32, offset: 288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !342, file: !91, line: 115, baseType: !31, size: 32, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !342, file: !91, line: 115, baseType: !31, size: 32, offset: 352)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !320, file: !91, line: 355, baseType: !133, size: 512, offset: 1216)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !24, line: 134, baseType: !115, size: 64, offset: 2368)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !155, file: !24, line: 136, baseType: !363, size: 64, offset: 2432)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !24, line: 58, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !155, file: !24, line: 138, baseType: !341, size: 384, offset: 2496)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !155, file: !24, line: 139, baseType: !367, size: 64, offset: 2880)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !91, line: 80, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !91, line: 72, size: 192, elements: !370)
!370 = !{!371, !378, !379, !380, !381}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !369, file: !91, line: 73, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !91, line: 59, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !91, line: 56, size: 128, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !374, file: !91, line: 57, baseType: !332, size: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !374, file: !91, line: 58, baseType: !31, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !369, file: !91, line: 74, baseType: !31, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !369, file: !91, line: 76, baseType: !31, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !369, file: !91, line: 77, baseType: !31, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !91, line: 79, baseType: !31, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !155, file: !24, line: 141, baseType: !124, size: 128, offset: 2944)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !155, file: !24, line: 142, baseType: !124, size: 128, offset: 3072)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !155, file: !24, line: 143, baseType: !124, size: 128, offset: 3200)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !155, file: !24, line: 144, baseType: !124, size: 128, offset: 3328)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !155, file: !24, line: 146, baseType: !31, size: 32, offset: 3456)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !155, file: !24, line: 147, baseType: !31, size: 32, offset: 3488)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !155, file: !24, line: 150, baseType: !389, size: 64, offset: 3520)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !392, line: 93, size: 7552, elements: !393)
!392 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !442, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !509, !510, !511, !512, !513, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !2210, !2211, !2212, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2252}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !391, file: !392, line: 94, baseType: !158, size: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !391, file: !392, line: 95, baseType: !217, size: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !391, file: !392, line: 97, baseType: !149, size: 16, offset: 1024)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !392, line: 97, baseType: !149, size: 16, offset: 1040)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !391, file: !392, line: 99, baseType: !261, size: 32, offset: 1056)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !391, file: !392, line: 99, baseType: !261, size: 32, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !391, file: !392, line: 99, baseType: !261, size: 32, offset: 1120)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !391, file: !392, line: 100, baseType: !261, size: 32, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !391, file: !392, line: 100, baseType: !261, size: 32, offset: 1184)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !391, file: !392, line: 100, baseType: !261, size: 32, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !391, file: !392, line: 101, baseType: !261, size: 32, offset: 1248)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !391, file: !392, line: 101, baseType: !261, size: 32, offset: 1280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !391, file: !392, line: 101, baseType: !261, size: 32, offset: 1312)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !391, file: !392, line: 102, baseType: !261, size: 32, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !391, file: !392, line: 102, baseType: !261, size: 32, offset: 1376)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !391, file: !392, line: 102, baseType: !261, size: 32, offset: 1408)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !391, file: !392, line: 103, baseType: !261, size: 32, offset: 1440)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !391, file: !392, line: 103, baseType: !261, size: 32, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !391, file: !392, line: 103, baseType: !261, size: 32, offset: 1504)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !391, file: !392, line: 103, baseType: !261, size: 32, offset: 1536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !391, file: !392, line: 103, baseType: !261, size: 32, offset: 1568)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !391, file: !392, line: 104, baseType: !261, size: 32, offset: 1600)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !391, file: !392, line: 104, baseType: !261, size: 32, offset: 1632)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !391, file: !392, line: 104, baseType: !261, size: 32, offset: 1664)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !391, file: !392, line: 104, baseType: !261, size: 32, offset: 1696)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !391, file: !392, line: 104, baseType: !261, size: 32, offset: 1728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !391, file: !392, line: 105, baseType: !261, size: 32, offset: 1760)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !391, file: !392, line: 108, baseType: !422, size: 704, offset: 1792)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !392, line: 53, size: 704, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !422, file: !392, line: 54, baseType: !261, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !422, file: !392, line: 55, baseType: !261, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !422, file: !392, line: 56, baseType: !261, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !422, file: !392, line: 57, baseType: !261, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !422, file: !392, line: 59, baseType: !332, size: 96, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !422, file: !392, line: 60, baseType: !332, size: 96, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !422, file: !392, line: 61, baseType: !332, size: 96, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !422, file: !392, line: 63, baseType: !261, size: 32, offset: 416)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !422, file: !392, line: 64, baseType: !261, size: 32, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !422, file: !392, line: 65, baseType: !261, size: 32, offset: 480)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !422, file: !392, line: 67, baseType: !149, size: 16, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !422, file: !392, line: 68, baseType: !149, size: 16, offset: 528)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !422, file: !392, line: 69, baseType: !149, size: 16, offset: 544)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !422, file: !392, line: 70, baseType: !149, size: 16, offset: 560)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !422, file: !392, line: 72, baseType: !261, size: 32, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !422, file: !392, line: 73, baseType: !261, size: 32, offset: 608)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !422, file: !392, line: 74, baseType: !261, size: 32, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !422, file: !392, line: 75, baseType: !261, size: 32, offset: 672)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !391, file: !392, line: 109, baseType: !443, size: 128, offset: 2496)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !392, line: 79, size: 128, elements: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !443, file: !392, line: 80, baseType: !31, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !443, file: !392, line: 81, baseType: !31, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !443, file: !392, line: 82, baseType: !31, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !443, file: !392, line: 83, baseType: !31, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !391, file: !392, line: 111, baseType: !261, size: 32, offset: 2624)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !391, file: !392, line: 111, baseType: !261, size: 32, offset: 2656)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !391, file: !392, line: 112, baseType: !261, size: 32, offset: 2688)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !391, file: !392, line: 112, baseType: !261, size: 32, offset: 2720)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !391, file: !392, line: 113, baseType: !261, size: 32, offset: 2752)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !391, file: !392, line: 114, baseType: !261, size: 32, offset: 2784)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !391, file: !392, line: 114, baseType: !261, size: 32, offset: 2816)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !391, file: !392, line: 115, baseType: !149, size: 16, offset: 2848)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !391, file: !392, line: 115, baseType: !149, size: 16, offset: 2864)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !391, file: !392, line: 116, baseType: !149, size: 16, offset: 2880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !391, file: !392, line: 117, baseType: !134, size: 8, offset: 2896)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !391, file: !392, line: 117, baseType: !134, size: 8, offset: 2904)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !391, file: !392, line: 119, baseType: !261, size: 32, offset: 2912)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !391, file: !392, line: 119, baseType: !261, size: 32, offset: 2944)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !391, file: !392, line: 120, baseType: !149, size: 16, offset: 2976)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !391, file: !392, line: 120, baseType: !149, size: 16, offset: 2992)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !391, file: !392, line: 121, baseType: !261, size: 32, offset: 3008)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !391, file: !392, line: 121, baseType: !261, size: 32, offset: 3040)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !391, file: !392, line: 122, baseType: !261, size: 32, offset: 3072)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !391, file: !392, line: 123, baseType: !261, size: 32, offset: 3104)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !391, file: !392, line: 124, baseType: !149, size: 16, offset: 3136)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !391, file: !392, line: 125, baseType: !149, size: 16, offset: 3152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !391, file: !392, line: 127, baseType: !31, size: 32, offset: 3168)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !391, file: !392, line: 127, baseType: !31, size: 32, offset: 3200)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !391, file: !392, line: 128, baseType: !31, size: 32, offset: 3232)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !391, file: !392, line: 128, baseType: !31, size: 32, offset: 3264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !391, file: !392, line: 129, baseType: !149, size: 16, offset: 3296)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !391, file: !392, line: 129, baseType: !149, size: 16, offset: 3312)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !391, file: !392, line: 129, baseType: !149, size: 16, offset: 3328)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !391, file: !392, line: 129, baseType: !149, size: 16, offset: 3344)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !391, file: !392, line: 130, baseType: !261, size: 32, offset: 3360)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !391, file: !392, line: 130, baseType: !261, size: 32, offset: 3392)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !391, file: !392, line: 130, baseType: !261, size: 32, offset: 3424)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !391, file: !392, line: 130, baseType: !261, size: 32, offset: 3456)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !391, file: !392, line: 131, baseType: !261, size: 32, offset: 3488)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !391, file: !392, line: 131, baseType: !261, size: 32, offset: 3520)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !391, file: !392, line: 131, baseType: !261, size: 32, offset: 3552)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !391, file: !392, line: 131, baseType: !261, size: 32, offset: 3584)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !391, file: !392, line: 132, baseType: !261, size: 32, offset: 3616)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !391, file: !392, line: 132, baseType: !261, size: 32, offset: 3648)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !391, file: !392, line: 133, baseType: !133, size: 512, offset: 3680)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !391, file: !392, line: 135, baseType: !261, size: 32, offset: 4192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !391, file: !392, line: 136, baseType: !261, size: 32, offset: 4224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !391, file: !392, line: 137, baseType: !261, size: 32, offset: 4256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !391, file: !392, line: 138, baseType: !31, size: 32, offset: 4288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !391, file: !392, line: 141, baseType: !134, size: 8, offset: 4320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !391, file: !392, line: 141, baseType: !134, size: 8, offset: 4328)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !391, file: !392, line: 141, baseType: !134, size: 8, offset: 4336)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !391, file: !392, line: 141, baseType: !134, size: 8, offset: 4344)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !391, file: !392, line: 142, baseType: !149, size: 16, offset: 4352)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !391, file: !392, line: 142, baseType: !149, size: 16, offset: 4368)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !391, file: !392, line: 142, baseType: !149, size: 16, offset: 4384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !391, file: !392, line: 145, baseType: !134, size: 8, offset: 4400)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !391, file: !392, line: 145, baseType: !134, size: 8, offset: 4408)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !391, file: !392, line: 148, baseType: !149, size: 16, offset: 4416)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !391, file: !392, line: 148, baseType: !149, size: 16, offset: 4432)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !391, file: !392, line: 149, baseType: !261, size: 32, offset: 4448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !391, file: !392, line: 149, baseType: !261, size: 32, offset: 4480)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !391, file: !392, line: 152, baseType: !508, size: 128, offset: 4512)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 128, elements: !144)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !391, file: !392, line: 153, baseType: !261, size: 32, offset: 4640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !391, file: !392, line: 154, baseType: !261, size: 32, offset: 4672)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !391, file: !392, line: 157, baseType: !149, size: 16, offset: 4704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !391, file: !392, line: 157, baseType: !149, size: 16, offset: 4720)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !391, file: !392, line: 160, baseType: !514, size: 64, offset: 4736)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !303, line: 113, size: 6208, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !526}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !515, file: !303, line: 114, baseType: !149, size: 16)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !515, file: !303, line: 114, baseType: !149, size: 16, offset: 16)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !515, file: !303, line: 115, baseType: !134, size: 8, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !515, file: !303, line: 115, baseType: !134, size: 8, offset: 40)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !515, file: !303, line: 116, baseType: !134, size: 8, offset: 48)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !515, file: !303, line: 117, baseType: !523, size: 8, offset: 56)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 8, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 1)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !515, file: !303, line: 119, baseType: !527, size: 6144, offset: 64)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 6144, elements: !537)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !303, line: 109, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !303, line: 106, size: 192, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !529, file: !303, line: 107, baseType: !261, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !529, file: !303, line: 107, baseType: !261, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !529, file: !303, line: 107, baseType: !261, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !529, file: !303, line: 107, baseType: !261, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !529, file: !303, line: 107, baseType: !261, size: 32, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !529, file: !303, line: 108, baseType: !31, size: 32, offset: 160)
!537 = !{!538}
!538 = !DISubrange(count: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !391, file: !392, line: 161, baseType: !514, size: 64, offset: 4800)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !391, file: !392, line: 162, baseType: !134, size: 8, offset: 4864)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !391, file: !392, line: 162, baseType: !134, size: 8, offset: 4872)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !391, file: !392, line: 163, baseType: !134, size: 8, offset: 4880)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !391, file: !392, line: 163, baseType: !134, size: 8, offset: 4888)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !391, file: !392, line: 164, baseType: !149, size: 16, offset: 4896)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !391, file: !392, line: 164, baseType: !149, size: 16, offset: 4912)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !391, file: !392, line: 165, baseType: !261, size: 32, offset: 4928)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !391, file: !392, line: 165, baseType: !261, size: 32, offset: 4960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !391, file: !392, line: 167, baseType: !549, size: 1152, offset: 4992)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 1152, elements: !2208)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !303, line: 57, size: 2496, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !551, file: !303, line: 59, baseType: !149, size: 16)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !551, file: !303, line: 59, baseType: !149, size: 16, offset: 16)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !551, file: !303, line: 59, baseType: !149, size: 16, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !551, file: !303, line: 59, baseType: !149, size: 16, offset: 48)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !551, file: !303, line: 60, baseType: !295, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !551, file: !303, line: 61, baseType: !559, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !303, line: 202, size: 3328, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !2059, !2060, !2061, !2062, !2063, !2089, !2090, !2119, !2139, !2147, !2148}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !560, file: !303, line: 203, baseType: !158, size: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !560, file: !303, line: 204, baseType: !217, size: 64, offset: 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !560, file: !303, line: 206, baseType: !261, size: 32, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !560, file: !303, line: 206, baseType: !261, size: 32, offset: 1056)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !560, file: !303, line: 207, baseType: !261, size: 32, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !560, file: !303, line: 207, baseType: !261, size: 32, offset: 1120)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !560, file: !303, line: 207, baseType: !261, size: 32, offset: 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !560, file: !303, line: 207, baseType: !261, size: 32, offset: 1184)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !560, file: !303, line: 207, baseType: !261, size: 32, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !560, file: !303, line: 207, baseType: !261, size: 32, offset: 1248)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !560, file: !303, line: 208, baseType: !261, size: 32, offset: 1280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !560, file: !303, line: 208, baseType: !261, size: 32, offset: 1312)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !560, file: !303, line: 211, baseType: !261, size: 32, offset: 1344)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !560, file: !303, line: 211, baseType: !261, size: 32, offset: 1376)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !560, file: !303, line: 211, baseType: !261, size: 32, offset: 1408)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !560, file: !303, line: 211, baseType: !261, size: 32, offset: 1440)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !560, file: !303, line: 211, baseType: !261, size: 32, offset: 1472)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !560, file: !303, line: 214, baseType: !261, size: 32, offset: 1504)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !560, file: !303, line: 214, baseType: !261, size: 32, offset: 1536)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !560, file: !303, line: 217, baseType: !261, size: 32, offset: 1568)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !560, file: !303, line: 218, baseType: !261, size: 32, offset: 1600)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !560, file: !303, line: 219, baseType: !261, size: 32, offset: 1632)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !560, file: !303, line: 220, baseType: !261, size: 32, offset: 1664)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !560, file: !303, line: 221, baseType: !261, size: 32, offset: 1696)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !560, file: !303, line: 222, baseType: !149, size: 16, offset: 1728)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !560, file: !303, line: 222, baseType: !149, size: 16, offset: 1744)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !560, file: !303, line: 224, baseType: !149, size: 16, offset: 1760)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !560, file: !303, line: 224, baseType: !149, size: 16, offset: 1776)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !560, file: !303, line: 227, baseType: !149, size: 16, offset: 1792)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !560, file: !303, line: 227, baseType: !149, size: 16, offset: 1808)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !560, file: !303, line: 229, baseType: !149, size: 16, offset: 1824)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !303, line: 229, baseType: !149, size: 16, offset: 1840)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !560, file: !303, line: 230, baseType: !149, size: 16, offset: 1856)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !560, file: !303, line: 230, baseType: !149, size: 16, offset: 1872)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !560, file: !303, line: 232, baseType: !261, size: 32, offset: 1888)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !560, file: !303, line: 232, baseType: !261, size: 32, offset: 1920)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !560, file: !303, line: 232, baseType: !261, size: 32, offset: 1952)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !560, file: !303, line: 232, baseType: !261, size: 32, offset: 1984)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !560, file: !303, line: 233, baseType: !31, size: 32, offset: 2016)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !560, file: !303, line: 234, baseType: !31, size: 32, offset: 2048)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !560, file: !303, line: 235, baseType: !149, size: 16, offset: 2080)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !560, file: !303, line: 235, baseType: !149, size: 16, offset: 2096)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !560, file: !303, line: 236, baseType: !149, size: 16, offset: 2112)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !560, file: !303, line: 239, baseType: !149, size: 16, offset: 2128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !560, file: !303, line: 240, baseType: !31, size: 32, offset: 2144)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !560, file: !303, line: 241, baseType: !31, size: 32, offset: 2176)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !560, file: !303, line: 241, baseType: !31, size: 32, offset: 2208)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !560, file: !303, line: 241, baseType: !31, size: 32, offset: 2240)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !560, file: !303, line: 243, baseType: !261, size: 32, offset: 2272)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !560, file: !303, line: 243, baseType: !261, size: 32, offset: 2304)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !560, file: !303, line: 244, baseType: !261, size: 32, offset: 2336)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !560, file: !303, line: 246, baseType: !614, size: 320, offset: 2368)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !615, line: 50, size: 320, elements: !616)
!615 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!616 = !{!617, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !614, file: !615, line: 51, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !620, line: 1216, size: 39680, elements: !621)
!620 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!621 = !{!622, !623, !624, !625, !1180, !1181, !1182, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1355, !1627, !1630, !1916, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1938, !1939, !1940, !1941, !1942, !1950, !2017, !2024, !2025, !2032, !2033, !2039, !2040, !2041, !2042, !2043}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !619, file: !620, line: 1217, baseType: !158, size: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !619, file: !620, line: 1218, baseType: !217, size: 64, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !619, file: !620, line: 1220, baseType: !295, size: 64, offset: 1024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !619, file: !620, line: 1221, baseType: !626, size: 64, offset: 1088)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !628, line: 52, size: 4224, elements: !629)
!628 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !699, !700, !701, !702, !703, !704, !708, !724}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !627, file: !628, line: 53, baseType: !158, size: 960)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !627, file: !628, line: 54, baseType: !217, size: 64, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !627, file: !628, line: 56, baseType: !149, size: 16, offset: 1024)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !627, file: !628, line: 56, baseType: !149, size: 16, offset: 1040)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !627, file: !628, line: 57, baseType: !149, size: 16, offset: 1056)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !627, file: !628, line: 57, baseType: !149, size: 16, offset: 1072)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !627, file: !628, line: 59, baseType: !261, size: 32, offset: 1088)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !627, file: !628, line: 59, baseType: !261, size: 32, offset: 1120)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !627, file: !628, line: 59, baseType: !261, size: 32, offset: 1152)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !627, file: !628, line: 60, baseType: !261, size: 32, offset: 1184)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !627, file: !628, line: 60, baseType: !261, size: 32, offset: 1216)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !627, file: !628, line: 60, baseType: !261, size: 32, offset: 1248)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !627, file: !628, line: 61, baseType: !261, size: 32, offset: 1280)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !627, file: !628, line: 61, baseType: !261, size: 32, offset: 1312)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !627, file: !628, line: 61, baseType: !261, size: 32, offset: 1344)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !627, file: !628, line: 68, baseType: !261, size: 32, offset: 1376)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !627, file: !628, line: 68, baseType: !261, size: 32, offset: 1408)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !627, file: !628, line: 68, baseType: !261, size: 32, offset: 1440)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !627, file: !628, line: 69, baseType: !261, size: 32, offset: 1472)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !627, file: !628, line: 69, baseType: !261, size: 32, offset: 1504)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !627, file: !628, line: 74, baseType: !261, size: 32, offset: 1536)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !627, file: !628, line: 79, baseType: !261, size: 32, offset: 1568)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !627, file: !628, line: 81, baseType: !149, size: 16, offset: 1600)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !627, file: !628, line: 91, baseType: !149, size: 16, offset: 1616)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !627, file: !628, line: 92, baseType: !149, size: 16, offset: 1632)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !627, file: !628, line: 93, baseType: !149, size: 16, offset: 1648)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !627, file: !628, line: 94, baseType: !149, size: 16, offset: 1664)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !627, file: !628, line: 94, baseType: !149, size: 16, offset: 1680)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !627, file: !628, line: 94, baseType: !149, size: 16, offset: 1696)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !627, file: !628, line: 94, baseType: !149, size: 16, offset: 1712)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !627, file: !628, line: 96, baseType: !261, size: 32, offset: 1728)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !627, file: !628, line: 96, baseType: !261, size: 32, offset: 1760)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !627, file: !628, line: 96, baseType: !261, size: 32, offset: 1792)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !627, file: !628, line: 96, baseType: !261, size: 32, offset: 1824)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !627, file: !628, line: 98, baseType: !261, size: 32, offset: 1856)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !627, file: !628, line: 98, baseType: !261, size: 32, offset: 1888)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !627, file: !628, line: 98, baseType: !261, size: 32, offset: 1920)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !627, file: !628, line: 98, baseType: !261, size: 32, offset: 1952)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !627, file: !628, line: 99, baseType: !261, size: 32, offset: 1984)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !627, file: !628, line: 99, baseType: !261, size: 32, offset: 2016)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !627, file: !628, line: 100, baseType: !261, size: 32, offset: 2048)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !627, file: !628, line: 100, baseType: !261, size: 32, offset: 2080)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !627, file: !628, line: 103, baseType: !149, size: 16, offset: 2112)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !627, file: !628, line: 103, baseType: !149, size: 16, offset: 2128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !627, file: !628, line: 103, baseType: !149, size: 16, offset: 2144)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !627, file: !628, line: 103, baseType: !149, size: 16, offset: 2160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !627, file: !628, line: 106, baseType: !261, size: 32, offset: 2176)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !627, file: !628, line: 106, baseType: !261, size: 32, offset: 2208)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !627, file: !628, line: 106, baseType: !261, size: 32, offset: 2240)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !627, file: !628, line: 106, baseType: !261, size: 32, offset: 2272)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !627, file: !628, line: 107, baseType: !149, size: 16, offset: 2304)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !627, file: !628, line: 107, baseType: !149, size: 16, offset: 2320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !627, file: !628, line: 107, baseType: !149, size: 16, offset: 2336)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !627, file: !628, line: 107, baseType: !149, size: 16, offset: 2352)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !627, file: !628, line: 108, baseType: !261, size: 32, offset: 2368)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !627, file: !628, line: 108, baseType: !261, size: 32, offset: 2400)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !627, file: !628, line: 109, baseType: !261, size: 32, offset: 2432)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !627, file: !628, line: 109, baseType: !261, size: 32, offset: 2464)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !627, file: !628, line: 110, baseType: !261, size: 32, offset: 2496)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !627, file: !628, line: 110, baseType: !261, size: 32, offset: 2528)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !627, file: !628, line: 110, baseType: !261, size: 32, offset: 2560)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !627, file: !628, line: 111, baseType: !149, size: 16, offset: 2592)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !627, file: !628, line: 111, baseType: !149, size: 16, offset: 2608)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !627, file: !628, line: 112, baseType: !149, size: 16, offset: 2624)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !627, file: !628, line: 112, baseType: !149, size: 16, offset: 2640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !627, file: !628, line: 112, baseType: !149, size: 16, offset: 2656)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !627, file: !628, line: 115, baseType: !149, size: 16, offset: 2672)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !627, file: !628, line: 118, baseType: !698, size: 64, offset: 2688)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !627, file: !628, line: 118, baseType: !698, size: 64, offset: 2752)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !627, file: !628, line: 121, baseType: !301, size: 64, offset: 2816)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !627, file: !628, line: 122, baseType: !549, size: 1152, offset: 2880)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !627, file: !628, line: 123, baseType: !149, size: 16, offset: 4032)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !627, file: !628, line: 123, baseType: !149, size: 16, offset: 4048)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !627, file: !628, line: 123, baseType: !705, size: 32, offset: 4064)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 32, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 2)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !627, file: !628, line: 126, baseType: !709, size: 64, offset: 4096)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !159, line: 159, size: 448, elements: !711)
!711 = !{!712, !714, !715, !716, !717, !720}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !710, file: !159, line: 161, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !706)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !710, file: !159, line: 162, baseType: !713, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !710, file: !159, line: 163, baseType: !705, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !710, file: !159, line: 164, baseType: !705, size: 32, offset: 160)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !710, file: !159, line: 165, baseType: !718, size: 128, offset: 192)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 128, elements: !706)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !710, file: !159, line: 166, baseType: !721, size: 128, offset: 320)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 128, elements: !706)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !159, line: 46, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !627, file: !628, line: 129, baseType: !725, size: 64, offset: 4160)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !727, line: 328, size: 3456, elements: !728)
!727 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!728 = !{!729, !730, !731, !1128, !1129, !1130, !1131, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1158, !1159, !1160, !1163, !1167, !1171, !1175, !1176, !1177, !1178, !1179}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !726, file: !727, line: 329, baseType: !158, size: 960)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !726, file: !727, line: 330, baseType: !217, size: 64, offset: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !726, file: !727, line: 332, baseType: !732, size: 64, offset: 1024)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !734, line: 283, size: 4096, elements: !735)
!734 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!735 = !{!736, !737, !738, !739, !743, !744, !748, !1097, !1105, !1109, !1115, !1119, !1120, !1121, !1122, !1126, !1127}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !733, file: !734, line: 284, baseType: !31, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !733, file: !734, line: 285, baseType: !133, size: 512, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !733, file: !734, line: 287, baseType: !133, size: 512, offset: 544)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !733, file: !734, line: 288, baseType: !740, size: 2048, offset: 1056)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 2048, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !733, file: !734, line: 289, baseType: !31, size: 32, offset: 3104)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !733, file: !734, line: 292, baseType: !745, size: 64, offset: 3136)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !725}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !733, file: !734, line: 293, baseType: !749, size: 64, offset: 3200)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !725, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !727, line: 167, size: 3712, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1089, !1090, !1091, !1092, !1093, !1094}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !727, line: 168, baseType: !752, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !753, file: !727, line: 168, baseType: !752, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !753, file: !727, line: 168, baseType: !752, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !753, file: !727, line: 170, baseType: !194, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !753, file: !727, line: 172, baseType: !760, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !734, line: 144, size: 6016, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !939, !940, !941, !956, !960, !964, !965, !972, !976, !980, !981, !982, !983, !987, !988, !992, !996, !1000, !1004, !1008, !1012, !1016, !1017, !1024, !1026, !1035, !1044}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !761, file: !734, line: 145, baseType: !115, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !761, file: !734, line: 145, baseType: !115, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !761, file: !734, line: 146, baseType: !149, size: 16, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !761, file: !734, line: 148, baseType: !133, size: 512, offset: 144)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !761, file: !734, line: 149, baseType: !31, size: 32, offset: 672)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !761, file: !734, line: 151, baseType: !133, size: 512, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !761, file: !734, line: 152, baseType: !740, size: 2048, offset: 1216)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !761, file: !734, line: 153, baseType: !31, size: 32, offset: 3264)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !761, file: !734, line: 155, baseType: !261, size: 32, offset: 3296)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !761, file: !734, line: 155, baseType: !261, size: 32, offset: 3328)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !761, file: !734, line: 155, baseType: !261, size: 32, offset: 3360)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !761, file: !734, line: 156, baseType: !261, size: 32, offset: 3392)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !761, file: !734, line: 156, baseType: !261, size: 32, offset: 3424)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !761, file: !734, line: 156, baseType: !261, size: 32, offset: 3456)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !761, file: !734, line: 157, baseType: !149, size: 16, offset: 3488)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !761, file: !734, line: 157, baseType: !149, size: 16, offset: 3504)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !761, file: !734, line: 157, baseType: !149, size: 16, offset: 3520)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !761, file: !734, line: 160, baseType: !781, size: 64, offset: 3584)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !734, line: 109, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !734, line: 98, size: 1408, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !938}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !783, file: !734, line: 99, baseType: !31, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !783, file: !734, line: 99, baseType: !31, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !783, file: !734, line: 100, baseType: !133, size: 512, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !783, file: !734, line: 101, baseType: !261, size: 32, offset: 576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !783, file: !734, line: 101, baseType: !261, size: 32, offset: 608)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !783, file: !734, line: 101, baseType: !261, size: 32, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !783, file: !734, line: 101, baseType: !261, size: 32, offset: 672)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !783, file: !734, line: 102, baseType: !261, size: 32, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !783, file: !734, line: 102, baseType: !261, size: 32, offset: 736)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !783, file: !734, line: 103, baseType: !31, size: 32, offset: 768)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !783, file: !734, line: 104, baseType: !31, size: 32, offset: 800)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !783, file: !734, line: 107, baseType: !797, size: 64, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !727, line: 87, size: 2816, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !923}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !798, file: !727, line: 88, baseType: !797, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !798, file: !727, line: 88, baseType: !797, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !798, file: !727, line: 88, baseType: !797, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !798, file: !727, line: 90, baseType: !194, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !798, file: !727, line: 92, baseType: !133, size: 512, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !727, line: 94, baseType: !133, size: 512, offset: 768)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !798, file: !727, line: 99, baseType: !115, size: 64, offset: 1280)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !798, file: !727, line: 101, baseType: !149, size: 16, offset: 1344)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !798, file: !727, line: 101, baseType: !149, size: 16, offset: 1360)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !798, file: !727, line: 102, baseType: !149, size: 16, offset: 1376)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !798, file: !727, line: 103, baseType: !149, size: 16, offset: 1392)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !798, file: !727, line: 104, baseType: !812, size: 64, offset: 1408)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !734, line: 114, size: 1600, elements: !814)
!814 = !{!815, !816, !839, !843, !847, !851, !855, !859, !860, !864, !893, !894, !895}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !813, file: !734, line: 115, baseType: !133, size: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !813, file: !734, line: 117, baseType: !817, size: 64, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !820, !823, !825, !825, !837}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !822, line: 40, flags: DIFlagFwdDecl)
!822 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_animsys.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !734, line: 73, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !827, line: 55, size: 192, elements: !828)
!827 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!828 = !{!829, !833, !836}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !826, file: !827, line: 58, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !826, file: !827, line: 56, size: 64, elements: !831)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !830, file: !827, line: 57, baseType: !115, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !826, file: !827, line: 60, baseType: !834, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !727, line: 335, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !826, file: !827, line: 61, baseType: !115, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !813, file: !734, line: 118, baseType: !840, size: 64, offset: 576)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !820, !825, !825, !698}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !813, file: !734, line: 120, baseType: !844, size: 64, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !820, !823, !825}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !813, file: !734, line: 121, baseType: !848, size: 64, offset: 704)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !820, !825, !698}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !813, file: !734, line: 122, baseType: !852, size: 64, offset: 768)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !725, !797, !834}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !813, file: !734, line: 123, baseType: !856, size: 64, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !725, !797, !752, !797, !837}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !813, file: !734, line: 124, baseType: !856, size: 64, offset: 896)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !813, file: !734, line: 125, baseType: !861, size: 64, offset: 960)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !725, !797, !752, !797}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !813, file: !734, line: 128, baseType: !865, size: 256, offset: 1024)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !827, line: 436, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !827, line: 430, size: 256, elements: !867)
!867 = !{!868, !869, !872, !888}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !866, file: !827, line: 431, baseType: !115, size: 64)
