; ModuleID = 'blender/source/blender/editors/interface/interface_anim.c'
source_filename = "blender/source/blender/editors/interface/interface_anim.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.uiBut = type { %struct.uiBut*, %struct.uiBut*, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8*, [128 x i8], [400 x i8], %struct.rctf, i8*, float, float, float, float, float, float, [4 x i8], void (%struct.bContext*, i8*, i8*)*, i8*, i8*, void (%struct.bContext*, i8*, i8*)*, i8*, %struct.bContextStore*, i32 (%struct.bContext*, i8*, i8*)*, i8*, void (%struct.bContext*, i8*, i8*, %struct.uiSearchItems*)*, i8*, void (%struct.bContext*, i8*, i8*)*, i8*, i8*, %struct.uiLink*, [2 x i16], i8*, i8*, i32, i8, i8, i8, i8, i8, i16, i16, %struct.uiBlock* (%struct.bContext*, %struct.ARegion*, i8*)*, void (%struct.bContext*, %struct.uiLayout*, i8*)*, %struct.PointerRNA, %struct.PropertyRNA*, i32, %struct.PointerRNA, %struct.PropertyRNA*, %struct.wmOperatorType*, %struct.PointerRNA*, i16, i8, i8, i8*, %struct.ImBuf*, float, %struct.uiHandleButtonData*, i8*, i8*, double*, float*, i8*, i8*, %struct.uiBlock* }

!936 = !DIEnumerator(name: "UI_BUT_COLOR_CUBIC", value: 8388608, isUnsigned: true)
!937 = !DIEnumerator(name: "UI_BUT_LIST_ITEM", value: 16777216, isUnsigned: true)
!938 = !DIEnumerator(name: "UI_BUT_DRAG_MULTI", value: 33554432, isUnsigned: true)
!939 = !DIEnumerator(name: "UI_BUT_SCA_LINK_GREY", value: 67108864, isUnsigned: true)
!940 = !DIEnumerator(name: "UI_BUT_HAS_SEP_CHAR", value: 134217728, isUnsigned: true)
!941 = !DIEnumerator(name: "UI_BUT_TIP_FORCE", value: 268435456, isUnsigned: true)
!942 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriver_Types", file: !943, line: 389, baseType: !5, size: 32, elements: !944)
!943 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!944 = !{!945, !946, !947, !948, !949}
!945 = !DIEnumerator(name: "DRIVER_TYPE_AVERAGE", value: 0, isUnsigned: true)
!946 = !DIEnumerator(name: "DRIVER_TYPE_PYTHON", value: 1, isUnsigned: true)
!947 = !DIEnumerator(name: "DRIVER_TYPE_SUM", value: 2, isUnsigned: true)
!948 = !DIEnumerator(name: "DRIVER_TYPE_MIN", value: 3, isUnsigned: true)
!949 = !DIEnumerator(name: "DRIVER_TYPE_MAX", value: 4, isUnsigned: true)
!950 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriver_Flags", file: !943, line: 403, baseType: !5, size: 32, elements: !951)
!951 = !{!952, !953, !954, !955, !956}
!952 = !DIEnumerator(name: "DRIVER_FLAG_INVALID", value: 1, isUnsigned: true)
!953 = !DIEnumerator(name: "DRIVER_FLAG_RECALC", value: 2, isUnsigned: true)
!954 = !DIEnumerator(name: "DRIVER_FLAG_RECOMPILE", value: 8, isUnsigned: true)
!955 = !DIEnumerator(name: "DRIVER_FLAG_RENAMEVAR", value: 16, isUnsigned: true)
!956 = !DIEnumerator(name: "DRIVER_FLAG_SHOWDEBUG", value: 32, isUnsigned: true)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFCurve_Flags", file: !943, line: 467, baseType: !5, size: 32, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !968}
!959 = !DIEnumerator(name: "FCURVE_VISIBLE", value: 1, isUnsigned: true)
!960 = !DIEnumerator(name: "FCURVE_SELECTED", value: 2, isUnsigned: true)
!961 = !DIEnumerator(name: "FCURVE_ACTIVE", value: 4, isUnsigned: true)
!962 = !DIEnumerator(name: "FCURVE_PROTECTED", value: 8, isUnsigned: true)
!963 = !DIEnumerator(name: "FCURVE_MUTED", value: 16, isUnsigned: true)
!964 = !DIEnumerator(name: "FCURVE_AUTO_HANDLES", value: 32, isUnsigned: true)
!965 = !DIEnumerator(name: "FCURVE_DISABLED", value: 1024, isUnsigned: true)
!966 = !DIEnumerator(name: "FCURVE_INT_VALUES", value: 2048, isUnsigned: true)
!967 = !DIEnumerator(name: "FCURVE_DISCRETE_VALUES", value: 4096, isUnsigned: true)
!968 = !DIEnumerator(name: "FCURVE_TAGGED", value: 32768, isUnsigned: true)
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !970, line: 123, baseType: !5, size: 32, elements: !971)
!970 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979, !980}
!972 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!973 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!974 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!975 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!976 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!977 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!978 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!979 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!980 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!981 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !982, line: 141, baseType: !5, size: 32, elements: !983)
!982 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995}
!984 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!985 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!986 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!987 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!988 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!989 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!990 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!991 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!992 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!993 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!994 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!995 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!996 = !{!997, !998, !1068, !1069}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1000, line: 130, baseType: !1001)
!1000 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1000, line: 117, size: 960, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1007, !1026, !1030, !1032, !1034, !1035, !1036}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1001, file: !1000, line: 118, baseType: !997, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1001, file: !1000, line: 118, baseType: !997, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1001, file: !1000, line: 119, baseType: !1006, size: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1001, file: !1000, line: 120, baseType: !1008, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1000, line: 136, size: 17600, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1016, !1021, !1022, !1023}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1009, file: !1000, line: 137, baseType: !999, size: 960)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1009, file: !1000, line: 138, baseType: !998, size: 64, offset: 960)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1009, file: !1000, line: 139, baseType: !1014, size: 64, offset: 1024)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1000, line: 43, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1009, file: !1000, line: 140, baseType: !1017, size: 8192, offset: 1088)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 8192, elements: !1019)
!1018 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1019 = !{!1020}
!1020 = !DISubrange(count: 1024)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1009, file: !1000, line: 141, baseType: !1017, size: 8192, offset: 9280)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1009, file: !1000, line: 148, baseType: !1008, size: 64, offset: 17472)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1009, file: !1000, line: 150, baseType: !1024, size: 64, offset: 17536)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1000, line: 45, flags: DIFlagFwdDecl)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1001, file: !1000, line: 121, baseType: !1027, size: 528, offset: 256)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 528, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 66)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1001, file: !1000, line: 126, baseType: !1031, size: 16, offset: 784)
!1031 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1001, file: !1000, line: 127, baseType: !1033, size: 32, offset: 800)
!1033 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1001, file: !1000, line: 128, baseType: !1033, size: 32, offset: 832)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1001, file: !1000, line: 128, baseType: !1033, size: 32, offset: 864)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1001, file: !1000, line: 129, baseType: !1037, size: 64, offset: 896)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1000, line: 75, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1000, line: 62, size: 1024, elements: !1040)
!1040 = !{!1041, !1043, !1044, !1045, !1046, !1047, !1051, !1052, !1066, !1067}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1039, file: !1000, line: 63, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1039, file: !1000, line: 63, baseType: !1042, size: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1039, file: !1000, line: 64, baseType: !1018, size: 8, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1039, file: !1000, line: 64, baseType: !1018, size: 8, offset: 136)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1039, file: !1000, line: 65, baseType: !1031, size: 16, offset: 144)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !1000, line: 66, baseType: !1048, size: 512, offset: 160)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 512, elements: !1049)
!1049 = !{!1050}
!1050 = !DISubrange(count: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1039, file: !1000, line: 67, baseType: !1033, size: 32, offset: 672)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1039, file: !1000, line: 69, baseType: !1053, size: 256, offset: 704)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1000, line: 60, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1000, line: 48, size: 256, elements: !1055)
!1055 = !{!1056, !1057, !1064, !1065}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1054, file: !1000, line: 49, baseType: !997, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1054, file: !1000, line: 58, baseType: !1058, size: 128, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1059, line: 71, baseType: !1060)
!1059 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1059, line: 69, size: 128, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1060, file: !1059, line: 70, baseType: !997, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1060, file: !1059, line: 70, baseType: !997, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1054, file: !1000, line: 59, baseType: !1033, size: 32, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1054, file: !1000, line: 59, baseType: !1033, size: 32, offset: 224)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1039, file: !1000, line: 70, baseType: !1033, size: 32, offset: 960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1039, file: !1000, line: 74, baseType: !1033, size: 32, offset: 992)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1070 = !{i32 7, !"Dwarf Version", i32 4}
!1071 = !{i32 2, !"Debug Info Version", i32 3}
!1072 = !{i32 1, !"wchar_size", i32 4}
!1073 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1074 = distinct !DISubprogram(name: "ui_but_anim_flag", scope: !1, file: !1, line: 67, type: !1075, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2624)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !1077, !1115}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBut", file: !4, line: 82, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBut", file: !1080, line: 195, size: 8000, elements: !1081)
!1080 = !DIFile(filename: "blender/source/blender/editors/interface/interface_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1081 = !{!1082, !1084, !1085, !1086, !1087, !1089, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1105, !1109, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1131, !1139, !1140, !1141, !1143, !1144, !1153, !1158, !1159, !1171, !1172, !1177, !1178, !1179, !1194, !1198, !1199, !1200, !1202, !1203, !1204, !1206, !1207, !1208, !1209, !1210, !2592, !2597, !2598, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609, !2612, !2613, !2616, !2617, !2618, !2620, !2621, !2622, !2623}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1079, file: !1080, line: 196, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1079, file: !1080, line: 196, baseType: !1083, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1079, file: !1080, line: 197, baseType: !1033, size: 32, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !1079, file: !1080, line: 197, baseType: !1033, size: 32, offset: 160)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1079, file: !1080, line: 198, baseType: !1088, size: 32, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "eButType", file: !4, line: 282, baseType: !3)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pointype", scope: !1079, file: !1080, line: 199, baseType: !1090, size: 32, offset: 224)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "eButPointerType", file: !4, line: 230, baseType: !51)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !1079, file: !1080, line: 200, baseType: !1031, size: 16, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "bitnr", scope: !1079, file: !1080, line: 200, baseType: !1031, size: 16, offset: 272)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !1079, file: !1080, line: 200, baseType: !1031, size: 16, offset: 288)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "strwidth", scope: !1079, file: !1080, line: 200, baseType: !1031, size: 16, offset: 304)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !1079, file: !1080, line: 200, baseType: !1031, size: 16, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !1079, file: !1080, line: 201, baseType: !1031, size: 16, offset: 336)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1079, file: !1080, line: 201, baseType: !1031, size: 16, offset: 352)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "selsta", scope: !1079, file: !1080, line: 201, baseType: !1031, size: 16, offset: 368)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "selend", scope: !1079, file: !1080, line: 201, baseType: !1031, size: 16, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1079, file: !1080, line: 203, baseType: !1068, size: 64, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "strdata", scope: !1079, file: !1080, line: 204, baseType: !1102, size: 1024, offset: 512)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 1024, elements: !1103)
!1103 = !{!1104}
!1104 = !DISubrange(count: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "drawstr", scope: !1079, file: !1080, line: 205, baseType: !1106, size: 3200, offset: 1536)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 3200, elements: !1107)
!1107 = !{!1108}
!1108 = !DISubrange(count: 400)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1079, file: !1080, line: 207, baseType: !1110, size: 128, offset: 4736)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1111, line: 95, baseType: !1112)
!1111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1111, line: 92, size: 128, elements: !1113)
!1113 = !{!1114, !1116, !1117, !1118}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1112, file: !1111, line: 93, baseType: !1115, size: 32)
!1115 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1112, file: !1111, line: 93, baseType: !1115, size: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1112, file: !1111, line: 94, baseType: !1115, size: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1112, file: !1111, line: 94, baseType: !1115, size: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !1079, file: !1080, line: 209, baseType: !1068, size: 64, offset: 4864)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "hardmin", scope: !1079, file: !1080, line: 210, baseType: !1115, size: 32, offset: 4928)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "hardmax", scope: !1079, file: !1080, line: 210, baseType: !1115, size: 32, offset: 4960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "softmin", scope: !1079, file: !1080, line: 210, baseType: !1115, size: 32, offset: 4992)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "softmax", scope: !1079, file: !1080, line: 210, baseType: !1115, size: 32, offset: 5024)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !1079, file: !1080, line: 222, baseType: !1115, size: 32, offset: 5056)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !1079, file: !1080, line: 230, baseType: !1115, size: 32, offset: 5088)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1079, file: !1080, line: 232, baseType: !1127, size: 32, offset: 5120)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 32, elements: !1129)
!1128 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1129 = !{!1130}
!1130 = !DISubrange(count: 4)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1079, file: !1080, line: 234, baseType: !1132, size: 64, offset: 5184)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleFunc", file: !4, line: 336, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !1136, !997, !997}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1138, line: 44, flags: DIFlagFwdDecl)
!1138 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !1079, file: !1080, line: 235, baseType: !997, size: 64, offset: 5248)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !1079, file: !1080, line: 236, baseType: !997, size: 64, offset: 5312)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !1079, file: !1080, line: 238, baseType: !1142, size: 64, offset: 5376)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleNFunc", file: !4, line: 338, baseType: !1133)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !1079, file: !1080, line: 239, baseType: !997, size: 64, offset: 5440)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1079, file: !1080, line: 241, baseType: !1145, size: 64, offset: 5504)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bContextStore", file: !1147, line: 84, size: 320, elements: !1148)
!1147 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1148 = !{!1149, !1150, !1151, !1152}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1146, file: !1147, line: 85, baseType: !1145, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1146, file: !1147, line: 85, baseType: !1145, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1146, file: !1147, line: 87, baseType: !1058, size: 128, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1146, file: !1147, line: 88, baseType: !1128, size: 8, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "autocomplete_func", scope: !1079, file: !1080, line: 243, baseType: !1154, size: 64, offset: 5568)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButCompleteFunc", file: !4, line: 339, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!1033, !1136, !1068, !997}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "autofunc_arg", scope: !1079, file: !1080, line: 244, baseType: !997, size: 64, offset: 5632)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "search_func", scope: !1079, file: !1080, line: 246, baseType: !1160, size: 64, offset: 5696)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButSearchFunc", file: !4, line: 340, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{null, !1164, !997, !1166, !1168}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1137)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiSearchItems", file: !4, line: 334, baseType: !1170)
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiSearchItems", file: !4, line: 334, flags: DIFlagFwdDecl)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "search_arg", scope: !1079, file: !1080, line: 247, baseType: !997, size: 64, offset: 5760)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "rename_func", scope: !1079, file: !1080, line: 249, baseType: !1173, size: 64, offset: 5824)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleRenameFunc", file: !4, line: 337, baseType: !1174)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{null, !1136, !997, !1068}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "rename_arg1", scope: !1079, file: !1080, line: 250, baseType: !997, size: 64, offset: 5888)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rename_orig", scope: !1079, file: !1080, line: 251, baseType: !997, size: 64, offset: 5952)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1079, file: !1080, line: 253, baseType: !1180, size: 64, offset: 6016)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiLink", file: !1080, line: 193, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1080, line: 184, size: 384, elements: !1183)
!1183 = !{!1184, !1186, !1188, !1189, !1190, !1191, !1192, !1193}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !1182, file: !1080, line: 185, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "ppoin", scope: !1182, file: !1080, line: 186, baseType: !1187, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "totlink", scope: !1182, file: !1080, line: 187, baseType: !1069, size: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !1182, file: !1080, line: 189, baseType: !1031, size: 16, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1182, file: !1080, line: 189, baseType: !1031, size: 16, offset: 208)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "fromcode", scope: !1182, file: !1080, line: 190, baseType: !1031, size: 16, offset: 224)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "tocode", scope: !1182, file: !1080, line: 190, baseType: !1031, size: 16, offset: 240)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !1182, file: !1080, line: 192, baseType: !1058, size: 128, offset: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "linkto", scope: !1079, file: !1080, line: 254, baseType: !1195, size: 32, offset: 6080)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1031, size: 32, elements: !1196)
!1196 = !{!1197}
!1197 = !DISubrange(count: 2)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "tip", scope: !1079, file: !1080, line: 256, baseType: !1166, size: 64, offset: 6144)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !1079, file: !1080, line: 256, baseType: !1166, size: 64, offset: 6208)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !1079, file: !1080, line: 258, baseType: !1201, size: 32, offset: 6272)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIFIconID", file: !59, line: 44, baseType: !58)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1079, file: !1080, line: 259, baseType: !1128, size: 8, offset: 6304)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1079, file: !1080, line: 260, baseType: !1018, size: 8, offset: 6312)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pie_dir", scope: !1079, file: !1080, line: 261, baseType: !1205, size: 8, offset: 6320)
!1205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1079, file: !1080, line: 262, baseType: !1018, size: 8, offset: 6328)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "unit_type", scope: !1079, file: !1080, line: 263, baseType: !1128, size: 8, offset: 6336)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "modifier_key", scope: !1079, file: !1080, line: 264, baseType: !1031, size: 16, offset: 6352)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "iconadd", scope: !1079, file: !1080, line: 265, baseType: !1031, size: 16, offset: 6368)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "block_create_func", scope: !1079, file: !1080, line: 268, baseType: !1211, size: 64, offset: 6400)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockCreateFunc", file: !4, line: 380, baseType: !1212)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!1215, !1136, !1373, !997}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlock", file: !4, line: 83, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !1080, line: 320, size: 5440, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1275, !1276, !1278, !1279, !1330, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !2574, !2575, !2576, !2578, !2579, !2580, !2581}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1217, file: !1080, line: 321, baseType: !1215, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1217, file: !1080, line: 321, baseType: !1215, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buttons", scope: !1217, file: !1080, line: 323, baseType: !1058, size: 128, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "panel", scope: !1217, file: !1080, line: 324, baseType: !1223, size: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Panel", file: !1225, line: 113, baseType: !1226)
!1225 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Panel", file: !1225, line: 97, size: 2176, elements: !1227)
!1227 = !{!1228, !1230, !1231, !1234, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1226, file: !1225, line: 98, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1226, file: !1225, line: 98, baseType: !1229, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1226, file: !1225, line: 100, baseType: !1232, size: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanelType", file: !1225, line: 43, flags: DIFlagFwdDecl)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1226, file: !1225, line: 101, baseType: !1235, size: 64, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !1225, line: 46, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "panelname", scope: !1226, file: !1225, line: 103, baseType: !1048, size: 512, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "tabname", scope: !1226, file: !1225, line: 103, baseType: !1048, size: 512, offset: 768)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "drawname", scope: !1226, file: !1225, line: 104, baseType: !1048, size: 512, offset: 1280)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ofsx", scope: !1226, file: !1225, line: 105, baseType: !1033, size: 32, offset: 1792)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ofsy", scope: !1226, file: !1225, line: 105, baseType: !1033, size: 32, offset: 1824)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1226, file: !1225, line: 105, baseType: !1033, size: 32, offset: 1856)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1226, file: !1225, line: 105, baseType: !1033, size: 32, offset: 1888)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "labelofs", scope: !1226, file: !1225, line: 106, baseType: !1031, size: 16, offset: 1920)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1226, file: !1225, line: 106, baseType: !1031, size: 16, offset: 1936)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1226, file: !1225, line: 107, baseType: !1031, size: 16, offset: 1952)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_flag", scope: !1226, file: !1225, line: 107, baseType: !1031, size: 16, offset: 1968)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1226, file: !1225, line: 108, baseType: !1031, size: 16, offset: 1984)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "snap", scope: !1226, file: !1225, line: 109, baseType: !1031, size: 16, offset: 2000)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "sortorder", scope: !1226, file: !1225, line: 110, baseType: !1033, size: 32, offset: 2016)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "paneltab", scope: !1226, file: !1225, line: 111, baseType: !1229, size: 64, offset: 2048)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "activedata", scope: !1226, file: !1225, line: 112, baseType: !997, size: 64, offset: 2112)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "oldblock", scope: !1217, file: !1080, line: 325, baseType: !1215, size: 64, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "butstore", scope: !1217, file: !1080, line: 327, baseType: !1058, size: 128, offset: 384)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "layouts", scope: !1217, file: !1080, line: 329, baseType: !1058, size: 128, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "curlayout", scope: !1217, file: !1080, line: 330, baseType: !1235, size: 64, offset: 640)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "contexts", scope: !1217, file: !1080, line: 332, baseType: !1058, size: 128, offset: 704)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1217, file: !1080, line: 334, baseType: !1102, size: 1024, offset: 832)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !1217, file: !1080, line: 336, baseType: !1260, size: 512, offset: 1856)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 512, elements: !1261)
!1261 = !{!1130, !1130}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1217, file: !1080, line: 338, baseType: !1110, size: 128, offset: 2368)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !1217, file: !1080, line: 339, baseType: !1115, size: 32, offset: 2496)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "puphash", scope: !1217, file: !1080, line: 341, baseType: !5, size: 32, offset: 2528)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1217, file: !1080, line: 343, baseType: !1132, size: 64, offset: 2560)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !1217, file: !1080, line: 344, baseType: !997, size: 64, offset: 2624)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !1217, file: !1080, line: 345, baseType: !997, size: 64, offset: 2688)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !1217, file: !1080, line: 347, baseType: !1142, size: 64, offset: 2752)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !1217, file: !1080, line: 348, baseType: !997, size: 64, offset: 2816)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func", scope: !1217, file: !1080, line: 350, baseType: !1271, size: 64, offset: 2880)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiMenuHandleFunc", file: !4, line: 346, baseType: !1272)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{null, !1136, !997, !1033}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func_arg", scope: !1217, file: !1080, line: 351, baseType: !997, size: 64, offset: 2944)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func", scope: !1217, file: !1080, line: 353, baseType: !1277, size: 64, offset: 3008)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockHandleFunc", file: !4, line: 341, baseType: !1272)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func_arg", scope: !1217, file: !1080, line: 354, baseType: !997, size: 64, offset: 3072)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "block_event_func", scope: !1217, file: !1080, line: 357, baseType: !1280, size: 64, offset: 3136)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!1033, !1164, !1283, !1284}
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !982, line: 421, size: 960, elements: !1287)
!1287 = !{!1288, !1290, !1291, !1292, !1293, !1294, !1295, !1297, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1326, !1327, !1328, !1329}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1286, file: !982, line: 422, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1286, file: !982, line: 422, baseType: !1289, size: 64, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1286, file: !982, line: 424, baseType: !1031, size: 16, offset: 128)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1286, file: !982, line: 425, baseType: !1031, size: 16, offset: 144)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1286, file: !982, line: 426, baseType: !1033, size: 32, offset: 160)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1286, file: !982, line: 426, baseType: !1033, size: 32, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !1286, file: !982, line: 427, baseType: !1296, size: 64, offset: 224)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 64, elements: !1196)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !1286, file: !982, line: 428, baseType: !1298, size: 48, offset: 288)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 48, elements: !1299)
!1299 = !{!1300}
!1300 = !DISubrange(count: 6)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !1286, file: !982, line: 431, baseType: !1018, size: 8, offset: 336)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1286, file: !982, line: 432, baseType: !1018, size: 8, offset: 344)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !1286, file: !982, line: 435, baseType: !1031, size: 16, offset: 352)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !1286, file: !982, line: 436, baseType: !1031, size: 16, offset: 368)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !1286, file: !982, line: 437, baseType: !1033, size: 32, offset: 384)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !1286, file: !982, line: 437, baseType: !1033, size: 32, offset: 416)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !1286, file: !982, line: 438, baseType: !1308, size: 64, offset: 448)
!1308 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !1286, file: !982, line: 439, baseType: !1033, size: 32, offset: 512)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !1286, file: !982, line: 439, baseType: !1033, size: 32, offset: 544)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1286, file: !982, line: 442, baseType: !1031, size: 16, offset: 576)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !1286, file: !982, line: 442, baseType: !1031, size: 16, offset: 592)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1286, file: !982, line: 442, baseType: !1031, size: 16, offset: 608)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !1286, file: !982, line: 442, baseType: !1031, size: 16, offset: 624)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !1286, file: !982, line: 443, baseType: !1031, size: 16, offset: 640)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !1286, file: !982, line: 446, baseType: !1031, size: 16, offset: 656)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !1286, file: !982, line: 449, baseType: !1166, size: 64, offset: 704)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !1286, file: !982, line: 452, baseType: !1319, size: 64, offset: 768)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !982, line: 463, size: 128, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1320, file: !982, line: 464, baseType: !1033, size: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1320, file: !982, line: 465, baseType: !1115, size: 32, offset: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1320, file: !982, line: 466, baseType: !1115, size: 32, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1320, file: !982, line: 467, baseType: !1115, size: 32, offset: 96)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !1286, file: !982, line: 455, baseType: !1031, size: 16, offset: 832)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !1286, file: !982, line: 456, baseType: !1031, size: 16, offset: 848)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1286, file: !982, line: 457, baseType: !1033, size: 32, offset: 864)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1286, file: !982, line: 458, baseType: !997, size: 64, offset: 896)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra", scope: !1217, file: !1080, line: 360, baseType: !1331, size: 64, offset: 3200)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{null, !1164, !997, !997, !997, !1334}
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1111, line: 89, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1111, line: 86, size: 128, elements: !1337)
!1337 = !{!1338, !1339, !1340, !1341}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1336, file: !1111, line: 87, baseType: !1033, size: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1336, file: !1111, line: 87, baseType: !1033, size: 32, offset: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1336, file: !1111, line: 88, baseType: !1033, size: 32, offset: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1336, file: !1111, line: 88, baseType: !1033, size: 32, offset: 96)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg1", scope: !1217, file: !1080, line: 361, baseType: !997, size: 64, offset: 3264)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg2", scope: !1217, file: !1080, line: 362, baseType: !997, size: 64, offset: 3328)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1217, file: !1080, line: 364, baseType: !1033, size: 32, offset: 3392)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !1217, file: !1080, line: 365, baseType: !1031, size: 16, offset: 3424)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1217, file: !1080, line: 367, baseType: !1018, size: 8, offset: 3440)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1217, file: !1080, line: 368, baseType: !1018, size: 8, offset: 3448)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open", scope: !1217, file: !1080, line: 369, baseType: !1128, size: 8, offset: 3456)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1217, file: !1080, line: 370, baseType: !1350, size: 56, offset: 3464)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 56, elements: !1351)
!1351 = !{!1352}
!1352 = !DISubrange(count: 7)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open_last", scope: !1217, file: !1080, line: 371, baseType: !1308, size: 64, offset: 3520)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !1217, file: !1080, line: 373, baseType: !1166, size: 64, offset: 3584)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1217, file: !1080, line: 375, baseType: !1018, size: 8, offset: 3648)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1217, file: !1080, line: 376, baseType: !1018, size: 8, offset: 3656)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "tooltipdisabled", scope: !1217, file: !1080, line: 377, baseType: !1018, size: 8, offset: 3664)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "endblock", scope: !1217, file: !1080, line: 378, baseType: !1018, size: 8, offset: 3672)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "bounds_type", scope: !1217, file: !1080, line: 380, baseType: !1360, size: 32, offset: 3680)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBlockBoundsCalc", file: !4, line: 434, baseType: !908)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !1217, file: !1080, line: 381, baseType: !1033, size: 32, offset: 3712)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "my", scope: !1217, file: !1080, line: 381, baseType: !1033, size: 32, offset: 3744)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1217, file: !1080, line: 382, baseType: !1033, size: 32, offset: 3776)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "minbounds", scope: !1217, file: !1080, line: 382, baseType: !1033, size: 32, offset: 3808)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !1217, file: !1080, line: 384, baseType: !1110, size: 128, offset: 3840)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "saferct", scope: !1217, file: !1080, line: 385, baseType: !1058, size: 128, offset: 3968)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1217, file: !1080, line: 387, baseType: !1368, size: 64, offset: 4096)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiPopupBlockHandle", file: !4, line: 84, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiPopupBlockHandle", file: !1080, line: 491, size: 1536, elements: !1371)
!1371 = !{!1372, !2361, !2362, !2363, !2364, !2365, !2366, !2370, !2371, !2386, !2387, !2392, !2516, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1370, file: !1080, line: 493, baseType: !1373, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !1225, line: 230, size: 3072, elements: !1375)
!1375 = !{!1376, !1377, !1378, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1374, file: !1225, line: 231, baseType: !1373, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1374, file: !1225, line: 231, baseType: !1373, size: 64, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1374, file: !1225, line: 233, baseType: !1379, size: 1280, offset: 128)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1380, line: 71, baseType: !1381)
!1380 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1380, line: 40, size: 1280, elements: !1382)
!1382 = !{!1383, !1384, !1385, !1386, !1387, !1388, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1407, !1408, !1409, !1412}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1381, file: !1380, line: 41, baseType: !1110, size: 128)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1381, file: !1380, line: 41, baseType: !1110, size: 128, offset: 128)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1381, file: !1380, line: 42, baseType: !1335, size: 128, offset: 256)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1381, file: !1380, line: 42, baseType: !1335, size: 128, offset: 384)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1381, file: !1380, line: 43, baseType: !1335, size: 128, offset: 512)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1381, file: !1380, line: 45, baseType: !1389, size: 64, offset: 640)
!1389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 64, elements: !1196)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1381, file: !1380, line: 45, baseType: !1389, size: 64, offset: 704)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1381, file: !1380, line: 46, baseType: !1115, size: 32, offset: 768)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1381, file: !1380, line: 46, baseType: !1115, size: 32, offset: 800)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1381, file: !1380, line: 48, baseType: !1031, size: 16, offset: 832)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1381, file: !1380, line: 49, baseType: !1031, size: 16, offset: 848)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1381, file: !1380, line: 51, baseType: !1031, size: 16, offset: 864)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1381, file: !1380, line: 52, baseType: !1031, size: 16, offset: 880)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1381, file: !1380, line: 53, baseType: !1031, size: 16, offset: 896)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1381, file: !1380, line: 55, baseType: !1031, size: 16, offset: 912)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1381, file: !1380, line: 56, baseType: !1031, size: 16, offset: 928)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1381, file: !1380, line: 58, baseType: !1031, size: 16, offset: 944)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1381, file: !1380, line: 58, baseType: !1031, size: 16, offset: 960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1381, file: !1380, line: 59, baseType: !1031, size: 16, offset: 976)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1381, file: !1380, line: 59, baseType: !1031, size: 16, offset: 992)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1381, file: !1380, line: 61, baseType: !1031, size: 16, offset: 1008)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1381, file: !1380, line: 63, baseType: !1406, size: 64, offset: 1024)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1381, file: !1380, line: 64, baseType: !1033, size: 32, offset: 1088)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1381, file: !1380, line: 65, baseType: !1033, size: 32, offset: 1120)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1381, file: !1380, line: 68, baseType: !1410, size: 64, offset: 1152)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1380, line: 68, flags: DIFlagFwdDecl)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1381, file: !1380, line: 69, baseType: !1413, size: 64, offset: 1216)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !982, line: 490, size: 768, elements: !1415)
!1415 = !{!1416, !1417, !1418, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1414, file: !982, line: 491, baseType: !1413, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1414, file: !982, line: 491, baseType: !1413, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1414, file: !982, line: 493, baseType: !1419, size: 64, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1421, line: 169, size: 2048, elements: !1422)
!1421 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1422 = !{!1423, !1424, !1425, !1426, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2300, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1420, file: !1421, line: 170, baseType: !1419, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1420, file: !1421, line: 170, baseType: !1419, size: 64, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1420, file: !1421, line: 172, baseType: !997, size: 64, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1420, file: !1421, line: 174, baseType: !1427, size: 64, offset: 192)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1225, line: 49, size: 1984, elements: !1429)
!1429 = !{!1430, !1431, !1432, !1433, !1434, !1435, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1428, file: !1225, line: 50, baseType: !999, size: 960)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1428, file: !1225, line: 52, baseType: !1058, size: 128, offset: 960)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1428, file: !1225, line: 53, baseType: !1058, size: 128, offset: 1088)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1428, file: !1225, line: 54, baseType: !1058, size: 128, offset: 1216)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1428, file: !1225, line: 55, baseType: !1058, size: 128, offset: 1344)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1428, file: !1225, line: 57, baseType: !1436, size: 64, offset: 1472)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1438, line: 1216, size: 39680, elements: !1439)
!1438 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1439 = !{!1440, !1441, !1510, !1514, !1517, !1518, !1519, !1531, !1532, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1548, !1551, !1554, !1847, !1850, !2128, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2150, !2151, !2152, !2153, !2154, !2162, !2229, !2236, !2239, !2246, !2249, !2255, !2256, !2257, !2258, !2259}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1437, file: !1438, line: 1217, baseType: !999, size: 960)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1437, file: !1438, line: 1218, baseType: !1442, size: 64, offset: 960)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !943, line: 838, size: 768, elements: !1444)
!1444 = !{!1445, !1460, !1461, !1471, !1472, !1503, !1504, !1505, !1506, !1507, !1508, !1509}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1443, file: !943, line: 840, baseType: !1446, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !1448, line: 499, baseType: !1449)
!1448 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1448, line: 486, size: 1600, elements: !1450)
!1450 = !{!1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1449, file: !1448, line: 487, baseType: !999, size: 960)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1449, file: !1448, line: 489, baseType: !1058, size: 128, offset: 960)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1449, file: !1448, line: 490, baseType: !1058, size: 128, offset: 1088)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1449, file: !1448, line: 491, baseType: !1058, size: 128, offset: 1216)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1449, file: !1448, line: 492, baseType: !1058, size: 128, offset: 1344)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1449, file: !1448, line: 494, baseType: !1033, size: 32, offset: 1472)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1449, file: !1448, line: 495, baseType: !1033, size: 32, offset: 1504)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1449, file: !1448, line: 497, baseType: !1033, size: 32, offset: 1536)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1449, file: !1448, line: 498, baseType: !1033, size: 32, offset: 1568)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1443, file: !943, line: 844, baseType: !1446, size: 64, offset: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1443, file: !943, line: 848, baseType: !1462, size: 64, offset: 128)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !943, line: 549, baseType: !1464)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !943, line: 544, size: 320, elements: !1465)
!1465 = !{!1466, !1468, !1469, !1470}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1464, file: !943, line: 545, baseType: !1467, size: 64)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1464, file: !943, line: 545, baseType: !1467, size: 64, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1464, file: !943, line: 547, baseType: !1446, size: 64, offset: 128)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1464, file: !943, line: 548, baseType: !1058, size: 128, offset: 192)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1443, file: !943, line: 851, baseType: !1058, size: 128, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1443, file: !943, line: 853, baseType: !1473, size: 64, offset: 320)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64)
!1474 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !943, line: 594, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !943, line: 561, size: 1664, elements: !1476)
!1476 = !{!1477, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1475, file: !943, line: 562, baseType: !1478, size: 64)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1475, file: !943, line: 562, baseType: !1478, size: 64, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1475, file: !943, line: 564, baseType: !1058, size: 128, offset: 128)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1475, file: !943, line: 565, baseType: !1446, size: 64, offset: 256)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1475, file: !943, line: 566, baseType: !1462, size: 64, offset: 320)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1475, file: !943, line: 568, baseType: !1058, size: 128, offset: 384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1475, file: !943, line: 569, baseType: !1058, size: 128, offset: 512)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1475, file: !943, line: 571, baseType: !1048, size: 512, offset: 640)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1475, file: !943, line: 573, baseType: !1115, size: 32, offset: 1152)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1475, file: !943, line: 574, baseType: !1115, size: 32, offset: 1184)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1475, file: !943, line: 576, baseType: !1115, size: 32, offset: 1216)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1475, file: !943, line: 576, baseType: !1115, size: 32, offset: 1248)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1475, file: !943, line: 577, baseType: !1115, size: 32, offset: 1280)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1475, file: !943, line: 577, baseType: !1115, size: 32, offset: 1312)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1475, file: !943, line: 579, baseType: !1115, size: 32, offset: 1344)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1475, file: !943, line: 580, baseType: !1115, size: 32, offset: 1376)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1475, file: !943, line: 582, baseType: !1115, size: 32, offset: 1408)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1475, file: !943, line: 582, baseType: !1115, size: 32, offset: 1440)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1475, file: !943, line: 583, baseType: !1031, size: 16, offset: 1472)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1475, file: !943, line: 585, baseType: !1031, size: 16, offset: 1488)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1475, file: !943, line: 586, baseType: !1031, size: 16, offset: 1504)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1475, file: !943, line: 588, baseType: !1031, size: 16, offset: 1520)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1475, file: !943, line: 590, baseType: !997, size: 64, offset: 1536)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1475, file: !943, line: 592, baseType: !1033, size: 32, offset: 1600)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1475, file: !943, line: 593, baseType: !1033, size: 32, offset: 1632)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !1443, file: !943, line: 858, baseType: !1058, size: 128, offset: 384)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !1443, file: !943, line: 859, baseType: !1058, size: 128, offset: 512)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1443, file: !943, line: 862, baseType: !1033, size: 32, offset: 640)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1443, file: !943, line: 863, baseType: !1033, size: 32, offset: 672)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !1443, file: !943, line: 866, baseType: !1031, size: 16, offset: 704)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !1443, file: !943, line: 867, baseType: !1031, size: 16, offset: 720)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !1443, file: !943, line: 868, baseType: !1115, size: 32, offset: 736)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1437, file: !1438, line: 1220, baseType: !1511, size: 64, offset: 1024)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64)
!1512 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1513, line: 49, flags: DIFlagFwdDecl)
!1513 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1437, file: !1438, line: 1221, baseType: !1515, size: 64, offset: 1088)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1438, line: 52, flags: DIFlagFwdDecl)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1437, file: !1438, line: 1223, baseType: !1436, size: 64, offset: 1152)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1437, file: !1438, line: 1225, baseType: !1058, size: 128, offset: 1216)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1437, file: !1438, line: 1226, baseType: !1520, size: 64, offset: 1344)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1438, line: 69, size: 320, elements: !1522)
!1522 = !{!1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1521, file: !1438, line: 70, baseType: !1520, size: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1521, file: !1438, line: 70, baseType: !1520, size: 64, offset: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1521, file: !1438, line: 71, baseType: !5, size: 32, offset: 128)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1521, file: !1438, line: 71, baseType: !5, size: 32, offset: 160)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1521, file: !1438, line: 72, baseType: !1033, size: 32, offset: 192)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1521, file: !1438, line: 73, baseType: !1031, size: 16, offset: 224)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1521, file: !1438, line: 73, baseType: !1031, size: 16, offset: 240)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1521, file: !1438, line: 74, baseType: !1511, size: 64, offset: 256)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1437, file: !1438, line: 1227, baseType: !1511, size: 64, offset: 1408)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1437, file: !1438, line: 1229, baseType: !1533, size: 96, offset: 1472)
!1533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 96, elements: !1534)
!1534 = !{!1535}
!1535 = !DISubrange(count: 3)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1437, file: !1438, line: 1230, baseType: !1533, size: 96, offset: 1568)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1437, file: !1438, line: 1231, baseType: !1533, size: 96, offset: 1664)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1437, file: !1438, line: 1231, baseType: !1533, size: 96, offset: 1760)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1437, file: !1438, line: 1233, baseType: !5, size: 32, offset: 1856)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1437, file: !1438, line: 1234, baseType: !1033, size: 32, offset: 1888)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1437, file: !1438, line: 1235, baseType: !5, size: 32, offset: 1920)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1437, file: !1438, line: 1237, baseType: !1031, size: 16, offset: 1952)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1437, file: !1438, line: 1239, baseType: !1018, size: 8, offset: 1968)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1437, file: !1438, line: 1240, baseType: !1545, size: 8, offset: 1976)
!1545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 8, elements: !1546)
!1546 = !{!1547}
!1547 = !DISubrange(count: 1)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1437, file: !1438, line: 1242, baseType: !1549, size: 64, offset: 1984)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64)
!1550 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1513, line: 248, flags: DIFlagFwdDecl)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1437, file: !1438, line: 1244, baseType: !1552, size: 64, offset: 2048)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64)
!1553 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1438, line: 59, flags: DIFlagFwdDecl)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !1437, file: !1438, line: 1246, baseType: !1555, size: 64, offset: 2112)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64)
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !1438, line: 1067, size: 5184, elements: !1557)
!1557 = !{!1558, !1587, !1588, !1603, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1625, !1719, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1830}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1556, file: !1438, line: 1068, baseType: !1559, size: 64)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64)
!1560 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !1438, line: 934, baseType: !1561)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !1438, line: 925, size: 576, elements: !1562)
!1562 = !{!1563, !1578, !1579, !1580, !1581, !1583, !1586}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1561, file: !1438, line: 926, baseType: !1564, size: 320)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !1438, line: 830, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !1438, line: 813, size: 320, elements: !1566)
!1566 = !{!1567, !1570, !1573, !1574, !1575, !1576, !1577}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1565, file: !1438, line: 814, baseType: !1568, size: 64)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64)
!1569 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !1438, line: 51, flags: DIFlagFwdDecl)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1565, file: !1438, line: 815, baseType: !1571, size: 64, offset: 64)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
!1572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !1438, line: 815, flags: DIFlagFwdDecl)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1565, file: !1438, line: 818, baseType: !997, size: 64, offset: 128)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1565, file: !1438, line: 819, baseType: !1127, size: 32, offset: 192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1565, file: !1438, line: 822, baseType: !1033, size: 32, offset: 224)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1565, file: !1438, line: 826, baseType: !1033, size: 32, offset: 256)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1565, file: !1438, line: 829, baseType: !1033, size: 32, offset: 288)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1561, file: !1438, line: 928, baseType: !1031, size: 16, offset: 320)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1561, file: !1438, line: 928, baseType: !1031, size: 16, offset: 336)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1561, file: !1438, line: 929, baseType: !1033, size: 32, offset: 352)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1561, file: !1438, line: 930, baseType: !1582, size: 64, offset: 384)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1561, file: !1438, line: 931, baseType: !1584, size: 64, offset: 448)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64)
!1585 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !1438, line: 931, flags: DIFlagFwdDecl)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1561, file: !1438, line: 933, baseType: !997, size: 64, offset: 512)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1556, file: !1438, line: 1069, baseType: !1559, size: 64, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1556, file: !1438, line: 1070, baseType: !1589, size: 64, offset: 128)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !1438, line: 916, baseType: !1591)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !1438, line: 891, size: 704, elements: !1592)
!1592 = !{!1593, !1594, !1595, !1597, !1598, !1599, !1600, !1601, !1602}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1591, file: !1438, line: 892, baseType: !1564, size: 320)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1591, file: !1438, line: 896, baseType: !1033, size: 32, offset: 320)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1591, file: !1438, line: 900, baseType: !1596, size: 96, offset: 352)
!1596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 96, elements: !1534)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1591, file: !1438, line: 903, baseType: !1115, size: 32, offset: 448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1591, file: !1438, line: 906, baseType: !1033, size: 32, offset: 480)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1591, file: !1438, line: 909, baseType: !1115, size: 32, offset: 512)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1591, file: !1438, line: 912, baseType: !1115, size: 32, offset: 544)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1591, file: !1438, line: 914, baseType: !1511, size: 64, offset: 576)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1591, file: !1438, line: 915, baseType: !997, size: 64, offset: 640)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1556, file: !1438, line: 1071, baseType: !1604, size: 64, offset: 192)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !1438, line: 920, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !1438, line: 918, size: 320, elements: !1607)
!1607 = !{!1608}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1606, file: !1438, line: 919, baseType: !1564, size: 320)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1556, file: !1438, line: 1075, baseType: !1115, size: 32, offset: 256)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1556, file: !1438, line: 1077, baseType: !1115, size: 32, offset: 288)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1556, file: !1438, line: 1078, baseType: !1115, size: 32, offset: 320)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1556, file: !1438, line: 1079, baseType: !1031, size: 16, offset: 352)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1556, file: !1438, line: 1082, baseType: !1031, size: 16, offset: 368)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1556, file: !1438, line: 1085, baseType: !1018, size: 8, offset: 384)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1556, file: !1438, line: 1086, baseType: !1018, size: 8, offset: 392)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1556, file: !1438, line: 1087, baseType: !1018, size: 8, offset: 400)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !1556, file: !1438, line: 1088, baseType: !1018, size: 8, offset: 408)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !1556, file: !1438, line: 1090, baseType: !1115, size: 32, offset: 416)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !1556, file: !1438, line: 1093, baseType: !1031, size: 16, offset: 448)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !1556, file: !1438, line: 1096, baseType: !1018, size: 8, offset: 464)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1556, file: !1438, line: 1098, baseType: !1622, size: 40, offset: 472)
!1622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 40, elements: !1623)
!1623 = !{!1624}
!1624 = !DISubrange(count: 5)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !1556, file: !1438, line: 1101, baseType: !1626, size: 832, offset: 512)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !1438, line: 836, size: 832, elements: !1627)
!1627 = !{!1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1715, !1716, !1717, !1718}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1626, file: !1438, line: 837, baseType: !1564, size: 320)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1626, file: !1438, line: 839, baseType: !1031, size: 16, offset: 320)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1626, file: !1438, line: 839, baseType: !1031, size: 16, offset: 336)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1626, file: !1438, line: 842, baseType: !1031, size: 16, offset: 352)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1626, file: !1438, line: 842, baseType: !1031, size: 16, offset: 368)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1626, file: !1438, line: 843, baseType: !1195, size: 32, offset: 384)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1626, file: !1438, line: 845, baseType: !1033, size: 32, offset: 416)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1626, file: !1438, line: 847, baseType: !997, size: 64, offset: 448)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !1626, file: !1438, line: 848, baseType: !1637, size: 64, offset: 512)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1639, line: 77, size: 15424, elements: !1640)
!1639 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1640 = !{!1641, !1642, !1643, !1646, !1649, !1652, !1655, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1699, !1700, !1701, !1707, !1708, !1709}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1638, file: !1639, line: 78, baseType: !999, size: 960)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1638, file: !1639, line: 80, baseType: !1017, size: 8192, offset: 960)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1638, file: !1639, line: 82, baseType: !1644, size: 64, offset: 9152)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64)
!1645 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1639, line: 43, flags: DIFlagFwdDecl)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1638, file: !1639, line: 83, baseType: !1647, size: 64, offset: 9216)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64)
!1648 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1000, line: 46, flags: DIFlagFwdDecl)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1638, file: !1639, line: 86, baseType: !1650, size: 64, offset: 9280)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64)
!1651 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1639, line: 41, flags: DIFlagFwdDecl)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1638, file: !1639, line: 87, baseType: !1653, size: 64, offset: 9344)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64)
!1654 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1639, line: 44, flags: DIFlagFwdDecl)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1638, file: !1639, line: 89, baseType: !1656, size: 512, offset: 9408)
!1656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1653, size: 512, elements: !1657)
!1657 = !{!1658}
!1658 = !DISubrange(count: 8)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1638, file: !1639, line: 90, baseType: !1031, size: 16, offset: 9920)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1638, file: !1639, line: 90, baseType: !1031, size: 16, offset: 9936)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1638, file: !1639, line: 92, baseType: !1031, size: 16, offset: 9952)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1638, file: !1639, line: 92, baseType: !1031, size: 16, offset: 9968)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1638, file: !1639, line: 93, baseType: !1031, size: 16, offset: 9984)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1638, file: !1639, line: 93, baseType: !1031, size: 16, offset: 10000)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1638, file: !1639, line: 94, baseType: !1033, size: 32, offset: 10016)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1638, file: !1639, line: 97, baseType: !1031, size: 16, offset: 10048)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1638, file: !1639, line: 97, baseType: !1031, size: 16, offset: 10064)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1638, file: !1639, line: 98, baseType: !1031, size: 16, offset: 10080)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1638, file: !1639, line: 98, baseType: !1031, size: 16, offset: 10096)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1638, file: !1639, line: 99, baseType: !1031, size: 16, offset: 10112)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1638, file: !1639, line: 99, baseType: !1031, size: 16, offset: 10128)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1638, file: !1639, line: 100, baseType: !5, size: 32, offset: 10144)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1638, file: !1639, line: 101, baseType: !1582, size: 64, offset: 10176)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1638, file: !1639, line: 103, baseType: !1024, size: 64, offset: 10240)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1638, file: !1639, line: 104, baseType: !1676, size: 64, offset: 10304)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64)
!1677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1000, line: 159, size: 448, elements: !1678)
!1678 = !{!1679, !1681, !1682, !1683, !1684, !1686}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1677, file: !1000, line: 161, baseType: !1680, size: 64)
!1680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1196)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1677, file: !1000, line: 162, baseType: !1680, size: 64, offset: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1677, file: !1000, line: 163, baseType: !1195, size: 32, offset: 128)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1677, file: !1000, line: 164, baseType: !1195, size: 32, offset: 160)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1677, file: !1000, line: 165, baseType: !1685, size: 128, offset: 192)
!1685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1582, size: 128, elements: !1196)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1677, file: !1000, line: 166, baseType: !1687, size: 128, offset: 320)
!1687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1647, size: 128, elements: !1196)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1638, file: !1639, line: 107, baseType: !1115, size: 32, offset: 10368)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1638, file: !1639, line: 108, baseType: !1033, size: 32, offset: 10400)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1638, file: !1639, line: 109, baseType: !1031, size: 16, offset: 10432)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1638, file: !1639, line: 110, baseType: !1031, size: 16, offset: 10448)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1638, file: !1639, line: 113, baseType: !1033, size: 32, offset: 10464)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1638, file: !1639, line: 113, baseType: !1033, size: 32, offset: 10496)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1638, file: !1639, line: 114, baseType: !1018, size: 8, offset: 10528)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1638, file: !1639, line: 114, baseType: !1018, size: 8, offset: 10536)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1638, file: !1639, line: 115, baseType: !1031, size: 16, offset: 10544)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1638, file: !1639, line: 116, baseType: !1698, size: 128, offset: 10560)
!1698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 128, elements: !1129)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1638, file: !1639, line: 119, baseType: !1115, size: 32, offset: 10688)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1638, file: !1639, line: 119, baseType: !1115, size: 32, offset: 10720)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1638, file: !1639, line: 122, baseType: !1702, size: 512, offset: 10752)
!1702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1703, line: 182, baseType: !1704)
!1703 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1703, line: 180, size: 512, elements: !1705)
!1705 = !{!1706}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1704, file: !1703, line: 181, baseType: !1048, size: 512)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1638, file: !1639, line: 123, baseType: !1018, size: 8, offset: 11264)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1638, file: !1639, line: 125, baseType: !1350, size: 56, offset: 11272)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1638, file: !1639, line: 126, baseType: !1710, size: 4096, offset: 11328)
!1710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1711, size: 4096, elements: !1657)
!1711 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1639, line: 69, baseType: !1712)
!1712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1639, line: 67, size: 512, elements: !1713)
!1713 = !{!1714}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1712, file: !1639, line: 68, baseType: !1048, size: 512)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !1626, file: !1438, line: 849, baseType: !1637, size: 64, offset: 576)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !1626, file: !1438, line: 850, baseType: !1637, size: 64, offset: 640)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !1626, file: !1438, line: 851, baseType: !1533, size: 96, offset: 704)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1626, file: !1438, line: 852, baseType: !1115, size: 32, offset: 800)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !1556, file: !1438, line: 1104, baseType: !1720, size: 1344, offset: 1344)
!1720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !1438, line: 867, size: 1344, elements: !1721)
!1721 = !{!1722, !1723, !1724, !1725, !1726, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745}
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1720, file: !1438, line: 868, baseType: !1031, size: 16)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !1720, file: !1438, line: 869, baseType: !1031, size: 16, offset: 16)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !1720, file: !1438, line: 870, baseType: !1031, size: 16, offset: 32)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !1720, file: !1438, line: 871, baseType: !1031, size: 16, offset: 48)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1720, file: !1438, line: 873, baseType: !1727, size: 896, offset: 64)
!1727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1728, size: 896, elements: !1351)
!1728 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !1438, line: 864, baseType: !1729)
!1729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !1438, line: 859, size: 128, elements: !1730)
!1730 = !{!1731, !1732, !1733, !1734, !1735, !1736}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1729, file: !1438, line: 860, baseType: !1031, size: 16)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1729, file: !1438, line: 861, baseType: !1031, size: 16, offset: 16)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1729, file: !1438, line: 861, baseType: !1031, size: 16, offset: 32)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1729, file: !1438, line: 861, baseType: !1031, size: 16, offset: 48)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1729, file: !1438, line: 862, baseType: !1033, size: 32, offset: 64)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !1729, file: !1438, line: 863, baseType: !1115, size: 32, offset: 96)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1720, file: !1438, line: 874, baseType: !997, size: 64, offset: 960)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !1720, file: !1438, line: 876, baseType: !1115, size: 32, offset: 1024)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !1720, file: !1438, line: 876, baseType: !1115, size: 32, offset: 1056)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1720, file: !1438, line: 878, baseType: !1033, size: 32, offset: 1088)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !1720, file: !1438, line: 879, baseType: !1033, size: 32, offset: 1120)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !1720, file: !1438, line: 881, baseType: !1033, size: 32, offset: 1152)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !1720, file: !1438, line: 881, baseType: !1033, size: 32, offset: 1184)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1720, file: !1438, line: 883, baseType: !1436, size: 64, offset: 1216)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1720, file: !1438, line: 884, baseType: !1511, size: 64, offset: 1280)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !1556, file: !1438, line: 1107, baseType: !1115, size: 32, offset: 2688)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !1556, file: !1438, line: 1110, baseType: !1115, size: 32, offset: 2720)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !1556, file: !1438, line: 1113, baseType: !1031, size: 16, offset: 2752)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !1556, file: !1438, line: 1113, baseType: !1031, size: 16, offset: 2768)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !1556, file: !1438, line: 1116, baseType: !1018, size: 8, offset: 2784)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1556, file: !1438, line: 1117, baseType: !1545, size: 8, offset: 2792)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !1556, file: !1438, line: 1120, baseType: !1031, size: 16, offset: 2800)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !1556, file: !1438, line: 1121, baseType: !1115, size: 32, offset: 2816)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !1556, file: !1438, line: 1122, baseType: !1115, size: 32, offset: 2848)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !1556, file: !1438, line: 1123, baseType: !1115, size: 32, offset: 2880)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !1556, file: !1438, line: 1124, baseType: !1115, size: 32, offset: 2912)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !1556, file: !1438, line: 1125, baseType: !1115, size: 32, offset: 2944)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !1556, file: !1438, line: 1126, baseType: !1115, size: 32, offset: 2976)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !1556, file: !1438, line: 1127, baseType: !1115, size: 32, offset: 3008)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !1556, file: !1438, line: 1128, baseType: !1115, size: 32, offset: 3040)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !1556, file: !1438, line: 1129, baseType: !1115, size: 32, offset: 3072)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !1556, file: !1438, line: 1130, baseType: !1115, size: 32, offset: 3104)
