; ModuleID = 'blender/source/blender/blenkernel/intern/font.c'
source_filename = "blender/source/blender/blenkernel/intern/font.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "builtin_font_data", scope: !2, file: !3, line: 110, type: !21, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !106, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/font.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 339, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!16 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!17 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!18 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!19 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!20 = !{!21, !22, !7, !23, !30, !33, !78, !63}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !25, line: 94, size: 192, elements: !26)
!25 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !25, line: 94, baseType: !21, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !24, file: !25, line: 94, baseType: !21, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !24, file: !25, line: 94, baseType: !21, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !31, line: 90, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!32 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nurb", file: !35, line: 166, baseType: !36)
!35 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Nurb", file: !35, line: 147, size: 704, elements: !37)
!37 = !{!38, !40, !41, !43, !44, !45, !46, !48, !49, !53, !54, !55, !56, !57, !58, !59, !61, !62, !77, !103, !104, !105}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !35, line: 148, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !36, file: !35, line: 148, baseType: !39, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !35, line: 149, baseType: !42, size: 16, offset: 128)
!42 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !36, file: !35, line: 150, baseType: !42, size: 16, offset: 144)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !36, file: !35, line: 151, baseType: !42, size: 16, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !36, file: !35, line: 151, baseType: !42, size: 16, offset: 176)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pntsu", scope: !36, file: !35, line: 152, baseType: !47, size: 32, offset: 192)
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pntsv", scope: !36, file: !35, line: 152, baseType: !47, size: 32, offset: 224)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !36, file: !35, line: 153, baseType: !50, size: 32, offset: 256)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 32, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 2)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "resolu", scope: !36, file: !35, line: 154, baseType: !42, size: 16, offset: 288)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "resolv", scope: !36, file: !35, line: 154, baseType: !42, size: 16, offset: 304)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "orderu", scope: !36, file: !35, line: 155, baseType: !42, size: 16, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "orderv", scope: !36, file: !35, line: 155, baseType: !42, size: 16, offset: 336)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flagu", scope: !36, file: !35, line: 156, baseType: !42, size: 16, offset: 352)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flagv", scope: !36, file: !35, line: 156, baseType: !42, size: 16, offset: 368)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "knotsu", scope: !36, file: !35, line: 158, baseType: !60, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "knotsv", scope: !36, file: !35, line: 158, baseType: !60, size: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !36, file: !35, line: 159, baseType: !63, size: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "BPoint", file: !35, line: 141, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BPoint", file: !35, line: 136, size: 288, elements: !66)
!66 = !{!67, !71, !72, !73, !74, !75, !76}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !65, file: !35, line: 137, baseType: !68, size: 128)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 4)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !65, file: !35, line: 138, baseType: !22, size: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !65, file: !35, line: 138, baseType: !22, size: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !65, file: !35, line: 139, baseType: !42, size: 16, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !65, file: !35, line: 139, baseType: !42, size: 16, offset: 208)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !65, file: !35, line: 140, baseType: !22, size: 32, offset: 224)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !65, file: !35, line: 140, baseType: !22, size: 32, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !36, file: !35, line: 160, baseType: !78, size: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !35, line: 133, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !35, line: 117, size: 576, elements: !81)
!81 = !{!82, !86, !87, !88, !89, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !80, file: !35, line: 118, baseType: !83, size: 288)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 288, elements: !84)
!84 = !{!85, !85}
!85 = !DISubrange(count: 3)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !80, file: !35, line: 119, baseType: !22, size: 32, offset: 288)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !80, file: !35, line: 119, baseType: !22, size: 32, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !80, file: !35, line: 119, baseType: !22, size: 32, offset: 352)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !80, file: !35, line: 121, baseType: !90, size: 8, offset: 384)
!90 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !80, file: !35, line: 123, baseType: !90, size: 8, offset: 392)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !80, file: !35, line: 123, baseType: !90, size: 8, offset: 400)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !80, file: !35, line: 124, baseType: !90, size: 8, offset: 408)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !80, file: !35, line: 124, baseType: !90, size: 8, offset: 416)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !80, file: !35, line: 124, baseType: !90, size: 8, offset: 424)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !80, file: !35, line: 126, baseType: !90, size: 8, offset: 432)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !80, file: !35, line: 128, baseType: !90, size: 8, offset: 440)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !80, file: !35, line: 129, baseType: !22, size: 32, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !80, file: !35, line: 130, baseType: !22, size: 32, offset: 480)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !80, file: !35, line: 130, baseType: !22, size: 32, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !80, file: !35, line: 132, baseType: !102, size: 32, offset: 544)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 32, elements: !69)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tilt_interp", scope: !36, file: !35, line: 162, baseType: !42, size: 16, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "radius_interp", scope: !36, file: !35, line: 163, baseType: !42, size: 16, offset: 656)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "charidx", scope: !36, file: !35, line: 165, baseType: !47, size: 32, offset: 672)
!106 = !{!0, !107, !109}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "builtin_font_size", scope: !2, file: !3, line: 111, type: !47, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "vfont_rwlock", scope: !2, file: !3, line: 65, type: !111, isLocal: true, isDefinition: true)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadRWMutex", file: !112, line: 148, baseType: !113)
!112 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_rwlock_t", file: !114, line: 10, baseType: !115)
!114 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !116, line: 26, baseType: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !118, line: 42, baseType: !7)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!119 = !{i32 7, !"Dwarf Version", i32 4}
!120 = !{i32 2, !"Debug Info Version", i32 3}
!121 = !{i32 1, !"wchar_size", i32 4}
!122 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!123 = distinct !DISubprogram(name: "BKE_vfont_free_data", scope: !3, file: !3, line: 68, type: !124, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !219)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VFont", file: !128, line: 45, size: 9344, elements: !129)
!128 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vfont_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!129 = !{!130, !203, !204, !217, !218}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !127, file: !128, line: 46, baseType: !131, size: 960)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !132, line: 130, baseType: !133)
!132 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !132, line: 117, size: 960, elements: !134)
!134 = !{!135, !136, !137, !139, !163, !167, !168, !169, !170, !171}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !132, line: 118, baseType: !21, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !133, file: !132, line: 118, baseType: !21, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !133, file: !132, line: 119, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !133, file: !132, line: 120, baseType: !140, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !132, line: 136, size: 17600, elements: !142)
!142 = !{!143, !144, !146, !149, !153, !154, !155}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !141, file: !132, line: 137, baseType: !131, size: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !141, file: !132, line: 138, baseType: !145, size: 64, offset: 960)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !141, file: !132, line: 139, baseType: !147, size: 64, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !132, line: 43, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !132, line: 140, baseType: !150, size: 8192, offset: 1088)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 8192, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !141, file: !132, line: 141, baseType: !150, size: 8192, offset: 9280)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !141, file: !132, line: 148, baseType: !140, size: 64, offset: 17472)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !141, file: !132, line: 150, baseType: !156, size: 64, offset: 17536)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !158, line: 37, size: 128, elements: !159)
!158 = !DIFile(filename: "blender/source/blender/makesdna/DNA_packedFile_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !{!160, !161, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !157, file: !158, line: 38, baseType: !47, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !157, file: !158, line: 39, baseType: !47, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !157, file: !158, line: 40, baseType: !21, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !133, file: !132, line: 121, baseType: !164, size: 528, offset: 256)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 528, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 66)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !133, file: !132, line: 126, baseType: !42, size: 16, offset: 784)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !133, file: !132, line: 127, baseType: !47, size: 32, offset: 800)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !133, file: !132, line: 128, baseType: !47, size: 32, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !133, file: !132, line: 128, baseType: !47, size: 32, offset: 864)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !133, file: !132, line: 129, baseType: !172, size: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !132, line: 75, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !132, line: 62, size: 1024, elements: !175)
!175 = !{!176, !178, !179, !180, !181, !182, !186, !187, !201, !202}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !174, file: !132, line: 63, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !174, file: !132, line: 63, baseType: !177, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !174, file: !132, line: 64, baseType: !90, size: 8, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !174, file: !132, line: 64, baseType: !90, size: 8, offset: 136)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !174, file: !132, line: 65, baseType: !42, size: 16, offset: 144)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !132, line: 66, baseType: !183, size: 512, offset: 160)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 512, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !174, file: !132, line: 67, baseType: !47, size: 32, offset: 672)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !132, line: 69, baseType: !188, size: 256, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !132, line: 60, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !132, line: 48, size: 256, elements: !190)
!190 = !{!191, !192, !199, !200}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !189, file: !132, line: 49, baseType: !21, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !189, file: !132, line: 58, baseType: !193, size: 128, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !194, line: 71, baseType: !195)
!194 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !194, line: 69, size: 128, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !195, file: !194, line: 70, baseType: !21, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !195, file: !194, line: 70, baseType: !21, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !189, file: !132, line: 59, baseType: !47, size: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !189, file: !132, line: 59, baseType: !47, size: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !174, file: !132, line: 70, baseType: !47, size: 32, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !174, file: !132, line: 74, baseType: !47, size: 32, offset: 992)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !128, line: 48, baseType: !150, size: 8192, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !128, line: 50, baseType: !205, size: 64, offset: 9152)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VFontData", file: !207, line: 42, size: 1152, elements: !208)
!207 = !DIFile(filename: "blender/source/blender/blenlib/BLI_vfontdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!208 = !{!209, !212, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "characters", scope: !206, file: !207, line: 43, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !25, line: 48, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !207, line: 44, baseType: !213, size: 1024, offset: 64)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 1024, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !206, file: !207, line: 45, baseType: !22, size: 32, offset: 1088)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !127, file: !128, line: 51, baseType: !156, size: 64, offset: 9216)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pf", scope: !127, file: !128, line: 55, baseType: !156, size: 64, offset: 9280)
!219 = !{}
!220 = !DILocalVariable(name: "vfont", arg: 1, scope: !123, file: !3, line: 68, type: !126)
!221 = !DILocation(line: 68, column: 40, scope: !123)
!222 = !DILocation(line: 70, column: 6, scope: !223)
!223 = distinct !DILexicalBlock(scope: !123, file: !3, line: 70, column: 6)
!224 = !DILocation(line: 70, column: 13, scope: !223)
!225 = !DILocation(line: 70, column: 6, scope: !123)
!226 = !DILocation(line: 71, column: 7, scope: !227)
!227 = distinct !DILexicalBlock(scope: !228, file: !3, line: 71, column: 7)
!228 = distinct !DILexicalBlock(scope: !223, file: !3, line: 70, column: 19)
!229 = !DILocation(line: 71, column: 14, scope: !227)
!230 = !DILocation(line: 71, column: 20, scope: !227)
!231 = !DILocation(line: 71, column: 7, scope: !228)
!232 = !DILocalVariable(name: "gh_iter", scope: !233, file: !3, line: 72, type: !234)
!233 = distinct !DILexicalBlock(scope: !227, file: !3, line: 71, column: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !25, line: 54, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !25, line: 50, size: 192, elements: !236)
!236 = !{!237, !240, !243}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !235, file: !25, line: 51, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !25, line: 48, baseType: !211)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !235, file: !25, line: 52, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !25, line: 52, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !235, file: !25, line: 53, baseType: !7, size: 32, offset: 128)
!244 = !DILocation(line: 72, column: 18, scope: !233)
!245 = !DILocation(line: 73, column: 4, scope: !246)
!246 = distinct !DILexicalBlock(scope: !233, file: !3, line: 73, column: 4)
!247 = !DILocation(line: 73, column: 4, scope: !248)
!248 = distinct !DILexicalBlock(scope: !246, file: !3, line: 73, column: 4)
!249 = !DILocalVariable(name: "che", scope: !250, file: !3, line: 74, type: !251)
!250 = distinct !DILexicalBlock(scope: !248, file: !3, line: 73, column: 50)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "VChar", file: !207, line: 52, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VChar", file: !207, line: 48, size: 192, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nurbsbase", scope: !253, file: !207, line: 49, baseType: !193, size: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !253, file: !207, line: 50, baseType: !7, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !253, file: !207, line: 51, baseType: !22, size: 32, offset: 160)
!258 = !DILocation(line: 74, column: 12, scope: !250)
!259 = !DILocation(line: 74, column: 18, scope: !250)
!260 = !DILocation(line: 76, column: 5, scope: !250)
!261 = !DILocation(line: 76, column: 12, scope: !250)
!262 = !DILocation(line: 76, column: 17, scope: !250)
!263 = !DILocation(line: 76, column: 27, scope: !250)
!264 = !DILocalVariable(name: "nu", scope: !265, file: !3, line: 77, type: !33)
!265 = distinct !DILexicalBlock(scope: !250, file: !3, line: 76, column: 34)
!266 = !DILocation(line: 77, column: 12, scope: !265)
!267 = !DILocation(line: 77, column: 17, scope: !265)
!268 = !DILocation(line: 77, column: 22, scope: !265)
!269 = !DILocation(line: 77, column: 32, scope: !265)
!270 = !DILocation(line: 78, column: 10, scope: !271)
!271 = distinct !DILexicalBlock(scope: !265, file: !3, line: 78, column: 10)
!272 = !DILocation(line: 78, column: 14, scope: !271)
!273 = !DILocation(line: 78, column: 10, scope: !265)
!274 = !DILocation(line: 78, column: 20, scope: !271)
!275 = !DILocation(line: 78, column: 30, scope: !271)
!276 = !DILocation(line: 78, column: 34, scope: !271)
!277 = !DILocation(line: 79, column: 21, scope: !265)
!278 = !DILocation(line: 79, column: 26, scope: !265)
!279 = !DILocation(line: 79, column: 37, scope: !265)
!280 = !DILocation(line: 79, column: 6, scope: !265)
!281 = distinct !{!281, !260, !282}
!282 = !DILocation(line: 80, column: 5, scope: !250)
!283 = !DILocation(line: 82, column: 5, scope: !250)
!284 = !DILocation(line: 82, column: 15, scope: !250)
!285 = !DILocation(line: 83, column: 4, scope: !250)
!286 = distinct !{!286, !245, !287}
!287 = !DILocation(line: 83, column: 4, scope: !246)
!288 = !DILocation(line: 85, column: 19, scope: !233)
!289 = !DILocation(line: 85, column: 26, scope: !233)
!290 = !DILocation(line: 85, column: 32, scope: !233)
!291 = !DILocation(line: 85, column: 4, scope: !233)
!292 = !DILocation(line: 86, column: 3, scope: !233)
!293 = !DILocation(line: 88, column: 3, scope: !228)
!294 = !DILocation(line: 88, column: 13, scope: !228)
!295 = !DILocation(line: 88, column: 20, scope: !228)
!296 = !DILocation(line: 89, column: 3, scope: !228)
!297 = !DILocation(line: 89, column: 10, scope: !228)
!298 = !DILocation(line: 89, column: 15, scope: !228)
!299 = !DILocation(line: 90, column: 2, scope: !228)
!300 = !DILocation(line: 92, column: 6, scope: !301)
!301 = distinct !DILexicalBlock(scope: !123, file: !3, line: 92, column: 6)
!302 = !DILocation(line: 92, column: 13, scope: !301)
!303 = !DILocation(line: 92, column: 6, scope: !123)
!304 = !DILocation(line: 93, column: 18, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !3, line: 92, column: 22)
!306 = !DILocation(line: 93, column: 25, scope: !305)
!307 = !DILocation(line: 93, column: 3, scope: !305)
!308 = !DILocation(line: 94, column: 3, scope: !305)
!309 = !DILocation(line: 94, column: 10, scope: !305)
!310 = !DILocation(line: 94, column: 18, scope: !305)
!311 = !DILocation(line: 95, column: 2, scope: !305)
!312 = !DILocation(line: 96, column: 1, scope: !123)
!313 = distinct !DISubprogram(name: "BLI_ghashIterator_done", scope: !25, file: !25, line: 98, type: !314, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !219)
!314 = !DISubroutineType(types: !315)
!315 = !{!316, !317}
!316 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!318 = !DILocalVariable(name: "ghi", arg: 1, scope: !313, file: !25, line: 98, type: !317)
!319 = !DILocation(line: 98, column: 57, scope: !313)
!320 = !DILocation(line: 98, column: 78, scope: !313)
!321 = !DILocation(line: 98, column: 83, scope: !313)
!322 = !DILocation(line: 98, column: 77, scope: !313)
!323 = !DILocation(line: 98, column: 70, scope: !313)
!324 = distinct !DISubprogram(name: "BLI_ghashIterator_getValue", scope: !25, file: !25, line: 96, type: !325, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !219)
!325 = !DISubroutineType(types: !326)
!326 = !{!21, !317}
!327 = !DILocalVariable(name: "ghi", arg: 1, scope: !324, file: !25, line: 96, type: !317)
!328 = !DILocation(line: 96, column: 61, scope: !324)
!329 = !DILocation(line: 96, column: 99, scope: !324)
!330 = !DILocation(line: 96, column: 104, scope: !324)
!331 = !DILocation(line: 96, column: 115, scope: !324)
!332 = !DILocation(line: 96, column: 70, scope: !324)
!333 = distinct !DISubprogram(name: "BKE_vfont_free", scope: !3, file: !3, line: 98, type: !124, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !219)
!334 = !DILocalVariable(name: "vf", arg: 1, scope: !333, file: !3, line: 98, type: !126)
!335 = !DILocation(line: 98, column: 35, scope: !333)
!336 = !DILocation(line: 100, column: 6, scope: !337)
!337 = distinct !DILexicalBlock(scope: !333, file: !3, line: 100, column: 6)
!338 = !DILocation(line: 100, column: 9, scope: !337)
!339 = !DILocation(line: 100, column: 6, scope: !333)
!340 = !DILocation(line: 100, column: 18, scope: !337)
!341 = !DILocation(line: 102, column: 22, scope: !333)
!342 = !DILocation(line: 102, column: 2, scope: !333)
!343 = !DILocation(line: 104, column: 6, scope: !344)
!344 = distinct !DILexicalBlock(scope: !333, file: !3, line: 104, column: 6)
!345 = !DILocation(line: 104, column: 10, scope: !344)
!346 = !DILocation(line: 104, column: 6, scope: !333)
!347 = !DILocation(line: 105, column: 18, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !3, line: 104, column: 22)
!349 = !DILocation(line: 105, column: 22, scope: !348)
!350 = !DILocation(line: 105, column: 3, scope: !348)
!351 = !DILocation(line: 106, column: 3, scope: !348)
!352 = !DILocation(line: 106, column: 7, scope: !348)
!353 = !DILocation(line: 106, column: 18, scope: !348)
!354 = !DILocation(line: 107, column: 2, scope: !348)
!355 = !DILocation(line: 108, column: 1, scope: !333)
!356 = distinct !DISubprogram(name: "BKE_vfont_is_builtin", scope: !3, file: !3, line: 113, type: !357, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !219)
!357 = !DISubroutineType(types: !358)
!358 = !{!316, !126}
!359 = !DILocalVariable(name: "vfont", arg: 1, scope: !356, file: !3, line: 113, type: !126)
!360 = !DILocation(line: 113, column: 41, scope: !356)
!361 = !DILocation(line: 115, column: 9, scope: !356)
!362 = !DILocation(line: 115, column: 2, scope: !356)
!363 = distinct !DISubprogram(name: "BKE_vfont_builtin_register", scope: !3, file: !3, line: 118, type: !364, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !219)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !21, !47}
!366 = !DILocalVariable(name: "mem", arg: 1, scope: !363, file: !3, line: 118, type: !21)
!367 = !DILocation(line: 118, column: 39, scope: !363)
!368 = !DILocalVariable(name: "size", arg: 2, scope: !363, file: !3, line: 118, type: !47)
!369 = !DILocation(line: 118, column: 48, scope: !363)
!370 = !DILocation(line: 120, column: 22, scope: !363)
!371 = !DILocation(line: 120, column: 20, scope: !363)
!372 = !DILocation(line: 121, column: 22, scope: !363)
!373 = !DILocation(line: 121, column: 20, scope: !363)
!374 = !DILocation(line: 122, column: 1, scope: !363)
!375 = distinct !DISubprogram(name: "BKE_vfont_load", scope: !3, file: !3, line: 206, type: !376, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !219)
!376 = !DISubroutineType(types: !377)
!377 = !{!126, !378, !444}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "Main", file: !380, line: 104, baseType: !381)
!380 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !380, line: 53, size: 15232, elements: !382)
!382 = !{!383, !385, !386, !387, !388, !389, !390, !391, !394, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !438, !441}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !380, line: 54, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !381, file: !380, line: 54, baseType: !384, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !380, line: 55, baseType: !150, size: 8192, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !381, file: !380, line: 56, baseType: !42, size: 16, offset: 8320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !381, file: !380, line: 56, baseType: !42, size: 16, offset: 8336)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !381, file: !380, line: 57, baseType: !42, size: 16, offset: 8352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !381, file: !380, line: 57, baseType: !42, size: 16, offset: 8368)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !381, file: !380, line: 58, baseType: !392, size: 64, offset: 8384)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !116, line: 27, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !118, line: 45, baseType: !32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !381, file: !380, line: 59, baseType: !395, size: 128, offset: 8448)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !381, file: !380, line: 60, baseType: !42, size: 16, offset: 8576)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !381, file: !380, line: 62, baseType: !140, size: 64, offset: 8640)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !381, file: !380, line: 63, baseType: !193, size: 128, offset: 8704)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !381, file: !380, line: 64, baseType: !193, size: 128, offset: 8832)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !381, file: !380, line: 65, baseType: !193, size: 128, offset: 8960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !381, file: !380, line: 66, baseType: !193, size: 128, offset: 9088)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !381, file: !380, line: 67, baseType: !193, size: 128, offset: 9216)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !381, file: !380, line: 68, baseType: !193, size: 128, offset: 9344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !381, file: !380, line: 69, baseType: !193, size: 128, offset: 9472)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !381, file: !380, line: 70, baseType: !193, size: 128, offset: 9600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !381, file: !380, line: 71, baseType: !193, size: 128, offset: 9728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !381, file: !380, line: 72, baseType: !193, size: 128, offset: 9856)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !381, file: !380, line: 73, baseType: !193, size: 128, offset: 9984)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !381, file: !380, line: 74, baseType: !193, size: 128, offset: 10112)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !381, file: !380, line: 75, baseType: !193, size: 128, offset: 10240)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !381, file: !380, line: 76, baseType: !193, size: 128, offset: 10368)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !381, file: !380, line: 77, baseType: !193, size: 128, offset: 10496)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !381, file: !380, line: 78, baseType: !193, size: 128, offset: 10624)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !381, file: !380, line: 79, baseType: !193, size: 128, offset: 10752)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !381, file: !380, line: 80, baseType: !193, size: 128, offset: 10880)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !381, file: !380, line: 81, baseType: !193, size: 128, offset: 11008)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !381, file: !380, line: 82, baseType: !193, size: 128, offset: 11136)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !381, file: !380, line: 83, baseType: !193, size: 128, offset: 11264)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !381, file: !380, line: 84, baseType: !193, size: 128, offset: 11392)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !381, file: !380, line: 85, baseType: !193, size: 128, offset: 11520)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !381, file: !380, line: 86, baseType: !193, size: 128, offset: 11648)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !381, file: !380, line: 87, baseType: !193, size: 128, offset: 11776)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !381, file: !380, line: 88, baseType: !193, size: 128, offset: 11904)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !381, file: !380, line: 89, baseType: !193, size: 128, offset: 12032)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !381, file: !380, line: 90, baseType: !193, size: 128, offset: 12160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !381, file: !380, line: 91, baseType: !193, size: 128, offset: 12288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !381, file: !380, line: 92, baseType: !193, size: 128, offset: 12416)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !381, file: !380, line: 93, baseType: !193, size: 128, offset: 12544)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !381, file: !380, line: 94, baseType: !193, size: 128, offset: 12672)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !381, file: !380, line: 95, baseType: !193, size: 128, offset: 12800)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !381, file: !380, line: 96, baseType: !193, size: 128, offset: 12928)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !381, file: !380, line: 98, baseType: !435, size: 2048, offset: 13056)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 2048, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !381, file: !380, line: 101, baseType: !439, size: 64, offset: 15104)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !380, line: 49, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !381, file: !380, line: 103, baseType: !442, size: 64, offset: 15168)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !380, line: 51, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!446 = !DILocalVariable(name: "bmain", arg: 1, scope: !375, file: !3, line: 206, type: !378)
!447 = !DILocation(line: 206, column: 29, scope: !375)
!448 = !DILocalVariable(name: "name", arg: 2, scope: !375, file: !3, line: 206, type: !444)
!449 = !DILocation(line: 206, column: 48, scope: !375)
!450 = !DILocalVariable(name: "filename", scope: !375, file: !3, line: 208, type: !435)
!451 = !DILocation(line: 208, column: 7, scope: !375)
!452 = !DILocalVariable(name: "vfont", scope: !375, file: !3, line: 209, type: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "VFont", file: !128, line: 56, baseType: !127)
!455 = !DILocation(line: 209, column: 9, scope: !375)
!456 = !DILocalVariable(name: "pf", scope: !375, file: !3, line: 210, type: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PackedFile", file: !158, line: 41, baseType: !157)
!459 = !DILocation(line: 210, column: 14, scope: !375)
!460 = !DILocalVariable(name: "temp_pf", scope: !375, file: !3, line: 211, type: !457)
!461 = !DILocation(line: 211, column: 14, scope: !375)
!462 = !DILocalVariable(name: "is_builtin", scope: !375, file: !3, line: 212, type: !316)
!463 = !DILocation(line: 212, column: 7, scope: !375)
!464 = !DILocation(line: 214, column: 6, scope: !465)
!465 = distinct !DILexicalBlock(scope: !375, file: !3, line: 214, column: 6)
!466 = !DILocation(line: 214, column: 6, scope: !375)
!467 = !DILocation(line: 215, column: 15, scope: !468)
!468 = distinct !DILexicalBlock(scope: !465, file: !3, line: 214, column: 36)
!469 = !DILocation(line: 215, column: 25, scope: !468)
!470 = !DILocation(line: 215, column: 3, scope: !468)
!471 = !DILocation(line: 217, column: 8, scope: !468)
!472 = !DILocation(line: 217, column: 6, scope: !468)
!473 = !DILocation(line: 218, column: 14, scope: !468)
!474 = !DILocation(line: 219, column: 2, scope: !468)
!475 = !DILocation(line: 221, column: 23, scope: !476)
!476 = distinct !DILexicalBlock(scope: !465, file: !3, line: 220, column: 7)
!477 = !DILocation(line: 221, column: 29, scope: !476)
!478 = !DILocation(line: 221, column: 3, scope: !476)
!479 = !DILocation(line: 222, column: 28, scope: !476)
!480 = !DILocation(line: 222, column: 34, scope: !476)
!481 = !DILocation(line: 222, column: 41, scope: !476)
!482 = !DILocation(line: 222, column: 8, scope: !476)
!483 = !DILocation(line: 222, column: 6, scope: !476)
!484 = !DILocation(line: 223, column: 33, scope: !476)
!485 = !DILocation(line: 223, column: 39, scope: !476)
!486 = !DILocation(line: 223, column: 46, scope: !476)
!487 = !DILocation(line: 223, column: 13, scope: !476)
!488 = !DILocation(line: 223, column: 11, scope: !476)
!489 = !DILocation(line: 225, column: 14, scope: !476)
!490 = !DILocation(line: 228, column: 6, scope: !491)
!491 = distinct !DILexicalBlock(scope: !375, file: !3, line: 228, column: 6)
!492 = !DILocation(line: 228, column: 6, scope: !375)
!493 = !DILocalVariable(name: "vfd", scope: !494, file: !3, line: 229, type: !495)
!494 = distinct !DILexicalBlock(scope: !491, file: !3, line: 228, column: 10)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "VFontData", file: !207, line: 46, baseType: !206)
!497 = !DILocation(line: 229, column: 14, scope: !494)
!498 = !DILocation(line: 231, column: 41, scope: !494)
!499 = !DILocation(line: 231, column: 9, scope: !494)
!500 = !DILocation(line: 231, column: 7, scope: !494)
!501 = !DILocation(line: 232, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !494, file: !3, line: 232, column: 7)
!503 = !DILocation(line: 232, column: 7, scope: !494)
!504 = !DILocation(line: 233, column: 31, scope: !505)
!505 = distinct !DILexicalBlock(scope: !502, file: !3, line: 232, column: 12)
!506 = !DILocation(line: 233, column: 45, scope: !505)
!507 = !DILocation(line: 233, column: 12, scope: !505)
!508 = !DILocation(line: 233, column: 10, scope: !505)
!509 = !DILocation(line: 234, column: 18, scope: !505)
!510 = !DILocation(line: 234, column: 4, scope: !505)
!511 = !DILocation(line: 234, column: 11, scope: !505)
!512 = !DILocation(line: 234, column: 16, scope: !505)
!513 = !DILocation(line: 237, column: 8, scope: !514)
!514 = distinct !DILexicalBlock(scope: !505, file: !3, line: 237, column: 8)
!515 = !DILocation(line: 237, column: 13, scope: !514)
!516 = !DILocation(line: 237, column: 21, scope: !514)
!517 = !DILocation(line: 237, column: 8, scope: !505)
!518 = !DILocation(line: 238, column: 17, scope: !519)
!519 = distinct !DILexicalBlock(scope: !514, file: !3, line: 237, column: 30)
!520 = !DILocation(line: 238, column: 24, scope: !519)
!521 = !DILocation(line: 238, column: 27, scope: !519)
!522 = !DILocation(line: 238, column: 32, scope: !519)
!523 = !DILocation(line: 238, column: 37, scope: !519)
!524 = !DILocation(line: 238, column: 42, scope: !519)
!525 = !DILocation(line: 238, column: 5, scope: !519)
!526 = !DILocation(line: 239, column: 4, scope: !519)
!527 = !DILocation(line: 240, column: 16, scope: !505)
!528 = !DILocation(line: 240, column: 23, scope: !505)
!529 = !DILocation(line: 240, column: 29, scope: !505)
!530 = !DILocation(line: 240, column: 4, scope: !505)
!531 = !DILocation(line: 243, column: 9, scope: !532)
!532 = distinct !DILexicalBlock(scope: !505, file: !3, line: 243, column: 8)
!533 = !DILocation(line: 243, column: 20, scope: !532)
!534 = !DILocation(line: 243, column: 26, scope: !532)
!535 = !DILocation(line: 243, column: 36, scope: !532)
!536 = !DILocation(line: 243, column: 8, scope: !505)
!537 = !DILocation(line: 244, column: 25, scope: !538)
!538 = distinct !DILexicalBlock(scope: !532, file: !3, line: 243, column: 51)
!539 = !DILocation(line: 244, column: 5, scope: !538)
!540 = !DILocation(line: 244, column: 12, scope: !538)
!541 = !DILocation(line: 244, column: 23, scope: !538)
!542 = !DILocation(line: 245, column: 4, scope: !538)
!543 = !DILocation(line: 248, column: 15, scope: !544)
!544 = distinct !DILexicalBlock(scope: !505, file: !3, line: 248, column: 8)
!545 = !DILocation(line: 248, column: 8, scope: !544)
!546 = !DILocation(line: 248, column: 8, scope: !505)
!547 = !DILocation(line: 249, column: 22, scope: !548)
!548 = distinct !DILexicalBlock(scope: !544, file: !3, line: 248, column: 43)
!549 = !DILocation(line: 249, column: 5, scope: !548)
!550 = !DILocation(line: 249, column: 12, scope: !548)
!551 = !DILocation(line: 249, column: 20, scope: !548)
!552 = !DILocation(line: 250, column: 4, scope: !548)
!553 = !DILocation(line: 251, column: 3, scope: !505)
!554 = !DILocation(line: 254, column: 8, scope: !555)
!555 = distinct !DILexicalBlock(scope: !494, file: !3, line: 254, column: 7)
!556 = !DILocation(line: 254, column: 14, scope: !555)
!557 = !DILocation(line: 254, column: 17, scope: !555)
!558 = !DILocation(line: 254, column: 24, scope: !555)
!559 = !DILocation(line: 254, column: 38, scope: !555)
!560 = !DILocation(line: 254, column: 35, scope: !555)
!561 = !DILocation(line: 254, column: 7, scope: !494)
!562 = !DILocation(line: 255, column: 19, scope: !563)
!563 = distinct !DILexicalBlock(scope: !555, file: !3, line: 254, column: 42)
!564 = !DILocation(line: 255, column: 4, scope: !563)
!565 = !DILocation(line: 256, column: 3, scope: !563)
!566 = !DILocation(line: 257, column: 2, scope: !494)
!567 = !DILocation(line: 259, column: 9, scope: !375)
!568 = !DILocation(line: 259, column: 2, scope: !375)
!569 = distinct !DISubprogram(name: "get_builtin_packedfile", scope: !3, file: !3, line: 124, type: !570, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !219)
!570 = !DISubroutineType(types: !571)
!571 = !{!457}
!572 = !DILocation(line: 126, column: 7, scope: !573)
!573 = distinct !DILexicalBlock(scope: !569, file: !3, line: 126, column: 6)
!574 = !DILocation(line: 126, column: 6, scope: !569)
!575 = !DILocation(line: 127, column: 3, scope: !576)
!576 = distinct !DILexicalBlock(scope: !573, file: !3, line: 126, column: 26)
!577 = !DILocation(line: 129, column: 3, scope: !576)
!578 = !DILocalVariable(name: "mem", scope: !579, file: !3, line: 132, type: !21)
!579 = distinct !DILexicalBlock(scope: !573, file: !3, line: 131, column: 7)
!580 = !DILocation(line: 132, column: 9, scope: !579)
!581 = !DILocation(line: 132, column: 15, scope: !579)
!582 = !DILocation(line: 132, column: 27, scope: !579)
!583 = !DILocation(line: 134, column: 10, scope: !579)
!584 = !DILocation(line: 134, column: 15, scope: !579)
!585 = !DILocation(line: 134, column: 34, scope: !579)
!586 = !DILocation(line: 134, column: 3, scope: !579)
!587 = !DILocation(line: 136, column: 30, scope: !579)
!588 = !DILocation(line: 136, column: 35, scope: !579)
!589 = !DILocation(line: 136, column: 10, scope: !579)
!590 = !DILocation(line: 136, column: 3, scope: !579)
!591 = !DILocation(line: 138, column: 1, scope: !569)
!592 = distinct !DISubprogram(name: "BKE_vfont_builtin_get", scope: !3, file: !3, line: 276, type: !593, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !219)
!593 = !DISubroutineType(types: !594)
!594 = !{!126}
!595 = !DILocalVariable(name: "vfont", scope: !592, file: !3, line: 278, type: !453)
!596 = !DILocation(line: 278, column: 9, scope: !592)
!597 = !DILocation(line: 280, column: 17, scope: !598)
!598 = distinct !DILexicalBlock(scope: !592, file: !3, line: 280, column: 2)
!599 = !DILocation(line: 280, column: 23, scope: !598)
!600 = !DILocation(line: 280, column: 29, scope: !598)
!601 = !DILocation(line: 280, column: 15, scope: !598)
!602 = !DILocation(line: 280, column: 13, scope: !598)
!603 = !DILocation(line: 280, column: 7, scope: !598)
!604 = !DILocation(line: 280, column: 36, scope: !605)
!605 = distinct !DILexicalBlock(scope: !598, file: !3, line: 280, column: 2)
!606 = !DILocation(line: 280, column: 2, scope: !598)
!607 = !DILocation(line: 281, column: 28, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !3, line: 281, column: 7)
!609 = distinct !DILexicalBlock(scope: !605, file: !3, line: 280, column: 67)
!610 = !DILocation(line: 281, column: 7, scope: !608)
!611 = !DILocation(line: 281, column: 7, scope: !609)
!612 = !DILocation(line: 282, column: 11, scope: !613)
!613 = distinct !DILexicalBlock(scope: !608, file: !3, line: 281, column: 36)
!614 = !DILocation(line: 282, column: 4, scope: !613)
!615 = !DILocation(line: 284, column: 2, scope: !609)
!616 = !DILocation(line: 280, column: 51, scope: !605)
!617 = !DILocation(line: 280, column: 58, scope: !605)
!618 = !DILocation(line: 280, column: 61, scope: !605)
!619 = !DILocation(line: 280, column: 49, scope: !605)
!620 = !DILocation(line: 280, column: 2, scope: !605)
!621 = distinct !{!621, !606, !622}
!622 = !DILocation(line: 284, column: 2, scope: !598)
!623 = !DILocation(line: 286, column: 26, scope: !592)
!624 = !DILocation(line: 286, column: 9, scope: !592)
!625 = !DILocation(line: 286, column: 2, scope: !592)
!626 = !DILocation(line: 287, column: 1, scope: !592)
!627 = distinct !DISubprogram(name: "BKE_vfont_select_get", scope: !3, file: !3, line: 483, type: !628, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !219)
!628 = !DISubroutineType(types: !629)
!629 = !{!47, !630, !931, !931}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !6, line: 295, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 115, size: 11392, elements: !633)
!633 = !{!634, !635, !638, !641, !642, !643, !644, !645, !646, !647, !649, !650, !651, !652, !653, !656, !666, !680, !681, !722, !723, !726, !727, !743, !744, !745, !746, !747, !748, !749, !753, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !831, !832, !833, !834, !835, !836, !837, !838, !839, !842, !845, !848, !849, !850, !851, !852, !855, !877, !880, !881, !882, !883, !884, !885, !886, !887, !889, !892, !895, !897, !919, !920}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !632, file: !6, line: 116, baseType: !131, size: 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !632, file: !6, line: 117, baseType: !636, size: 64, offset: 960)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !35, line: 48, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !632, file: !6, line: 119, baseType: !639, size: 64, offset: 1024)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !6, line: 57, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !632, file: !6, line: 121, baseType: !42, size: 16, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !632, file: !6, line: 121, baseType: !42, size: 16, offset: 1104)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !632, file: !6, line: 122, baseType: !47, size: 32, offset: 1120)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !632, file: !6, line: 122, baseType: !47, size: 32, offset: 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !632, file: !6, line: 122, baseType: !47, size: 32, offset: 1184)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !632, file: !6, line: 123, baseType: !183, size: 512, offset: 1216)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !632, file: !6, line: 124, baseType: !648, size: 64, offset: 1728)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !632, file: !6, line: 124, baseType: !648, size: 64, offset: 1792)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !632, file: !6, line: 127, baseType: !648, size: 64, offset: 1856)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !632, file: !6, line: 127, baseType: !648, size: 64, offset: 1920)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !632, file: !6, line: 127, baseType: !648, size: 64, offset: 1984)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !632, file: !6, line: 128, baseType: !654, size: 64, offset: 2048)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !35, line: 44, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !632, file: !6, line: 130, baseType: !657, size: 64, offset: 2112)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !6, line: 97, size: 832, elements: !659)
!659 = !{!660, !664, !665}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !658, file: !6, line: 98, baseType: !661, size: 768)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 768, elements: !662)
!662 = !{!663, !85}
!663 = !DISubrange(count: 8)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !658, file: !6, line: 99, baseType: !47, size: 32, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !658, file: !6, line: 99, baseType: !47, size: 32, offset: 800)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !632, file: !6, line: 131, baseType: !667, size: 64, offset: 2176)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !669, line: 486, size: 1600, elements: !670)
!669 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !668, file: !669, line: 487, baseType: !131, size: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !668, file: !669, line: 489, baseType: !193, size: 128, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !668, file: !669, line: 490, baseType: !193, size: 128, offset: 1088)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !668, file: !669, line: 491, baseType: !193, size: 128, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !668, file: !669, line: 492, baseType: !193, size: 128, offset: 1344)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !668, file: !669, line: 494, baseType: !47, size: 32, offset: 1472)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !668, file: !669, line: 495, baseType: !47, size: 32, offset: 1504)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !668, file: !669, line: 497, baseType: !47, size: 32, offset: 1536)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !668, file: !669, line: 498, baseType: !47, size: 32, offset: 1568)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !632, file: !6, line: 132, baseType: !667, size: 64, offset: 2240)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !632, file: !6, line: 133, baseType: !682, size: 64, offset: 2304)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !669, line: 334, size: 1728, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !695, !696, !697, !698, !699, !700, !701, !721}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !683, file: !669, line: 335, baseType: !193, size: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !683, file: !669, line: 336, baseType: !210, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !683, file: !669, line: 338, baseType: !42, size: 16, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !683, file: !669, line: 338, baseType: !42, size: 16, offset: 208)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !683, file: !669, line: 339, baseType: !7, size: 32, offset: 224)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !683, file: !669, line: 340, baseType: !47, size: 32, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !683, file: !669, line: 342, baseType: !22, size: 32, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !683, file: !669, line: 343, baseType: !693, size: 96, offset: 320)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 96, elements: !694)
!694 = !{!85}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !683, file: !669, line: 344, baseType: !693, size: 96, offset: 416)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !683, file: !669, line: 347, baseType: !193, size: 128, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !683, file: !669, line: 349, baseType: !47, size: 32, offset: 640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !683, file: !669, line: 350, baseType: !47, size: 32, offset: 672)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !683, file: !669, line: 351, baseType: !21, size: 64, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !683, file: !669, line: 352, baseType: !21, size: 64, offset: 768)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !683, file: !669, line: 354, baseType: !702, size: 384, offset: 832)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !669, line: 116, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !669, line: 94, size: 384, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !703, file: !669, line: 96, baseType: !47, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !703, file: !669, line: 96, baseType: !47, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !703, file: !669, line: 97, baseType: !47, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !703, file: !669, line: 97, baseType: !47, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !703, file: !669, line: 99, baseType: !42, size: 16, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !703, file: !669, line: 100, baseType: !42, size: 16, offset: 144)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !703, file: !669, line: 102, baseType: !42, size: 16, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !703, file: !669, line: 105, baseType: !42, size: 16, offset: 176)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !703, file: !669, line: 108, baseType: !42, size: 16, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !703, file: !669, line: 109, baseType: !42, size: 16, offset: 208)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !703, file: !669, line: 111, baseType: !42, size: 16, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !703, file: !669, line: 112, baseType: !42, size: 16, offset: 240)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !703, file: !669, line: 114, baseType: !47, size: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !703, file: !669, line: 114, baseType: !47, size: 32, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !703, file: !669, line: 115, baseType: !47, size: 32, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !703, file: !669, line: 115, baseType: !47, size: 32, offset: 352)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !683, file: !669, line: 355, baseType: !183, size: 512, offset: 1216)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !632, file: !6, line: 134, baseType: !21, size: 64, offset: 2368)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !632, file: !6, line: 136, baseType: !724, size: 64, offset: 2432)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !6, line: 58, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !632, file: !6, line: 138, baseType: !702, size: 384, offset: 2496)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !632, file: !6, line: 139, baseType: !728, size: 64, offset: 2880)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !669, line: 80, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !669, line: 72, size: 192, elements: !731)
!731 = !{!732, !739, !740, !741, !742}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !730, file: !669, line: 73, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !669, line: 59, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !669, line: 56, size: 128, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !735, file: !669, line: 57, baseType: !693, size: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !735, file: !669, line: 58, baseType: !47, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !730, file: !669, line: 74, baseType: !47, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !730, file: !669, line: 76, baseType: !47, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !730, file: !669, line: 77, baseType: !47, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !730, file: !669, line: 79, baseType: !47, size: 32, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !632, file: !6, line: 141, baseType: !193, size: 128, offset: 2944)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !632, file: !6, line: 142, baseType: !193, size: 128, offset: 3072)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !632, file: !6, line: 143, baseType: !193, size: 128, offset: 3200)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !632, file: !6, line: 144, baseType: !193, size: 128, offset: 3328)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !632, file: !6, line: 146, baseType: !47, size: 32, offset: 3456)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !632, file: !6, line: 147, baseType: !47, size: 32, offset: 3488)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !632, file: !6, line: 150, baseType: !750, size: 64, offset: 3520)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !35, line: 46, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !632, file: !6, line: 151, baseType: !754, size: 64, offset: 3584)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !632, file: !6, line: 152, baseType: !47, size: 32, offset: 3648)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !632, file: !6, line: 153, baseType: !47, size: 32, offset: 3680)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !632, file: !6, line: 156, baseType: !693, size: 96, offset: 3712)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !632, file: !6, line: 156, baseType: !693, size: 96, offset: 3808)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !632, file: !6, line: 156, baseType: !693, size: 96, offset: 3904)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !632, file: !6, line: 157, baseType: !693, size: 96, offset: 4000)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !632, file: !6, line: 158, baseType: !693, size: 96, offset: 4096)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !632, file: !6, line: 159, baseType: !693, size: 96, offset: 4192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !632, file: !6, line: 160, baseType: !693, size: 96, offset: 4288)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !632, file: !6, line: 160, baseType: !693, size: 96, offset: 4384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !632, file: !6, line: 161, baseType: !68, size: 128, offset: 4480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !632, file: !6, line: 161, baseType: !68, size: 128, offset: 4608)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !632, file: !6, line: 162, baseType: !693, size: 96, offset: 4736)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !632, file: !6, line: 162, baseType: !693, size: 96, offset: 4832)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !632, file: !6, line: 163, baseType: !22, size: 32, offset: 4928)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !632, file: !6, line: 163, baseType: !22, size: 32, offset: 4960)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !632, file: !6, line: 164, baseType: !772, size: 512, offset: 4992)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, elements: !773)
!773 = !{!70, !70}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !632, file: !6, line: 165, baseType: !772, size: 512, offset: 5504)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !632, file: !6, line: 166, baseType: !772, size: 512, offset: 6016)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !632, file: !6, line: 167, baseType: !772, size: 512, offset: 6528)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !632, file: !6, line: 176, baseType: !772, size: 512, offset: 7040)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !632, file: !6, line: 178, baseType: !7, size: 32, offset: 7552)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !632, file: !6, line: 180, baseType: !42, size: 16, offset: 7584)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !632, file: !6, line: 181, baseType: !42, size: 16, offset: 7600)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !632, file: !6, line: 183, baseType: !42, size: 16, offset: 7616)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !632, file: !6, line: 183, baseType: !42, size: 16, offset: 7632)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !632, file: !6, line: 184, baseType: !42, size: 16, offset: 7648)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !632, file: !6, line: 184, baseType: !42, size: 16, offset: 7664)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !632, file: !6, line: 185, baseType: !42, size: 16, offset: 7680)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !632, file: !6, line: 186, baseType: !42, size: 16, offset: 7696)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !632, file: !6, line: 187, baseType: !42, size: 16, offset: 7712)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !632, file: !6, line: 188, baseType: !90, size: 8, offset: 7728)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !632, file: !6, line: 189, baseType: !90, size: 8, offset: 7736)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !632, file: !6, line: 192, baseType: !47, size: 32, offset: 7744)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !632, file: !6, line: 192, baseType: !47, size: 32, offset: 7776)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !632, file: !6, line: 192, baseType: !47, size: 32, offset: 7808)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !632, file: !6, line: 192, baseType: !47, size: 32, offset: 7840)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !632, file: !6, line: 194, baseType: !47, size: 32, offset: 7872)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !632, file: !6, line: 202, baseType: !22, size: 32, offset: 7904)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !632, file: !6, line: 202, baseType: !22, size: 32, offset: 7936)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !632, file: !6, line: 202, baseType: !22, size: 32, offset: 7968)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !632, file: !6, line: 211, baseType: !22, size: 32, offset: 8000)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !632, file: !6, line: 212, baseType: !22, size: 32, offset: 8032)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !632, file: !6, line: 213, baseType: !22, size: 32, offset: 8064)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !632, file: !6, line: 214, baseType: !22, size: 32, offset: 8096)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !632, file: !6, line: 215, baseType: !22, size: 32, offset: 8128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !632, file: !6, line: 216, baseType: !22, size: 32, offset: 8160)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !632, file: !6, line: 219, baseType: !22, size: 32, offset: 8192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !632, file: !6, line: 220, baseType: !22, size: 32, offset: 8224)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !632, file: !6, line: 221, baseType: !22, size: 32, offset: 8256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !632, file: !6, line: 224, baseType: !808, size: 16, offset: 8288)
!808 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !632, file: !6, line: 224, baseType: !808, size: 16, offset: 8304)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !632, file: !6, line: 226, baseType: !42, size: 16, offset: 8320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !632, file: !6, line: 228, baseType: !90, size: 8, offset: 8336)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !632, file: !6, line: 229, baseType: !90, size: 8, offset: 8344)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !632, file: !6, line: 231, baseType: !42, size: 16, offset: 8352)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !632, file: !6, line: 232, baseType: !90, size: 8, offset: 8368)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !632, file: !6, line: 233, baseType: !90, size: 8, offset: 8376)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !632, file: !6, line: 234, baseType: !22, size: 32, offset: 8384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !632, file: !6, line: 235, baseType: !22, size: 32, offset: 8416)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !632, file: !6, line: 237, baseType: !193, size: 128, offset: 8448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !632, file: !6, line: 238, baseType: !193, size: 128, offset: 8576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !632, file: !6, line: 239, baseType: !193, size: 128, offset: 8704)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !632, file: !6, line: 240, baseType: !193, size: 128, offset: 8832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !632, file: !6, line: 242, baseType: !22, size: 32, offset: 8960)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !632, file: !6, line: 244, baseType: !42, size: 16, offset: 8992)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !632, file: !6, line: 245, baseType: !808, size: 16, offset: 9008)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !632, file: !6, line: 246, baseType: !68, size: 128, offset: 9024)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !632, file: !6, line: 248, baseType: !47, size: 32, offset: 9152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !632, file: !6, line: 249, baseType: !47, size: 32, offset: 9184)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !632, file: !6, line: 251, baseType: !829, size: 64, offset: 9216)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !6, line: 251, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !632, file: !6, line: 253, baseType: !90, size: 8, offset: 9280)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !632, file: !6, line: 254, baseType: !90, size: 8, offset: 9288)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !632, file: !6, line: 255, baseType: !42, size: 16, offset: 9296)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !632, file: !6, line: 256, baseType: !693, size: 96, offset: 9312)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !632, file: !6, line: 258, baseType: !193, size: 128, offset: 9408)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !632, file: !6, line: 259, baseType: !193, size: 128, offset: 9536)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !632, file: !6, line: 260, baseType: !193, size: 128, offset: 9664)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !632, file: !6, line: 261, baseType: !193, size: 128, offset: 9792)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !632, file: !6, line: 263, baseType: !840, size: 64, offset: 9920)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !6, line: 52, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !632, file: !6, line: 264, baseType: !843, size: 64, offset: 9984)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !6, line: 53, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !632, file: !6, line: 265, baseType: !846, size: 64, offset: 10048)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !669, line: 46, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !632, file: !6, line: 267, baseType: !90, size: 8, offset: 10112)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !632, file: !6, line: 268, baseType: !90, size: 8, offset: 10120)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !632, file: !6, line: 269, baseType: !42, size: 16, offset: 10128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !632, file: !6, line: 270, baseType: !22, size: 32, offset: 10144)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !632, file: !6, line: 272, baseType: !853, size: 64, offset: 10176)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !6, line: 54, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !632, file: !6, line: 275, baseType: !856, size: 64, offset: 10240)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !858, line: 49, size: 448, elements: !859)
!858 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!859 = !{!860, !861, !862, !863}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !857, file: !858, line: 50, baseType: !193, size: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !857, file: !858, line: 51, baseType: !193, size: 128, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !857, file: !858, line: 52, baseType: !193, size: 128, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !857, file: !858, line: 53, baseType: !864, size: 64, offset: 384)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !35, line: 65, size: 128, elements: !866)
!866 = !{!867, !875, !876}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !865, file: !35, line: 66, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !35, line: 56, size: 320, elements: !870)
!870 = !{!871, !872, !873, !874}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !869, file: !35, line: 57, baseType: !68, size: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !869, file: !35, line: 58, baseType: !68, size: 128, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !869, file: !35, line: 59, baseType: !22, size: 32, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !869, file: !35, line: 59, baseType: !22, size: 32, offset: 288)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !865, file: !35, line: 67, baseType: !47, size: 32, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !865, file: !35, line: 68, baseType: !22, size: 32, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !632, file: !6, line: 277, baseType: !878, size: 64, offset: 10304)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 56, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !632, file: !6, line: 277, baseType: !878, size: 64, offset: 10368)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !632, file: !6, line: 278, baseType: !392, size: 64, offset: 10432)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !632, file: !6, line: 279, baseType: !392, size: 64, offset: 10496)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !632, file: !6, line: 280, baseType: !7, size: 32, offset: 10560)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !632, file: !6, line: 281, baseType: !7, size: 32, offset: 10592)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !632, file: !6, line: 283, baseType: !193, size: 128, offset: 10624)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !632, file: !6, line: 284, baseType: !193, size: 128, offset: 10752)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !632, file: !6, line: 285, baseType: !888, size: 64, offset: 10880)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !632, file: !6, line: 287, baseType: !890, size: 64, offset: 10944)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !6, line: 59, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !632, file: !6, line: 288, baseType: !893, size: 64, offset: 11008)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !6, line: 288, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !632, file: !6, line: 290, baseType: !896, size: 64, offset: 11072)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !51)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !632, file: !6, line: 291, baseType: !898, size: 64, offset: 11136)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !900, line: 65, baseType: !901)
!900 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !900, line: 50, size: 320, elements: !902)
!902 = !{!903, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !901, file: !900, line: 51, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !900, line: 40, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !901, file: !900, line: 53, baseType: !47, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !901, file: !900, line: 54, baseType: !47, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !901, file: !900, line: 55, baseType: !47, size: 32, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !901, file: !900, line: 55, baseType: !47, size: 32, offset: 160)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !901, file: !900, line: 56, baseType: !90, size: 8, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !901, file: !900, line: 56, baseType: !90, size: 8, offset: 200)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !901, file: !900, line: 57, baseType: !90, size: 8, offset: 208)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !901, file: !900, line: 57, baseType: !90, size: 8, offset: 216)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !901, file: !900, line: 59, baseType: !42, size: 16, offset: 224)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !901, file: !900, line: 59, baseType: !42, size: 16, offset: 240)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !901, file: !900, line: 59, baseType: !42, size: 16, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !901, file: !900, line: 61, baseType: !42, size: 16, offset: 272)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !901, file: !900, line: 63, baseType: !47, size: 32, offset: 288)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !632, file: !6, line: 293, baseType: !193, size: 128, offset: 11200)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !632, file: !6, line: 294, baseType: !921, size: 64, offset: 11328)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !6, line: 113, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !6, line: 108, size: 256, elements: !924)
!924 = !{!925, !927, !928, !929, !930}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !923, file: !6, line: 109, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !923, file: !6, line: 109, baseType: !926, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !923, file: !6, line: 110, baseType: !648, size: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !923, file: !6, line: 111, baseType: !47, size: 32, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !923, file: !6, line: 112, baseType: !22, size: 32, offset: 224)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!932 = !DILocalVariable(name: "ob", arg: 1, scope: !627, file: !3, line: 483, type: !630)
!933 = !DILocation(line: 483, column: 34, scope: !627)
!934 = !DILocalVariable(name: "r_start", arg: 2, scope: !627, file: !3, line: 483, type: !931)
!935 = !DILocation(line: 483, column: 43, scope: !627)
!936 = !DILocalVariable(name: "r_end", arg: 3, scope: !627, file: !3, line: 483, type: !931)
!937 = !DILocation(line: 483, column: 57, scope: !627)
!938 = !DILocalVariable(name: "cu", scope: !627, file: !3, line: 485, type: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "Curve", file: !35, line: 273, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Curve", file: !35, line: 193, size: 4224, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !956, !957, !958, !959, !960, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1043, !1044, !1045, !1046, !1047, !1048, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !941, file: !35, line: 194, baseType: !131, size: 960)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !941, file: !35, line: 195, baseType: !636, size: 64, offset: 960)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !941, file: !35, line: 197, baseType: !657, size: 64, offset: 1024)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "nurb", scope: !941, file: !35, line: 199, baseType: !193, size: 128, offset: 1088)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "editnurb", scope: !941, file: !35, line: 201, baseType: !948, size: 64, offset: 1216)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditNurb", file: !35, line: 191, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditNurb", file: !35, line: 180, size: 256, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "nurbs", scope: !950, file: !35, line: 182, baseType: !193, size: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "keyindex", scope: !950, file: !35, line: 185, baseType: !210, size: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !950, file: !35, line: 188, baseType: !47, size: 32, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !950, file: !35, line: 190, baseType: !102, size: 32, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "bevobj", scope: !941, file: !35, line: 203, baseType: !648, size: 64, offset: 1280)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "taperobj", scope: !941, file: !35, line: 203, baseType: !648, size: 64, offset: 1344)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "textoncurve", scope: !941, file: !35, line: 203, baseType: !648, size: 64, offset: 1408)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !941, file: !35, line: 204, baseType: !654, size: 64, offset: 1472)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !941, file: !35, line: 205, baseType: !961, size: 64, offset: 1536)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !35, line: 45, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !941, file: !35, line: 206, baseType: !750, size: 64, offset: 1600)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !941, file: !35, line: 209, baseType: !693, size: 96, offset: 1664)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !941, file: !35, line: 210, baseType: !693, size: 96, offset: 1760)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !941, file: !35, line: 211, baseType: !693, size: 96, offset: 1856)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !941, file: !35, line: 213, baseType: !42, size: 16, offset: 1952)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !941, file: !35, line: 215, baseType: !42, size: 16, offset: 1968)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !941, file: !35, line: 216, baseType: !42, size: 16, offset: 1984)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "twist_mode", scope: !941, file: !35, line: 216, baseType: !42, size: 16, offset: 2000)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "twist_smooth", scope: !941, file: !35, line: 217, baseType: !22, size: 32, offset: 2016)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "smallcaps_scale", scope: !941, file: !35, line: 217, baseType: !22, size: 32, offset: 2048)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "pathlen", scope: !941, file: !35, line: 219, baseType: !47, size: 32, offset: 2080)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "bevresol", scope: !941, file: !35, line: 220, baseType: !42, size: 16, offset: 2112)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !941, file: !35, line: 220, baseType: !42, size: 16, offset: 2128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !941, file: !35, line: 221, baseType: !47, size: 32, offset: 2144)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !941, file: !35, line: 222, baseType: !22, size: 32, offset: 2176)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ext1", scope: !941, file: !35, line: 222, baseType: !22, size: 32, offset: 2208)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ext2", scope: !941, file: !35, line: 222, baseType: !22, size: 32, offset: 2240)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "resolu", scope: !941, file: !35, line: 225, baseType: !42, size: 16, offset: 2272)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "resolv", scope: !941, file: !35, line: 225, baseType: !42, size: 16, offset: 2288)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "resolu_ren", scope: !941, file: !35, line: 226, baseType: !42, size: 16, offset: 2304)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "resolv_ren", scope: !941, file: !35, line: 226, baseType: !42, size: 16, offset: 2320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "actnu", scope: !941, file: !35, line: 229, baseType: !47, size: 32, offset: 2336)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "actvert", scope: !941, file: !35, line: 231, baseType: !47, size: 32, offset: 2368)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !941, file: !35, line: 233, baseType: !102, size: 32, offset: 2400)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !941, file: !35, line: 236, baseType: !42, size: 16, offset: 2432)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "spacemode", scope: !941, file: !35, line: 237, baseType: !90, size: 8, offset: 2448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !941, file: !35, line: 237, baseType: !90, size: 8, offset: 2456)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "spacing", scope: !941, file: !35, line: 238, baseType: !22, size: 32, offset: 2464)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "linedist", scope: !941, file: !35, line: 238, baseType: !22, size: 32, offset: 2496)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "shear", scope: !941, file: !35, line: 238, baseType: !22, size: 32, offset: 2528)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !941, file: !35, line: 238, baseType: !22, size: 32, offset: 2560)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "wordspace", scope: !941, file: !35, line: 238, baseType: !22, size: 32, offset: 2592)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ulpos", scope: !941, file: !35, line: 238, baseType: !22, size: 32, offset: 2624)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ulheight", scope: !941, file: !35, line: 238, baseType: !22, size: 32, offset: 2656)
