; ModuleID = 'blender/source/blender/editors/mesh/editmesh_loopcut.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_loopcut.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!206 = !DIEnumerator(name: "BMW_EDGERING", value: 4, isUnsigned: true)
!207 = !DIEnumerator(name: "BMW_EDGEBOUNDARY", value: 5, isUnsigned: true)
!208 = !DIEnumerator(name: "BMW_LOOPDATA_ISLAND", value: 6, isUnsigned: true)
!209 = !DIEnumerator(name: "BMW_ISLANDBOUND", value: 7, isUnsigned: true)
!210 = !DIEnumerator(name: "BMW_ISLAND", value: 8, isUnsigned: true)
!211 = !DIEnumerator(name: "BMW_CONNECTED_VERTEX", value: 9, isUnsigned: true)
!212 = !DIEnumerator(name: "BMW_CUSTOM", value: 10, isUnsigned: true)
!213 = !DIEnumerator(name: "BMW_MAXWALKERS", value: 11, isUnsigned: true)
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !215, line: 57, baseType: !5, size: 32, elements: !216)
!215 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!217 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!218 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!219 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!220 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!221 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!222 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!223 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!224 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!225 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!226 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!227 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!228 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!229 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!230 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !232, line: 51, baseType: !5, size: 32, elements: !233)
!232 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!233 = !{!234, !235, !236, !237}
!234 = !DIEnumerator(name: "SUBDIV_SELECT_NONE", value: 0, isUnsigned: true)
!235 = !DIEnumerator(name: "SUBDIV_SELECT_ORIG", value: 1, isUnsigned: true)
!236 = !DIEnumerator(name: "SUBDIV_SELECT_INNER", value: 2, isUnsigned: true)
!237 = !DIEnumerator(name: "SUBDIV_SELECT_LOOPCUT", value: 3, isUnsigned: true)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !164, line: 260, baseType: !5, size: 32, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246}
!240 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!241 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!242 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!243 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!244 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!245 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!246 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !232, line: 35, baseType: !5, size: 32, elements: !248)
!248 = !{!249, !250, !251, !252}
!249 = !DIEnumerator(name: "SUBD_INNERVERT", value: 0, isUnsigned: true)
!250 = !DIEnumerator(name: "SUBD_PATH", value: 1, isUnsigned: true)
!251 = !DIEnumerator(name: "SUBD_FAN", value: 2, isUnsigned: true)
!252 = !DIEnumerator(name: "SUBD_STRAIGHT_CUT", value: 3, isUnsigned: true)
!253 = !{!254, !255, !256, !257, !260, !261, !262, !266, !270, !335, !337, !319}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !258, line: 46, baseType: !259)
!258 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!259 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !215, line: 79, baseType: !214)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !215, line: 158, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !254}
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !215, line: 159, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!254, !254}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !164, line: 103, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !164, line: 90, size: 448, elements: !273)
!273 = !{!274, !285, !291, !295, !296}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !272, file: !164, line: 91, baseType: !275, size: 128)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !164, line: 82, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !164, line: 64, size: 128, elements: !277)
!277 = !{!278, !279, !281, !283, !284}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !164, line: 65, baseType: !254, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !276, file: !164, line: 66, baseType: !280, size: 32, offset: 64)
!280 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !276, file: !164, line: 73, baseType: !282, size: 8, offset: 96)
!282 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !276, file: !164, line: 74, baseType: !282, size: 8, offset: 104)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !276, file: !164, line: 80, baseType: !282, size: 8, offset: 112)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !272, file: !164, line: 92, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !164, line: 180, size: 16, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !287, file: !164, line: 181, baseType: !290, size: 16)
!290 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !272, file: !164, line: 94, baseType: !292, size: 96, offset: 192)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 96, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 3)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !272, file: !164, line: 95, baseType: !292, size: 96, offset: 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !272, file: !164, line: 102, baseType: !297, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !164, line: 110, size: 640, elements: !299)
!299 = !{!300, !301, !302, !304, !305, !328, !334}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !298, file: !164, line: 111, baseType: !275, size: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !298, file: !164, line: 112, baseType: !286, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !298, file: !164, line: 114, baseType: !303, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !298, file: !164, line: 114, baseType: !303, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !298, file: !164, line: 118, baseType: !306, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !164, line: 125, size: 576, elements: !308)
!308 = !{!309, !310, !311, !312, !324, !325, !326, !327}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !307, file: !164, line: 126, baseType: !275, size: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !307, file: !164, line: 129, baseType: !303, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !307, file: !164, line: 130, baseType: !297, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !307, file: !164, line: 131, baseType: !313, size: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !164, line: 164, size: 448, elements: !315)
!315 = !{!316, !317, !318, !321, !322, !323}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !314, file: !164, line: 165, baseType: !275, size: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !314, file: !164, line: 166, baseType: !286, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !314, file: !164, line: 172, baseType: !319, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !164, line: 140, baseType: !307)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !314, file: !164, line: 174, baseType: !280, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !314, file: !164, line: 175, baseType: !292, size: 96, offset: 288)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !314, file: !164, line: 176, baseType: !290, size: 16, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !307, file: !164, line: 135, baseType: !306, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !307, file: !164, line: 135, baseType: !306, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !164, line: 139, baseType: !306, size: 64, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !164, line: 139, baseType: !306, size: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !298, file: !164, line: 122, baseType: !329, size: 128, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !164, line: 108, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !164, line: 106, size: 128, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !164, line: 107, baseType: !297, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !330, file: !164, line: 107, baseType: !297, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !298, file: !164, line: 122, baseType: !329, size: 128, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !164, line: 123, baseType: !298)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !164, line: 178, baseType: !314)
!339 = !{i32 7, !"Dwarf Version", i32 4}
!340 = !{i32 2, !"Debug Info Version", i32 3}
!341 = !{i32 1, !"wchar_size", i32 4}
!342 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!343 = distinct !DISubprogram(name: "MESH_OT_loopcut", scope: !1, file: !1, line: 808, type: !344, scopeLine: 809, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2537)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !348, line: 568, baseType: !349)
!348 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !348, line: 508, size: 1536, elements: !350)
!350 = !{!351, !354, !355, !356, !357, !2463, !2467, !2473, !2477, !2478, !2482, !2483, !2484, !2485, !2489, !2490, !2505, !2506, !2510, !2536}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !349, file: !348, line: 509, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !349, file: !348, line: 510, baseType: !352, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !349, file: !348, line: 511, baseType: !352, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !349, file: !348, line: 512, baseType: !352, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !349, file: !348, line: 518, baseType: !358, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!280, !361, !363}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !32, line: 44, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !144, line: 328, size: 1344, elements: !365)
!365 = !{!366, !367, !368, !372, !402, !404, !405, !406, !418, !2456, !2457, !2458, !2461, !2462}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !144, line: 329, baseType: !363, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !364, file: !144, line: 329, baseType: !363, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !364, file: !144, line: 332, baseType: !369, size: 512, offset: 128)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 512, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !364, file: !144, line: 333, baseType: !373, size: 64, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !375, line: 75, baseType: !376)
!375 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !375, line: 62, size: 1024, elements: !377)
!377 = !{!378, !380, !381, !382, !383, !384, !385, !386, !400, !401}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !375, line: 63, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !376, file: !375, line: 63, baseType: !379, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !376, file: !375, line: 64, baseType: !282, size: 8, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !376, file: !375, line: 64, baseType: !282, size: 8, offset: 136)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !375, line: 65, baseType: !290, size: 16, offset: 144)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !375, line: 66, baseType: !369, size: 512, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !376, file: !375, line: 67, baseType: !280, size: 32, offset: 672)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !376, file: !375, line: 69, baseType: !387, size: 256, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !375, line: 60, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !375, line: 48, size: 256, elements: !389)
!389 = !{!390, !391, !398, !399}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !388, file: !375, line: 49, baseType: !254, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !388, file: !375, line: 58, baseType: !392, size: 128, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !393, line: 71, baseType: !394)
!393 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !393, line: 69, size: 128, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !394, file: !393, line: 70, baseType: !254, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !394, file: !393, line: 70, baseType: !254, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !388, file: !375, line: 59, baseType: !280, size: 32, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !388, file: !375, line: 59, baseType: !280, size: 32, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !376, file: !375, line: 70, baseType: !280, size: 32, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !376, file: !375, line: 74, baseType: !280, size: 32, offset: 992)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !144, line: 336, baseType: !403, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !364, file: !144, line: 337, baseType: !254, size: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !364, file: !144, line: 338, baseType: !254, size: 64, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !364, file: !144, line: 340, baseType: !407, size: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !32, line: 55, size: 192, elements: !409)
!409 = !{!410, !414, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !408, file: !32, line: 58, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !32, line: 56, size: 64, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !411, file: !32, line: 57, baseType: !254, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, file: !32, line: 60, baseType: !415, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !32, line: 41, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !408, file: !32, line: 61, baseType: !254, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !364, file: !144, line: 341, baseType: !419, size: 64, offset: 960)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !144, line: 106, size: 320, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !420, file: !144, line: 107, baseType: !392, size: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !420, file: !144, line: 108, baseType: !280, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !420, file: !144, line: 109, baseType: !280, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !420, file: !144, line: 110, baseType: !280, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !420, file: !144, line: 110, baseType: !280, size: 32, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !420, file: !144, line: 111, baseType: !428, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !348, line: 490, size: 768, elements: !430)
!430 = !{!431, !432, !433, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !348, line: 491, baseType: !428, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !348, line: 491, baseType: !428, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !429, file: !348, line: 493, baseType: !434, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !144, line: 169, size: 2048, elements: !436)
!436 = !{!437, !438, !439, !440, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2422, !2425, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !435, file: !144, line: 170, baseType: !434, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !435, file: !144, line: 170, baseType: !434, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !435, file: !144, line: 172, baseType: !254, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !435, file: !144, line: 174, baseType: !441, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !443, line: 49, size: 1984, elements: !444)
!443 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!444 = !{!445, !481, !482, !483, !484, !485, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !442, file: !443, line: 50, baseType: !446, size: 960)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !375, line: 130, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !375, line: 117, size: 960, elements: !448)
!448 = !{!449, !450, !451, !453, !472, !476, !477, !478, !479, !480}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !375, line: 118, baseType: !254, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !447, file: !375, line: 118, baseType: !254, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !447, file: !375, line: 119, baseType: !452, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !447, file: !375, line: 120, baseType: !454, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !375, line: 136, size: 17600, elements: !456)
!456 = !{!457, !458, !460, !463, !467, !468, !469}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !455, file: !375, line: 137, baseType: !446, size: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !455, file: !375, line: 138, baseType: !459, size: 64, offset: 960)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !455, file: !375, line: 139, baseType: !461, size: 64, offset: 1024)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !375, line: 43, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !455, file: !375, line: 140, baseType: !464, size: 8192, offset: 1088)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 8192, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 1024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !455, file: !375, line: 141, baseType: !464, size: 8192, offset: 9280)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !455, file: !375, line: 148, baseType: !454, size: 64, offset: 17472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !455, file: !375, line: 150, baseType: !470, size: 64, offset: 17536)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !375, line: 45, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !375, line: 121, baseType: !473, size: 528, offset: 256)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 528, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 66)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !375, line: 126, baseType: !290, size: 16, offset: 784)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !447, file: !375, line: 127, baseType: !280, size: 32, offset: 800)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !447, file: !375, line: 128, baseType: !280, size: 32, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !447, file: !375, line: 128, baseType: !280, size: 32, offset: 864)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !447, file: !375, line: 129, baseType: !373, size: 64, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !442, file: !443, line: 52, baseType: !392, size: 128, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !442, file: !443, line: 53, baseType: !392, size: 128, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !442, file: !443, line: 54, baseType: !392, size: 128, offset: 1216)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !442, file: !443, line: 55, baseType: !392, size: 128, offset: 1344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !442, file: !443, line: 57, baseType: !486, size: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !488, line: 1216, size: 39680, elements: !489)
!488 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!489 = !{!490, !491, !495, !1264, !1267, !1268, !1269, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1295, !1363, !1709, !1932, !1935, !2223, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2245, !2246, !2247, !2248, !2249, !2257, !2323, !2330, !2331, !2338, !2339, !2340, !2341, !2342, !2343, !2344}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !487, file: !488, line: 1217, baseType: !446, size: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !487, file: !488, line: 1218, baseType: !492, size: 64, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !494, line: 45, flags: DIFlagFwdDecl)
!494 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!495 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !487, file: !488, line: 1220, baseType: !496, size: 64, offset: 1024)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !498, line: 115, size: 11392, elements: !499)
!498 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!499 = !{!500, !501, !502, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !519, !529, !543, !544, !585, !586, !589, !590, !606, !607, !608, !609, !610, !611, !612, !616, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !632, !633, !634, !635, !636, !637, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !697, !698, !699, !700, !701, !702, !703, !704, !705, !708, !711, !714, !715, !716, !717, !718, !721, !724, !1212, !1213, !1218, !1219, !1220, !1221, !1222, !1223, !1225, !1228, !1231, !1233, !1252, !1253}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !497, file: !498, line: 116, baseType: !446, size: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !497, file: !498, line: 117, baseType: !492, size: 64, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !497, file: !498, line: 119, baseType: !503, size: 64, offset: 1024)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !498, line: 57, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !497, file: !498, line: 121, baseType: !290, size: 16, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !497, file: !498, line: 121, baseType: !290, size: 16, offset: 1104)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !497, file: !498, line: 122, baseType: !280, size: 32, offset: 1120)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !497, file: !498, line: 122, baseType: !280, size: 32, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !497, file: !498, line: 122, baseType: !280, size: 32, offset: 1184)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !497, file: !498, line: 123, baseType: !369, size: 512, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !497, file: !498, line: 124, baseType: !496, size: 64, offset: 1728)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !497, file: !498, line: 124, baseType: !496, size: 64, offset: 1792)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !497, file: !498, line: 127, baseType: !496, size: 64, offset: 1856)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !497, file: !498, line: 127, baseType: !496, size: 64, offset: 1920)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !497, file: !498, line: 127, baseType: !496, size: 64, offset: 1984)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !497, file: !498, line: 128, baseType: !517, size: 64, offset: 2048)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !494, line: 46, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !497, file: !498, line: 130, baseType: !520, size: 64, offset: 2112)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !498, line: 97, size: 832, elements: !522)
!522 = !{!523, !527, !528}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !521, file: !498, line: 98, baseType: !524, size: 768)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 768, elements: !525)
!525 = !{!526, !294}
!526 = !DISubrange(count: 8)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !498, line: 99, baseType: !280, size: 32, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !521, file: !498, line: 99, baseType: !280, size: 32, offset: 800)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !497, file: !498, line: 131, baseType: !530, size: 64, offset: 2176)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !532, line: 486, size: 1600, elements: !533)
!532 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !531, file: !532, line: 487, baseType: !446, size: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !531, file: !532, line: 489, baseType: !392, size: 128, offset: 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !531, file: !532, line: 490, baseType: !392, size: 128, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !531, file: !532, line: 491, baseType: !392, size: 128, offset: 1216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !531, file: !532, line: 492, baseType: !392, size: 128, offset: 1344)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !532, line: 494, baseType: !280, size: 32, offset: 1472)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !531, file: !532, line: 495, baseType: !280, size: 32, offset: 1504)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !531, file: !532, line: 497, baseType: !280, size: 32, offset: 1536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !531, file: !532, line: 498, baseType: !280, size: 32, offset: 1568)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !497, file: !498, line: 132, baseType: !530, size: 64, offset: 2240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !497, file: !498, line: 133, baseType: !545, size: 64, offset: 2304)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !532, line: 334, size: 1728, elements: !547)
!547 = !{!548, !549, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !584}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !546, file: !532, line: 335, baseType: !392, size: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !546, file: !532, line: 336, baseType: !550, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !532, line: 47, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !532, line: 338, baseType: !290, size: 16, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !546, file: !532, line: 338, baseType: !290, size: 16, offset: 208)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !546, file: !532, line: 339, baseType: !5, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !546, file: !532, line: 340, baseType: !280, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !546, file: !532, line: 342, baseType: !256, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !546, file: !532, line: 343, baseType: !292, size: 96, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !546, file: !532, line: 344, baseType: !292, size: 96, offset: 416)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !546, file: !532, line: 347, baseType: !392, size: 128, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !546, file: !532, line: 349, baseType: !280, size: 32, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !546, file: !532, line: 350, baseType: !280, size: 32, offset: 672)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !546, file: !532, line: 351, baseType: !254, size: 64, offset: 704)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !546, file: !532, line: 352, baseType: !254, size: 64, offset: 768)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !546, file: !532, line: 354, baseType: !565, size: 384, offset: 832)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !532, line: 116, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !532, line: 94, size: 384, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !566, file: !532, line: 96, baseType: !280, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !566, file: !532, line: 96, baseType: !280, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !566, file: !532, line: 97, baseType: !280, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !566, file: !532, line: 97, baseType: !280, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !566, file: !532, line: 99, baseType: !290, size: 16, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !566, file: !532, line: 100, baseType: !290, size: 16, offset: 144)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !566, file: !532, line: 102, baseType: !290, size: 16, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !566, file: !532, line: 105, baseType: !290, size: 16, offset: 176)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !566, file: !532, line: 108, baseType: !290, size: 16, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !566, file: !532, line: 109, baseType: !290, size: 16, offset: 208)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !566, file: !532, line: 111, baseType: !290, size: 16, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !566, file: !532, line: 112, baseType: !290, size: 16, offset: 240)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !566, file: !532, line: 114, baseType: !280, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !566, file: !532, line: 114, baseType: !280, size: 32, offset: 288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !566, file: !532, line: 115, baseType: !280, size: 32, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !566, file: !532, line: 115, baseType: !280, size: 32, offset: 352)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !546, file: !532, line: 355, baseType: !369, size: 512, offset: 1216)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !497, file: !498, line: 134, baseType: !254, size: 64, offset: 2368)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !497, file: !498, line: 136, baseType: !587, size: 64, offset: 2432)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !498, line: 58, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !497, file: !498, line: 138, baseType: !565, size: 384, offset: 2496)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !497, file: !498, line: 139, baseType: !591, size: 64, offset: 2880)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !532, line: 80, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !532, line: 72, size: 192, elements: !594)
!594 = !{!595, !602, !603, !604, !605}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !593, file: !532, line: 73, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !532, line: 59, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !532, line: 56, size: 128, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !598, file: !532, line: 57, baseType: !292, size: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !598, file: !532, line: 58, baseType: !280, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !593, file: !532, line: 74, baseType: !280, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !593, file: !532, line: 76, baseType: !280, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !593, file: !532, line: 77, baseType: !280, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !593, file: !532, line: 79, baseType: !280, size: 32, offset: 160)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !497, file: !498, line: 141, baseType: !392, size: 128, offset: 2944)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !497, file: !498, line: 142, baseType: !392, size: 128, offset: 3072)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !497, file: !498, line: 143, baseType: !392, size: 128, offset: 3200)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !497, file: !498, line: 144, baseType: !392, size: 128, offset: 3328)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !497, file: !498, line: 146, baseType: !280, size: 32, offset: 3456)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !497, file: !498, line: 147, baseType: !280, size: 32, offset: 3488)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !497, file: !498, line: 150, baseType: !613, size: 64, offset: 3520)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !498, line: 50, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !497, file: !498, line: 151, baseType: !617, size: 64, offset: 3584)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !497, file: !498, line: 152, baseType: !280, size: 32, offset: 3648)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !497, file: !498, line: 153, baseType: !280, size: 32, offset: 3680)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !497, file: !498, line: 156, baseType: !292, size: 96, offset: 3712)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !497, file: !498, line: 156, baseType: !292, size: 96, offset: 3808)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !497, file: !498, line: 156, baseType: !292, size: 96, offset: 3904)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !497, file: !498, line: 157, baseType: !292, size: 96, offset: 4000)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !497, file: !498, line: 158, baseType: !292, size: 96, offset: 4096)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !497, file: !498, line: 159, baseType: !292, size: 96, offset: 4192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !497, file: !498, line: 160, baseType: !292, size: 96, offset: 4288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !497, file: !498, line: 160, baseType: !292, size: 96, offset: 4384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !497, file: !498, line: 161, baseType: !629, size: 128, offset: 4480)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 128, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 4)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !497, file: !498, line: 161, baseType: !629, size: 128, offset: 4608)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !497, file: !498, line: 162, baseType: !292, size: 96, offset: 4736)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !497, file: !498, line: 162, baseType: !292, size: 96, offset: 4832)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !497, file: !498, line: 163, baseType: !256, size: 32, offset: 4928)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !497, file: !498, line: 163, baseType: !256, size: 32, offset: 4960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !497, file: !498, line: 164, baseType: !638, size: 512, offset: 4992)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 512, elements: !639)
!639 = !{!631, !631}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !497, file: !498, line: 165, baseType: !638, size: 512, offset: 5504)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !497, file: !498, line: 166, baseType: !638, size: 512, offset: 6016)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !497, file: !498, line: 167, baseType: !638, size: 512, offset: 6528)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !497, file: !498, line: 176, baseType: !638, size: 512, offset: 7040)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !497, file: !498, line: 178, baseType: !5, size: 32, offset: 7552)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !497, file: !498, line: 180, baseType: !290, size: 16, offset: 7584)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !497, file: !498, line: 181, baseType: !290, size: 16, offset: 7600)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !497, file: !498, line: 183, baseType: !290, size: 16, offset: 7616)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !497, file: !498, line: 183, baseType: !290, size: 16, offset: 7632)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !497, file: !498, line: 184, baseType: !290, size: 16, offset: 7648)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !497, file: !498, line: 184, baseType: !290, size: 16, offset: 7664)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !497, file: !498, line: 185, baseType: !290, size: 16, offset: 7680)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !497, file: !498, line: 186, baseType: !290, size: 16, offset: 7696)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !497, file: !498, line: 187, baseType: !290, size: 16, offset: 7712)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !497, file: !498, line: 188, baseType: !282, size: 8, offset: 7728)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !497, file: !498, line: 189, baseType: !282, size: 8, offset: 7736)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !497, file: !498, line: 192, baseType: !280, size: 32, offset: 7744)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !497, file: !498, line: 192, baseType: !280, size: 32, offset: 7776)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !497, file: !498, line: 192, baseType: !280, size: 32, offset: 7808)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !497, file: !498, line: 192, baseType: !280, size: 32, offset: 7840)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !497, file: !498, line: 194, baseType: !280, size: 32, offset: 7872)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !497, file: !498, line: 202, baseType: !256, size: 32, offset: 7904)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !497, file: !498, line: 202, baseType: !256, size: 32, offset: 7936)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !497, file: !498, line: 202, baseType: !256, size: 32, offset: 7968)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !497, file: !498, line: 211, baseType: !256, size: 32, offset: 8000)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !497, file: !498, line: 212, baseType: !256, size: 32, offset: 8032)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !497, file: !498, line: 213, baseType: !256, size: 32, offset: 8064)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !497, file: !498, line: 214, baseType: !256, size: 32, offset: 8096)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !497, file: !498, line: 215, baseType: !256, size: 32, offset: 8128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !497, file: !498, line: 216, baseType: !256, size: 32, offset: 8160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !497, file: !498, line: 219, baseType: !256, size: 32, offset: 8192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !497, file: !498, line: 220, baseType: !256, size: 32, offset: 8224)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !497, file: !498, line: 221, baseType: !256, size: 32, offset: 8256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !497, file: !498, line: 224, baseType: !674, size: 16, offset: 8288)
!674 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !497, file: !498, line: 224, baseType: !674, size: 16, offset: 8304)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !497, file: !498, line: 226, baseType: !290, size: 16, offset: 8320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !497, file: !498, line: 228, baseType: !282, size: 8, offset: 8336)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !497, file: !498, line: 229, baseType: !282, size: 8, offset: 8344)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !497, file: !498, line: 231, baseType: !290, size: 16, offset: 8352)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !497, file: !498, line: 232, baseType: !282, size: 8, offset: 8368)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !497, file: !498, line: 233, baseType: !282, size: 8, offset: 8376)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !497, file: !498, line: 234, baseType: !256, size: 32, offset: 8384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !497, file: !498, line: 235, baseType: !256, size: 32, offset: 8416)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !497, file: !498, line: 237, baseType: !392, size: 128, offset: 8448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !497, file: !498, line: 238, baseType: !392, size: 128, offset: 8576)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !497, file: !498, line: 239, baseType: !392, size: 128, offset: 8704)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !497, file: !498, line: 240, baseType: !392, size: 128, offset: 8832)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !497, file: !498, line: 242, baseType: !256, size: 32, offset: 8960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !497, file: !498, line: 244, baseType: !290, size: 16, offset: 8992)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !497, file: !498, line: 245, baseType: !674, size: 16, offset: 9008)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !497, file: !498, line: 246, baseType: !629, size: 128, offset: 9024)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !497, file: !498, line: 248, baseType: !280, size: 32, offset: 9152)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !497, file: !498, line: 249, baseType: !280, size: 32, offset: 9184)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !497, file: !498, line: 251, baseType: !695, size: 64, offset: 9216)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !498, line: 251, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !497, file: !498, line: 253, baseType: !282, size: 8, offset: 9280)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !497, file: !498, line: 254, baseType: !282, size: 8, offset: 9288)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !497, file: !498, line: 255, baseType: !290, size: 16, offset: 9296)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !497, file: !498, line: 256, baseType: !292, size: 96, offset: 9312)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !497, file: !498, line: 258, baseType: !392, size: 128, offset: 9408)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !497, file: !498, line: 259, baseType: !392, size: 128, offset: 9536)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !497, file: !498, line: 260, baseType: !392, size: 128, offset: 9664)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !497, file: !498, line: 261, baseType: !392, size: 128, offset: 9792)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !497, file: !498, line: 263, baseType: !706, size: 64, offset: 9920)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !498, line: 52, flags: DIFlagFwdDecl)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !497, file: !498, line: 264, baseType: !709, size: 64, offset: 9984)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !498, line: 53, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !497, file: !498, line: 265, baseType: !712, size: 64, offset: 10048)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !532, line: 46, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !497, file: !498, line: 267, baseType: !282, size: 8, offset: 10112)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !497, file: !498, line: 268, baseType: !282, size: 8, offset: 10120)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !497, file: !498, line: 269, baseType: !290, size: 16, offset: 10128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !497, file: !498, line: 270, baseType: !256, size: 32, offset: 10144)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !497, file: !498, line: 272, baseType: !719, size: 64, offset: 10176)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !498, line: 54, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !497, file: !498, line: 275, baseType: !722, size: 64, offset: 10240)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !498, line: 275, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !497, file: !498, line: 277, baseType: !725, size: 64, offset: 10304)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !727)
!727 = !{!728, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !781, !784, !786, !787, !789, !790, !791, !792, !798, !803, !804, !808, !809, !810, !811, !812, !825, !837, !851, !855, !859, !863, !872, !884, !888, !892, !896, !900, !904, !905, !906, !907, !908, !909, !913, !914, !915, !916, !920, !921, !922, !923, !924, !929, !930, !931, !932, !933, !937, !938, !939, !940, !941, !948, !959, !964, !970, !980, !986, !997, !1004, !1011, !1015, !1019, !1023, !1028, !1029, !1030, !1037, !1043, !1044, !1045, !1050, !1051, !1060, !1169, !1173, !1181, !1185, !1189, !1193, !1201, !1211}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !726, file: !4, line: 180, baseType: !729, size: 1600)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !730, line: 73, baseType: !731)
!730 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !730, line: 64, size: 1600, elements: !732)
!732 = !{!733, !748, !752, !753, !754, !755, !758}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !731, file: !730, line: 65, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !730, line: 53, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !730, line: 42, size: 832, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !736, file: !730, line: 43, baseType: !280, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !736, file: !730, line: 44, baseType: !280, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !736, file: !730, line: 45, baseType: !280, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !736, file: !730, line: 46, baseType: !280, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !736, file: !730, line: 47, baseType: !280, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !736, file: !730, line: 48, baseType: !280, size: 32, offset: 160)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !736, file: !730, line: 49, baseType: !280, size: 32, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !736, file: !730, line: 50, baseType: !280, size: 32, offset: 224)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !736, file: !730, line: 51, baseType: !369, size: 512, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !736, file: !730, line: 52, baseType: !254, size: 64, offset: 768)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !731, file: !730, line: 66, baseType: !749, size: 1312, offset: 64)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 1312, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 41)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !731, file: !730, line: 69, baseType: !280, size: 32, offset: 1376)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !731, file: !730, line: 69, baseType: !280, size: 32, offset: 1408)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !731, file: !730, line: 70, baseType: !280, size: 32, offset: 1440)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !731, file: !730, line: 71, baseType: !756, size: 64, offset: 1472)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !730, line: 71, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !731, file: !730, line: 72, baseType: !759, size: 64, offset: 1536)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !730, line: 59, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !730, line: 57, size: 8192, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !761, file: !730, line: 58, baseType: !464, size: 8192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !726, file: !4, line: 180, baseType: !729, size: 1600, offset: 1600)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !726, file: !4, line: 180, baseType: !729, size: 1600, offset: 3200)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !726, file: !4, line: 180, baseType: !729, size: 1600, offset: 4800)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !726, file: !4, line: 180, baseType: !729, size: 1600, offset: 6400)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !726, file: !4, line: 181, baseType: !280, size: 32, offset: 8000)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !726, file: !4, line: 181, baseType: !280, size: 32, offset: 8032)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !726, file: !4, line: 181, baseType: !280, size: 32, offset: 8064)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !726, file: !4, line: 181, baseType: !280, size: 32, offset: 8096)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !726, file: !4, line: 181, baseType: !280, size: 32, offset: 8128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !726, file: !4, line: 182, baseType: !280, size: 32, offset: 8160)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !726, file: !4, line: 183, baseType: !280, size: 32, offset: 8192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !726, file: !4, line: 184, baseType: !776, size: 64, offset: 8256)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !777, line: 124, baseType: !778)
!777 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !780, line: 42, flags: DIFlagFwdDecl)
!780 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_modifier.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!781 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !726, file: !4, line: 185, baseType: !782, size: 64, offset: 8320)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !726, file: !4, line: 186, baseType: !785, size: 32, offset: 8384)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !726, file: !4, line: 187, baseType: !256, size: 32, offset: 8416)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !726, file: !4, line: 188, baseType: !788, size: 32, offset: 8448)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !726, file: !4, line: 189, baseType: !280, size: 32, offset: 8480)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !726, file: !4, line: 190, baseType: !613, size: 64, offset: 8512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !726, file: !4, line: 193, baseType: !282, size: 8, offset: 8576)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !726, file: !4, line: 196, baseType: !793, size: 64, offset: 8640)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !796}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !726)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !726, file: !4, line: 199, baseType: !799, size: 64, offset: 8704)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !796, !802}
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !726, file: !4, line: 202, baseType: !793, size: 64, offset: 8768)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !726, file: !4, line: 207, baseType: !805, size: 64, offset: 8832)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!280, !796}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !726, file: !4, line: 208, baseType: !805, size: 64, offset: 8896)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !726, file: !4, line: 209, baseType: !805, size: 64, offset: 8960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !726, file: !4, line: 210, baseType: !805, size: 64, offset: 9024)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !726, file: !4, line: 211, baseType: !805, size: 64, offset: 9088)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !726, file: !4, line: 218, baseType: !813, size: 64, offset: 9152)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !796, !280, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !818, line: 65, size: 160, elements: !819)
!818 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!819 = !{!820, !821, !823, !824}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !817, file: !818, line: 66, baseType: !292, size: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !817, file: !818, line: 67, baseType: !822, size: 48, offset: 96)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 48, elements: !293)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !817, file: !818, line: 68, baseType: !282, size: 8, offset: 144)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !817, file: !818, line: 68, baseType: !282, size: 8, offset: 152)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !726, file: !4, line: 219, baseType: !826, size: 64, offset: 9216)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !796, !280, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !818, line: 48, size: 96, elements: !831)
!831 = !{!832, !833, !834, !835, !836}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !830, file: !818, line: 49, baseType: !5, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !830, file: !818, line: 49, baseType: !5, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !830, file: !818, line: 50, baseType: !282, size: 8, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !830, file: !818, line: 50, baseType: !282, size: 8, offset: 72)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !830, file: !818, line: 51, baseType: !290, size: 16, offset: 80)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !726, file: !4, line: 220, baseType: !838, size: 64, offset: 9280)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !796, !280, !841}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !818, line: 42, size: 160, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !842, file: !818, line: 43, baseType: !5, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !842, file: !818, line: 43, baseType: !5, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !842, file: !818, line: 43, baseType: !5, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !842, file: !818, line: 43, baseType: !5, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !842, file: !818, line: 44, baseType: !290, size: 16, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !842, file: !818, line: 45, baseType: !282, size: 8, offset: 144)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !842, file: !818, line: 45, baseType: !282, size: 8, offset: 152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !726, file: !4, line: 227, baseType: !852, size: 64, offset: 9344)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!816, !796}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !726, file: !4, line: 228, baseType: !856, size: 64, offset: 9408)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!829, !796}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !726, file: !4, line: 229, baseType: !860, size: 64, offset: 9472)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!841, !796}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !726, file: !4, line: 230, baseType: !864, size: 64, offset: 9536)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!867, !796}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !818, line: 88, size: 64, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !868, file: !818, line: 89, baseType: !5, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !868, file: !818, line: 90, baseType: !5, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !726, file: !4, line: 231, baseType: !873, size: 64, offset: 9600)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!876, !796}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !818, line: 79, size: 96, elements: !878)
!878 = !{!879, !880, !881, !882, !883}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !877, file: !818, line: 81, baseType: !280, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !877, file: !818, line: 82, baseType: !280, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !877, file: !818, line: 83, baseType: !290, size: 16, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !877, file: !818, line: 84, baseType: !282, size: 8, offset: 80)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !877, file: !818, line: 84, baseType: !282, size: 8, offset: 88)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !726, file: !4, line: 236, baseType: !885, size: 64, offset: 9664)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !796, !816}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !726, file: !4, line: 237, baseType: !889, size: 64, offset: 9728)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !796, !829}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !726, file: !4, line: 238, baseType: !893, size: 64, offset: 9792)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !796, !841}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !726, file: !4, line: 239, baseType: !897, size: 64, offset: 9856)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !796, !867}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !726, file: !4, line: 240, baseType: !901, size: 64, offset: 9920)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !796, !876}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !726, file: !4, line: 245, baseType: !852, size: 64, offset: 9984)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !726, file: !4, line: 246, baseType: !856, size: 64, offset: 10048)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !726, file: !4, line: 247, baseType: !860, size: 64, offset: 10112)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !726, file: !4, line: 248, baseType: !864, size: 64, offset: 10176)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !726, file: !4, line: 249, baseType: !873, size: 64, offset: 10240)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !726, file: !4, line: 255, baseType: !910, size: 64, offset: 10304)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!254, !796, !280, !280}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !726, file: !4, line: 256, baseType: !910, size: 64, offset: 10368)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !726, file: !4, line: 257, baseType: !910, size: 64, offset: 10432)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !726, file: !4, line: 258, baseType: !910, size: 64, offset: 10496)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !726, file: !4, line: 264, baseType: !917, size: 64, offset: 10560)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!254, !796, !280}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !726, file: !4, line: 265, baseType: !917, size: 64, offset: 10624)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !726, file: !4, line: 266, baseType: !917, size: 64, offset: 10688)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !726, file: !4, line: 267, baseType: !917, size: 64, offset: 10752)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !726, file: !4, line: 268, baseType: !917, size: 64, offset: 10816)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !726, file: !4, line: 272, baseType: !925, size: 64, offset: 10880)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!928, !796}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !726, file: !4, line: 273, baseType: !925, size: 64, offset: 10944)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !726, file: !4, line: 274, baseType: !925, size: 64, offset: 11008)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !726, file: !4, line: 275, baseType: !925, size: 64, offset: 11072)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !726, file: !4, line: 276, baseType: !925, size: 64, offset: 11136)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !726, file: !4, line: 279, baseType: !934, size: 64, offset: 11200)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !796, !280, !928, !280}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !726, file: !4, line: 280, baseType: !934, size: 64, offset: 11264)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !726, file: !4, line: 281, baseType: !934, size: 64, offset: 11328)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !726, file: !4, line: 284, baseType: !805, size: 64, offset: 11392)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !726, file: !4, line: 285, baseType: !805, size: 64, offset: 11456)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !726, file: !4, line: 286, baseType: !942, size: 64, offset: 11520)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!945, !796}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !726, file: !4, line: 287, baseType: !949, size: 64, offset: 11584)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!952, !796}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !955)
!955 = !{!956, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !954, file: !4, line: 118, baseType: !957, size: 128)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 128, elements: !630)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !954, file: !4, line: 119, baseType: !957, size: 128, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !726, file: !4, line: 288, baseType: !960, size: 64, offset: 11648)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!963, !796}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !726, file: !4, line: 289, baseType: !965, size: 64, offset: 11712)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !796, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !726, file: !4, line: 290, baseType: !971, size: 64, offset: 11776)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!974, !796}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !976, file: !4, line: 124, baseType: !290, size: 16)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !976, file: !4, line: 125, baseType: !282, size: 8, offset: 16)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !726, file: !4, line: 291, baseType: !981, size: 64, offset: 11840)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!984, !796}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !726, file: !4, line: 299, baseType: !987, size: 64, offset: 11904)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{null, !796, !990, !254, !996}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !254, !280, !993, !993, !994}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !4, line: 162, baseType: !15)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !726, file: !4, line: 309, baseType: !998, size: 64, offset: 11968)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !796, !1001, !254}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !254, !280, !993, !993}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !726, file: !4, line: 317, baseType: !1005, size: 64, offset: 12032)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !796, !1008, !254, !996}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !254, !280, !280, !993, !993}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !726, file: !4, line: 327, baseType: !1012, size: 64, offset: 12096)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !796, !1001, !254, !996}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !726, file: !4, line: 337, baseType: !1016, size: 64, offset: 12160)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !796, !255, !255}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !726, file: !4, line: 344, baseType: !1020, size: 64, offset: 12224)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !796, !280, !255}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !726, file: !4, line: 347, baseType: !1024, size: 64, offset: 12288)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !796, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !726, file: !4, line: 350, baseType: !1020, size: 64, offset: 12352)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !726, file: !4, line: 351, baseType: !1020, size: 64, offset: 12416)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !726, file: !4, line: 355, baseType: !1031, size: 64, offset: 12480)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!1034, !496, !796}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !4, line: 355, flags: DIFlagFwdDecl)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !726, file: !4, line: 359, baseType: !1038, size: 64, offset: 12544)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1041, !496, !796}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !4, line: 100, flags: DIFlagFwdDecl)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !726, file: !4, line: 364, baseType: !793, size: 64, offset: 12608)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !726, file: !4, line: 367, baseType: !793, size: 64, offset: 12672)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !726, file: !4, line: 373, baseType: !1046, size: 64, offset: 12736)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !796, !1049, !1049}
!1049 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !726, file: !4, line: 376, baseType: !793, size: 64, offset: 12800)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !726, file: !4, line: 385, baseType: !1052, size: 64, offset: 12864)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{null, !796, !1055, !1049, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !4, line: 146, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!280, !280, !254}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !726, file: !4, line: 391, baseType: !1061, size: 64, offset: 12928)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !796, !1064, !1164, !254, !1168}
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !4, line: 150, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!1068, !1069, !1163, !280}
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !4, line: 143, baseType: !19)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !818, line: 160, size: 384, elements: !1071)
!1071 = !{!1072, !1076, !1158, !1159, !1160, !1161, !1162}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !1070, file: !818, line: 161, baseType: !1073, size: 256)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 256, elements: !1074)
!1074 = !{!631, !1075}
!1075 = !DISubrange(count: 2)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !1070, file: !818, line: 162, baseType: !1077, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1079, line: 77, size: 15424, elements: !1080)
!1079 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1080 = !{!1081, !1082, !1083, !1086, !1089, !1092, !1095, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1147, !1148, !1152}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1078, file: !1079, line: 78, baseType: !446, size: 960)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1078, file: !1079, line: 80, baseType: !464, size: 8192, offset: 960)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1078, file: !1079, line: 82, baseType: !1084, size: 64, offset: 9152)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1079, line: 43, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1078, file: !1079, line: 83, baseType: !1087, size: 64, offset: 9216)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !375, line: 46, flags: DIFlagFwdDecl)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1078, file: !1079, line: 86, baseType: !1090, size: 64, offset: 9280)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1079, line: 41, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1078, file: !1079, line: 87, baseType: !1093, size: 64, offset: 9344)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1079, line: 44, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1078, file: !1079, line: 89, baseType: !1096, size: 512, offset: 9408)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 512, elements: !1097)
!1097 = !{!526}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1078, file: !1079, line: 90, baseType: !290, size: 16, offset: 9920)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1078, file: !1079, line: 90, baseType: !290, size: 16, offset: 9936)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1078, file: !1079, line: 92, baseType: !290, size: 16, offset: 9952)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1078, file: !1079, line: 92, baseType: !290, size: 16, offset: 9968)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1078, file: !1079, line: 93, baseType: !290, size: 16, offset: 9984)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1078, file: !1079, line: 93, baseType: !290, size: 16, offset: 10000)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1078, file: !1079, line: 94, baseType: !280, size: 32, offset: 10016)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1078, file: !1079, line: 97, baseType: !290, size: 16, offset: 10048)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1078, file: !1079, line: 97, baseType: !290, size: 16, offset: 10064)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1078, file: !1079, line: 98, baseType: !290, size: 16, offset: 10080)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1078, file: !1079, line: 98, baseType: !290, size: 16, offset: 10096)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1078, file: !1079, line: 99, baseType: !290, size: 16, offset: 10112)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1078, file: !1079, line: 99, baseType: !290, size: 16, offset: 10128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1078, file: !1079, line: 100, baseType: !5, size: 32, offset: 10144)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1078, file: !1079, line: 101, baseType: !985, size: 64, offset: 10176)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1078, file: !1079, line: 103, baseType: !470, size: 64, offset: 10240)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1078, file: !1079, line: 104, baseType: !1115, size: 64, offset: 10304)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !375, line: 159, size: 448, elements: !1117)
!1117 = !{!1118, !1121, !1122, !1124, !1125, !1127}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1116, file: !375, line: 161, baseType: !1119, size: 64)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1120)
!1120 = !{!1075}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1116, file: !375, line: 162, baseType: !1119, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1116, file: !375, line: 163, baseType: !1123, size: 32, offset: 128)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 32, elements: !1120)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1116, file: !375, line: 164, baseType: !1123, size: 32, offset: 160)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1116, file: !375, line: 165, baseType: !1126, size: 128, offset: 192)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 128, elements: !1120)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1116, file: !375, line: 166, baseType: !1128, size: 128, offset: 320)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1087, size: 128, elements: !1120)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1078, file: !1079, line: 107, baseType: !256, size: 32, offset: 10368)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1078, file: !1079, line: 108, baseType: !280, size: 32, offset: 10400)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1078, file: !1079, line: 109, baseType: !290, size: 16, offset: 10432)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1078, file: !1079, line: 110, baseType: !290, size: 16, offset: 10448)
