; ModuleID = 'blender/source/blender/editors/transform/transform_orientations.c'
source_filename = "blender/source/blender/editors/transform/transform_orientations.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bContext = type opaque
%struct.View3D = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16], [4 x float], float, float, i8, [3 x i8], i32, i32, i16, i16, %struct.Object*, %struct.Object*, %struct.rctf, %struct.ListBase, %struct.BGpic*, %struct.View3D*, [64 x i8], i32, i32, i16, i16, i16, i16, i16, i16, float, float, float, float, [3 x float], [3 x float], i16, i16, i16, i8, i8, i8, i8, [2 x i8], %struct.ListBase, %struct.ListBase, %struct.ListBase, i8, i8, i8, [5 x i8], i8*, %struct.Material*, %struct.bGPdata* }
%struct.SpaceLink = type opaque

!86 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!94 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!95 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!96 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!97 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!98 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!99 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 260, baseType: !5, size: 32, elements: !102)
!101 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = !{!103, !104, !105, !106, !107, !108, !109}
!103 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!104 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!105 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!106 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!107 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!108 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!109 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBone_Flag", file: !111, line: 187, baseType: !5, size: 32, elements: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!113 = !DIEnumerator(name: "BONE_SELECTED", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "BONE_ROOTSEL", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "BONE_TIPSEL", value: 4, isUnsigned: true)
!116 = !DIEnumerator(name: "BONE_TRANSFORM", value: 8, isUnsigned: true)
!117 = !DIEnumerator(name: "BONE_CONNECTED", value: 16, isUnsigned: true)
!118 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!119 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!120 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!121 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!122 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!123 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!124 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!125 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!126 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!127 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!128 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!129 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!130 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!131 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!132 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!133 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!134 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!135 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 619, baseType: !5, size: 32, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIEnumerator(name: "OB_RESTRICT_VIEW", value: 1, isUnsigned: true)
!139 = !DIEnumerator(name: "OB_RESTRICT_SELECT", value: 2, isUnsigned: true)
!140 = !DIEnumerator(name: "OB_RESTRICT_RENDER", value: 4, isUnsigned: true)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 249, baseType: !5, size: 32, elements: !142)
!142 = !{!143, !144, !145, !146}
!143 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!144 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!145 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!146 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!147 = !{!148, !149, !215, !217, !224, !225, !229, !233, !199, !235}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !101, line: 123, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !101, line: 110, size: 640, elements: !152)
!152 = !{!153, !164, !170, !184, !185, !208, !214}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !151, file: !101, line: 111, baseType: !154, size: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !101, line: 82, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !101, line: 64, size: 128, elements: !156)
!156 = !{!157, !158, !160, !162, !163}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !101, line: 65, baseType: !148, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !155, file: !101, line: 66, baseType: !159, size: 32, offset: 64)
!159 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !155, file: !101, line: 73, baseType: !161, size: 8, offset: 96)
!161 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !155, file: !101, line: 74, baseType: !161, size: 8, offset: 104)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !155, file: !101, line: 80, baseType: !161, size: 8, offset: 112)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !151, file: !101, line: 112, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !101, line: 180, size: 16, elements: !167)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !166, file: !101, line: 181, baseType: !169, size: 16)
!169 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !151, file: !101, line: 114, baseType: !171, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !101, line: 90, size: 448, elements: !173)
!173 = !{!174, !175, !176, !181, !182}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !172, file: !101, line: 91, baseType: !154, size: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !172, file: !101, line: 92, baseType: !165, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !172, file: !101, line: 94, baseType: !177, size: 96, offset: 192)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 96, elements: !179)
!178 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!179 = !{!180}
!180 = !DISubrange(count: 3)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !172, file: !101, line: 95, baseType: !177, size: 96, offset: 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !172, file: !101, line: 102, baseType: !183, size: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !151, file: !101, line: 114, baseType: !171, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !151, file: !101, line: 118, baseType: !186, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !101, line: 125, size: 576, elements: !188)
!188 = !{!189, !190, !191, !192, !204, !205, !206, !207}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !187, file: !101, line: 126, baseType: !154, size: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !187, file: !101, line: 129, baseType: !171, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !187, file: !101, line: 130, baseType: !183, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !187, file: !101, line: 131, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !101, line: 164, size: 448, elements: !195)
!195 = !{!196, !197, !198, !201, !202, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !194, file: !101, line: 165, baseType: !154, size: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !194, file: !101, line: 166, baseType: !165, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !194, file: !101, line: 172, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !101, line: 140, baseType: !187)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !194, file: !101, line: 174, baseType: !159, size: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !194, file: !101, line: 175, baseType: !177, size: 96, offset: 288)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !194, file: !101, line: 176, baseType: !169, size: 16, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !187, file: !101, line: 135, baseType: !186, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !187, file: !101, line: 135, baseType: !186, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !101, line: 139, baseType: !186, size: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !187, file: !101, line: 139, baseType: !186, size: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !151, file: !101, line: 122, baseType: !209, size: 128, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !101, line: 108, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !101, line: 106, size: 128, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !101, line: 107, baseType: !183, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !101, line: 107, baseType: !183, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !151, file: !101, line: 122, baseType: !209, size: 128, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !101, line: 103, baseType: !172)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !219, line: 71, baseType: !220)
!219 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !219, line: 69, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !220, file: !219, line: 70, baseType: !148, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !220, file: !219, line: 70, baseType: !148, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !84, line: 79, baseType: !83)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !84, line: 158, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !148}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !84, line: 159, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!148, !148}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !101, line: 178, baseType: !194)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !101, line: 154, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !101, line: 152, size: 128, elements: !239)
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !238, file: !101, line: 153, baseType: !154, size: 128)
!241 = !{i32 7, !"Dwarf Version", i32 4}
!242 = !{i32 2, !"Debug Info Version", i32 3}
!243 = !{i32 1, !"wchar_size", i32 4}
!244 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!245 = distinct !DISubprogram(name: "BIF_clearTransformOrientation", scope: !1, file: !1, line: 68, type: !246, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !253)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !250, line: 69, baseType: !251)
!250 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !252, line: 44, flags: DIFlagFwdDecl)
!252 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!253 = !{}
!254 = !DILocalVariable(name: "C", arg: 1, scope: !245, file: !1, line: 68, type: !248)
!255 = !DILocation(line: 68, column: 46, scope: !245)
!256 = !DILocalVariable(name: "v3d", scope: !245, file: !1, line: 70, type: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "View3D", file: !259, line: 221, baseType: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view3d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View3D", file: !259, line: 151, size: 3008, elements: !261)
!261 = !{!262, !266, !267, !268, !269, !270, !274, !278, !279, !280, !281, !283, !284, !285, !286, !287, !1625, !1626, !1627, !1628, !1651, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !259, line: 152, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !265, line: 44, flags: DIFlagFwdDecl)
!265 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!266 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !259, line: 152, baseType: !263, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !260, file: !259, line: 153, baseType: !218, size: 128, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !260, file: !259, line: 154, baseType: !159, size: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !260, file: !259, line: 155, baseType: !178, size: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !260, file: !259, line: 156, baseType: !271, size: 128, offset: 320)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 8)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "viewquat", scope: !260, file: !259, line: 158, baseType: !275, size: 128, offset: 448)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 128, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 4)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !260, file: !259, line: 159, baseType: !178, size: 32, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_size", scope: !260, file: !259, line: 161, baseType: !178, size: 32, offset: 608)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_drawtype", scope: !260, file: !259, line: 162, baseType: !161, size: 8, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !260, file: !259, line: 163, baseType: !282, size: 24, offset: 648)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 24, elements: !179)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "lay_prev", scope: !260, file: !259, line: 165, baseType: !5, size: 32, offset: 672)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lay_used", scope: !260, file: !259, line: 166, baseType: !5, size: 32, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "persp", scope: !260, file: !259, line: 168, baseType: !169, size: 16, offset: 736)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !260, file: !259, line: 169, baseType: !169, size: 16, offset: 752)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !260, file: !259, line: 171, baseType: !288, size: 64, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !4, line: 115, size: 11392, elements: !290)
!290 = !{!291, !353, !356, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !374, !383, !396, !397, !438, !439, !442, !443, !459, !460, !461, !462, !463, !464, !465, !469, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !547, !548, !549, !550, !551, !552, !553, !554, !555, !558, !561, !564, !565, !566, !567, !568, !571, !593, !596, !597, !603, !604, !605, !606, !607, !608, !609, !612, !615, !619, !1613, !1614}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !289, file: !4, line: 116, baseType: !292, size: 960)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !293, line: 130, baseType: !294)
!293 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !293, line: 117, size: 960, elements: !295)
!295 = !{!296, !297, !298, !300, !319, !323, !324, !325, !326, !327}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !293, line: 118, baseType: !148, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !294, file: !293, line: 118, baseType: !148, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !294, file: !293, line: 119, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !294, file: !293, line: 120, baseType: !301, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !293, line: 136, size: 17600, elements: !303)
!303 = !{!304, !305, !307, !310, !314, !315, !316}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !302, file: !293, line: 137, baseType: !292, size: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !302, file: !293, line: 138, baseType: !306, size: 64, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !302, file: !293, line: 139, baseType: !308, size: 64, offset: 1024)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !293, line: 43, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !293, line: 140, baseType: !311, size: 8192, offset: 1088)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 8192, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 1024)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !302, file: !293, line: 141, baseType: !311, size: 8192, offset: 9280)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !302, file: !293, line: 148, baseType: !301, size: 64, offset: 17472)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !302, file: !293, line: 150, baseType: !317, size: 64, offset: 17536)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !293, line: 45, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !293, line: 121, baseType: !320, size: 528, offset: 256)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 528, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 66)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !294, file: !293, line: 126, baseType: !169, size: 16, offset: 784)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !294, file: !293, line: 127, baseType: !159, size: 32, offset: 800)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !294, file: !293, line: 128, baseType: !159, size: 32, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !294, file: !293, line: 128, baseType: !159, size: 32, offset: 864)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !294, file: !293, line: 129, baseType: !328, size: 64, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !293, line: 75, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !293, line: 62, size: 1024, elements: !331)
!331 = !{!332, !334, !335, !336, !337, !338, !342, !343, !351, !352}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !293, line: 63, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !330, file: !293, line: 63, baseType: !333, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !330, file: !293, line: 64, baseType: !161, size: 8, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !330, file: !293, line: 64, baseType: !161, size: 8, offset: 136)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !293, line: 65, baseType: !169, size: 16, offset: 144)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !293, line: 66, baseType: !339, size: 512, offset: 160)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !330, file: !293, line: 67, baseType: !159, size: 32, offset: 672)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !293, line: 69, baseType: !344, size: 256, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !293, line: 60, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !293, line: 48, size: 256, elements: !346)
!346 = !{!347, !348, !349, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !345, file: !293, line: 49, baseType: !148, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !345, file: !293, line: 58, baseType: !218, size: 128, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !345, file: !293, line: 59, baseType: !159, size: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !345, file: !293, line: 59, baseType: !159, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !330, file: !293, line: 70, baseType: !159, size: 32, offset: 960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !330, file: !293, line: 74, baseType: !159, size: 32, offset: 992)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !289, file: !4, line: 117, baseType: !354, size: 64, offset: 960)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !111, line: 37, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !289, file: !4, line: 119, baseType: !357, size: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !4, line: 57, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !289, file: !4, line: 121, baseType: !169, size: 16, offset: 1088)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !289, file: !4, line: 121, baseType: !169, size: 16, offset: 1104)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !289, file: !4, line: 122, baseType: !159, size: 32, offset: 1120)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !289, file: !4, line: 122, baseType: !159, size: 32, offset: 1152)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !289, file: !4, line: 122, baseType: !159, size: 32, offset: 1184)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !289, file: !4, line: 123, baseType: !339, size: 512, offset: 1216)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !289, file: !4, line: 124, baseType: !288, size: 64, offset: 1728)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !289, file: !4, line: 124, baseType: !288, size: 64, offset: 1792)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !289, file: !4, line: 127, baseType: !288, size: 64, offset: 1856)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !289, file: !4, line: 127, baseType: !288, size: 64, offset: 1920)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !289, file: !4, line: 127, baseType: !288, size: 64, offset: 1984)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !289, file: !4, line: 128, baseType: !371, size: 64, offset: 2048)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !373, line: 44, flags: DIFlagFwdDecl)
!373 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !289, file: !4, line: 130, baseType: !375, size: 64, offset: 2112)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !4, line: 97, size: 832, elements: !377)
!377 = !{!378, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !376, file: !4, line: 98, baseType: !379, size: 768)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 768, elements: !380)
!380 = !{!273, !180}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !4, line: 99, baseType: !159, size: 32, offset: 768)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !376, file: !4, line: 99, baseType: !159, size: 32, offset: 800)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !289, file: !4, line: 131, baseType: !384, size: 64, offset: 2176)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !265, line: 486, size: 1600, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !385, file: !265, line: 487, baseType: !292, size: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !385, file: !265, line: 489, baseType: !218, size: 128, offset: 960)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !385, file: !265, line: 490, baseType: !218, size: 128, offset: 1088)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !385, file: !265, line: 491, baseType: !218, size: 128, offset: 1216)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !385, file: !265, line: 492, baseType: !218, size: 128, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !385, file: !265, line: 494, baseType: !159, size: 32, offset: 1472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !385, file: !265, line: 495, baseType: !159, size: 32, offset: 1504)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !385, file: !265, line: 497, baseType: !159, size: 32, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !385, file: !265, line: 498, baseType: !159, size: 32, offset: 1568)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !289, file: !4, line: 132, baseType: !384, size: 64, offset: 2240)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !289, file: !4, line: 133, baseType: !398, size: 64, offset: 2304)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !265, line: 334, size: 1728, elements: !400)
!400 = !{!401, !402, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !437}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !399, file: !265, line: 335, baseType: !218, size: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !399, file: !265, line: 336, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !373, line: 51, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !399, file: !265, line: 338, baseType: !169, size: 16, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !399, file: !265, line: 338, baseType: !169, size: 16, offset: 208)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !399, file: !265, line: 339, baseType: !5, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !399, file: !265, line: 340, baseType: !159, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !399, file: !265, line: 342, baseType: !178, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !399, file: !265, line: 343, baseType: !177, size: 96, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !399, file: !265, line: 344, baseType: !177, size: 96, offset: 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !399, file: !265, line: 347, baseType: !218, size: 128, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !399, file: !265, line: 349, baseType: !159, size: 32, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !399, file: !265, line: 350, baseType: !159, size: 32, offset: 672)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !399, file: !265, line: 351, baseType: !148, size: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !399, file: !265, line: 352, baseType: !148, size: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !399, file: !265, line: 354, baseType: !418, size: 384, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !265, line: 116, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !265, line: 94, size: 384, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !419, file: !265, line: 96, baseType: !159, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !419, file: !265, line: 96, baseType: !159, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !419, file: !265, line: 97, baseType: !159, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !419, file: !265, line: 97, baseType: !159, size: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !419, file: !265, line: 99, baseType: !169, size: 16, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !419, file: !265, line: 100, baseType: !169, size: 16, offset: 144)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !419, file: !265, line: 102, baseType: !169, size: 16, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !419, file: !265, line: 105, baseType: !169, size: 16, offset: 176)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !419, file: !265, line: 108, baseType: !169, size: 16, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !419, file: !265, line: 109, baseType: !169, size: 16, offset: 208)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !419, file: !265, line: 111, baseType: !169, size: 16, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !419, file: !265, line: 112, baseType: !169, size: 16, offset: 240)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !419, file: !265, line: 114, baseType: !159, size: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !419, file: !265, line: 114, baseType: !159, size: 32, offset: 288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !419, file: !265, line: 115, baseType: !159, size: 32, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !419, file: !265, line: 115, baseType: !159, size: 32, offset: 352)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !399, file: !265, line: 355, baseType: !339, size: 512, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !289, file: !4, line: 134, baseType: !148, size: 64, offset: 2368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !289, file: !4, line: 136, baseType: !440, size: 64, offset: 2432)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 58, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !289, file: !4, line: 138, baseType: !418, size: 384, offset: 2496)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !289, file: !4, line: 139, baseType: !444, size: 64, offset: 2880)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !265, line: 80, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !265, line: 72, size: 192, elements: !447)
!447 = !{!448, !455, !456, !457, !458}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !446, file: !265, line: 73, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !265, line: 59, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !265, line: 56, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !451, file: !265, line: 57, baseType: !177, size: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !451, file: !265, line: 58, baseType: !159, size: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !446, file: !265, line: 74, baseType: !159, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !446, file: !265, line: 76, baseType: !159, size: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !446, file: !265, line: 77, baseType: !159, size: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !446, file: !265, line: 79, baseType: !159, size: 32, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !289, file: !4, line: 141, baseType: !218, size: 128, offset: 2944)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !289, file: !4, line: 142, baseType: !218, size: 128, offset: 3072)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !289, file: !4, line: 143, baseType: !218, size: 128, offset: 3200)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !289, file: !4, line: 144, baseType: !218, size: 128, offset: 3328)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !289, file: !4, line: 146, baseType: !159, size: 32, offset: 3456)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !289, file: !4, line: 147, baseType: !159, size: 32, offset: 3488)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !289, file: !4, line: 150, baseType: !466, size: 64, offset: 3520)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !373, line: 46, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !289, file: !4, line: 151, baseType: !470, size: 64, offset: 3584)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !289, file: !4, line: 152, baseType: !159, size: 32, offset: 3648)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !289, file: !4, line: 153, baseType: !159, size: 32, offset: 3680)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !289, file: !4, line: 156, baseType: !177, size: 96, offset: 3712)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !289, file: !4, line: 156, baseType: !177, size: 96, offset: 3808)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !289, file: !4, line: 156, baseType: !177, size: 96, offset: 3904)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !289, file: !4, line: 157, baseType: !177, size: 96, offset: 4000)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !289, file: !4, line: 158, baseType: !177, size: 96, offset: 4096)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !289, file: !4, line: 159, baseType: !177, size: 96, offset: 4192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !289, file: !4, line: 160, baseType: !177, size: 96, offset: 4288)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !289, file: !4, line: 160, baseType: !177, size: 96, offset: 4384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !289, file: !4, line: 161, baseType: !275, size: 128, offset: 4480)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !289, file: !4, line: 161, baseType: !275, size: 128, offset: 4608)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !289, file: !4, line: 162, baseType: !177, size: 96, offset: 4736)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !289, file: !4, line: 162, baseType: !177, size: 96, offset: 4832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !289, file: !4, line: 163, baseType: !178, size: 32, offset: 4928)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !289, file: !4, line: 163, baseType: !178, size: 32, offset: 4960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !289, file: !4, line: 164, baseType: !488, size: 512, offset: 4992)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 512, elements: !489)
!489 = !{!277, !277}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !289, file: !4, line: 165, baseType: !488, size: 512, offset: 5504)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !289, file: !4, line: 166, baseType: !488, size: 512, offset: 6016)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !289, file: !4, line: 167, baseType: !488, size: 512, offset: 6528)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !289, file: !4, line: 176, baseType: !488, size: 512, offset: 7040)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !289, file: !4, line: 178, baseType: !5, size: 32, offset: 7552)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !289, file: !4, line: 180, baseType: !169, size: 16, offset: 7584)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !289, file: !4, line: 181, baseType: !169, size: 16, offset: 7600)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !289, file: !4, line: 183, baseType: !169, size: 16, offset: 7616)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !289, file: !4, line: 183, baseType: !169, size: 16, offset: 7632)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !289, file: !4, line: 184, baseType: !169, size: 16, offset: 7648)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !289, file: !4, line: 184, baseType: !169, size: 16, offset: 7664)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !289, file: !4, line: 185, baseType: !169, size: 16, offset: 7680)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !289, file: !4, line: 186, baseType: !169, size: 16, offset: 7696)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !289, file: !4, line: 187, baseType: !169, size: 16, offset: 7712)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !289, file: !4, line: 188, baseType: !161, size: 8, offset: 7728)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !289, file: !4, line: 189, baseType: !161, size: 8, offset: 7736)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !289, file: !4, line: 192, baseType: !159, size: 32, offset: 7744)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !289, file: !4, line: 192, baseType: !159, size: 32, offset: 7776)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !289, file: !4, line: 192, baseType: !159, size: 32, offset: 7808)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !289, file: !4, line: 192, baseType: !159, size: 32, offset: 7840)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !289, file: !4, line: 194, baseType: !159, size: 32, offset: 7872)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !289, file: !4, line: 202, baseType: !178, size: 32, offset: 7904)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !289, file: !4, line: 202, baseType: !178, size: 32, offset: 7936)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !289, file: !4, line: 202, baseType: !178, size: 32, offset: 7968)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !289, file: !4, line: 211, baseType: !178, size: 32, offset: 8000)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !289, file: !4, line: 212, baseType: !178, size: 32, offset: 8032)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !289, file: !4, line: 213, baseType: !178, size: 32, offset: 8064)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !289, file: !4, line: 214, baseType: !178, size: 32, offset: 8096)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !289, file: !4, line: 215, baseType: !178, size: 32, offset: 8128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !289, file: !4, line: 216, baseType: !178, size: 32, offset: 8160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !289, file: !4, line: 219, baseType: !178, size: 32, offset: 8192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !289, file: !4, line: 220, baseType: !178, size: 32, offset: 8224)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !289, file: !4, line: 221, baseType: !178, size: 32, offset: 8256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !289, file: !4, line: 224, baseType: !524, size: 16, offset: 8288)
!524 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !289, file: !4, line: 224, baseType: !524, size: 16, offset: 8304)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !289, file: !4, line: 226, baseType: !169, size: 16, offset: 8320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !289, file: !4, line: 228, baseType: !161, size: 8, offset: 8336)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !289, file: !4, line: 229, baseType: !161, size: 8, offset: 8344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !289, file: !4, line: 231, baseType: !169, size: 16, offset: 8352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !289, file: !4, line: 232, baseType: !161, size: 8, offset: 8368)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !289, file: !4, line: 233, baseType: !161, size: 8, offset: 8376)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !289, file: !4, line: 234, baseType: !178, size: 32, offset: 8384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !289, file: !4, line: 235, baseType: !178, size: 32, offset: 8416)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !289, file: !4, line: 237, baseType: !218, size: 128, offset: 8448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !289, file: !4, line: 238, baseType: !218, size: 128, offset: 8576)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !289, file: !4, line: 239, baseType: !218, size: 128, offset: 8704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !289, file: !4, line: 240, baseType: !218, size: 128, offset: 8832)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !289, file: !4, line: 242, baseType: !178, size: 32, offset: 8960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !289, file: !4, line: 244, baseType: !169, size: 16, offset: 8992)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !289, file: !4, line: 245, baseType: !524, size: 16, offset: 9008)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !289, file: !4, line: 246, baseType: !275, size: 128, offset: 9024)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !289, file: !4, line: 248, baseType: !159, size: 32, offset: 9152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !289, file: !4, line: 249, baseType: !159, size: 32, offset: 9184)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !289, file: !4, line: 251, baseType: !545, size: 64, offset: 9216)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !4, line: 251, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !289, file: !4, line: 253, baseType: !161, size: 8, offset: 9280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !289, file: !4, line: 254, baseType: !161, size: 8, offset: 9288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !289, file: !4, line: 255, baseType: !169, size: 16, offset: 9296)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !289, file: !4, line: 256, baseType: !177, size: 96, offset: 9312)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !289, file: !4, line: 258, baseType: !218, size: 128, offset: 9408)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !289, file: !4, line: 259, baseType: !218, size: 128, offset: 9536)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !289, file: !4, line: 260, baseType: !218, size: 128, offset: 9664)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !289, file: !4, line: 261, baseType: !218, size: 128, offset: 9792)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !289, file: !4, line: 263, baseType: !556, size: 64, offset: 9920)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !4, line: 52, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !289, file: !4, line: 264, baseType: !559, size: 64, offset: 9984)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !4, line: 53, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !289, file: !4, line: 265, baseType: !562, size: 64, offset: 10048)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !265, line: 46, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !289, file: !4, line: 267, baseType: !161, size: 8, offset: 10112)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !289, file: !4, line: 268, baseType: !161, size: 8, offset: 10120)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !289, file: !4, line: 269, baseType: !169, size: 16, offset: 10128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !289, file: !4, line: 270, baseType: !178, size: 32, offset: 10144)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !289, file: !4, line: 272, baseType: !569, size: 64, offset: 10176)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !4, line: 54, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !289, file: !4, line: 275, baseType: !572, size: 64, offset: 10240)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !574, line: 49, size: 448, elements: !575)
!574 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!575 = !{!576, !577, !578, !579}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !573, file: !574, line: 50, baseType: !218, size: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !573, file: !574, line: 51, baseType: !218, size: 128, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !573, file: !574, line: 52, baseType: !218, size: 128, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !573, file: !574, line: 53, baseType: !580, size: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !373, line: 65, size: 128, elements: !582)
!582 = !{!583, !591, !592}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !581, file: !373, line: 66, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !373, line: 56, size: 320, elements: !586)
!586 = !{!587, !588, !589, !590}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !585, file: !373, line: 57, baseType: !275, size: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !585, file: !373, line: 58, baseType: !275, size: 128, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !585, file: !373, line: 59, baseType: !178, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !585, file: !373, line: 59, baseType: !178, size: 32, offset: 288)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !581, file: !373, line: 67, baseType: !159, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !581, file: !373, line: 68, baseType: !178, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !289, file: !4, line: 277, baseType: !594, size: 64, offset: 10304)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 56, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !289, file: !4, line: 277, baseType: !594, size: 64, offset: 10368)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !289, file: !4, line: 278, baseType: !598, size: 64, offset: 10432)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !599, line: 27, baseType: !600)
!599 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !601, line: 45, baseType: !602)
!601 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!602 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !289, file: !4, line: 279, baseType: !598, size: 64, offset: 10496)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !289, file: !4, line: 280, baseType: !5, size: 32, offset: 10560)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !289, file: !4, line: 281, baseType: !5, size: 32, offset: 10592)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !289, file: !4, line: 283, baseType: !218, size: 128, offset: 10624)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !289, file: !4, line: 284, baseType: !218, size: 128, offset: 10752)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !289, file: !4, line: 285, baseType: !217, size: 64, offset: 10880)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !289, file: !4, line: 287, baseType: !610, size: 64, offset: 10944)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !4, line: 59, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !289, file: !4, line: 288, baseType: !613, size: 64, offset: 11008)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !4, line: 288, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !289, file: !4, line: 290, baseType: !616, size: 64, offset: 11072)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 64, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 2)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !289, file: !4, line: 291, baseType: !620, size: 64, offset: 11136)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !622, line: 65, baseType: !623)
!622 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !622, line: 50, size: 320, elements: !624)
!624 = !{!625, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !623, file: !622, line: 51, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !628, line: 1216, size: 39680, elements: !629)
!628 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!629 = !{!630, !631, !632, !633, !636, !637, !638, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !664, !668, !671, !965, !968, !1268, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1290, !1291, !1292, !1293, !1294, !1302, !1369, !1376, !1377, !1384, !1592, !1593, !1594, !1595, !1596, !1597}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !627, file: !628, line: 1217, baseType: !292, size: 960)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !627, file: !628, line: 1218, baseType: !354, size: 64, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !627, file: !628, line: 1220, baseType: !288, size: 64, offset: 1024)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !627, file: !628, line: 1221, baseType: !634, size: 64, offset: 1088)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !628, line: 52, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !627, file: !628, line: 1223, baseType: !626, size: 64, offset: 1152)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !627, file: !628, line: 1225, baseType: !218, size: 128, offset: 1216)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !627, file: !628, line: 1226, baseType: !639, size: 64, offset: 1344)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !628, line: 69, size: 320, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !628, line: 70, baseType: !639, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !640, file: !628, line: 70, baseType: !639, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !640, file: !628, line: 71, baseType: !5, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !640, file: !628, line: 71, baseType: !5, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !640, file: !628, line: 72, baseType: !159, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !640, file: !628, line: 73, baseType: !169, size: 16, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !640, file: !628, line: 73, baseType: !169, size: 16, offset: 240)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !640, file: !628, line: 74, baseType: !288, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !627, file: !628, line: 1227, baseType: !288, size: 64, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !627, file: !628, line: 1229, baseType: !177, size: 96, offset: 1472)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !627, file: !628, line: 1230, baseType: !177, size: 96, offset: 1568)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !627, file: !628, line: 1231, baseType: !177, size: 96, offset: 1664)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !627, file: !628, line: 1231, baseType: !177, size: 96, offset: 1760)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !627, file: !628, line: 1233, baseType: !5, size: 32, offset: 1856)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !627, file: !628, line: 1234, baseType: !159, size: 32, offset: 1888)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !627, file: !628, line: 1235, baseType: !5, size: 32, offset: 1920)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !627, file: !628, line: 1237, baseType: !169, size: 16, offset: 1952)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !627, file: !628, line: 1239, baseType: !161, size: 8, offset: 1968)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !627, file: !628, line: 1240, baseType: !661, size: 8, offset: 1976)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 8, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 1)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !627, file: !628, line: 1242, baseType: !665, size: 64, offset: 1984)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !667, line: 248, flags: DIFlagFwdDecl)
!667 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !627, file: !628, line: 1244, baseType: !669, size: 64, offset: 2048)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !628, line: 59, flags: DIFlagFwdDecl)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !627, file: !628, line: 1246, baseType: !672, size: 64, offset: 2112)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !628, line: 1067, size: 5184, elements: !674)
!674 = !{!675, !706, !707, !722, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !744, !838, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !948}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !673, file: !628, line: 1068, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !628, line: 934, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !628, line: 925, size: 576, elements: !679)
!679 = !{!680, !697, !698, !699, !700, !702, !705}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !678, file: !628, line: 926, baseType: !681, size: 320)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !628, line: 830, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !628, line: 813, size: 320, elements: !683)
!683 = !{!684, !687, !690, !691, !694, !695, !696}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !682, file: !628, line: 814, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !628, line: 51, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !682, file: !628, line: 815, baseType: !688, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !628, line: 815, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !682, file: !628, line: 818, baseType: !148, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !682, file: !628, line: 819, baseType: !692, size: 32, offset: 192)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 32, elements: !276)
!693 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !682, file: !628, line: 822, baseType: !159, size: 32, offset: 224)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !682, file: !628, line: 826, baseType: !159, size: 32, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !682, file: !628, line: 829, baseType: !159, size: 32, offset: 288)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !678, file: !628, line: 928, baseType: !169, size: 16, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !678, file: !628, line: 928, baseType: !169, size: 16, offset: 336)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !678, file: !628, line: 929, baseType: !159, size: 32, offset: 352)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !678, file: !628, line: 930, baseType: !701, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !678, file: !628, line: 931, baseType: !703, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !628, line: 931, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !678, file: !628, line: 933, baseType: !148, size: 64, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !673, file: !628, line: 1069, baseType: !676, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !673, file: !628, line: 1070, baseType: !708, size: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !628, line: 916, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !628, line: 891, size: 704, elements: !711)
!711 = !{!712, !713, !714, !716, !717, !718, !719, !720, !721}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !710, file: !628, line: 892, baseType: !681, size: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !710, file: !628, line: 896, baseType: !159, size: 32, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !710, file: !628, line: 900, baseType: !715, size: 96, offset: 352)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 96, elements: !179)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !710, file: !628, line: 903, baseType: !178, size: 32, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !710, file: !628, line: 906, baseType: !159, size: 32, offset: 480)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !710, file: !628, line: 909, baseType: !178, size: 32, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !710, file: !628, line: 912, baseType: !178, size: 32, offset: 544)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !710, file: !628, line: 914, baseType: !288, size: 64, offset: 576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !710, file: !628, line: 915, baseType: !148, size: 64, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !673, file: !628, line: 1071, baseType: !723, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !628, line: 920, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !628, line: 918, size: 320, elements: !726)
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !725, file: !628, line: 919, baseType: !681, size: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !673, file: !628, line: 1075, baseType: !178, size: 32, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !673, file: !628, line: 1077, baseType: !178, size: 32, offset: 288)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !673, file: !628, line: 1078, baseType: !178, size: 32, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !673, file: !628, line: 1079, baseType: !169, size: 16, offset: 352)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !673, file: !628, line: 1082, baseType: !169, size: 16, offset: 368)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !673, file: !628, line: 1085, baseType: !161, size: 8, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !673, file: !628, line: 1086, baseType: !161, size: 8, offset: 392)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !673, file: !628, line: 1087, baseType: !161, size: 8, offset: 400)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !673, file: !628, line: 1088, baseType: !161, size: 8, offset: 408)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !673, file: !628, line: 1090, baseType: !178, size: 32, offset: 416)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !673, file: !628, line: 1093, baseType: !169, size: 16, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !673, file: !628, line: 1096, baseType: !161, size: 8, offset: 464)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !673, file: !628, line: 1098, baseType: !741, size: 40, offset: 472)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 40, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 5)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !673, file: !628, line: 1101, baseType: !745, size: 832, offset: 512)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !628, line: 836, size: 832, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !754, !755, !756, !834, !835, !836, !837}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !745, file: !628, line: 837, baseType: !681, size: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !745, file: !628, line: 839, baseType: !169, size: 16, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !745, file: !628, line: 839, baseType: !169, size: 16, offset: 336)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !745, file: !628, line: 842, baseType: !169, size: 16, offset: 352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !745, file: !628, line: 842, baseType: !169, size: 16, offset: 368)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !745, file: !628, line: 843, baseType: !753, size: 32, offset: 384)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 32, elements: !617)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !745, file: !628, line: 845, baseType: !159, size: 32, offset: 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !745, file: !628, line: 847, baseType: !148, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !745, file: !628, line: 848, baseType: !757, size: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !622, line: 77, size: 15424, elements: !759)
!759 = !{!760, !761, !762, !765, !768, !771, !774, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !823, !824, !828}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !758, file: !622, line: 78, baseType: !292, size: 960)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !758, file: !622, line: 80, baseType: !311, size: 8192, offset: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !758, file: !622, line: 82, baseType: !763, size: 64, offset: 9152)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !622, line: 43, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !758, file: !622, line: 83, baseType: !766, size: 64, offset: 9216)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !293, line: 46, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !758, file: !622, line: 86, baseType: !769, size: 64, offset: 9280)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !622, line: 41, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !758, file: !622, line: 87, baseType: !772, size: 64, offset: 9344)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !622, line: 44, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !758, file: !622, line: 89, baseType: !775, size: 512, offset: 9408)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 512, elements: !272)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !758, file: !622, line: 90, baseType: !169, size: 16, offset: 9920)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !758, file: !622, line: 90, baseType: !169, size: 16, offset: 9936)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !758, file: !622, line: 92, baseType: !169, size: 16, offset: 9952)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !758, file: !622, line: 92, baseType: !169, size: 16, offset: 9968)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !758, file: !622, line: 93, baseType: !169, size: 16, offset: 9984)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !758, file: !622, line: 93, baseType: !169, size: 16, offset: 10000)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !758, file: !622, line: 94, baseType: !159, size: 32, offset: 10016)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !758, file: !622, line: 97, baseType: !169, size: 16, offset: 10048)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !758, file: !622, line: 97, baseType: !169, size: 16, offset: 10064)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !758, file: !622, line: 98, baseType: !169, size: 16, offset: 10080)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !758, file: !622, line: 98, baseType: !169, size: 16, offset: 10096)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !758, file: !622, line: 99, baseType: !169, size: 16, offset: 10112)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !758, file: !622, line: 99, baseType: !169, size: 16, offset: 10128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !758, file: !622, line: 100, baseType: !5, size: 32, offset: 10144)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !758, file: !622, line: 101, baseType: !701, size: 64, offset: 10176)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !758, file: !622, line: 103, baseType: !317, size: 64, offset: 10240)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !758, file: !622, line: 104, baseType: !793, size: 64, offset: 10304)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !293, line: 159, size: 448, elements: !795)
!795 = !{!796, !798, !799, !800, !801, !803}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !794, file: !293, line: 161, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !617)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !794, file: !293, line: 162, baseType: !797, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !794, file: !293, line: 163, baseType: !753, size: 32, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !794, file: !293, line: 164, baseType: !753, size: 32, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !794, file: !293, line: 165, baseType: !802, size: 128, offset: 192)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 128, elements: !617)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !794, file: !293, line: 166, baseType: !804, size: 128, offset: 320)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 128, elements: !617)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !758, file: !622, line: 107, baseType: !178, size: 32, offset: 10368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !758, file: !622, line: 108, baseType: !159, size: 32, offset: 10400)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !758, file: !622, line: 109, baseType: !169, size: 16, offset: 10432)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !758, file: !622, line: 110, baseType: !169, size: 16, offset: 10448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !758, file: !622, line: 113, baseType: !159, size: 32, offset: 10464)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !758, file: !622, line: 113, baseType: !159, size: 32, offset: 10496)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !758, file: !622, line: 114, baseType: !161, size: 8, offset: 10528)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !758, file: !622, line: 114, baseType: !161, size: 8, offset: 10536)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !758, file: !622, line: 115, baseType: !169, size: 16, offset: 10544)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !758, file: !622, line: 116, baseType: !275, size: 128, offset: 10560)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !758, file: !622, line: 119, baseType: !178, size: 32, offset: 10688)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !758, file: !622, line: 119, baseType: !178, size: 32, offset: 10720)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !758, file: !622, line: 122, baseType: !818, size: 512, offset: 10752)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !819, line: 182, baseType: !820)
!819 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !819, line: 180, size: 512, elements: !821)
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !820, file: !819, line: 181, baseType: !339, size: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !758, file: !622, line: 123, baseType: !161, size: 8, offset: 11264)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !758, file: !622, line: 125, baseType: !825, size: 56, offset: 11272)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 56, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 7)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !758, file: !622, line: 126, baseType: !829, size: 4096, offset: 11328)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 4096, elements: !272)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !622, line: 69, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !622, line: 67, size: 512, elements: !832)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !831, file: !622, line: 68, baseType: !339, size: 512)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !745, file: !628, line: 849, baseType: !757, size: 64, offset: 576)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !745, file: !628, line: 850, baseType: !757, size: 64, offset: 640)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !745, file: !628, line: 851, baseType: !177, size: 96, offset: 704)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !745, file: !628, line: 852, baseType: !178, size: 32, offset: 800)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !673, file: !628, line: 1104, baseType: !839, size: 1344, offset: 1344)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !628, line: 867, size: 1344, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !856, !857, !858, !859, !860, !861, !862, !863, !864}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !839, file: !628, line: 868, baseType: !169, size: 16)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !839, file: !628, line: 869, baseType: !169, size: 16, offset: 16)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !839, file: !628, line: 870, baseType: !169, size: 16, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !839, file: !628, line: 871, baseType: !169, size: 16, offset: 48)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !839, file: !628, line: 873, baseType: !846, size: 896, offset: 64)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 896, elements: !826)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !628, line: 864, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !628, line: 859, size: 128, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !848, file: !628, line: 860, baseType: !169, size: 16)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !848, file: !628, line: 861, baseType: !169, size: 16, offset: 16)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !848, file: !628, line: 861, baseType: !169, size: 16, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !848, file: !628, line: 861, baseType: !169, size: 16, offset: 48)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !848, file: !628, line: 862, baseType: !159, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !848, file: !628, line: 863, baseType: !178, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !839, file: !628, line: 874, baseType: !148, size: 64, offset: 960)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !839, file: !628, line: 876, baseType: !178, size: 32, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !839, file: !628, line: 876, baseType: !178, size: 32, offset: 1056)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !839, file: !628, line: 878, baseType: !159, size: 32, offset: 1088)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !839, file: !628, line: 879, baseType: !159, size: 32, offset: 1120)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !839, file: !628, line: 881, baseType: !159, size: 32, offset: 1152)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !839, file: !628, line: 881, baseType: !159, size: 32, offset: 1184)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !839, file: !628, line: 883, baseType: !626, size: 64, offset: 1216)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !839, file: !628, line: 884, baseType: !288, size: 64, offset: 1280)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !673, file: !628, line: 1107, baseType: !178, size: 32, offset: 2688)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !673, file: !628, line: 1110, baseType: !178, size: 32, offset: 2720)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !673, file: !628, line: 1113, baseType: !169, size: 16, offset: 2752)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !673, file: !628, line: 1113, baseType: !169, size: 16, offset: 2768)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !673, file: !628, line: 1116, baseType: !161, size: 8, offset: 2784)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !673, file: !628, line: 1117, baseType: !661, size: 8, offset: 2792)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !673, file: !628, line: 1120, baseType: !169, size: 16, offset: 2800)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !673, file: !628, line: 1121, baseType: !178, size: 32, offset: 2816)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !673, file: !628, line: 1122, baseType: !178, size: 32, offset: 2848)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !673, file: !628, line: 1123, baseType: !178, size: 32, offset: 2880)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !673, file: !628, line: 1124, baseType: !178, size: 32, offset: 2912)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !673, file: !628, line: 1125, baseType: !178, size: 32, offset: 2944)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !673, file: !628, line: 1126, baseType: !178, size: 32, offset: 2976)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !673, file: !628, line: 1127, baseType: !178, size: 32, offset: 3008)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !673, file: !628, line: 1128, baseType: !178, size: 32, offset: 3040)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !673, file: !628, line: 1129, baseType: !178, size: 32, offset: 3072)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !673, file: !628, line: 1130, baseType: !178, size: 32, offset: 3104)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !673, file: !628, line: 1131, baseType: !169, size: 16, offset: 3136)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !673, file: !628, line: 1132, baseType: !161, size: 8, offset: 3152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !673, file: !628, line: 1133, baseType: !161, size: 8, offset: 3160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !673, file: !628, line: 1134, baseType: !282, size: 24, offset: 3168)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !673, file: !628, line: 1135, baseType: !161, size: 8, offset: 3192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !673, file: !628, line: 1138, baseType: !288, size: 64, offset: 3200)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !673, file: !628, line: 1139, baseType: !161, size: 8, offset: 3264)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !673, file: !628, line: 1140, baseType: !161, size: 8, offset: 3272)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !673, file: !628, line: 1141, baseType: !161, size: 8, offset: 3280)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !673, file: !628, line: 1142, baseType: !161, size: 8, offset: 3288)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !673, file: !628, line: 1143, baseType: !161, size: 8, offset: 3296)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !673, file: !628, line: 1144, baseType: !894, size: 64, offset: 3304)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !272)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !673, file: !628, line: 1145, baseType: !894, size: 64, offset: 3368)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !673, file: !628, line: 1148, baseType: !161, size: 8, offset: 3432)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !673, file: !628, line: 1149, baseType: !161, size: 8, offset: 3440)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !673, file: !628, line: 1152, baseType: !161, size: 8, offset: 3448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !673, file: !628, line: 1152, baseType: !161, size: 8, offset: 3456)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !673, file: !628, line: 1153, baseType: !161, size: 8, offset: 3464)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !673, file: !628, line: 1154, baseType: !169, size: 16, offset: 3472)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !673, file: !628, line: 1154, baseType: !169, size: 16, offset: 3488)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !673, file: !628, line: 1155, baseType: !169, size: 16, offset: 3504)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !673, file: !628, line: 1155, baseType: !169, size: 16, offset: 3520)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !673, file: !628, line: 1156, baseType: !161, size: 8, offset: 3536)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !673, file: !628, line: 1157, baseType: !161, size: 8, offset: 3544)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !673, file: !628, line: 1159, baseType: !161, size: 8, offset: 3552)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !673, file: !628, line: 1160, baseType: !161, size: 8, offset: 3560)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !673, file: !628, line: 1161, baseType: !161, size: 8, offset: 3568)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !673, file: !628, line: 1162, baseType: !161, size: 8, offset: 3576)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !673, file: !628, line: 1165, baseType: !159, size: 32, offset: 3584)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !673, file: !628, line: 1166, baseType: !159, size: 32, offset: 3616)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !673, file: !628, line: 1167, baseType: !159, size: 32, offset: 3648)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !673, file: !628, line: 1168, baseType: !159, size: 32, offset: 3680)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !673, file: !628, line: 1171, baseType: !169, size: 16, offset: 3712)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !673, file: !628, line: 1171, baseType: !169, size: 16, offset: 3728)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !673, file: !628, line: 1172, baseType: !159, size: 32, offset: 3744)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !673, file: !628, line: 1173, baseType: !178, size: 32, offset: 3776)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !673, file: !628, line: 1174, baseType: !178, size: 32, offset: 3808)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !673, file: !628, line: 1177, baseType: !921, size: 1024, offset: 3840)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !628, line: 963, size: 1024, elements: !922)
!922 = !{!923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !946, !947}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !921, file: !628, line: 965, baseType: !159, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !921, file: !628, line: 968, baseType: !178, size: 32, offset: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !921, file: !628, line: 971, baseType: !178, size: 32, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !921, file: !628, line: 974, baseType: !178, size: 32, offset: 96)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !921, file: !628, line: 977, baseType: !177, size: 96, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !921, file: !628, line: 979, baseType: !177, size: 96, offset: 224)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !921, file: !628, line: 982, baseType: !159, size: 32, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !921, file: !628, line: 987, baseType: !616, size: 64, offset: 352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !921, file: !628, line: 989, baseType: !178, size: 32, offset: 416)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !921, file: !628, line: 994, baseType: !159, size: 32, offset: 448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !921, file: !628, line: 995, baseType: !159, size: 32, offset: 480)
