; ModuleID = 'blender/source/blender/editors/interface/interface_eyedropper.c'
source_filename = "blender/source/blender/editors/interface/interface_eyedropper.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!70 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!71 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!72 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!73 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!74 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !76, line: 1163, baseType: !5, size: 32, elements: !77)
!76 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!78 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!83 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!84 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!85 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!86 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!87 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!88 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!89 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!90 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!91 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!92 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!93 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!94 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!95 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!96 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!97 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!98 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!99 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 361, baseType: !5, size: 32, elements: !102)
!101 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110}
!103 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!104 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!105 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!107 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!108 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!109 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!110 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 787, baseType: !5, size: 32, elements: !113)
!112 = !DIFile(filename: "blender/source/blender/editors/include/UI_interface.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!113 = !{!114, !115, !116, !117, !118, !119}
!114 = !DIEnumerator(name: "UI_CNR_TOP_LEFT", value: 1, isUnsigned: true)
!115 = !DIEnumerator(name: "UI_CNR_TOP_RIGHT", value: 2, isUnsigned: true)
!116 = !DIEnumerator(name: "UI_CNR_BOTTOM_RIGHT", value: 4, isUnsigned: true)
!117 = !DIEnumerator(name: "UI_CNR_BOTTOM_LEFT", value: 8, isUnsigned: true)
!118 = !DIEnumerator(name: "UI_CNR_NONE", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "UI_CNR_ALL", value: 15, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !26, line: 67, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130}
!122 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!125 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!126 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!127 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!128 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!129 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!130 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!131 = !{!132, !133, !164, !168, !212, !415, !2119}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "Eyedropper", file: !1, line: 85, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Eyedropper", file: !1, line: 75, size: 512, elements: !136)
!136 = !{!137, !141, !154, !158, !160, !162, !167}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !135, file: !1, line: 76, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplay", file: !140, line: 57, flags: DIFlagFwdDecl)
!140 = !DIFile(filename: "blender/source/blender/imbuf/IMB_colormanagement.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !135, file: !1, line: 78, baseType: !142, size: 192, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !35, line: 62, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !35, line: 55, size: 192, elements: !144)
!144 = !{!145, !149, !153}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !143, file: !35, line: 58, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !143, file: !35, line: 56, size: 64, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !35, line: 57, baseType: !132, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !35, line: 60, baseType: !150, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !152, line: 335, flags: DIFlagFwdDecl)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !143, file: !35, line: 61, baseType: !132, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !135, file: !1, line: 79, baseType: !155, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !35, line: 333, baseType: !157)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !35, line: 39, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !135, file: !1, line: 80, baseType: !159, size: 32, offset: 320)
!159 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "accum_start", scope: !135, file: !1, line: 82, baseType: !161, size: 8, offset: 352)
!161 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "accum_col", scope: !135, file: !1, line: 83, baseType: !163, size: 96, offset: 384)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 96, elements: !165)
!164 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!165 = !{!166}
!166 = !DISubrange(count: 3)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "accum_tot", scope: !135, file: !1, line: 84, baseType: !159, size: 32, offset: 480)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataDropper", file: !1, line: 366, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DataDropper", file: !1, line: 357, size: 2112, elements: !171)
!171 = !{!172, !173, !174, !176, !180, !2114, !2115}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !170, file: !1, line: 358, baseType: !142, size: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !170, file: !1, line: 359, baseType: !155, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "idcode", scope: !170, file: !1, line: 360, baseType: !175, size: 16, offset: 256)
!175 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "idcode_name", scope: !170, file: !1, line: 361, baseType: !177, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "art", scope: !170, file: !1, line: 363, baseType: !181, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegionType", file: !183, line: 165, baseType: !184)
!183 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !183, line: 116, size: 1472, elements: !185)
!185 = !{!186, !188, !189, !190, !1957, !1958, !1965, !2088, !2092, !2096, !2097, !2098, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !183, line: 117, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !183, line: 117, baseType: !187, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !184, file: !183, line: 119, baseType: !159, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !184, file: !183, line: 122, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194, !1890}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !26, line: 128, size: 2816, elements: !196)
!196 = !{!197, !265, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1869, !1870, !1871, !1872, !1873, !1884, !1885, !1886, !1887, !1888, !1889}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !195, file: !26, line: 129, baseType: !198, size: 960)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !199, line: 130, baseType: !200)
!199 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !199, line: 117, size: 960, elements: !201)
!201 = !{!202, !203, !204, !206, !225, !229, !230, !231, !232, !233}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !199, line: 118, baseType: !132, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !200, file: !199, line: 118, baseType: !132, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !200, file: !199, line: 119, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !200, file: !199, line: 120, baseType: !207, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !199, line: 136, size: 17600, elements: !209)
!209 = !{!210, !211, !213, !216, !220, !221, !222}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !208, file: !199, line: 137, baseType: !198, size: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !208, file: !199, line: 138, baseType: !212, size: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !208, file: !199, line: 139, baseType: !214, size: 64, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !199, line: 43, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !199, line: 140, baseType: !217, size: 8192, offset: 1088)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 8192, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !208, file: !199, line: 141, baseType: !217, size: 8192, offset: 9280)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !208, file: !199, line: 148, baseType: !207, size: 64, offset: 17472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !208, file: !199, line: 150, baseType: !223, size: 64, offset: 17536)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !199, line: 45, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !199, line: 121, baseType: !226, size: 528, offset: 256)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 528, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 66)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !199, line: 126, baseType: !175, size: 16, offset: 784)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !200, file: !199, line: 127, baseType: !159, size: 32, offset: 800)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !200, file: !199, line: 128, baseType: !159, size: 32, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !200, file: !199, line: 128, baseType: !159, size: 32, offset: 864)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !200, file: !199, line: 129, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !199, line: 75, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !199, line: 62, size: 1024, elements: !237)
!237 = !{!238, !240, !241, !242, !243, !244, !248, !249, !263, !264}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !199, line: 63, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !199, line: 63, baseType: !239, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !199, line: 64, baseType: !179, size: 8, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !236, file: !199, line: 64, baseType: !179, size: 8, offset: 136)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !199, line: 65, baseType: !175, size: 16, offset: 144)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !199, line: 66, baseType: !245, size: 512, offset: 160)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 512, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !236, file: !199, line: 67, baseType: !159, size: 32, offset: 672)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !199, line: 69, baseType: !250, size: 256, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !199, line: 60, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !199, line: 48, size: 256, elements: !252)
!252 = !{!253, !254, !261, !262}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !251, file: !199, line: 49, baseType: !132, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !251, file: !199, line: 58, baseType: !255, size: 128, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !256, line: 71, baseType: !257)
!256 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !256, line: 69, size: 128, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !257, file: !256, line: 70, baseType: !132, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !257, file: !256, line: 70, baseType: !132, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !251, file: !199, line: 59, baseType: !159, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !251, file: !199, line: 59, baseType: !159, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !236, file: !199, line: 70, baseType: !159, size: 32, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !236, file: !199, line: 74, baseType: !159, size: 32, offset: 992)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !195, file: !26, line: 131, baseType: !266, size: 64, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !26, line: 169, size: 2048, elements: !268)
!268 = !{!269, !270, !271, !272, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1828, !1831, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !26, line: 170, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !267, file: !26, line: 170, baseType: !266, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !267, file: !26, line: 172, baseType: !132, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !267, file: !26, line: 174, baseType: !273, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !101, line: 49, size: 1984, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1770}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !274, file: !101, line: 50, baseType: !198, size: 960)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !274, file: !101, line: 52, baseType: !255, size: 128, offset: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !274, file: !101, line: 53, baseType: !255, size: 128, offset: 1088)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !274, file: !101, line: 54, baseType: !255, size: 128, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !274, file: !101, line: 55, baseType: !255, size: 128, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !274, file: !101, line: 57, baseType: !282, size: 64, offset: 1472)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !284, line: 1216, size: 39680, elements: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = !{!286, !287, !291, !582, !585, !586, !587, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !613, !683, !1107, !1321, !1324, !1612, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1634, !1635, !1636, !1637, !1638, !1646, !1713, !1720, !1721, !1728, !1729, !1730, !1731, !1732, !1733, !1734}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !283, file: !284, line: 1217, baseType: !198, size: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !283, file: !284, line: 1218, baseType: !288, size: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !290, line: 43, flags: DIFlagFwdDecl)
!290 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!291 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !283, file: !284, line: 1220, baseType: !292, size: 64, offset: 1024)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !294, line: 115, size: 11392, elements: !295)
!294 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!295 = !{!296, !297, !298, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !316, !326, !340, !341, !382, !383, !387, !388, !404, !405, !406, !407, !408, !409, !410, !414, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !430, !431, !432, !433, !434, !435, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !495, !496, !497, !498, !499, !500, !501, !502, !503, !506, !509, !513, !514, !515, !516, !517, !520, !523, !526, !527, !533, !534, !535, !536, !537, !538, !540, !543, !546, !550, !570, !571}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !293, file: !294, line: 116, baseType: !198, size: 960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !293, file: !294, line: 117, baseType: !288, size: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !293, file: !294, line: 119, baseType: !299, size: 64, offset: 1024)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !294, line: 57, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !293, file: !294, line: 121, baseType: !175, size: 16, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !293, file: !294, line: 121, baseType: !175, size: 16, offset: 1104)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !293, file: !294, line: 122, baseType: !159, size: 32, offset: 1120)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !293, file: !294, line: 122, baseType: !159, size: 32, offset: 1152)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !293, file: !294, line: 122, baseType: !159, size: 32, offset: 1184)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !293, file: !294, line: 123, baseType: !245, size: 512, offset: 1216)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !293, file: !294, line: 124, baseType: !292, size: 64, offset: 1728)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !293, file: !294, line: 124, baseType: !292, size: 64, offset: 1792)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !293, file: !294, line: 127, baseType: !292, size: 64, offset: 1856)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !293, file: !294, line: 127, baseType: !292, size: 64, offset: 1920)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !293, file: !294, line: 127, baseType: !292, size: 64, offset: 1984)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !293, file: !294, line: 128, baseType: !313, size: 64, offset: 2048)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !315, line: 49, flags: DIFlagFwdDecl)
!315 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !293, file: !294, line: 130, baseType: !317, size: 64, offset: 2112)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !294, line: 97, size: 832, elements: !319)
!319 = !{!320, !324, !325}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !318, file: !294, line: 98, baseType: !321, size: 768)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 768, elements: !322)
!322 = !{!323, !166}
!323 = !DISubrange(count: 8)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !294, line: 99, baseType: !159, size: 32, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !318, file: !294, line: 99, baseType: !159, size: 32, offset: 800)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !293, file: !294, line: 131, baseType: !327, size: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !329, line: 486, size: 1600, elements: !330)
!329 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !328, file: !329, line: 487, baseType: !198, size: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !328, file: !329, line: 489, baseType: !255, size: 128, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !328, file: !329, line: 490, baseType: !255, size: 128, offset: 1088)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !328, file: !329, line: 491, baseType: !255, size: 128, offset: 1216)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !328, file: !329, line: 492, baseType: !255, size: 128, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !328, file: !329, line: 494, baseType: !159, size: 32, offset: 1472)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !328, file: !329, line: 495, baseType: !159, size: 32, offset: 1504)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !328, file: !329, line: 497, baseType: !159, size: 32, offset: 1536)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !328, file: !329, line: 498, baseType: !159, size: 32, offset: 1568)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !293, file: !294, line: 132, baseType: !327, size: 64, offset: 2240)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !293, file: !294, line: 133, baseType: !342, size: 64, offset: 2304)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !329, line: 334, size: 1728, elements: !344)
!344 = !{!345, !346, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !381}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !343, file: !329, line: 335, baseType: !255, size: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !343, file: !329, line: 336, baseType: !347, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !76, line: 74, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !343, file: !329, line: 338, baseType: !175, size: 16, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !343, file: !329, line: 338, baseType: !175, size: 16, offset: 208)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !343, file: !329, line: 339, baseType: !5, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !343, file: !329, line: 340, baseType: !159, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !343, file: !329, line: 342, baseType: !164, size: 32, offset: 288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !343, file: !329, line: 343, baseType: !163, size: 96, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !343, file: !329, line: 344, baseType: !163, size: 96, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !343, file: !329, line: 347, baseType: !255, size: 128, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !343, file: !329, line: 349, baseType: !159, size: 32, offset: 640)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !343, file: !329, line: 350, baseType: !159, size: 32, offset: 672)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !343, file: !329, line: 351, baseType: !132, size: 64, offset: 704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !343, file: !329, line: 352, baseType: !132, size: 64, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !343, file: !329, line: 354, baseType: !362, size: 384, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !329, line: 116, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !329, line: 94, size: 384, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !363, file: !329, line: 96, baseType: !159, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !363, file: !329, line: 96, baseType: !159, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !363, file: !329, line: 97, baseType: !159, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !363, file: !329, line: 97, baseType: !159, size: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !363, file: !329, line: 99, baseType: !175, size: 16, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !363, file: !329, line: 100, baseType: !175, size: 16, offset: 144)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !363, file: !329, line: 102, baseType: !175, size: 16, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !363, file: !329, line: 105, baseType: !175, size: 16, offset: 176)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !363, file: !329, line: 108, baseType: !175, size: 16, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !363, file: !329, line: 109, baseType: !175, size: 16, offset: 208)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !363, file: !329, line: 111, baseType: !175, size: 16, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !363, file: !329, line: 112, baseType: !175, size: 16, offset: 240)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !363, file: !329, line: 114, baseType: !159, size: 32, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !363, file: !329, line: 114, baseType: !159, size: 32, offset: 288)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !363, file: !329, line: 115, baseType: !159, size: 32, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !363, file: !329, line: 115, baseType: !159, size: 32, offset: 352)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !343, file: !329, line: 355, baseType: !245, size: 512, offset: 1216)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !293, file: !294, line: 134, baseType: !132, size: 64, offset: 2368)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !293, file: !294, line: 136, baseType: !384, size: 64, offset: 2432)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !386, line: 45, flags: DIFlagFwdDecl)
!386 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!387 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !293, file: !294, line: 138, baseType: !362, size: 384, offset: 2496)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !293, file: !294, line: 139, baseType: !389, size: 64, offset: 2880)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !329, line: 80, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !329, line: 72, size: 192, elements: !392)
!392 = !{!393, !400, !401, !402, !403}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !391, file: !329, line: 73, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !329, line: 59, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !329, line: 56, size: 128, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !396, file: !329, line: 57, baseType: !163, size: 96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !396, file: !329, line: 58, baseType: !159, size: 32, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !391, file: !329, line: 74, baseType: !159, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !391, file: !329, line: 76, baseType: !159, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !391, file: !329, line: 77, baseType: !159, size: 32, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !329, line: 79, baseType: !159, size: 32, offset: 160)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !293, file: !294, line: 141, baseType: !255, size: 128, offset: 2944)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !293, file: !294, line: 142, baseType: !255, size: 128, offset: 3072)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !293, file: !294, line: 143, baseType: !255, size: 128, offset: 3200)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !293, file: !294, line: 144, baseType: !255, size: 128, offset: 3328)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !293, file: !294, line: 146, baseType: !159, size: 32, offset: 3456)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !293, file: !294, line: 147, baseType: !159, size: 32, offset: 3488)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !293, file: !294, line: 150, baseType: !411, size: 64, offset: 3520)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !284, line: 179, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !293, file: !294, line: 151, baseType: !415, size: 64, offset: 3584)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !293, file: !294, line: 152, baseType: !159, size: 32, offset: 3648)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !293, file: !294, line: 153, baseType: !159, size: 32, offset: 3680)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !293, file: !294, line: 156, baseType: !163, size: 96, offset: 3712)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !293, file: !294, line: 156, baseType: !163, size: 96, offset: 3808)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !293, file: !294, line: 156, baseType: !163, size: 96, offset: 3904)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !293, file: !294, line: 157, baseType: !163, size: 96, offset: 4000)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !293, file: !294, line: 158, baseType: !163, size: 96, offset: 4096)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !293, file: !294, line: 159, baseType: !163, size: 96, offset: 4192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !293, file: !294, line: 160, baseType: !163, size: 96, offset: 4288)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !293, file: !294, line: 160, baseType: !163, size: 96, offset: 4384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !293, file: !294, line: 161, baseType: !427, size: 128, offset: 4480)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 4)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !293, file: !294, line: 161, baseType: !427, size: 128, offset: 4608)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !293, file: !294, line: 162, baseType: !163, size: 96, offset: 4736)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !293, file: !294, line: 162, baseType: !163, size: 96, offset: 4832)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !293, file: !294, line: 163, baseType: !164, size: 32, offset: 4928)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !293, file: !294, line: 163, baseType: !164, size: 32, offset: 4960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !293, file: !294, line: 164, baseType: !436, size: 512, offset: 4992)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 512, elements: !437)
!437 = !{!429, !429}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !293, file: !294, line: 165, baseType: !436, size: 512, offset: 5504)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !293, file: !294, line: 166, baseType: !436, size: 512, offset: 6016)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !293, file: !294, line: 167, baseType: !436, size: 512, offset: 6528)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !293, file: !294, line: 176, baseType: !436, size: 512, offset: 7040)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !293, file: !294, line: 178, baseType: !5, size: 32, offset: 7552)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !294, line: 180, baseType: !175, size: 16, offset: 7584)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !293, file: !294, line: 181, baseType: !175, size: 16, offset: 7600)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !293, file: !294, line: 183, baseType: !175, size: 16, offset: 7616)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !293, file: !294, line: 183, baseType: !175, size: 16, offset: 7632)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !293, file: !294, line: 184, baseType: !175, size: 16, offset: 7648)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !293, file: !294, line: 184, baseType: !175, size: 16, offset: 7664)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !293, file: !294, line: 185, baseType: !175, size: 16, offset: 7680)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !293, file: !294, line: 186, baseType: !175, size: 16, offset: 7696)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !293, file: !294, line: 187, baseType: !175, size: 16, offset: 7712)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !293, file: !294, line: 188, baseType: !179, size: 8, offset: 7728)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !293, file: !294, line: 189, baseType: !179, size: 8, offset: 7736)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !293, file: !294, line: 192, baseType: !159, size: 32, offset: 7744)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !293, file: !294, line: 192, baseType: !159, size: 32, offset: 7776)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !293, file: !294, line: 192, baseType: !159, size: 32, offset: 7808)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !293, file: !294, line: 192, baseType: !159, size: 32, offset: 7840)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !294, line: 194, baseType: !159, size: 32, offset: 7872)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !293, file: !294, line: 202, baseType: !164, size: 32, offset: 7904)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !293, file: !294, line: 202, baseType: !164, size: 32, offset: 7936)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !293, file: !294, line: 202, baseType: !164, size: 32, offset: 7968)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !293, file: !294, line: 211, baseType: !164, size: 32, offset: 8000)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !293, file: !294, line: 212, baseType: !164, size: 32, offset: 8032)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !293, file: !294, line: 213, baseType: !164, size: 32, offset: 8064)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !293, file: !294, line: 214, baseType: !164, size: 32, offset: 8096)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !293, file: !294, line: 215, baseType: !164, size: 32, offset: 8128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !293, file: !294, line: 216, baseType: !164, size: 32, offset: 8160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !293, file: !294, line: 219, baseType: !164, size: 32, offset: 8192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !293, file: !294, line: 220, baseType: !164, size: 32, offset: 8224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !293, file: !294, line: 221, baseType: !164, size: 32, offset: 8256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !293, file: !294, line: 224, baseType: !472, size: 16, offset: 8288)
!472 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !293, file: !294, line: 224, baseType: !472, size: 16, offset: 8304)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !293, file: !294, line: 226, baseType: !175, size: 16, offset: 8320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !293, file: !294, line: 228, baseType: !179, size: 8, offset: 8336)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !293, file: !294, line: 229, baseType: !179, size: 8, offset: 8344)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !293, file: !294, line: 231, baseType: !175, size: 16, offset: 8352)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !293, file: !294, line: 232, baseType: !179, size: 8, offset: 8368)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !293, file: !294, line: 233, baseType: !179, size: 8, offset: 8376)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !293, file: !294, line: 234, baseType: !164, size: 32, offset: 8384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !293, file: !294, line: 235, baseType: !164, size: 32, offset: 8416)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !293, file: !294, line: 237, baseType: !255, size: 128, offset: 8448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !293, file: !294, line: 238, baseType: !255, size: 128, offset: 8576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !293, file: !294, line: 239, baseType: !255, size: 128, offset: 8704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !293, file: !294, line: 240, baseType: !255, size: 128, offset: 8832)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !293, file: !294, line: 242, baseType: !164, size: 32, offset: 8960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !293, file: !294, line: 244, baseType: !175, size: 16, offset: 8992)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !293, file: !294, line: 245, baseType: !472, size: 16, offset: 9008)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !293, file: !294, line: 246, baseType: !427, size: 128, offset: 9024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !293, file: !294, line: 248, baseType: !159, size: 32, offset: 9152)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !293, file: !294, line: 249, baseType: !159, size: 32, offset: 9184)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !293, file: !294, line: 251, baseType: !493, size: 64, offset: 9216)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !294, line: 251, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !293, file: !294, line: 253, baseType: !179, size: 8, offset: 9280)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !293, file: !294, line: 254, baseType: !179, size: 8, offset: 9288)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !293, file: !294, line: 255, baseType: !175, size: 16, offset: 9296)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !293, file: !294, line: 256, baseType: !163, size: 96, offset: 9312)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !293, file: !294, line: 258, baseType: !255, size: 128, offset: 9408)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !293, file: !294, line: 259, baseType: !255, size: 128, offset: 9536)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !293, file: !294, line: 260, baseType: !255, size: 128, offset: 9664)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !293, file: !294, line: 261, baseType: !255, size: 128, offset: 9792)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !293, file: !294, line: 263, baseType: !504, size: 64, offset: 9920)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !294, line: 52, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !293, file: !294, line: 264, baseType: !507, size: 64, offset: 9984)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !294, line: 53, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !293, file: !294, line: 265, baseType: !510, size: 64, offset: 10048)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !512, line: 43, flags: DIFlagFwdDecl)
!512 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!513 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !293, file: !294, line: 267, baseType: !179, size: 8, offset: 10112)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !293, file: !294, line: 268, baseType: !179, size: 8, offset: 10120)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !293, file: !294, line: 269, baseType: !175, size: 16, offset: 10128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !293, file: !294, line: 270, baseType: !164, size: 32, offset: 10144)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !293, file: !294, line: 272, baseType: !518, size: 64, offset: 10176)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !294, line: 54, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !293, file: !294, line: 275, baseType: !521, size: 64, offset: 10240)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !294, line: 275, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !293, file: !294, line: 277, baseType: !524, size: 64, offset: 10304)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !294, line: 56, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !293, file: !294, line: 277, baseType: !524, size: 64, offset: 10368)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !293, file: !294, line: 278, baseType: !528, size: 64, offset: 10432)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !529, line: 27, baseType: !530)
!529 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !531, line: 45, baseType: !532)
!531 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!532 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !293, file: !294, line: 279, baseType: !528, size: 64, offset: 10496)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !293, file: !294, line: 280, baseType: !5, size: 32, offset: 10560)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !293, file: !294, line: 281, baseType: !5, size: 32, offset: 10592)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !293, file: !294, line: 283, baseType: !255, size: 128, offset: 10624)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !293, file: !294, line: 284, baseType: !255, size: 128, offset: 10752)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !293, file: !294, line: 285, baseType: !539, size: 64, offset: 10880)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !293, file: !294, line: 287, baseType: !541, size: 64, offset: 10944)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !294, line: 59, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !293, file: !294, line: 288, baseType: !544, size: 64, offset: 11008)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !294, line: 288, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !293, file: !294, line: 290, baseType: !547, size: 64, offset: 11072)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 64, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 2)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !293, file: !294, line: 291, baseType: !551, size: 64, offset: 11136)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !553, line: 65, baseType: !554)
!553 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !553, line: 50, size: 320, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !554, file: !553, line: 51, baseType: !282, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !554, file: !553, line: 53, baseType: !159, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !554, file: !553, line: 54, baseType: !159, size: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !554, file: !553, line: 55, baseType: !159, size: 32, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !554, file: !553, line: 55, baseType: !159, size: 32, offset: 160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !554, file: !553, line: 56, baseType: !179, size: 8, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !554, file: !553, line: 56, baseType: !179, size: 8, offset: 200)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !554, file: !553, line: 57, baseType: !179, size: 8, offset: 208)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !554, file: !553, line: 57, baseType: !179, size: 8, offset: 216)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !554, file: !553, line: 59, baseType: !175, size: 16, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !554, file: !553, line: 59, baseType: !175, size: 16, offset: 240)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !554, file: !553, line: 59, baseType: !175, size: 16, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !554, file: !553, line: 61, baseType: !175, size: 16, offset: 272)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !554, file: !553, line: 63, baseType: !159, size: 32, offset: 288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !293, file: !294, line: 293, baseType: !255, size: 128, offset: 11200)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !293, file: !294, line: 294, baseType: !572, size: 64, offset: 11328)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !294, line: 113, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !294, line: 108, size: 256, elements: !575)
!575 = !{!576, !578, !579, !580, !581}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !574, file: !294, line: 109, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !574, file: !294, line: 109, baseType: !577, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !574, file: !294, line: 110, baseType: !292, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !574, file: !294, line: 111, baseType: !159, size: 32, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !574, file: !294, line: 112, baseType: !164, size: 32, offset: 224)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !283, file: !284, line: 1221, baseType: !583, size: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !284, line: 52, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !283, file: !284, line: 1223, baseType: !282, size: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !283, file: !284, line: 1225, baseType: !255, size: 128, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !283, file: !284, line: 1226, baseType: !588, size: 64, offset: 1344)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !284, line: 69, size: 320, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !589, file: !284, line: 70, baseType: !588, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !589, file: !284, line: 70, baseType: !588, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !589, file: !284, line: 71, baseType: !5, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !589, file: !284, line: 71, baseType: !5, size: 32, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !589, file: !284, line: 72, baseType: !159, size: 32, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !589, file: !284, line: 73, baseType: !175, size: 16, offset: 224)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !589, file: !284, line: 73, baseType: !175, size: 16, offset: 240)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !589, file: !284, line: 74, baseType: !292, size: 64, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !283, file: !284, line: 1227, baseType: !292, size: 64, offset: 1408)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !283, file: !284, line: 1229, baseType: !163, size: 96, offset: 1472)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !283, file: !284, line: 1230, baseType: !163, size: 96, offset: 1568)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !283, file: !284, line: 1231, baseType: !163, size: 96, offset: 1664)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !283, file: !284, line: 1231, baseType: !163, size: 96, offset: 1760)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !283, file: !284, line: 1233, baseType: !5, size: 32, offset: 1856)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !283, file: !284, line: 1234, baseType: !159, size: 32, offset: 1888)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !283, file: !284, line: 1235, baseType: !5, size: 32, offset: 1920)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !284, line: 1237, baseType: !175, size: 16, offset: 1952)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !283, file: !284, line: 1239, baseType: !179, size: 8, offset: 1968)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !283, file: !284, line: 1240, baseType: !610, size: 8, offset: 1976)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 8, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 1)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !283, file: !284, line: 1242, baseType: !614, size: 64, offset: 1984)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !152, line: 328, size: 3456, elements: !616)
!616 = !{!617, !618, !619, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !649, !650, !651, !654, !659, !660, !663, !667, !671, !675, !679, !680, !681, !682}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !615, file: !152, line: 329, baseType: !198, size: 960)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !615, file: !152, line: 330, baseType: !288, size: 64, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !615, file: !152, line: 332, baseType: !620, size: 64, offset: 1024)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !152, line: 332, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !615, file: !152, line: 333, baseType: !245, size: 512, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !615, file: !152, line: 335, baseType: !150, size: 64, offset: 1600)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !615, file: !152, line: 337, baseType: !384, size: 64, offset: 1664)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !615, file: !152, line: 338, baseType: !547, size: 64, offset: 1728)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !615, file: !152, line: 340, baseType: !255, size: 128, offset: 1792)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !615, file: !152, line: 340, baseType: !255, size: 128, offset: 1920)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !615, file: !152, line: 342, baseType: !159, size: 32, offset: 2048)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !615, file: !152, line: 342, baseType: !159, size: 32, offset: 2080)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !615, file: !152, line: 343, baseType: !159, size: 32, offset: 2112)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !615, file: !152, line: 345, baseType: !159, size: 32, offset: 2144)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !615, file: !152, line: 346, baseType: !159, size: 32, offset: 2176)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !615, file: !152, line: 347, baseType: !175, size: 16, offset: 2208)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !615, file: !152, line: 348, baseType: !175, size: 16, offset: 2224)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !615, file: !152, line: 349, baseType: !159, size: 32, offset: 2240)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !615, file: !152, line: 351, baseType: !159, size: 32, offset: 2272)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !615, file: !152, line: 353, baseType: !175, size: 16, offset: 2304)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !615, file: !152, line: 354, baseType: !175, size: 16, offset: 2320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !615, file: !152, line: 355, baseType: !159, size: 32, offset: 2336)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !615, file: !152, line: 357, baseType: !641, size: 128, offset: 2368)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !642, line: 95, baseType: !643)
!642 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !642, line: 92, size: 128, elements: !644)
!644 = !{!645, !646, !647, !648}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !643, file: !642, line: 93, baseType: !164, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !643, file: !642, line: 93, baseType: !164, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !643, file: !642, line: 94, baseType: !164, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !643, file: !642, line: 94, baseType: !164, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !615, file: !152, line: 363, baseType: !255, size: 128, offset: 2496)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !615, file: !152, line: 363, baseType: !255, size: 128, offset: 2624)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !615, file: !152, line: 368, baseType: !652, size: 64, offset: 2752)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !152, line: 48, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !615, file: !152, line: 372, baseType: !655, size: 32, offset: 2816)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !152, line: 274, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !152, line: 271, size: 32, elements: !657)
!657 = !{!658}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !656, file: !152, line: 273, baseType: !5, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !615, file: !152, line: 373, baseType: !159, size: 32, offset: 2848)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !615, file: !152, line: 382, baseType: !661, size: 64, offset: 2880)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !152, line: 46, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !615, file: !152, line: 385, baseType: !664, size: 64, offset: 2944)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !132, !164}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !615, file: !152, line: 386, baseType: !668, size: 64, offset: 3008)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !132, !415}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !615, file: !152, line: 387, baseType: !672, size: 64, offset: 3072)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!159, !132}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !615, file: !152, line: 388, baseType: !676, size: 64, offset: 3136)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !132}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !615, file: !152, line: 389, baseType: !132, size: 64, offset: 3200)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !615, file: !152, line: 389, baseType: !132, size: 64, offset: 3264)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !615, file: !152, line: 389, baseType: !132, size: 64, offset: 3328)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !615, file: !152, line: 389, baseType: !132, size: 64, offset: 3392)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !283, file: !284, line: 1244, baseType: !684, size: 64, offset: 2048)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !315, line: 200, size: 17024, elements: !686)
!686 = !{!687, !688, !689, !690, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !685, file: !315, line: 201, baseType: !539, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !685, file: !315, line: 202, baseType: !255, size: 128, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !685, file: !315, line: 203, baseType: !255, size: 128, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !685, file: !315, line: 206, baseType: !691, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !315, line: 190, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !315, line: 126, size: 2816, elements: !694)
!694 = !{!695, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !793, !794, !795, !796, !1072, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1099}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !693, file: !315, line: 127, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !693, file: !315, line: 127, baseType: !696, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !693, file: !315, line: 128, baseType: !132, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !693, file: !315, line: 129, baseType: !132, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !693, file: !315, line: 130, baseType: !245, size: 512, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !693, file: !315, line: 132, baseType: !159, size: 32, offset: 768)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !693, file: !315, line: 132, baseType: !159, size: 32, offset: 800)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !693, file: !315, line: 133, baseType: !159, size: 32, offset: 832)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !693, file: !315, line: 134, baseType: !159, size: 32, offset: 864)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !693, file: !315, line: 134, baseType: !159, size: 32, offset: 896)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !693, file: !315, line: 134, baseType: !159, size: 32, offset: 928)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !693, file: !315, line: 135, baseType: !159, size: 32, offset: 960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !693, file: !315, line: 135, baseType: !159, size: 32, offset: 992)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !693, file: !315, line: 136, baseType: !159, size: 32, offset: 1024)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !693, file: !315, line: 136, baseType: !159, size: 32, offset: 1056)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !693, file: !315, line: 137, baseType: !159, size: 32, offset: 1088)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !693, file: !315, line: 137, baseType: !159, size: 32, offset: 1120)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !693, file: !315, line: 138, baseType: !164, size: 32, offset: 1152)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !693, file: !315, line: 139, baseType: !164, size: 32, offset: 1184)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !693, file: !315, line: 139, baseType: !164, size: 32, offset: 1216)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !693, file: !315, line: 141, baseType: !175, size: 16, offset: 1248)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !693, file: !315, line: 142, baseType: !175, size: 16, offset: 1264)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !693, file: !315, line: 143, baseType: !159, size: 32, offset: 1280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !693, file: !315, line: 144, baseType: !159, size: 32, offset: 1312)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !693, file: !315, line: 146, baseType: !721, size: 64, offset: 1344)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !315, line: 114, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !315, line: 99, size: 7232, elements: !724)
!724 = !{!725, !727, !728, !729, !730, !731, !732, !743, !747, !761, !770, !777, !787}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !315, line: 100, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !723, file: !315, line: 100, baseType: !726, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !723, file: !315, line: 101, baseType: !159, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !723, file: !315, line: 101, baseType: !159, size: 32, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !723, file: !315, line: 102, baseType: !159, size: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !723, file: !315, line: 102, baseType: !159, size: 32, offset: 224)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !723, file: !315, line: 103, baseType: !733, size: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !315, line: 59, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !315, line: 56, size: 2112, elements: !736)
!736 = !{!737, !741, !742}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !735, file: !315, line: 57, baseType: !738, size: 2048)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 2048, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !735, file: !315, line: 58, baseType: !159, size: 32, offset: 2048)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !735, file: !315, line: 58, baseType: !159, size: 32, offset: 2080)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !723, file: !315, line: 106, baseType: !744, size: 6144, offset: 320)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 6144, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !723, file: !315, line: 107, baseType: !748, size: 64, offset: 6464)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !315, line: 97, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !315, line: 83, size: 8320, elements: !751)
!751 = !{!752, !753, !754, !757, !758, !759, !760}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !750, file: !315, line: 84, baseType: !744, size: 6144)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !750, file: !315, line: 87, baseType: !738, size: 2048, offset: 6144)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !750, file: !315, line: 88, baseType: !755, size: 64, offset: 8192)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !553, line: 41, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !750, file: !315, line: 90, baseType: !175, size: 16, offset: 8256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !750, file: !315, line: 92, baseType: !175, size: 16, offset: 8272)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !750, file: !315, line: 93, baseType: !175, size: 16, offset: 8288)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !750, file: !315, line: 95, baseType: !175, size: 16, offset: 8304)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !723, file: !315, line: 108, baseType: !762, size: 64, offset: 6528)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !315, line: 66, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !315, line: 61, size: 128, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !764, file: !315, line: 62, baseType: !159, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !764, file: !315, line: 63, baseType: !159, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !764, file: !315, line: 64, baseType: !159, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !764, file: !315, line: 65, baseType: !159, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !723, file: !315, line: 109, baseType: !771, size: 64, offset: 6592)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !315, line: 71, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !315, line: 68, size: 64, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !773, file: !315, line: 69, baseType: !159, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !773, file: !315, line: 70, baseType: !159, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !723, file: !315, line: 110, baseType: !778, size: 64, offset: 6656)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !315, line: 81, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !315, line: 73, size: 352, elements: !781)
!781 = !{!782, !783, !784, !785, !786}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !780, file: !315, line: 74, baseType: !163, size: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !780, file: !315, line: 75, baseType: !163, size: 96, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !780, file: !315, line: 76, baseType: !163, size: 96, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !780, file: !315, line: 77, baseType: !159, size: 32, offset: 288)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !780, file: !315, line: 78, baseType: !159, size: 32, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !723, file: !315, line: 113, baseType: !788, size: 512, offset: 6720)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !789, line: 182, baseType: !790)
!789 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !789, line: 180, size: 512, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !790, file: !789, line: 181, baseType: !245, size: 512)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !693, file: !315, line: 148, baseType: !313, size: 64, offset: 1408)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !693, file: !315, line: 151, baseType: !282, size: 64, offset: 1472)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !693, file: !315, line: 152, baseType: !292, size: 64, offset: 1536)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !693, file: !315, line: 153, baseType: !797, size: 64, offset: 1600)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !290, line: 64, size: 19136, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !807, !808, !809, !810, !813, !814, !1058, !1059, !1067, !1068, !1069, !1070, !1071}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !798, file: !290, line: 65, baseType: !198, size: 960)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !798, file: !290, line: 66, baseType: !288, size: 64, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !290, line: 68, baseType: !217, size: 8192, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !798, file: !290, line: 70, baseType: !159, size: 32, offset: 9216)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !798, file: !290, line: 71, baseType: !159, size: 32, offset: 9248)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !798, file: !290, line: 72, baseType: !806, size: 64, offset: 9280)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 64, elements: !548)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !798, file: !290, line: 74, baseType: !164, size: 32, offset: 9344)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !798, file: !290, line: 74, baseType: !164, size: 32, offset: 9376)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !798, file: !290, line: 76, baseType: !755, size: 64, offset: 9408)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !798, file: !290, line: 77, baseType: !811, size: 64, offset: 9472)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !290, line: 77, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !798, file: !290, line: 78, baseType: !384, size: 64, offset: 9536)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !798, file: !290, line: 80, baseType: !815, size: 2624, offset: 9600)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !386, line: 340, size: 2624, elements: !816)
!816 = !{!817, !845, !863, !864, !865, !880, !938, !939, !1038, !1039, !1040, !1041, !1047}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !815, file: !386, line: 341, baseType: !818, size: 576)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !386, line: 251, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !386, line: 207, size: 576, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !819, file: !386, line: 208, baseType: !159, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !819, file: !386, line: 211, baseType: !175, size: 16, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !819, file: !386, line: 212, baseType: !175, size: 16, offset: 48)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !819, file: !386, line: 213, baseType: !164, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !819, file: !386, line: 214, baseType: !175, size: 16, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !819, file: !386, line: 215, baseType: !175, size: 16, offset: 112)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !819, file: !386, line: 216, baseType: !175, size: 16, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !819, file: !386, line: 217, baseType: !175, size: 16, offset: 144)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !819, file: !386, line: 218, baseType: !175, size: 16, offset: 160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !819, file: !386, line: 219, baseType: !175, size: 16, offset: 176)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !819, file: !386, line: 220, baseType: !164, size: 32, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !819, file: !386, line: 222, baseType: !175, size: 16, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !819, file: !386, line: 225, baseType: !175, size: 16, offset: 240)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !819, file: !386, line: 228, baseType: !159, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !819, file: !386, line: 229, baseType: !159, size: 32, offset: 288)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !819, file: !386, line: 233, baseType: !159, size: 32, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !819, file: !386, line: 236, baseType: !175, size: 16, offset: 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !819, file: !386, line: 236, baseType: !175, size: 16, offset: 368)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !819, file: !386, line: 241, baseType: !164, size: 32, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !819, file: !386, line: 244, baseType: !159, size: 32, offset: 416)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !819, file: !386, line: 244, baseType: !159, size: 32, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !819, file: !386, line: 245, baseType: !164, size: 32, offset: 480)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !819, file: !386, line: 248, baseType: !164, size: 32, offset: 512)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !819, file: !386, line: 250, baseType: !159, size: 32, offset: 544)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !815, file: !386, line: 342, baseType: !846, size: 448, offset: 576)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !386, line: 79, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !386, line: 61, size: 448, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !847, file: !386, line: 62, baseType: !132, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !847, file: !386, line: 64, baseType: !175, size: 16, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !847, file: !386, line: 65, baseType: !175, size: 16, offset: 80)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !847, file: !386, line: 67, baseType: !164, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !847, file: !386, line: 68, baseType: !164, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !847, file: !386, line: 69, baseType: !164, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !847, file: !386, line: 70, baseType: !175, size: 16, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !847, file: !386, line: 71, baseType: !175, size: 16, offset: 208)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !847, file: !386, line: 72, baseType: !547, size: 64, offset: 224)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !847, file: !386, line: 75, baseType: !164, size: 32, offset: 288)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !847, file: !386, line: 75, baseType: !164, size: 32, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !847, file: !386, line: 75, baseType: !164, size: 32, offset: 352)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !847, file: !386, line: 78, baseType: !164, size: 32, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !847, file: !386, line: 78, baseType: !164, size: 32, offset: 416)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !815, file: !386, line: 343, baseType: !255, size: 128, offset: 1024)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !815, file: !386, line: 344, baseType: !255, size: 128, offset: 1152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !815, file: !386, line: 345, baseType: !866, size: 192, offset: 1280)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !386, line: 278, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !386, line: 270, size: 192, elements: !868)
!868 = !{!869, !870, !871, !872, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !867, file: !386, line: 271, baseType: !159, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !867, file: !386, line: 273, baseType: !164, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !867, file: !386, line: 275, baseType: !159, size: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !867, file: !386, line: 276, baseType: !159, size: 32, offset: 96)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !867, file: !386, line: 277, baseType: !874, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !386, line: 55, size: 576, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !875, file: !386, line: 56, baseType: !159, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !875, file: !386, line: 57, baseType: !164, size: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !875, file: !386, line: 58, baseType: !436, size: 512, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !815, file: !386, line: 346, baseType: !881, size: 384, offset: 1472)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !386, line: 268, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !386, line: 253, size: 384, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !932, !933, !934, !935, !936, !937}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !882, file: !386, line: 254, baseType: !159, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !882, file: !386, line: 255, baseType: !159, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !882, file: !386, line: 255, baseType: !159, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !882, file: !386, line: 258, baseType: !164, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !882, file: !386, line: 259, baseType: !889, size: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !386, line: 164, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !386, line: 108, size: 1664, elements: !892)
!892 = !{!893, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !891, file: !386, line: 109, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !891, file: !386, line: 109, baseType: !894, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !891, file: !386, line: 111, baseType: !245, size: 512, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !891, file: !386, line: 119, baseType: !547, size: 64, offset: 640)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !891, file: !386, line: 119, baseType: !547, size: 64, offset: 704)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !891, file: !386, line: 125, baseType: !547, size: 64, offset: 768)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !891, file: !386, line: 125, baseType: !547, size: 64, offset: 832)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !891, file: !386, line: 127, baseType: !547, size: 64, offset: 896)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !891, file: !386, line: 130, baseType: !159, size: 32, offset: 960)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !891, file: !386, line: 131, baseType: !159, size: 32, offset: 992)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !891, file: !386, line: 132, baseType: !905, size: 64, offset: 1024)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !386, line: 106, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !386, line: 81, size: 512, elements: !908)
!908 = !{!909, !910, !913, !914, !915, !916}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !907, file: !386, line: 82, baseType: !547, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !907, file: !386, line: 97, baseType: !911, size: 256, offset: 64)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 256, elements: !912)
!912 = !{!429, !549}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !907, file: !386, line: 102, baseType: !547, size: 64, offset: 320)
