; ModuleID = 'blender/source/blender/editors/metaball/mball_edit.c'
source_filename = "blender/source/blender/editors/metaball/mball_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.MetaElem = type { %struct.MetaElem*, %struct.MetaElem*, %struct.BoundBox*, i16, i16, i16, i16, float, float, float, [4 x float], float, float, float, float, float, float, float, float*, float* }
%struct.BoundBox = type { [8 x [3 x float]], i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prop_similar_types", scope: !2, file: !3, line: 191, type: !191, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !29, globals: !176, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/editors/metaball/mball_edit.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 351, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 339, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!18 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!24 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!26 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!27 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!28 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!29 = !{!30, !41, !128, !175}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "MetaBall", file: !32, line: 95, baseType: !33)
!32 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meta_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MetaBall", file: !32, line: 64, size: 1984, elements: !34)
!34 = !{!35, !107, !110, !111, !112, !114, !117, !121, !122, !123, !124, !125, !126, !131, !132, !133, !134, !135, !136}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !33, file: !32, line: 65, baseType: !36, size: 960)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !37, line: 130, baseType: !38)
!37 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !37, line: 117, size: 960, elements: !39)
!39 = !{!40, !42, !43, !45, !65, !69, !71, !73, !74, !75}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !38, file: !37, line: 118, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !38, file: !37, line: 118, baseType: !41, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !38, file: !37, line: 119, baseType: !44, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !38, file: !37, line: 120, baseType: !46, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !37, line: 136, size: 17600, elements: !48)
!48 = !{!49, !50, !52, !55, !60, !61, !62}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !47, file: !37, line: 137, baseType: !36, size: 960)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !47, file: !37, line: 138, baseType: !51, size: 64, offset: 960)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !47, file: !37, line: 139, baseType: !53, size: 64, offset: 1024)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !37, line: 43, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !47, file: !37, line: 140, baseType: !56, size: 8192, offset: 1088)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8192, elements: !58)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !{!59}
!59 = !DISubrange(count: 1024)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !47, file: !37, line: 141, baseType: !56, size: 8192, offset: 9280)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !47, file: !37, line: 148, baseType: !46, size: 64, offset: 17472)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !47, file: !37, line: 150, baseType: !63, size: 64, offset: 17536)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !37, line: 45, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !37, line: 121, baseType: !66, size: 528, offset: 256)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 528, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 66)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !38, file: !37, line: 126, baseType: !70, size: 16, offset: 784)
!70 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !38, file: !37, line: 127, baseType: !72, size: 32, offset: 800)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !38, file: !37, line: 128, baseType: !72, size: 32, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !38, file: !37, line: 128, baseType: !72, size: 32, offset: 864)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !38, file: !37, line: 129, baseType: !76, size: 64, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !37, line: 75, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !37, line: 62, size: 1024, elements: !79)
!79 = !{!80, !82, !83, !84, !85, !86, !90, !91, !105, !106}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !37, line: 63, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !78, file: !37, line: 63, baseType: !81, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !37, line: 64, baseType: !57, size: 8, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !78, file: !37, line: 64, baseType: !57, size: 8, offset: 136)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !78, file: !37, line: 65, baseType: !70, size: 16, offset: 144)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !37, line: 66, baseType: !87, size: 512, offset: 160)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 512, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !78, file: !37, line: 67, baseType: !72, size: 32, offset: 672)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !37, line: 69, baseType: !92, size: 256, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !37, line: 60, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !37, line: 48, size: 256, elements: !94)
!94 = !{!95, !96, !103, !104}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !93, file: !37, line: 49, baseType: !41, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !93, file: !37, line: 58, baseType: !97, size: 128, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !98, line: 71, baseType: !99)
!98 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !98, line: 69, size: 128, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !99, file: !98, line: 70, baseType: !41, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !99, file: !98, line: 70, baseType: !41, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !93, file: !37, line: 59, baseType: !72, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !93, file: !37, line: 59, baseType: !72, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !78, file: !37, line: 70, baseType: !72, size: 32, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !78, file: !37, line: 74, baseType: !72, size: 32, offset: 992)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !33, file: !32, line: 66, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !32, line: 39, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !33, file: !32, line: 68, baseType: !97, size: 128, offset: 1024)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !33, file: !32, line: 69, baseType: !97, size: 128, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "editelems", scope: !33, file: !32, line: 70, baseType: !113, size: 64, offset: 1280)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !33, file: !32, line: 71, baseType: !115, size: 64, offset: 1344)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !32, line: 40, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !33, file: !32, line: 74, baseType: !118, size: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !32, line: 41, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !33, file: !32, line: 76, baseType: !57, size: 8, offset: 1472)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flag2", scope: !33, file: !32, line: 76, baseType: !57, size: 8, offset: 1480)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !33, file: !32, line: 77, baseType: !70, size: 16, offset: 1488)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !33, file: !32, line: 78, baseType: !70, size: 16, offset: 1504)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !33, file: !32, line: 78, baseType: !70, size: 16, offset: 1520)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !33, file: !32, line: 81, baseType: !127, size: 96, offset: 1536)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 96, elements: !129)
!128 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!129 = !{!130}
!130 = !DISubrange(count: 3)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !32, line: 82, baseType: !127, size: 96, offset: 1632)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !33, file: !32, line: 83, baseType: !127, size: 96, offset: 1728)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "wiresize", scope: !33, file: !32, line: 85, baseType: !128, size: 32, offset: 1824)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rendersize", scope: !33, file: !32, line: 85, baseType: !128, size: 32, offset: 1856)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "thresh", scope: !33, file: !32, line: 90, baseType: !128, size: 32, offset: 1888)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "lastelem", scope: !33, file: !32, line: 94, baseType: !137, size: 64, offset: 1920)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "MetaElem", file: !32, line: 62, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MetaElem", file: !32, line: 44, size: 832, elements: !140)
!140 = !{!141, !143, !144, !154, !155, !156, !157, !158, !159, !160, !161, !165, !166, !167, !168, !169, !170, !171, !172, !174}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !139, file: !32, line: 45, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !139, file: !32, line: 45, baseType: !142, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !139, file: !32, line: 47, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !16, line: 97, size: 832, elements: !147)
!147 = !{!148, !152, !153}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !146, file: !16, line: 98, baseType: !149, size: 768)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 768, elements: !150)
!150 = !{!151, !130}
!151 = !DISubrange(count: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !146, file: !16, line: 99, baseType: !72, size: 32, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !146, file: !16, line: 99, baseType: !72, size: 32, offset: 800)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !32, line: 49, baseType: !70, size: 16, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !139, file: !32, line: 49, baseType: !70, size: 16, offset: 208)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "selcol1", scope: !139, file: !32, line: 49, baseType: !70, size: 16, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "selcol2", scope: !139, file: !32, line: 49, baseType: !70, size: 16, offset: 240)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !139, file: !32, line: 50, baseType: !128, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !139, file: !32, line: 50, baseType: !128, size: 32, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !139, file: !32, line: 50, baseType: !128, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !139, file: !32, line: 51, baseType: !162, size: 128, offset: 352)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 128, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 4)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "expx", scope: !139, file: !32, line: 52, baseType: !128, size: 32, offset: 480)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "expy", scope: !139, file: !32, line: 53, baseType: !128, size: 32, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "expz", scope: !139, file: !32, line: 54, baseType: !128, size: 32, offset: 544)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !139, file: !32, line: 55, baseType: !128, size: 32, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rad2", scope: !139, file: !32, line: 56, baseType: !128, size: 32, offset: 608)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !139, file: !32, line: 57, baseType: !128, size: 32, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !139, file: !32, line: 58, baseType: !128, size: 32, offset: 672)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !139, file: !32, line: 60, baseType: !173, size: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !139, file: !32, line: 60, baseType: !173, size: 64, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!176 = !{!177, !0}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "startelem", scope: !179, file: !3, line: 581, type: !137, isLocal: true, isDefinition: true)
!179 = distinct !DISubprogram(name: "mouse_mball", scope: !3, file: !3, line: 579, type: !180, scopeLine: 580, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !190)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !183, !188, !182, !182, !182}
!182 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !185, line: 69, baseType: !186)
!185 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !187, line: 44, flags: DIFlagFwdDecl)
!187 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!190 = !{}
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 1600, elements: !202)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "EnumPropertyItem", file: !187, line: 308, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !187, line: 302, size: 320, elements: !194)
!194 = !{!195, !196, !199, !200, !201}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !193, file: !187, line: 303, baseType: !72, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !193, file: !187, line: 304, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !193, file: !187, line: 305, baseType: !72, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !187, line: 306, baseType: !197, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !193, file: !187, line: 307, baseType: !197, size: 64, offset: 256)
!202 = !{!203}
!203 = !DISubrange(count: 5)
!204 = !{i32 7, !"Dwarf Version", i32 4}
!205 = !{i32 2, !"Debug Info Version", i32 3}
!206 = !{i32 1, !"wchar_size", i32 4}
!207 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!208 = distinct !DISubprogram(name: "free_editMball", scope: !3, file: !3, line: 67, type: !209, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !190)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !16, line: 295, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !16, line: 115, size: 11392, elements: !214)
!214 = !{!215, !216, !217, !220, !221, !222, !223, !224, !225, !226, !228, !229, !230, !231, !232, !233, !234, !248, !249, !290, !291, !294, !295, !311, !312, !313, !314, !315, !316, !317, !318, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !396, !397, !398, !399, !400, !401, !402, !403, !404, !407, !410, !413, !414, !415, !416, !417, !420, !423, !426, !427, !433, !434, !435, !436, !437, !438, !439, !442, !445, !449, !1637, !1638}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !213, file: !16, line: 116, baseType: !36, size: 960)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !213, file: !16, line: 117, baseType: !108, size: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !213, file: !16, line: 119, baseType: !218, size: 64, offset: 1024)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !16, line: 57, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !16, line: 121, baseType: !70, size: 16, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !213, file: !16, line: 121, baseType: !70, size: 16, offset: 1104)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !213, file: !16, line: 122, baseType: !72, size: 32, offset: 1120)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !213, file: !16, line: 122, baseType: !72, size: 32, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !213, file: !16, line: 122, baseType: !72, size: 32, offset: 1184)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !213, file: !16, line: 123, baseType: !87, size: 512, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !213, file: !16, line: 124, baseType: !227, size: 64, offset: 1728)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !213, file: !16, line: 124, baseType: !227, size: 64, offset: 1792)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !213, file: !16, line: 127, baseType: !227, size: 64, offset: 1856)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !213, file: !16, line: 127, baseType: !227, size: 64, offset: 1920)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !213, file: !16, line: 127, baseType: !227, size: 64, offset: 1984)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !213, file: !16, line: 128, baseType: !115, size: 64, offset: 2048)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !213, file: !16, line: 130, baseType: !145, size: 64, offset: 2112)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !213, file: !16, line: 131, baseType: !235, size: 64, offset: 2176)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !237, line: 486, size: 1600, elements: !238)
!237 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !236, file: !237, line: 487, baseType: !36, size: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !236, file: !237, line: 489, baseType: !97, size: 128, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !236, file: !237, line: 490, baseType: !97, size: 128, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !236, file: !237, line: 491, baseType: !97, size: 128, offset: 1216)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !236, file: !237, line: 492, baseType: !97, size: 128, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !237, line: 494, baseType: !72, size: 32, offset: 1472)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !236, file: !237, line: 495, baseType: !72, size: 32, offset: 1504)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !236, file: !237, line: 497, baseType: !72, size: 32, offset: 1536)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !236, file: !237, line: 498, baseType: !72, size: 32, offset: 1568)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !213, file: !16, line: 132, baseType: !235, size: 64, offset: 2240)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !213, file: !16, line: 133, baseType: !250, size: 64, offset: 2304)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !237, line: 334, size: 1728, elements: !252)
!252 = !{!253, !254, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !289}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !251, file: !237, line: 335, baseType: !97, size: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !251, file: !237, line: 336, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !237, line: 47, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !237, line: 338, baseType: !70, size: 16, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !251, file: !237, line: 338, baseType: !70, size: 16, offset: 208)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !251, file: !237, line: 339, baseType: !7, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !251, file: !237, line: 340, baseType: !72, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !251, file: !237, line: 342, baseType: !128, size: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !251, file: !237, line: 343, baseType: !127, size: 96, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !251, file: !237, line: 344, baseType: !127, size: 96, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !251, file: !237, line: 347, baseType: !97, size: 128, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !251, file: !237, line: 349, baseType: !72, size: 32, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !251, file: !237, line: 350, baseType: !72, size: 32, offset: 672)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !251, file: !237, line: 351, baseType: !41, size: 64, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !251, file: !237, line: 352, baseType: !41, size: 64, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !251, file: !237, line: 354, baseType: !270, size: 384, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !237, line: 116, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !237, line: 94, size: 384, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !271, file: !237, line: 96, baseType: !72, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !271, file: !237, line: 96, baseType: !72, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !271, file: !237, line: 97, baseType: !72, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !271, file: !237, line: 97, baseType: !72, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !271, file: !237, line: 99, baseType: !70, size: 16, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !271, file: !237, line: 100, baseType: !70, size: 16, offset: 144)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !271, file: !237, line: 102, baseType: !70, size: 16, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !271, file: !237, line: 105, baseType: !70, size: 16, offset: 176)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !271, file: !237, line: 108, baseType: !70, size: 16, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !271, file: !237, line: 109, baseType: !70, size: 16, offset: 208)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !271, file: !237, line: 111, baseType: !70, size: 16, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !271, file: !237, line: 112, baseType: !70, size: 16, offset: 240)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !271, file: !237, line: 114, baseType: !72, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !271, file: !237, line: 114, baseType: !72, size: 32, offset: 288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !271, file: !237, line: 115, baseType: !72, size: 32, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !271, file: !237, line: 115, baseType: !72, size: 32, offset: 352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !251, file: !237, line: 355, baseType: !87, size: 512, offset: 1216)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !16, line: 134, baseType: !41, size: 64, offset: 2368)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !213, file: !16, line: 136, baseType: !292, size: 64, offset: 2432)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !16, line: 58, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !213, file: !16, line: 138, baseType: !270, size: 384, offset: 2496)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !213, file: !16, line: 139, baseType: !296, size: 64, offset: 2880)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !237, line: 80, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !237, line: 72, size: 192, elements: !299)
!299 = !{!300, !307, !308, !309, !310}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !298, file: !237, line: 73, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !237, line: 59, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !237, line: 56, size: 128, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !303, file: !237, line: 57, baseType: !127, size: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !237, line: 58, baseType: !72, size: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !298, file: !237, line: 74, baseType: !72, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !298, file: !237, line: 76, baseType: !72, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !298, file: !237, line: 77, baseType: !72, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !237, line: 79, baseType: !72, size: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !213, file: !16, line: 141, baseType: !97, size: 128, offset: 2944)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !213, file: !16, line: 142, baseType: !97, size: 128, offset: 3072)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !213, file: !16, line: 143, baseType: !97, size: 128, offset: 3200)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !213, file: !16, line: 144, baseType: !97, size: 128, offset: 3328)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !213, file: !16, line: 146, baseType: !72, size: 32, offset: 3456)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !213, file: !16, line: 147, baseType: !72, size: 32, offset: 3488)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !213, file: !16, line: 150, baseType: !118, size: 64, offset: 3520)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !213, file: !16, line: 151, baseType: !319, size: 64, offset: 3584)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !213, file: !16, line: 152, baseType: !72, size: 32, offset: 3648)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !213, file: !16, line: 153, baseType: !72, size: 32, offset: 3680)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !213, file: !16, line: 156, baseType: !127, size: 96, offset: 3712)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !213, file: !16, line: 156, baseType: !127, size: 96, offset: 3808)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !213, file: !16, line: 156, baseType: !127, size: 96, offset: 3904)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !213, file: !16, line: 157, baseType: !127, size: 96, offset: 4000)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !213, file: !16, line: 158, baseType: !127, size: 96, offset: 4096)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !213, file: !16, line: 159, baseType: !127, size: 96, offset: 4192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !213, file: !16, line: 160, baseType: !127, size: 96, offset: 4288)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !213, file: !16, line: 160, baseType: !127, size: 96, offset: 4384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !213, file: !16, line: 161, baseType: !162, size: 128, offset: 4480)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !213, file: !16, line: 161, baseType: !162, size: 128, offset: 4608)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !213, file: !16, line: 162, baseType: !127, size: 96, offset: 4736)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !213, file: !16, line: 162, baseType: !127, size: 96, offset: 4832)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !213, file: !16, line: 163, baseType: !128, size: 32, offset: 4928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !213, file: !16, line: 163, baseType: !128, size: 32, offset: 4960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !213, file: !16, line: 164, baseType: !337, size: 512, offset: 4992)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 512, elements: !338)
!338 = !{!164, !164}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !213, file: !16, line: 165, baseType: !337, size: 512, offset: 5504)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !213, file: !16, line: 166, baseType: !337, size: 512, offset: 6016)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !213, file: !16, line: 167, baseType: !337, size: 512, offset: 6528)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !213, file: !16, line: 176, baseType: !337, size: 512, offset: 7040)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !213, file: !16, line: 178, baseType: !7, size: 32, offset: 7552)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !213, file: !16, line: 180, baseType: !70, size: 16, offset: 7584)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !213, file: !16, line: 181, baseType: !70, size: 16, offset: 7600)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !213, file: !16, line: 183, baseType: !70, size: 16, offset: 7616)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !213, file: !16, line: 183, baseType: !70, size: 16, offset: 7632)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !213, file: !16, line: 184, baseType: !70, size: 16, offset: 7648)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !213, file: !16, line: 184, baseType: !70, size: 16, offset: 7664)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !213, file: !16, line: 185, baseType: !70, size: 16, offset: 7680)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !213, file: !16, line: 186, baseType: !70, size: 16, offset: 7696)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !213, file: !16, line: 187, baseType: !70, size: 16, offset: 7712)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !213, file: !16, line: 188, baseType: !57, size: 8, offset: 7728)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !213, file: !16, line: 189, baseType: !57, size: 8, offset: 7736)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !213, file: !16, line: 192, baseType: !72, size: 32, offset: 7744)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !213, file: !16, line: 192, baseType: !72, size: 32, offset: 7776)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !213, file: !16, line: 192, baseType: !72, size: 32, offset: 7808)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !213, file: !16, line: 192, baseType: !72, size: 32, offset: 7840)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !213, file: !16, line: 194, baseType: !72, size: 32, offset: 7872)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !213, file: !16, line: 202, baseType: !128, size: 32, offset: 7904)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !213, file: !16, line: 202, baseType: !128, size: 32, offset: 7936)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !213, file: !16, line: 202, baseType: !128, size: 32, offset: 7968)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !213, file: !16, line: 211, baseType: !128, size: 32, offset: 8000)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !213, file: !16, line: 212, baseType: !128, size: 32, offset: 8032)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !213, file: !16, line: 213, baseType: !128, size: 32, offset: 8064)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !213, file: !16, line: 214, baseType: !128, size: 32, offset: 8096)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !213, file: !16, line: 215, baseType: !128, size: 32, offset: 8128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !213, file: !16, line: 216, baseType: !128, size: 32, offset: 8160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !213, file: !16, line: 219, baseType: !128, size: 32, offset: 8192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !213, file: !16, line: 220, baseType: !128, size: 32, offset: 8224)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !213, file: !16, line: 221, baseType: !128, size: 32, offset: 8256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !213, file: !16, line: 224, baseType: !373, size: 16, offset: 8288)
!373 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !213, file: !16, line: 224, baseType: !373, size: 16, offset: 8304)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !213, file: !16, line: 226, baseType: !70, size: 16, offset: 8320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !213, file: !16, line: 228, baseType: !57, size: 8, offset: 8336)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !213, file: !16, line: 229, baseType: !57, size: 8, offset: 8344)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !213, file: !16, line: 231, baseType: !70, size: 16, offset: 8352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !213, file: !16, line: 232, baseType: !57, size: 8, offset: 8368)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !213, file: !16, line: 233, baseType: !57, size: 8, offset: 8376)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !213, file: !16, line: 234, baseType: !128, size: 32, offset: 8384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !213, file: !16, line: 235, baseType: !128, size: 32, offset: 8416)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !213, file: !16, line: 237, baseType: !97, size: 128, offset: 8448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !213, file: !16, line: 238, baseType: !97, size: 128, offset: 8576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !213, file: !16, line: 239, baseType: !97, size: 128, offset: 8704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !213, file: !16, line: 240, baseType: !97, size: 128, offset: 8832)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !213, file: !16, line: 242, baseType: !128, size: 32, offset: 8960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !213, file: !16, line: 244, baseType: !70, size: 16, offset: 8992)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !213, file: !16, line: 245, baseType: !373, size: 16, offset: 9008)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !213, file: !16, line: 246, baseType: !162, size: 128, offset: 9024)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !213, file: !16, line: 248, baseType: !72, size: 32, offset: 9152)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !213, file: !16, line: 249, baseType: !72, size: 32, offset: 9184)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !213, file: !16, line: 251, baseType: !394, size: 64, offset: 9216)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !16, line: 251, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !213, file: !16, line: 253, baseType: !57, size: 8, offset: 9280)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !213, file: !16, line: 254, baseType: !57, size: 8, offset: 9288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !213, file: !16, line: 255, baseType: !70, size: 16, offset: 9296)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !213, file: !16, line: 256, baseType: !127, size: 96, offset: 9312)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !213, file: !16, line: 258, baseType: !97, size: 128, offset: 9408)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !213, file: !16, line: 259, baseType: !97, size: 128, offset: 9536)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !213, file: !16, line: 260, baseType: !97, size: 128, offset: 9664)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !213, file: !16, line: 261, baseType: !97, size: 128, offset: 9792)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !213, file: !16, line: 263, baseType: !405, size: 64, offset: 9920)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !16, line: 52, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !213, file: !16, line: 264, baseType: !408, size: 64, offset: 9984)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !16, line: 53, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !213, file: !16, line: 265, baseType: !411, size: 64, offset: 10048)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !237, line: 46, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !213, file: !16, line: 267, baseType: !57, size: 8, offset: 10112)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !213, file: !16, line: 268, baseType: !57, size: 8, offset: 10120)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !213, file: !16, line: 269, baseType: !70, size: 16, offset: 10128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !213, file: !16, line: 270, baseType: !128, size: 32, offset: 10144)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !213, file: !16, line: 272, baseType: !418, size: 64, offset: 10176)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !16, line: 54, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !213, file: !16, line: 275, baseType: !421, size: 64, offset: 10240)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !16, line: 275, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !213, file: !16, line: 277, baseType: !424, size: 64, offset: 10304)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !16, line: 56, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !213, file: !16, line: 277, baseType: !424, size: 64, offset: 10368)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !213, file: !16, line: 278, baseType: !428, size: 64, offset: 10432)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !429, line: 27, baseType: !430)
!429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !431, line: 45, baseType: !432)
!431 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!432 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !213, file: !16, line: 279, baseType: !428, size: 64, offset: 10496)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !213, file: !16, line: 280, baseType: !7, size: 32, offset: 10560)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !213, file: !16, line: 281, baseType: !7, size: 32, offset: 10592)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !213, file: !16, line: 283, baseType: !97, size: 128, offset: 10624)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !213, file: !16, line: 284, baseType: !97, size: 128, offset: 10752)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !213, file: !16, line: 285, baseType: !113, size: 64, offset: 10880)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !213, file: !16, line: 287, baseType: !440, size: 64, offset: 10944)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !16, line: 59, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !213, file: !16, line: 288, baseType: !443, size: 64, offset: 11008)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !16, line: 288, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !213, file: !16, line: 290, baseType: !446, size: 64, offset: 11072)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 64, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 2)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !213, file: !16, line: 291, baseType: !450, size: 64, offset: 11136)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !452, line: 65, baseType: !453)
!452 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !452, line: 50, size: 320, elements: !454)
!454 = !{!455, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !453, file: !452, line: 51, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !458, line: 1216, size: 39680, elements: !459)
!458 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!459 = !{!460, !461, !462, !463, !466, !467, !468, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !494, !568, !995, !1207, !1210, !1499, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1521, !1522, !1523, !1524, !1525, !1533, !1600, !1607, !1608, !1615, !1616, !1617, !1618, !1619, !1620, !1621}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !457, file: !458, line: 1217, baseType: !36, size: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !457, file: !458, line: 1218, baseType: !108, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !457, file: !458, line: 1220, baseType: !227, size: 64, offset: 1024)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !457, file: !458, line: 1221, baseType: !464, size: 64, offset: 1088)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !458, line: 52, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !457, file: !458, line: 1223, baseType: !456, size: 64, offset: 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !457, file: !458, line: 1225, baseType: !97, size: 128, offset: 1216)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !457, file: !458, line: 1226, baseType: !469, size: 64, offset: 1344)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !458, line: 69, size: 320, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !470, file: !458, line: 70, baseType: !469, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !470, file: !458, line: 70, baseType: !469, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !470, file: !458, line: 71, baseType: !7, size: 32, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !470, file: !458, line: 71, baseType: !7, size: 32, offset: 160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !470, file: !458, line: 72, baseType: !72, size: 32, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !470, file: !458, line: 73, baseType: !70, size: 16, offset: 224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !470, file: !458, line: 73, baseType: !70, size: 16, offset: 240)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !470, file: !458, line: 74, baseType: !227, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !457, file: !458, line: 1227, baseType: !227, size: 64, offset: 1408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !457, file: !458, line: 1229, baseType: !127, size: 96, offset: 1472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !457, file: !458, line: 1230, baseType: !127, size: 96, offset: 1568)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !457, file: !458, line: 1231, baseType: !127, size: 96, offset: 1664)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !457, file: !458, line: 1231, baseType: !127, size: 96, offset: 1760)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !457, file: !458, line: 1233, baseType: !7, size: 32, offset: 1856)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !457, file: !458, line: 1234, baseType: !72, size: 32, offset: 1888)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !457, file: !458, line: 1235, baseType: !7, size: 32, offset: 1920)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !457, file: !458, line: 1237, baseType: !70, size: 16, offset: 1952)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !457, file: !458, line: 1239, baseType: !57, size: 8, offset: 1968)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !457, file: !458, line: 1240, baseType: !491, size: 8, offset: 1976)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 1)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !457, file: !458, line: 1242, baseType: !495, size: 64, offset: 1984)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !497, line: 328, size: 3456, elements: !498)
!497 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!498 = !{!499, !500, !501, !505, !506, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !534, !535, !536, !539, !544, !545, !548, !552, !556, !560, !564, !565, !566, !567}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !496, file: !497, line: 329, baseType: !36, size: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !496, file: !497, line: 330, baseType: !108, size: 64, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !496, file: !497, line: 332, baseType: !502, size: 64, offset: 1024)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !504, line: 32, flags: DIFlagFwdDecl)
!504 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!505 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !496, file: !497, line: 333, baseType: !87, size: 512, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !496, file: !497, line: 335, baseType: !507, size: 64, offset: 1600)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !187, line: 41, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !496, file: !497, line: 337, baseType: !292, size: 64, offset: 1664)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !496, file: !497, line: 338, baseType: !446, size: 64, offset: 1728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !496, file: !497, line: 340, baseType: !97, size: 128, offset: 1792)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !496, file: !497, line: 340, baseType: !97, size: 128, offset: 1920)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !496, file: !497, line: 342, baseType: !72, size: 32, offset: 2048)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !496, file: !497, line: 342, baseType: !72, size: 32, offset: 2080)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !496, file: !497, line: 343, baseType: !72, size: 32, offset: 2112)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !496, file: !497, line: 345, baseType: !72, size: 32, offset: 2144)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !496, file: !497, line: 346, baseType: !72, size: 32, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !496, file: !497, line: 347, baseType: !70, size: 16, offset: 2208)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !496, file: !497, line: 348, baseType: !70, size: 16, offset: 2224)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !496, file: !497, line: 349, baseType: !72, size: 32, offset: 2240)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !496, file: !497, line: 351, baseType: !72, size: 32, offset: 2272)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !496, file: !497, line: 353, baseType: !70, size: 16, offset: 2304)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !496, file: !497, line: 354, baseType: !70, size: 16, offset: 2320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !496, file: !497, line: 355, baseType: !72, size: 32, offset: 2336)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !496, file: !497, line: 357, baseType: !526, size: 128, offset: 2368)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !527, line: 95, baseType: !528)
!527 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !527, line: 92, size: 128, elements: !529)
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !528, file: !527, line: 93, baseType: !128, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !528, file: !527, line: 93, baseType: !128, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !528, file: !527, line: 94, baseType: !128, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !528, file: !527, line: 94, baseType: !128, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !496, file: !497, line: 363, baseType: !97, size: 128, offset: 2496)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !496, file: !497, line: 363, baseType: !97, size: 128, offset: 2624)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !496, file: !497, line: 368, baseType: !537, size: 64, offset: 2752)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !497, line: 48, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !496, file: !497, line: 372, baseType: !540, size: 32, offset: 2816)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !497, line: 274, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !497, line: 271, size: 32, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !541, file: !497, line: 273, baseType: !7, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !496, file: !497, line: 373, baseType: !72, size: 32, offset: 2848)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !496, file: !497, line: 382, baseType: !546, size: 64, offset: 2880)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !497, line: 46, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !496, file: !497, line: 385, baseType: !549, size: 64, offset: 2944)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !41, !128}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !496, file: !497, line: 386, baseType: !553, size: 64, offset: 3008)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !41, !319}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !496, file: !497, line: 387, baseType: !557, size: 64, offset: 3072)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!72, !41}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !496, file: !497, line: 388, baseType: !561, size: 64, offset: 3136)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !41}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !496, file: !497, line: 389, baseType: !41, size: 64, offset: 3200)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !496, file: !497, line: 389, baseType: !41, size: 64, offset: 3264)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !496, file: !497, line: 389, baseType: !41, size: 64, offset: 3328)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !496, file: !497, line: 389, baseType: !41, size: 64, offset: 3392)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !457, file: !458, line: 1244, baseType: !569, size: 64, offset: 2048)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !571, line: 200, size: 17024, elements: !572)
!571 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!572 = !{!573, !574, !575, !576, !988, !989, !990, !991, !992, !993, !994}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !570, file: !571, line: 201, baseType: !113, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !570, file: !571, line: 202, baseType: !97, size: 128, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !570, file: !571, line: 203, baseType: !97, size: 128, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !570, file: !571, line: 206, baseType: !577, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !571, line: 190, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !571, line: 126, size: 2816, elements: !580)
!580 = !{!581, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !679, !680, !681, !682, !960, !963, !964, !965, !966, !967, !968, !969, !970, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !987}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !579, file: !571, line: 127, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !579, file: !571, line: 127, baseType: !582, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !579, file: !571, line: 128, baseType: !41, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !579, file: !571, line: 129, baseType: !41, size: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !571, line: 130, baseType: !87, size: 512, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !579, file: !571, line: 132, baseType: !72, size: 32, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !571, line: 132, baseType: !72, size: 32, offset: 800)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !579, file: !571, line: 133, baseType: !72, size: 32, offset: 832)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !579, file: !571, line: 134, baseType: !72, size: 32, offset: 864)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !579, file: !571, line: 134, baseType: !72, size: 32, offset: 896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !579, file: !571, line: 134, baseType: !72, size: 32, offset: 928)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !579, file: !571, line: 135, baseType: !72, size: 32, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !579, file: !571, line: 135, baseType: !72, size: 32, offset: 992)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !579, file: !571, line: 136, baseType: !72, size: 32, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !579, file: !571, line: 136, baseType: !72, size: 32, offset: 1056)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !579, file: !571, line: 137, baseType: !72, size: 32, offset: 1088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !579, file: !571, line: 137, baseType: !72, size: 32, offset: 1120)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !579, file: !571, line: 138, baseType: !128, size: 32, offset: 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !579, file: !571, line: 139, baseType: !128, size: 32, offset: 1184)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !579, file: !571, line: 139, baseType: !128, size: 32, offset: 1216)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !579, file: !571, line: 141, baseType: !70, size: 16, offset: 1248)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !579, file: !571, line: 142, baseType: !70, size: 16, offset: 1264)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !579, file: !571, line: 143, baseType: !72, size: 32, offset: 1280)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !579, file: !571, line: 144, baseType: !72, size: 32, offset: 1312)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !579, file: !571, line: 146, baseType: !607, size: 64, offset: 1344)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !571, line: 114, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !571, line: 99, size: 7232, elements: !610)
!610 = !{!611, !613, !614, !615, !616, !617, !618, !629, !633, !647, !656, !663, !673}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !609, file: !571, line: 100, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !609, file: !571, line: 100, baseType: !612, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !609, file: !571, line: 101, baseType: !72, size: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !609, file: !571, line: 101, baseType: !72, size: 32, offset: 160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !609, file: !571, line: 102, baseType: !72, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !609, file: !571, line: 102, baseType: !72, size: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !609, file: !571, line: 103, baseType: !619, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !571, line: 59, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !571, line: 56, size: 2112, elements: !622)
!622 = !{!623, !627, !628}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !621, file: !571, line: 57, baseType: !624, size: 2048)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !621, file: !571, line: 58, baseType: !72, size: 32, offset: 2048)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !621, file: !571, line: 58, baseType: !72, size: 32, offset: 2080)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !609, file: !571, line: 106, baseType: !630, size: 6144, offset: 320)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 6144, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 768)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !609, file: !571, line: 107, baseType: !634, size: 64, offset: 6464)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !571, line: 97, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !571, line: 83, size: 8320, elements: !637)
!637 = !{!638, !639, !640, !643, !644, !645, !646}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !636, file: !571, line: 84, baseType: !630, size: 6144)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !636, file: !571, line: 87, baseType: !624, size: 2048, offset: 6144)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !636, file: !571, line: 88, baseType: !641, size: 64, offset: 8192)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !452, line: 41, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !636, file: !571, line: 90, baseType: !70, size: 16, offset: 8256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !636, file: !571, line: 92, baseType: !70, size: 16, offset: 8272)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !636, file: !571, line: 93, baseType: !70, size: 16, offset: 8288)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !636, file: !571, line: 95, baseType: !70, size: 16, offset: 8304)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !609, file: !571, line: 108, baseType: !648, size: 64, offset: 6528)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !571, line: 66, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !571, line: 61, size: 128, elements: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !650, file: !571, line: 62, baseType: !72, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !650, file: !571, line: 63, baseType: !72, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !650, file: !571, line: 64, baseType: !72, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !650, file: !571, line: 65, baseType: !72, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !609, file: !571, line: 109, baseType: !657, size: 64, offset: 6592)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !571, line: 71, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !571, line: 68, size: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !659, file: !571, line: 69, baseType: !72, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !659, file: !571, line: 70, baseType: !72, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !609, file: !571, line: 110, baseType: !664, size: 64, offset: 6656)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !571, line: 81, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !571, line: 73, size: 352, elements: !667)
!667 = !{!668, !669, !670, !671, !672}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !666, file: !571, line: 74, baseType: !127, size: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !666, file: !571, line: 75, baseType: !127, size: 96, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !666, file: !571, line: 76, baseType: !127, size: 96, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !666, file: !571, line: 77, baseType: !72, size: 32, offset: 288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !666, file: !571, line: 78, baseType: !72, size: 32, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !609, file: !571, line: 113, baseType: !674, size: 512, offset: 6720)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !675, line: 182, baseType: !676)
!675 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !675, line: 180, size: 512, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !676, file: !675, line: 181, baseType: !87, size: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !579, file: !571, line: 148, baseType: !115, size: 64, offset: 1408)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !579, file: !571, line: 151, baseType: !456, size: 64, offset: 1472)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !579, file: !571, line: 152, baseType: !227, size: 64, offset: 1536)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !579, file: !571, line: 153, baseType: !683, size: 64, offset: 1600)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !685, line: 64, size: 19136, elements: !686)
!685 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!686 = !{!687, !688, !689, !690, !691, !692, !694, !695, !696, !697, !700, !701, !946, !947, !955, !956, !957, !958, !959}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !684, file: !685, line: 65, baseType: !36, size: 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !684, file: !685, line: 66, baseType: !108, size: 64, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !684, file: !685, line: 68, baseType: !56, size: 8192, offset: 1024)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !684, file: !685, line: 70, baseType: !72, size: 32, offset: 9216)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !684, file: !685, line: 71, baseType: !72, size: 32, offset: 9248)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !684, file: !685, line: 72, baseType: !693, size: 64, offset: 9280)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, elements: !447)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !684, file: !685, line: 74, baseType: !128, size: 32, offset: 9344)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !684, file: !685, line: 74, baseType: !128, size: 32, offset: 9376)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !684, file: !685, line: 76, baseType: !641, size: 64, offset: 9408)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !684, file: !685, line: 77, baseType: !698, size: 64, offset: 9472)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !685, line: 77, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !684, file: !685, line: 78, baseType: !292, size: 64, offset: 9536)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !684, file: !685, line: 80, baseType: !702, size: 2624, offset: 9600)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !703, line: 340, size: 2624, elements: !704)
!703 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!704 = !{!705, !733, !751, !752, !753, !768, !826, !827, !926, !927, !928, !929, !935}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !702, file: !703, line: 341, baseType: !706, size: 576)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !703, line: 251, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !703, line: 207, size: 576, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !707, file: !703, line: 208, baseType: !72, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !707, file: !703, line: 211, baseType: !70, size: 16, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !707, file: !703, line: 212, baseType: !70, size: 16, offset: 48)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !707, file: !703, line: 213, baseType: !128, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !707, file: !703, line: 214, baseType: !70, size: 16, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !707, file: !703, line: 215, baseType: !70, size: 16, offset: 112)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !707, file: !703, line: 216, baseType: !70, size: 16, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !707, file: !703, line: 217, baseType: !70, size: 16, offset: 144)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !707, file: !703, line: 218, baseType: !70, size: 16, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !707, file: !703, line: 219, baseType: !70, size: 16, offset: 176)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !707, file: !703, line: 220, baseType: !128, size: 32, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !707, file: !703, line: 222, baseType: !70, size: 16, offset: 224)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !707, file: !703, line: 225, baseType: !70, size: 16, offset: 240)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !707, file: !703, line: 228, baseType: !72, size: 32, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !707, file: !703, line: 229, baseType: !72, size: 32, offset: 288)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !707, file: !703, line: 233, baseType: !72, size: 32, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !707, file: !703, line: 236, baseType: !70, size: 16, offset: 352)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !707, file: !703, line: 236, baseType: !70, size: 16, offset: 368)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !707, file: !703, line: 241, baseType: !128, size: 32, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !707, file: !703, line: 244, baseType: !72, size: 32, offset: 416)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !707, file: !703, line: 244, baseType: !72, size: 32, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !707, file: !703, line: 245, baseType: !128, size: 32, offset: 480)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !707, file: !703, line: 248, baseType: !128, size: 32, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !707, file: !703, line: 250, baseType: !72, size: 32, offset: 544)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !702, file: !703, line: 342, baseType: !734, size: 448, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !703, line: 79, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !703, line: 61, size: 448, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !735, file: !703, line: 62, baseType: !41, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !735, file: !703, line: 64, baseType: !70, size: 16, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !735, file: !703, line: 65, baseType: !70, size: 16, offset: 80)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !735, file: !703, line: 67, baseType: !128, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !735, file: !703, line: 68, baseType: !128, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !735, file: !703, line: 69, baseType: !128, size: 32, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !735, file: !703, line: 70, baseType: !70, size: 16, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !735, file: !703, line: 71, baseType: !70, size: 16, offset: 208)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !735, file: !703, line: 72, baseType: !446, size: 64, offset: 224)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !735, file: !703, line: 75, baseType: !128, size: 32, offset: 288)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !735, file: !703, line: 75, baseType: !128, size: 32, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !735, file: !703, line: 75, baseType: !128, size: 32, offset: 352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !735, file: !703, line: 78, baseType: !128, size: 32, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !735, file: !703, line: 78, baseType: !128, size: 32, offset: 416)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !702, file: !703, line: 343, baseType: !97, size: 128, offset: 1024)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !702, file: !703, line: 344, baseType: !97, size: 128, offset: 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !702, file: !703, line: 345, baseType: !754, size: 192, offset: 1280)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !703, line: 278, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !703, line: 270, size: 192, elements: !756)
!756 = !{!757, !758, !759, !760, !761}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !755, file: !703, line: 271, baseType: !72, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !755, file: !703, line: 273, baseType: !128, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !755, file: !703, line: 275, baseType: !72, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !755, file: !703, line: 276, baseType: !72, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !755, file: !703, line: 277, baseType: !762, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !703, line: 55, size: 576, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !763, file: !703, line: 56, baseType: !72, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !763, file: !703, line: 57, baseType: !128, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !763, file: !703, line: 58, baseType: !337, size: 512, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !702, file: !703, line: 346, baseType: !769, size: 384, offset: 1472)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !703, line: 268, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !703, line: 253, size: 384, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !820, !821, !822, !823, !824, !825}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !770, file: !703, line: 254, baseType: !72, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !770, file: !703, line: 255, baseType: !72, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !770, file: !703, line: 255, baseType: !72, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !770, file: !703, line: 258, baseType: !128, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !770, file: !703, line: 259, baseType: !777, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !703, line: 164, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !703, line: 108, size: 1664, elements: !780)
!780 = !{!781, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !779, file: !703, line: 109, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !779, file: !703, line: 109, baseType: !782, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !779, file: !703, line: 111, baseType: !87, size: 512, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !779, file: !703, line: 119, baseType: !446, size: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !779, file: !703, line: 119, baseType: !446, size: 64, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !779, file: !703, line: 125, baseType: !446, size: 64, offset: 768)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !779, file: !703, line: 125, baseType: !446, size: 64, offset: 832)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !779, file: !703, line: 127, baseType: !446, size: 64, offset: 896)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !779, file: !703, line: 130, baseType: !72, size: 32, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !779, file: !703, line: 131, baseType: !72, size: 32, offset: 992)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !779, file: !703, line: 132, baseType: !793, size: 64, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !703, line: 106, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !703, line: 81, size: 512, elements: !796)
!796 = !{!797, !798, !801, !802, !803, !804}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !795, file: !703, line: 82, baseType: !446, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !795, file: !703, line: 97, baseType: !799, size: 256, offset: 64)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 256, elements: !800)
!800 = !{!164, !448}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !795, file: !703, line: 102, baseType: !446, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !795, file: !703, line: 102, baseType: !446, size: 64, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !795, file: !703, line: 104, baseType: !72, size: 32, offset: 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !795, file: !703, line: 105, baseType: !72, size: 32, offset: 480)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !779, file: !703, line: 135, baseType: !127, size: 96, offset: 1088)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !779, file: !703, line: 136, baseType: !128, size: 32, offset: 1184)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !779, file: !703, line: 139, baseType: !72, size: 32, offset: 1216)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !779, file: !703, line: 139, baseType: !72, size: 32, offset: 1248)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !779, file: !703, line: 139, baseType: !72, size: 32, offset: 1280)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !779, file: !703, line: 140, baseType: !127, size: 96, offset: 1312)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !779, file: !703, line: 143, baseType: !70, size: 16, offset: 1408)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !779, file: !703, line: 144, baseType: !70, size: 16, offset: 1424)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !779, file: !703, line: 145, baseType: !70, size: 16, offset: 1440)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !779, file: !703, line: 148, baseType: !70, size: 16, offset: 1456)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !779, file: !703, line: 149, baseType: !72, size: 32, offset: 1472)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !779, file: !703, line: 150, baseType: !128, size: 32, offset: 1504)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !779, file: !703, line: 152, baseType: !292, size: 64, offset: 1536)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !779, file: !703, line: 163, baseType: !128, size: 32, offset: 1600)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !779, file: !703, line: 163, baseType: !128, size: 32, offset: 1632)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !770, file: !703, line: 261, baseType: !128, size: 32, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !770, file: !703, line: 261, baseType: !128, size: 32, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !770, file: !703, line: 261, baseType: !128, size: 32, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !770, file: !703, line: 263, baseType: !72, size: 32, offset: 288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !770, file: !703, line: 266, baseType: !72, size: 32, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !770, file: !703, line: 267, baseType: !128, size: 32, offset: 352)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !702, file: !703, line: 347, baseType: !777, size: 64, offset: 1856)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !702, file: !703, line: 348, baseType: !828, size: 64, offset: 1920)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !703, line: 205, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !703, line: 186, size: 1024, elements: !831)
!831 = !{!832, !834, !835, !836, !838, !839, !840, !848, !849, !850, !924, !925}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !703, line: 187, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !830, file: !703, line: 187, baseType: !833, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !703, line: 189, baseType: !87, size: 512, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !830, file: !703, line: 191, baseType: !837, size: 64, offset: 640)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !830, file: !703, line: 193, baseType: !72, size: 32, offset: 704)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !830, file: !703, line: 193, baseType: !72, size: 32, offset: 736)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !830, file: !703, line: 195, baseType: !841, size: 64, offset: 768)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !703, line: 184, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !703, line: 166, size: 320, elements: !844)
!844 = !{!845, !846, !847}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !843, file: !703, line: 180, baseType: !799, size: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !843, file: !703, line: 182, baseType: !72, size: 32, offset: 256)
