; ModuleID = 'blender/source/blender/editors/space_buttons/buttons_texture.c'
source_filename = "blender/source/blender/editors/space_buttons/buttons_texture.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!970 = !DIEnumerator(name: "UI_BUT_REDALERT", value: 65536, isUnsigned: true)
!971 = !DIEnumerator(name: "UI_BUT_INACTIVE", value: 131072, isUnsigned: true)
!972 = !DIEnumerator(name: "UI_BUT_LAST_ACTIVE", value: 262144, isUnsigned: true)
!973 = !DIEnumerator(name: "UI_BUT_UNDO", value: 524288, isUnsigned: true)
!974 = !DIEnumerator(name: "UI_BUT_IMMEDIATE", value: 1048576, isUnsigned: true)
!975 = !DIEnumerator(name: "UI_BUT_NO_UTF8", value: 2097152, isUnsigned: true)
!976 = !DIEnumerator(name: "UI_BUT_VEC_SIZE_LOCK", value: 4194304, isUnsigned: true)
!977 = !DIEnumerator(name: "UI_BUT_COLOR_CUBIC", value: 8388608, isUnsigned: true)
!978 = !DIEnumerator(name: "UI_BUT_LIST_ITEM", value: 16777216, isUnsigned: true)
!979 = !DIEnumerator(name: "UI_BUT_DRAG_MULTI", value: 33554432, isUnsigned: true)
!980 = !DIEnumerator(name: "UI_BUT_SCA_LINK_GREY", value: 67108864, isUnsigned: true)
!981 = !DIEnumerator(name: "UI_BUT_HAS_SEP_CHAR", value: 134217728, isUnsigned: true)
!982 = !DIEnumerator(name: "UI_BUT_TIP_FORCE", value: 268435456, isUnsigned: true)
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceButtons_Context", file: !47, line: 174, baseType: !5, size: 32, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!985 = !DIEnumerator(name: "BCONTEXT_RENDER", value: 0, isUnsigned: true)
!986 = !DIEnumerator(name: "BCONTEXT_SCENE", value: 1, isUnsigned: true)
!987 = !DIEnumerator(name: "BCONTEXT_WORLD", value: 2, isUnsigned: true)
!988 = !DIEnumerator(name: "BCONTEXT_OBJECT", value: 3, isUnsigned: true)
!989 = !DIEnumerator(name: "BCONTEXT_DATA", value: 4, isUnsigned: true)
!990 = !DIEnumerator(name: "BCONTEXT_MATERIAL", value: 5, isUnsigned: true)
!991 = !DIEnumerator(name: "BCONTEXT_TEXTURE", value: 6, isUnsigned: true)
!992 = !DIEnumerator(name: "BCONTEXT_PARTICLE", value: 7, isUnsigned: true)
!993 = !DIEnumerator(name: "BCONTEXT_PHYSICS", value: 8, isUnsigned: true)
!994 = !DIEnumerator(name: "BCONTEXT_BONE", value: 9, isUnsigned: true)
!995 = !DIEnumerator(name: "BCONTEXT_MODIFIER", value: 10, isUnsigned: true)
!996 = !DIEnumerator(name: "BCONTEXT_CONSTRAINT", value: 11, isUnsigned: true)
!997 = !DIEnumerator(name: "BCONTEXT_BONE_CONSTRAINT", value: 12, isUnsigned: true)
!998 = !DIEnumerator(name: "BCONTEXT_RENDER_LAYER", value: 13, isUnsigned: true)
!999 = !DIEnumerator(name: "BCONTEXT_TOT", value: 14, isUnsigned: true)
!1000 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceButtons_Flag", file: !47, line: 195, baseType: !5, size: 32, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005}
!1002 = !DIEnumerator(name: "SB_PRV_OSA", value: 1, isUnsigned: true)
!1003 = !DIEnumerator(name: "SB_PIN_CONTEXT", value: 2, isUnsigned: true)
!1004 = !DIEnumerator(name: "SB_TEX_USER_LIMITED", value: 8, isUnsigned: true)
!1005 = !DIEnumerator(name: "SB_SHADING_CONTEXT", value: 16, isUnsigned: true)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 195, baseType: !5, size: 32, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016}
!1008 = !DIEnumerator(name: "UI_BUT_TEXT_LEFT", value: 2, isUnsigned: true)
!1009 = !DIEnumerator(name: "UI_BUT_ICON_LEFT", value: 4, isUnsigned: true)
!1010 = !DIEnumerator(name: "UI_BUT_TEXT_RIGHT", value: 8, isUnsigned: true)
!1011 = !DIEnumerator(name: "UI_BUT_NO_TOOLTIP", value: 16, isUnsigned: true)
!1012 = !DIEnumerator(name: "UI_BUT_ALIGN_TOP", value: 16384, isUnsigned: true)
!1013 = !DIEnumerator(name: "UI_BUT_ALIGN_LEFT", value: 32768, isUnsigned: true)
!1014 = !DIEnumerator(name: "UI_BUT_ALIGN_RIGHT", value: 65536, isUnsigned: true)
!1015 = !DIEnumerator(name: "UI_BUT_ALIGN_DOWN", value: 131072, isUnsigned: true)
!1016 = !DIEnumerator(name: "UI_BUT_ALIGN", value: 245760, isUnsigned: true)
!1017 = !{!1018, !1019, !1021, !1023, !4151, !4152, !4154, !4156, !4236, !4238, !4240, !4242, !4292, !4294}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tex", file: !1025, line: 261, baseType: !1026)
!1025 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1025, line: 202, size: 3328, elements: !1027)
!1027 = !{!1028, !1097, !1100, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !4065, !4066, !4067, !4068, !4069, !4091, !4092, !4121, !4141, !4149, !4150}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1026, file: !1025, line: 203, baseType: !1029, size: 960)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1030, line: 130, baseType: !1031)
!1030 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1030, line: 117, size: 960, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1037, !1056, !1060, !1061, !1063, !1064, !1065}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1031, file: !1030, line: 118, baseType: !1018, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1031, file: !1030, line: 118, baseType: !1018, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1031, file: !1030, line: 119, baseType: !1036, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1031, file: !1030, line: 120, baseType: !1038, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1030, line: 136, size: 17600, elements: !1040)
!1040 = !{!1041, !1042, !1044, !1047, !1051, !1052, !1053}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1039, file: !1030, line: 137, baseType: !1029, size: 960)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1039, file: !1030, line: 138, baseType: !1043, size: 64, offset: 960)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1039, file: !1030, line: 139, baseType: !1045, size: 64, offset: 1024)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1030, line: 43, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !1030, line: 140, baseType: !1048, size: 8192, offset: 1088)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 8192, elements: !1049)
!1049 = !{!1050}
!1050 = !DISubrange(count: 1024)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1039, file: !1030, line: 141, baseType: !1048, size: 8192, offset: 9280)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1039, file: !1030, line: 148, baseType: !1038, size: 64, offset: 17472)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1039, file: !1030, line: 150, baseType: !1054, size: 64, offset: 17536)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1030, line: 45, flags: DIFlagFwdDecl)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1031, file: !1030, line: 121, baseType: !1057, size: 528, offset: 256)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 528, elements: !1058)
!1058 = !{!1059}
!1059 = !DISubrange(count: 66)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1031, file: !1030, line: 126, baseType: !1022, size: 16, offset: 784)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1031, file: !1030, line: 127, baseType: !1062, size: 32, offset: 800)
!1062 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1031, file: !1030, line: 128, baseType: !1062, size: 32, offset: 832)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1031, file: !1030, line: 128, baseType: !1062, size: 32, offset: 864)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1031, file: !1030, line: 129, baseType: !1066, size: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1030, line: 75, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1030, line: 62, size: 1024, elements: !1069)
!1069 = !{!1070, !1072, !1073, !1074, !1075, !1076, !1080, !1081, !1095, !1096}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1068, file: !1030, line: 63, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1068, file: !1030, line: 63, baseType: !1071, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1068, file: !1030, line: 64, baseType: !1020, size: 8, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1068, file: !1030, line: 64, baseType: !1020, size: 8, offset: 136)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1068, file: !1030, line: 65, baseType: !1022, size: 16, offset: 144)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1068, file: !1030, line: 66, baseType: !1077, size: 512, offset: 160)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 512, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1068, file: !1030, line: 67, baseType: !1062, size: 32, offset: 672)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1068, file: !1030, line: 69, baseType: !1082, size: 256, offset: 704)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1030, line: 60, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1030, line: 48, size: 256, elements: !1084)
!1084 = !{!1085, !1086, !1093, !1094}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1083, file: !1030, line: 49, baseType: !1018, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1083, file: !1030, line: 58, baseType: !1087, size: 128, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1088, line: 71, baseType: !1089)
!1088 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1088, line: 69, size: 128, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1089, file: !1088, line: 70, baseType: !1018, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1089, file: !1088, line: 70, baseType: !1018, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1083, file: !1030, line: 59, baseType: !1062, size: 32, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1083, file: !1030, line: 59, baseType: !1062, size: 32, offset: 224)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1068, file: !1030, line: 70, baseType: !1062, size: 32, offset: 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1068, file: !1030, line: 74, baseType: !1062, size: 32, offset: 992)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1026, file: !1025, line: 204, baseType: !1098, size: 64, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1025, line: 45, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1026, file: !1025, line: 206, baseType: !1101, size: 32, offset: 1024)
!1101 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1026, file: !1025, line: 206, baseType: !1101, size: 32, offset: 1056)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1026, file: !1025, line: 207, baseType: !1101, size: 32, offset: 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1026, file: !1025, line: 207, baseType: !1101, size: 32, offset: 1120)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1026, file: !1025, line: 207, baseType: !1101, size: 32, offset: 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1026, file: !1025, line: 207, baseType: !1101, size: 32, offset: 1184)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1026, file: !1025, line: 207, baseType: !1101, size: 32, offset: 1216)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1026, file: !1025, line: 207, baseType: !1101, size: 32, offset: 1248)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1026, file: !1025, line: 208, baseType: !1101, size: 32, offset: 1280)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1026, file: !1025, line: 208, baseType: !1101, size: 32, offset: 1312)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1026, file: !1025, line: 211, baseType: !1101, size: 32, offset: 1344)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1026, file: !1025, line: 211, baseType: !1101, size: 32, offset: 1376)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1026, file: !1025, line: 211, baseType: !1101, size: 32, offset: 1408)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1026, file: !1025, line: 211, baseType: !1101, size: 32, offset: 1440)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1026, file: !1025, line: 211, baseType: !1101, size: 32, offset: 1472)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1026, file: !1025, line: 214, baseType: !1101, size: 32, offset: 1504)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1026, file: !1025, line: 214, baseType: !1101, size: 32, offset: 1536)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1026, file: !1025, line: 217, baseType: !1101, size: 32, offset: 1568)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1026, file: !1025, line: 218, baseType: !1101, size: 32, offset: 1600)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1026, file: !1025, line: 219, baseType: !1101, size: 32, offset: 1632)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1026, file: !1025, line: 220, baseType: !1101, size: 32, offset: 1664)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1026, file: !1025, line: 221, baseType: !1101, size: 32, offset: 1696)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1026, file: !1025, line: 222, baseType: !1022, size: 16, offset: 1728)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1026, file: !1025, line: 222, baseType: !1022, size: 16, offset: 1744)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1026, file: !1025, line: 224, baseType: !1022, size: 16, offset: 1760)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1026, file: !1025, line: 224, baseType: !1022, size: 16, offset: 1776)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1026, file: !1025, line: 227, baseType: !1022, size: 16, offset: 1792)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1026, file: !1025, line: 227, baseType: !1022, size: 16, offset: 1808)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1026, file: !1025, line: 229, baseType: !1022, size: 16, offset: 1824)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1026, file: !1025, line: 229, baseType: !1022, size: 16, offset: 1840)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1026, file: !1025, line: 230, baseType: !1022, size: 16, offset: 1856)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1026, file: !1025, line: 230, baseType: !1022, size: 16, offset: 1872)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1026, file: !1025, line: 232, baseType: !1101, size: 32, offset: 1888)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1026, file: !1025, line: 232, baseType: !1101, size: 32, offset: 1920)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1026, file: !1025, line: 232, baseType: !1101, size: 32, offset: 1952)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1026, file: !1025, line: 232, baseType: !1101, size: 32, offset: 1984)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1026, file: !1025, line: 233, baseType: !1062, size: 32, offset: 2016)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1026, file: !1025, line: 234, baseType: !1062, size: 32, offset: 2048)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1026, file: !1025, line: 235, baseType: !1022, size: 16, offset: 2080)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1026, file: !1025, line: 235, baseType: !1022, size: 16, offset: 2096)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1026, file: !1025, line: 236, baseType: !1022, size: 16, offset: 2112)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1026, file: !1025, line: 239, baseType: !1022, size: 16, offset: 2128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1026, file: !1025, line: 240, baseType: !1062, size: 32, offset: 2144)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1026, file: !1025, line: 241, baseType: !1062, size: 32, offset: 2176)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1026, file: !1025, line: 241, baseType: !1062, size: 32, offset: 2208)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1026, file: !1025, line: 241, baseType: !1062, size: 32, offset: 2240)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1026, file: !1025, line: 243, baseType: !1101, size: 32, offset: 2272)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1026, file: !1025, line: 243, baseType: !1101, size: 32, offset: 2304)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1026, file: !1025, line: 244, baseType: !1101, size: 32, offset: 2336)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1026, file: !1025, line: 246, baseType: !1151, size: 320, offset: 2368)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1152, line: 50, size: 320, elements: !1153)
!1152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1153 = !{!1154, !4052, !4053, !4054, !4055, !4056, !4057, !4058, !4059, !4060, !4061, !4062, !4063, !4064}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1151, file: !1152, line: 51, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1157, line: 1216, size: 39680, elements: !1158)
!1157 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1158 = !{!1159, !1160, !1161, !2885, !2966, !2967, !2968, !2980, !2981, !2982, !2983, !2984, !2985, !2986, !2987, !2988, !2989, !2990, !2991, !2992, !3335, !3692, !3695, !3934, !3946, !3947, !3948, !3949, !3950, !3951, !3952, !3953, !3956, !3957, !3958, !3959, !3960, !3968, !4034, !4035, !4036, !4043, !4044, !4045, !4046, !4047, !4048, !4049}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1156, file: !1157, line: 1217, baseType: !1029, size: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1156, file: !1157, line: 1218, baseType: !1098, size: 64, offset: 960)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1156, file: !1157, line: 1220, baseType: !1162, size: 64, offset: 1024)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !15, line: 115, size: 11392, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1281, !1291, !1305, !1306, !1348, !1349, !1352, !1353, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !2561, !2562, !2563, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588, !2589, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2612, !2614, !2615, !2616, !2617, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2722, !2835, !2836, !2837, !2838, !2839, !2840, !2843, !2846, !2849, !2850, !2856, !2857, !2858, !2859, !2860, !2861, !2863, !2866, !2869, !2870, !2873, !2874}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1163, file: !15, line: 116, baseType: !1029, size: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1163, file: !15, line: 117, baseType: !1098, size: 64, offset: 960)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1163, file: !15, line: 119, baseType: !1168, size: 64, offset: 1024)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !1170, line: 155, size: 1856, elements: !1171)
!1170 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1171 = !{!1172, !1201, !1204, !1207, !1210, !1211, !1212, !1217, !1220, !1222, !1226, !1230, !1231, !1232, !1234, !1237, !1240, !1241, !1242, !1243, !1244, !1248, !1249, !1250, !1252, !1253, !1256, !1257, !1260, !1263, !1264, !1265, !1266}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !1169, file: !1170, line: 157, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !1175, line: 717, size: 960, elements: !1176)
!1175 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1176 = !{!1177, !1191, !1192, !1193, !1194, !1195, !1196, !1197}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !1174, file: !1175, line: 718, baseType: !1178, size: 896)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !1175, line: 110, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !1175, line: 99, size: 896, elements: !1180)
!1180 = !{!1181, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1179, file: !1175, line: 100, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1179, file: !1175, line: 100, baseType: !1182, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1179, file: !1175, line: 102, baseType: !1062, size: 32, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1179, file: !1175, line: 102, baseType: !1062, size: 32, offset: 160)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !1179, file: !1175, line: 103, baseType: !1062, size: 32, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1179, file: !1175, line: 103, baseType: !1062, size: 32, offset: 224)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1179, file: !1175, line: 104, baseType: !1077, size: 512, offset: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1179, file: !1175, line: 107, baseType: !1155, size: 64, offset: 768)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1179, file: !1175, line: 109, baseType: !1019, size: 64, offset: 832)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "lvl", scope: !1174, file: !1175, line: 720, baseType: !1020, size: 8, offset: 896)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sculptlvl", scope: !1174, file: !1175, line: 720, baseType: !1020, size: 8, offset: 904)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !1174, file: !1175, line: 720, baseType: !1020, size: 8, offset: 912)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "totlvl", scope: !1174, file: !1175, line: 720, baseType: !1020, size: 8, offset: 920)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "simple", scope: !1174, file: !1175, line: 721, baseType: !1020, size: 8, offset: 928)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1174, file: !1175, line: 721, baseType: !1020, size: 8, offset: 936)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1174, file: !1175, line: 721, baseType: !1198, size: 16, offset: 944)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 16, elements: !1199)
!1199 = !{!1200}
!1200 = !DISubrange(count: 2)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !1169, file: !1170, line: 158, baseType: !1202, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !1175, line: 571, flags: DIFlagFwdDecl)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !1169, file: !1170, line: 159, baseType: !1205, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !1170, line: 159, flags: DIFlagFwdDecl)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !1169, file: !1170, line: 160, baseType: !1208, size: 64, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !1170, line: 160, flags: DIFlagFwdDecl)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !1169, file: !1170, line: 161, baseType: !1062, size: 32, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !1169, file: !1170, line: 161, baseType: !1062, size: 32, offset: 288)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !1169, file: !1170, line: 162, baseType: !1213, size: 64, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 96, elements: !1215)
!1215 = !{!1216}
!1216 = !DISubrange(count: 3)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !1169, file: !1170, line: 163, baseType: !1218, size: 64, offset: 384)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !1170, line: 163, flags: DIFlagFwdDecl)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !1169, file: !1170, line: 164, baseType: !1221, size: 64, offset: 448)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !1169, file: !1170, line: 167, baseType: !1223, size: 64, offset: 512)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1225)
!1225 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !1170, line: 44, flags: DIFlagFwdDecl)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !1169, file: !1170, line: 170, baseType: !1227, size: 64, offset: 576)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !1229, line: 44, flags: DIFlagFwdDecl)
!1229 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !1169, file: !1170, line: 171, baseType: !1062, size: 32, offset: 640)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !1169, file: !1170, line: 172, baseType: !1062, size: 32, offset: 672)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !1169, file: !1170, line: 173, baseType: !1233, size: 8, offset: 704)
!1233 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !1169, file: !1170, line: 175, baseType: !1235, size: 64, offset: 768)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !1170, line: 175, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !1169, file: !1170, line: 178, baseType: !1238, size: 64, offset: 832)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !1170, line: 55, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !1169, file: !1170, line: 179, baseType: !1233, size: 8, offset: 896)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !1169, file: !1170, line: 182, baseType: !1233, size: 8, offset: 904)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !1169, file: !1170, line: 183, baseType: !1213, size: 64, offset: 960)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !1169, file: !1170, line: 184, baseType: !1213, size: 64, offset: 1024)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !1169, file: !1170, line: 185, baseType: !1245, size: 64, offset: 1088)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 288, elements: !1247)
!1247 = !{!1216, !1216}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !1169, file: !1170, line: 188, baseType: !1233, size: 8, offset: 1152)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !1169, file: !1170, line: 191, baseType: !5, size: 32, offset: 1184)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !1169, file: !1170, line: 191, baseType: !1251, size: 64, offset: 1216)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !1169, file: !1170, line: 191, baseType: !5, size: 32, offset: 1280)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !1169, file: !1170, line: 192, baseType: !1254, size: 64, offset: 1344)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !1170, line: 61, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !1169, file: !1170, line: 195, baseType: !1213, size: 64, offset: 1408)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !1169, file: !1170, line: 197, baseType: !1258, size: 64, offset: 1472)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !1170, line: 197, flags: DIFlagFwdDecl)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1169, file: !1170, line: 198, baseType: !1261, size: 64, offset: 1536)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !1170, line: 59, flags: DIFlagFwdDecl)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !1169, file: !1170, line: 201, baseType: !1233, size: 8, offset: 1600)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !1169, file: !1170, line: 202, baseType: !1214, size: 96, offset: 1632)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !1169, file: !1170, line: 204, baseType: !1214, size: 96, offset: 1728)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !1169, file: !1170, line: 205, baseType: !1062, size: 32, offset: 1824)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1163, file: !15, line: 121, baseType: !1022, size: 16, offset: 1088)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1163, file: !15, line: 121, baseType: !1022, size: 16, offset: 1104)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1163, file: !15, line: 122, baseType: !1062, size: 32, offset: 1120)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1163, file: !15, line: 122, baseType: !1062, size: 32, offset: 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1163, file: !15, line: 122, baseType: !1062, size: 32, offset: 1184)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1163, file: !15, line: 123, baseType: !1077, size: 512, offset: 1216)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1163, file: !15, line: 124, baseType: !1162, size: 64, offset: 1728)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1163, file: !15, line: 124, baseType: !1162, size: 64, offset: 1792)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1163, file: !15, line: 127, baseType: !1162, size: 64, offset: 1856)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1163, file: !15, line: 127, baseType: !1162, size: 64, offset: 1920)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1163, file: !15, line: 127, baseType: !1162, size: 64, offset: 1984)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1163, file: !15, line: 128, baseType: !1279, size: 64, offset: 2048)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1025, line: 46, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1163, file: !15, line: 130, baseType: !1282, size: 64, offset: 2112)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !15, line: 97, size: 832, elements: !1284)
!1284 = !{!1285, !1289, !1290}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1283, file: !15, line: 98, baseType: !1286, size: 768)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 768, elements: !1287)
!1287 = !{!1288, !1216}
!1288 = !DISubrange(count: 8)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1283, file: !15, line: 99, baseType: !1062, size: 32, offset: 768)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1283, file: !15, line: 99, baseType: !1062, size: 32, offset: 800)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1163, file: !15, line: 131, baseType: !1292, size: 64, offset: 2176)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1294, line: 486, size: 1600, elements: !1295)
!1294 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1295 = !{!1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1293, file: !1294, line: 487, baseType: !1029, size: 960)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1293, file: !1294, line: 489, baseType: !1087, size: 128, offset: 960)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1293, file: !1294, line: 490, baseType: !1087, size: 128, offset: 1088)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1293, file: !1294, line: 491, baseType: !1087, size: 128, offset: 1216)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1293, file: !1294, line: 492, baseType: !1087, size: 128, offset: 1344)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1293, file: !1294, line: 494, baseType: !1062, size: 32, offset: 1472)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1293, file: !1294, line: 495, baseType: !1062, size: 32, offset: 1504)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1293, file: !1294, line: 497, baseType: !1062, size: 32, offset: 1536)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1293, file: !1294, line: 498, baseType: !1062, size: 32, offset: 1568)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1163, file: !15, line: 132, baseType: !1292, size: 64, offset: 2240)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1163, file: !15, line: 133, baseType: !1307, size: 64, offset: 2304)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1294, line: 334, size: 1728, elements: !1309)
!1309 = !{!1310, !1311, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1347}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1308, file: !1294, line: 335, baseType: !1087, size: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1308, file: !1294, line: 336, baseType: !1312, size: 64, offset: 128)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1314, line: 51, flags: DIFlagFwdDecl)
!1314 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1308, file: !1294, line: 338, baseType: !1022, size: 16, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1308, file: !1294, line: 338, baseType: !1022, size: 16, offset: 208)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1308, file: !1294, line: 339, baseType: !5, size: 32, offset: 224)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1308, file: !1294, line: 340, baseType: !1062, size: 32, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1308, file: !1294, line: 342, baseType: !1101, size: 32, offset: 288)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1308, file: !1294, line: 343, baseType: !1214, size: 96, offset: 320)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1308, file: !1294, line: 344, baseType: !1214, size: 96, offset: 416)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1308, file: !1294, line: 347, baseType: !1087, size: 128, offset: 512)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1308, file: !1294, line: 349, baseType: !1062, size: 32, offset: 640)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1308, file: !1294, line: 350, baseType: !1062, size: 32, offset: 672)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1308, file: !1294, line: 351, baseType: !1018, size: 64, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1308, file: !1294, line: 352, baseType: !1018, size: 64, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1308, file: !1294, line: 354, baseType: !1328, size: 384, offset: 832)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1294, line: 116, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1294, line: 94, size: 384, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1329, file: !1294, line: 96, baseType: !1062, size: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1329, file: !1294, line: 96, baseType: !1062, size: 32, offset: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1329, file: !1294, line: 97, baseType: !1062, size: 32, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1329, file: !1294, line: 97, baseType: !1062, size: 32, offset: 96)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1329, file: !1294, line: 99, baseType: !1022, size: 16, offset: 128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1329, file: !1294, line: 100, baseType: !1022, size: 16, offset: 144)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1329, file: !1294, line: 102, baseType: !1022, size: 16, offset: 160)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1329, file: !1294, line: 105, baseType: !1022, size: 16, offset: 176)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1329, file: !1294, line: 108, baseType: !1022, size: 16, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1329, file: !1294, line: 109, baseType: !1022, size: 16, offset: 208)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1329, file: !1294, line: 111, baseType: !1022, size: 16, offset: 224)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1329, file: !1294, line: 112, baseType: !1022, size: 16, offset: 240)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1329, file: !1294, line: 114, baseType: !1062, size: 32, offset: 256)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1329, file: !1294, line: 114, baseType: !1062, size: 32, offset: 288)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1329, file: !1294, line: 115, baseType: !1062, size: 32, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1329, file: !1294, line: 115, baseType: !1062, size: 32, offset: 352)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1308, file: !1294, line: 355, baseType: !1077, size: 512, offset: 1216)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !15, line: 134, baseType: !1018, size: 64, offset: 2368)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1163, file: !15, line: 136, baseType: !1350, size: 64, offset: 2432)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1157, line: 61, flags: DIFlagFwdDecl)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1163, file: !15, line: 138, baseType: !1328, size: 384, offset: 2496)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1163, file: !15, line: 139, baseType: !1354, size: 64, offset: 2880)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1294, line: 80, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1294, line: 72, size: 192, elements: !1357)
!1357 = !{!1358, !1365, !1366, !1367, !1368}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1356, file: !1294, line: 73, baseType: !1359, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1294, line: 59, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1294, line: 56, size: 128, elements: !1362)
!1362 = !{!1363, !1364}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1361, file: !1294, line: 57, baseType: !1214, size: 96)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1361, file: !1294, line: 58, baseType: !1062, size: 32, offset: 96)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1356, file: !1294, line: 74, baseType: !1062, size: 32, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1356, file: !1294, line: 76, baseType: !1062, size: 32, offset: 96)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1356, file: !1294, line: 77, baseType: !1062, size: 32, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1356, file: !1294, line: 79, baseType: !1062, size: 32, offset: 160)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1163, file: !15, line: 141, baseType: !1087, size: 128, offset: 2944)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1163, file: !15, line: 142, baseType: !1087, size: 128, offset: 3072)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1163, file: !15, line: 143, baseType: !1087, size: 128, offset: 3200)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1163, file: !15, line: 144, baseType: !1087, size: 128, offset: 3328)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1163, file: !15, line: 146, baseType: !1062, size: 32, offset: 3456)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1163, file: !15, line: 147, baseType: !1062, size: 32, offset: 3488)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1163, file: !15, line: 150, baseType: !1376, size: 64, offset: 3520)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1379, line: 93, size: 7552, elements: !1380)
!1379 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1380 = !{!1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1429, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1498, !1499, !1500, !1501, !1502, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1613, !2445, !2446, !2449, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2493, !2560}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1378, file: !1379, line: 94, baseType: !1029, size: 960)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1378, file: !1379, line: 95, baseType: !1098, size: 64, offset: 960)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !1378, file: !1379, line: 97, baseType: !1022, size: 16, offset: 1024)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1378, file: !1379, line: 97, baseType: !1022, size: 16, offset: 1040)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1378, file: !1379, line: 99, baseType: !1101, size: 32, offset: 1056)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1378, file: !1379, line: 99, baseType: !1101, size: 32, offset: 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1378, file: !1379, line: 99, baseType: !1101, size: 32, offset: 1120)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !1378, file: !1379, line: 100, baseType: !1101, size: 32, offset: 1152)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !1378, file: !1379, line: 100, baseType: !1101, size: 32, offset: 1184)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !1378, file: !1379, line: 100, baseType: !1101, size: 32, offset: 1216)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !1378, file: !1379, line: 101, baseType: !1101, size: 32, offset: 1248)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !1378, file: !1379, line: 101, baseType: !1101, size: 32, offset: 1280)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !1378, file: !1379, line: 101, baseType: !1101, size: 32, offset: 1312)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1378, file: !1379, line: 102, baseType: !1101, size: 32, offset: 1344)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1378, file: !1379, line: 102, baseType: !1101, size: 32, offset: 1376)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1378, file: !1379, line: 102, baseType: !1101, size: 32, offset: 1408)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !1378, file: !1379, line: 103, baseType: !1101, size: 32, offset: 1440)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !1378, file: !1379, line: 103, baseType: !1101, size: 32, offset: 1472)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !1378, file: !1379, line: 103, baseType: !1101, size: 32, offset: 1504)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !1378, file: !1379, line: 103, baseType: !1101, size: 32, offset: 1536)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !1378, file: !1379, line: 103, baseType: !1101, size: 32, offset: 1568)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1378, file: !1379, line: 104, baseType: !1101, size: 32, offset: 1600)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1378, file: !1379, line: 104, baseType: !1101, size: 32, offset: 1632)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !1378, file: !1379, line: 104, baseType: !1101, size: 32, offset: 1664)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !1378, file: !1379, line: 104, baseType: !1101, size: 32, offset: 1696)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !1378, file: !1379, line: 104, baseType: !1101, size: 32, offset: 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !1378, file: !1379, line: 105, baseType: !1101, size: 32, offset: 1760)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !1378, file: !1379, line: 108, baseType: !1409, size: 704, offset: 1792)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !1379, line: 53, size: 704, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1409, file: !1379, line: 54, baseType: !1101, size: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !1409, file: !1379, line: 55, baseType: !1101, size: 32, offset: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !1409, file: !1379, line: 56, baseType: !1101, size: 32, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !1409, file: !1379, line: 57, baseType: !1101, size: 32, offset: 96)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !1409, file: !1379, line: 59, baseType: !1214, size: 96, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !1409, file: !1379, line: 60, baseType: !1214, size: 96, offset: 224)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !1409, file: !1379, line: 61, baseType: !1214, size: 96, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !1409, file: !1379, line: 63, baseType: !1101, size: 32, offset: 416)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !1409, file: !1379, line: 64, baseType: !1101, size: 32, offset: 448)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !1409, file: !1379, line: 65, baseType: !1101, size: 32, offset: 480)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !1409, file: !1379, line: 67, baseType: !1022, size: 16, offset: 512)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !1409, file: !1379, line: 68, baseType: !1022, size: 16, offset: 528)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !1409, file: !1379, line: 69, baseType: !1022, size: 16, offset: 544)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !1409, file: !1379, line: 70, baseType: !1022, size: 16, offset: 560)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !1409, file: !1379, line: 72, baseType: !1101, size: 32, offset: 576)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !1409, file: !1379, line: 73, baseType: !1101, size: 32, offset: 608)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !1409, file: !1379, line: 74, baseType: !1101, size: 32, offset: 640)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !1409, file: !1379, line: 75, baseType: !1101, size: 32, offset: 672)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !1378, file: !1379, line: 109, baseType: !1430, size: 128, offset: 2496)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !1379, line: 79, size: 128, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1435}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1430, file: !1379, line: 80, baseType: !1062, size: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !1430, file: !1379, line: 81, baseType: !1062, size: 32, offset: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !1430, file: !1379, line: 82, baseType: !1062, size: 32, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1430, file: !1379, line: 83, baseType: !1062, size: 32, offset: 96)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !1378, file: !1379, line: 111, baseType: !1101, size: 32, offset: 2624)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !1378, file: !1379, line: 111, baseType: !1101, size: 32, offset: 2656)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !1378, file: !1379, line: 112, baseType: !1101, size: 32, offset: 2688)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !1378, file: !1379, line: 112, baseType: !1101, size: 32, offset: 2720)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1378, file: !1379, line: 113, baseType: !1101, size: 32, offset: 2752)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !1378, file: !1379, line: 114, baseType: !1101, size: 32, offset: 2784)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !1378, file: !1379, line: 114, baseType: !1101, size: 32, offset: 2816)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !1378, file: !1379, line: 115, baseType: !1022, size: 16, offset: 2848)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !1378, file: !1379, line: 115, baseType: !1022, size: 16, offset: 2864)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !1378, file: !1379, line: 116, baseType: !1022, size: 16, offset: 2880)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !1378, file: !1379, line: 117, baseType: !1020, size: 8, offset: 2896)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !1378, file: !1379, line: 117, baseType: !1020, size: 8, offset: 2904)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !1378, file: !1379, line: 119, baseType: !1101, size: 32, offset: 2912)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !1378, file: !1379, line: 119, baseType: !1101, size: 32, offset: 2944)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !1378, file: !1379, line: 120, baseType: !1022, size: 16, offset: 2976)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !1378, file: !1379, line: 120, baseType: !1022, size: 16, offset: 2992)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !1378, file: !1379, line: 121, baseType: !1101, size: 32, offset: 3008)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !1378, file: !1379, line: 121, baseType: !1101, size: 32, offset: 3040)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !1378, file: !1379, line: 122, baseType: !1101, size: 32, offset: 3072)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !1378, file: !1379, line: 123, baseType: !1101, size: 32, offset: 3104)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !1378, file: !1379, line: 124, baseType: !1022, size: 16, offset: 3136)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !1378, file: !1379, line: 125, baseType: !1022, size: 16, offset: 3152)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1378, file: !1379, line: 127, baseType: !1062, size: 32, offset: 3168)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !1378, file: !1379, line: 127, baseType: !1062, size: 32, offset: 3200)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !1378, file: !1379, line: 128, baseType: !1062, size: 32, offset: 3232)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !1378, file: !1379, line: 128, baseType: !1062, size: 32, offset: 3264)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !1378, file: !1379, line: 129, baseType: !1022, size: 16, offset: 3296)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !1378, file: !1379, line: 129, baseType: !1022, size: 16, offset: 3312)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !1378, file: !1379, line: 129, baseType: !1022, size: 16, offset: 3328)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !1378, file: !1379, line: 129, baseType: !1022, size: 16, offset: 3344)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !1378, file: !1379, line: 130, baseType: !1101, size: 32, offset: 3360)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !1378, file: !1379, line: 130, baseType: !1101, size: 32, offset: 3392)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !1378, file: !1379, line: 130, baseType: !1101, size: 32, offset: 3424)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !1378, file: !1379, line: 130, baseType: !1101, size: 32, offset: 3456)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !1378, file: !1379, line: 131, baseType: !1101, size: 32, offset: 3488)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !1378, file: !1379, line: 131, baseType: !1101, size: 32, offset: 3520)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !1378, file: !1379, line: 131, baseType: !1101, size: 32, offset: 3552)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !1378, file: !1379, line: 131, baseType: !1101, size: 32, offset: 3584)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !1378, file: !1379, line: 132, baseType: !1101, size: 32, offset: 3616)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !1378, file: !1379, line: 132, baseType: !1101, size: 32, offset: 3648)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !1378, file: !1379, line: 133, baseType: !1077, size: 512, offset: 3680)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !1378, file: !1379, line: 135, baseType: !1101, size: 32, offset: 4192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !1378, file: !1379, line: 136, baseType: !1101, size: 32, offset: 4224)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !1378, file: !1379, line: 137, baseType: !1101, size: 32, offset: 4256)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !1378, file: !1379, line: 138, baseType: !1062, size: 32, offset: 4288)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !1378, file: !1379, line: 141, baseType: !1020, size: 8, offset: 4320)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1378, file: !1379, line: 141, baseType: !1020, size: 8, offset: 4328)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !1378, file: !1379, line: 141, baseType: !1020, size: 8, offset: 4336)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1378, file: !1379, line: 141, baseType: !1020, size: 8, offset: 4344)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !1378, file: !1379, line: 142, baseType: !1022, size: 16, offset: 4352)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !1378, file: !1379, line: 142, baseType: !1022, size: 16, offset: 4368)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !1378, file: !1379, line: 142, baseType: !1022, size: 16, offset: 4384)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !1378, file: !1379, line: 145, baseType: !1020, size: 8, offset: 4400)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1378, file: !1379, line: 145, baseType: !1020, size: 8, offset: 4408)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !1378, file: !1379, line: 148, baseType: !1022, size: 16, offset: 4416)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !1378, file: !1379, line: 148, baseType: !1022, size: 16, offset: 4432)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !1378, file: !1379, line: 149, baseType: !1101, size: 32, offset: 4448)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !1378, file: !1379, line: 149, baseType: !1101, size: 32, offset: 4480)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1378, file: !1379, line: 152, baseType: !1495, size: 128, offset: 4512)
!1495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 128, elements: !1496)
!1496 = !{!1497}
!1497 = !DISubrange(count: 4)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !1378, file: !1379, line: 153, baseType: !1101, size: 32, offset: 4640)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !1378, file: !1379, line: 154, baseType: !1101, size: 32, offset: 4672)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1378, file: !1379, line: 157, baseType: !1022, size: 16, offset: 4704)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1378, file: !1379, line: 157, baseType: !1022, size: 16, offset: 4720)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !1378, file: !1379, line: 160, baseType: !1503, size: 64, offset: 4736)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !1025, line: 113, size: 6208, elements: !1505)
!1505 = !{!1506, !1507, !1508, !1509, !1510, !1511, !1515}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1504, file: !1025, line: 114, baseType: !1022, size: 16)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1504, file: !1025, line: 114, baseType: !1022, size: 16, offset: 16)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1504, file: !1025, line: 115, baseType: !1020, size: 8, offset: 32)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1504, file: !1025, line: 115, baseType: !1020, size: 8, offset: 40)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1504, file: !1025, line: 116, baseType: !1020, size: 8, offset: 48)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1504, file: !1025, line: 117, baseType: !1512, size: 8, offset: 56)
!1512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 8, elements: !1513)
!1513 = !{!1514}
!1514 = !DISubrange(count: 1)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1504, file: !1025, line: 119, baseType: !1516, size: 6144, offset: 64)
!1516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1517, size: 6144, elements: !1526)
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !1025, line: 109, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !1025, line: 106, size: 192, elements: !1519)
!1519 = !{!1520, !1521, !1522, !1523, !1524, !1525}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1518, file: !1025, line: 107, baseType: !1101, size: 32)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1518, file: !1025, line: 107, baseType: !1101, size: 32, offset: 32)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1518, file: !1025, line: 107, baseType: !1101, size: 32, offset: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1518, file: !1025, line: 107, baseType: !1101, size: 32, offset: 96)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1518, file: !1025, line: 107, baseType: !1101, size: 32, offset: 128)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1518, file: !1025, line: 108, baseType: !1062, size: 32, offset: 160)
!1526 = !{!1527}
!1527 = !DISubrange(count: 32)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !1378, file: !1379, line: 161, baseType: !1503, size: 64, offset: 4800)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !1378, file: !1379, line: 162, baseType: !1020, size: 8, offset: 4864)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !1378, file: !1379, line: 162, baseType: !1020, size: 8, offset: 4872)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !1378, file: !1379, line: 163, baseType: !1020, size: 8, offset: 4880)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !1378, file: !1379, line: 163, baseType: !1020, size: 8, offset: 4888)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !1378, file: !1379, line: 164, baseType: !1022, size: 16, offset: 4896)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1378, file: !1379, line: 164, baseType: !1022, size: 16, offset: 4912)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !1378, file: !1379, line: 165, baseType: !1101, size: 32, offset: 4928)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !1378, file: !1379, line: 165, baseType: !1101, size: 32, offset: 4960)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1378, file: !1379, line: 167, baseType: !1538, size: 1152, offset: 4992)
!1538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1539, size: 1152, elements: !1611)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1025, line: 57, size: 2496, elements: !1541)
!1541 = !{!1542, !1543, !1544, !1545, !1546, !1547, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1540, file: !1025, line: 59, baseType: !1022, size: 16)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1540, file: !1025, line: 59, baseType: !1022, size: 16, offset: 16)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1540, file: !1025, line: 59, baseType: !1022, size: 16, offset: 32)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1540, file: !1025, line: 59, baseType: !1022, size: 16, offset: 48)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1540, file: !1025, line: 60, baseType: !1162, size: 64, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1540, file: !1025, line: 61, baseType: !1548, size: 64, offset: 128)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !1540, file: !1025, line: 62, baseType: !1077, size: 512, offset: 192)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !1540, file: !1025, line: 64, baseType: !1020, size: 8, offset: 704)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !1540, file: !1025, line: 64, baseType: !1020, size: 8, offset: 712)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !1540, file: !1025, line: 64, baseType: !1020, size: 8, offset: 720)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1540, file: !1025, line: 64, baseType: !1020, size: 8, offset: 728)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !1540, file: !1025, line: 65, baseType: !1214, size: 96, offset: 736)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1540, file: !1025, line: 65, baseType: !1214, size: 96, offset: 832)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1540, file: !1025, line: 65, baseType: !1101, size: 32, offset: 928)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !1540, file: !1025, line: 67, baseType: !1022, size: 16, offset: 960)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !1540, file: !1025, line: 67, baseType: !1022, size: 16, offset: 976)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !1540, file: !1025, line: 67, baseType: !1022, size: 16, offset: 992)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !1540, file: !1025, line: 67, baseType: !1022, size: 16, offset: 1008)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !1540, file: !1025, line: 68, baseType: !1022, size: 16, offset: 1024)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !1540, file: !1025, line: 68, baseType: !1022, size: 16, offset: 1040)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !1540, file: !1025, line: 69, baseType: !1020, size: 8, offset: 1056)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1540, file: !1025, line: 69, baseType: !1565, size: 56, offset: 1064)
!1565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 56, elements: !1566)
!1566 = !{!1567}
!1567 = !DISubrange(count: 7)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1540, file: !1025, line: 70, baseType: !1101, size: 32, offset: 1120)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1540, file: !1025, line: 70, baseType: !1101, size: 32, offset: 1152)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1540, file: !1025, line: 70, baseType: !1101, size: 32, offset: 1184)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1540, file: !1025, line: 70, baseType: !1101, size: 32, offset: 1216)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !1540, file: !1025, line: 71, baseType: !1101, size: 32, offset: 1248)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !1540, file: !1025, line: 71, baseType: !1101, size: 32, offset: 1280)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !1540, file: !1025, line: 74, baseType: !1101, size: 32, offset: 1312)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !1540, file: !1025, line: 74, baseType: !1101, size: 32, offset: 1344)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !1540, file: !1025, line: 77, baseType: !1101, size: 32, offset: 1376)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !1540, file: !1025, line: 77, baseType: !1101, size: 32, offset: 1408)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !1540, file: !1025, line: 77, baseType: !1101, size: 32, offset: 1440)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !1540, file: !1025, line: 78, baseType: !1101, size: 32, offset: 1472)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !1540, file: !1025, line: 78, baseType: !1101, size: 32, offset: 1504)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !1540, file: !1025, line: 78, baseType: !1101, size: 32, offset: 1536)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !1540, file: !1025, line: 79, baseType: !1101, size: 32, offset: 1568)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !1540, file: !1025, line: 79, baseType: !1101, size: 32, offset: 1600)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !1540, file: !1025, line: 79, baseType: !1101, size: 32, offset: 1632)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !1540, file: !1025, line: 79, baseType: !1101, size: 32, offset: 1664)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !1540, file: !1025, line: 80, baseType: !1101, size: 32, offset: 1696)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !1540, file: !1025, line: 80, baseType: !1101, size: 32, offset: 1728)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !1540, file: !1025, line: 80, baseType: !1101, size: 32, offset: 1760)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !1540, file: !1025, line: 81, baseType: !1101, size: 32, offset: 1792)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !1540, file: !1025, line: 81, baseType: !1101, size: 32, offset: 1824)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !1540, file: !1025, line: 81, baseType: !1101, size: 32, offset: 1856)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !1540, file: !1025, line: 82, baseType: !1101, size: 32, offset: 1888)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !1540, file: !1025, line: 82, baseType: !1101, size: 32, offset: 1920)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !1540, file: !1025, line: 82, baseType: !1101, size: 32, offset: 1952)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !1540, file: !1025, line: 85, baseType: !1101, size: 32, offset: 1984)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !1540, file: !1025, line: 85, baseType: !1101, size: 32, offset: 2016)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !1540, file: !1025, line: 85, baseType: !1101, size: 32, offset: 2048)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !1540, file: !1025, line: 85, baseType: !1101, size: 32, offset: 2080)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !1540, file: !1025, line: 86, baseType: !1101, size: 32, offset: 2112)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !1540, file: !1025, line: 86, baseType: !1101, size: 32, offset: 2144)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !1540, file: !1025, line: 86, baseType: !1101, size: 32, offset: 2176)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !1540, file: !1025, line: 86, baseType: !1101, size: 32, offset: 2208)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !1540, file: !1025, line: 87, baseType: !1101, size: 32, offset: 2240)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !1540, file: !1025, line: 87, baseType: !1101, size: 32, offset: 2272)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !1540, file: !1025, line: 87, baseType: !1101, size: 32, offset: 2304)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !1540, file: !1025, line: 87, baseType: !1101, size: 32, offset: 2336)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !1540, file: !1025, line: 90, baseType: !1101, size: 32, offset: 2368)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !1540, file: !1025, line: 93, baseType: !1101, size: 32, offset: 2400)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !1540, file: !1025, line: 93, baseType: !1101, size: 32, offset: 2432)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !1540, file: !1025, line: 93, baseType: !1101, size: 32, offset: 2464)
!1611 = !{!1612}
!1612 = !DISubrange(count: 18)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1378, file: !1379, line: 168, baseType: !1614, size: 64, offset: 6144)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1616, line: 328, size: 3456, elements: !1617)
!1616 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1617 = !{!1618, !1619, !1620, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2423, !2424, !2425, !2428, !2432, !2436, !2440, !2441, !2442, !2443, !2444}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1615, file: !1616, line: 329, baseType: !1029, size: 960)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1615, file: !1616, line: 330, baseType: !1098, size: 64, offset: 960)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1615, file: !1616, line: 332, baseType: !1621, size: 64, offset: 1024)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1623, line: 283, size: 4096, elements: !1624)
!1623 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1624 = !{!1625, !1626, !1627, !1628, !1632, !1633, !1637, !2363, !2371, !2375, !2381, !2385, !2386, !2387, !2388, !2392, !2393}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1622, file: !1623, line: 284, baseType: !1062, size: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1622, file: !1623, line: 285, baseType: !1077, size: 512, offset: 32)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1622, file: !1623, line: 287, baseType: !1077, size: 512, offset: 544)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1622, file: !1623, line: 288, baseType: !1629, size: 2048, offset: 1056)
!1629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 2048, elements: !1630)
!1630 = !{!1631}
!1631 = !DISubrange(count: 256)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1622, file: !1623, line: 289, baseType: !1062, size: 32, offset: 3104)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !1622, file: !1623, line: 292, baseType: !1634, size: 64, offset: 3136)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{null, !1614}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !1622, file: !1623, line: 293, baseType: !1638, size: 64, offset: 3200)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{null, !1614, !1641}
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64)
!1642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !1616, line: 167, size: 3712, elements: !1643)
!1643 = !{!1644, !1645, !1646, !1647, !1648, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1642, file: !1616, line: 168, baseType: !1641, size: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1642, file: !1616, line: 168, baseType: !1641, size: 64, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !1642, file: !1616, line: 168, baseType: !1641, size: 64, offset: 128)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1642, file: !1616, line: 170, baseType: !1066, size: 64, offset: 192)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1642, file: !1616, line: 172, baseType: !1649, size: 64, offset: 256)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !1623, line: 144, size: 6016, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1829, !1830, !1831, !1972, !1976, !1980, !1981, !1988, !1992, !1996, !1997, !1998, !1999, !2003, !2004, !2008, !2012, !2016, !2020, !2024, !2028, !2032, !2033, !2040, !2042, !2051, !2060}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1650, file: !1623, line: 145, baseType: !1018, size: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1650, file: !1623, line: 145, baseType: !1018, size: 64, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !1650, file: !1623, line: 146, baseType: !1022, size: 16, offset: 128)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1650, file: !1623, line: 148, baseType: !1077, size: 512, offset: 144)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1650, file: !1623, line: 149, baseType: !1062, size: 32, offset: 672)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1650, file: !1623, line: 151, baseType: !1077, size: 512, offset: 704)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1650, file: !1623, line: 152, baseType: !1629, size: 2048, offset: 1216)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1650, file: !1623, line: 153, baseType: !1062, size: 32, offset: 3264)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1650, file: !1623, line: 155, baseType: !1101, size: 32, offset: 3296)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !1650, file: !1623, line: 155, baseType: !1101, size: 32, offset: 3328)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !1650, file: !1623, line: 155, baseType: !1101, size: 32, offset: 3360)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1650, file: !1623, line: 156, baseType: !1101, size: 32, offset: 3392)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !1650, file: !1623, line: 156, baseType: !1101, size: 32, offset: 3424)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !1650, file: !1623, line: 156, baseType: !1101, size: 32, offset: 3456)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !1650, file: !1623, line: 157, baseType: !1022, size: 16, offset: 3488)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1650, file: !1623, line: 157, baseType: !1022, size: 16, offset: 3504)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !1650, file: !1623, line: 157, baseType: !1022, size: 16, offset: 3520)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1650, file: !1623, line: 160, baseType: !1670, size: 64, offset: 3584)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64)
!1671 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !1623, line: 109, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !1623, line: 98, size: 1408, elements: !1673)
!1673 = !{!1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1828}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1672, file: !1623, line: 99, baseType: !1062, size: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1672, file: !1623, line: 99, baseType: !1062, size: 32, offset: 32)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1672, file: !1623, line: 100, baseType: !1077, size: 512, offset: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !1672, file: !1623, line: 101, baseType: !1101, size: 32, offset: 576)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1672, file: !1623, line: 101, baseType: !1101, size: 32, offset: 608)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !1672, file: !1623, line: 101, baseType: !1101, size: 32, offset: 640)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !1672, file: !1623, line: 101, baseType: !1101, size: 32, offset: 672)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1672, file: !1623, line: 102, baseType: !1101, size: 32, offset: 704)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1672, file: !1623, line: 102, baseType: !1101, size: 32, offset: 736)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1672, file: !1623, line: 103, baseType: !1062, size: 32, offset: 768)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1672, file: !1623, line: 104, baseType: !1062, size: 32, offset: 800)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !1672, file: !1623, line: 107, baseType: !1686, size: 64, offset: 832)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64)
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !1616, line: 87, size: 2816, elements: !1688)
!1688 = !{!1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1812}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1687, file: !1616, line: 88, baseType: !1686, size: 64)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1687, file: !1616, line: 88, baseType: !1686, size: 64, offset: 64)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !1687, file: !1616, line: 88, baseType: !1686, size: 64, offset: 128)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1687, file: !1616, line: 90, baseType: !1066, size: 64, offset: 192)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1687, file: !1616, line: 92, baseType: !1077, size: 512, offset: 256)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1687, file: !1616, line: 94, baseType: !1077, size: 512, offset: 768)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !1687, file: !1616, line: 99, baseType: !1018, size: 64, offset: 1280)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1687, file: !1616, line: 101, baseType: !1022, size: 16, offset: 1344)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1687, file: !1616, line: 101, baseType: !1022, size: 16, offset: 1360)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1687, file: !1616, line: 102, baseType: !1022, size: 16, offset: 1376)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !1687, file: !1616, line: 103, baseType: !1022, size: 16, offset: 1392)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1687, file: !1616, line: 104, baseType: !1701, size: 64, offset: 1408)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64)
!1702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !1623, line: 114, size: 1600, elements: !1703)
!1703 = !{!1704, !1705, !1728, !1732, !1736, !1740, !1744, !1748, !1749, !1753, !1782, !1783, !1784}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1702, file: !1623, line: 115, baseType: !1077, size: 512)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1702, file: !1623, line: 117, baseType: !1706, size: 64, offset: 512)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{null, !1709, !1712, !1715, !1715, !1726}
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64)
!1710 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1711, line: 44, flags: DIFlagFwdDecl)
!1711 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64)
!1713 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !1714, line: 46, flags: DIFlagFwdDecl)
!1714 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64)
!1716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !1711, line: 55, size: 192, elements: !1717)
!1717 = !{!1718, !1722, !1725}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1716, file: !1711, line: 58, baseType: !1719, size: 64)
!1719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1716, file: !1711, line: 56, size: 64, elements: !1720)
!1720 = !{!1721}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1719, file: !1711, line: 57, baseType: !1018, size: 64)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1716, file: !1711, line: 60, baseType: !1723, size: 64, offset: 64)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64)
!1724 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1616, line: 335, flags: DIFlagFwdDecl)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1716, file: !1711, line: 61, baseType: !1018, size: 64, offset: 128)
!1726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1727, size: 64)
!1727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !1702, file: !1623, line: 118, baseType: !1729, size: 64, offset: 576)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64)
!1730 = !DISubroutineType(types: !1731)
!1731 = !{null, !1709, !1715, !1715, !1221}
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !1702, file: !1623, line: 120, baseType: !1733, size: 64, offset: 640)
!1733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1734, size: 64)
!1734 = !DISubroutineType(types: !1735)
!1735 = !{null, !1709, !1712, !1715}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !1702, file: !1623, line: 121, baseType: !1737, size: 64, offset: 704)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64)
!1738 = !DISubroutineType(types: !1739)
!1739 = !{null, !1709, !1715, !1221}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !1702, file: !1623, line: 122, baseType: !1741, size: 64, offset: 768)
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64)
!1742 = !DISubroutineType(types: !1743)
!1743 = !{null, !1614, !1686, !1723}
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !1702, file: !1623, line: 123, baseType: !1745, size: 64, offset: 832)
!1745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64)
!1746 = !DISubroutineType(types: !1747)
!1747 = !{null, !1614, !1686, !1641, !1686, !1726}
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !1702, file: !1623, line: 124, baseType: !1745, size: 64, offset: 896)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !1702, file: !1623, line: 125, baseType: !1750, size: 64, offset: 960)
!1750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1751, size: 64)
!1751 = !DISubroutineType(types: !1752)
!1752 = !{null, !1614, !1686, !1641, !1686}
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !1702, file: !1623, line: 128, baseType: !1754, size: 256, offset: 1024)
!1754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !1711, line: 436, baseType: !1755)
!1755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !1711, line: 430, size: 256, elements: !1756)
!1756 = !{!1757, !1758, !1761, !1777}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1755, file: !1711, line: 431, baseType: !1018, size: 64)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1755, file: !1711, line: 432, baseType: !1759, size: 64, offset: 64)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64)
!1760 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !1711, line: 417, baseType: !1724)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1755, file: !1711, line: 433, baseType: !1762, size: 64, offset: 128)
!1762 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !1711, line: 408, baseType: !1763)
!1763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1764, size: 64)
!1764 = !DISubroutineType(types: !1765)
!1765 = !{!1062, !1709, !1715, !1766, !1768}
!1766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1767, size: 64)
!1767 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !1711, line: 38, flags: DIFlagFwdDecl)
!1768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1769, size: 64)
