; ModuleID = 'blender/source/blender/modifiers/intern/MOD_collision.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_collision.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!17 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsMesh", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsCVs", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "eModifierTypeFlag_SupportsMapping", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "eModifierTypeFlag_SupportsEditmode", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "eModifierTypeFlag_EnableInEditmode", value: 16, isUnsigned: true)
!22 = !DIEnumerator(name: "eModifierTypeFlag_RequiresOriginalData", value: 32, isUnsigned: true)
!23 = !DIEnumerator(name: "eModifierTypeFlag_UsesPointCache", value: 64, isUnsigned: true)
!24 = !DIEnumerator(name: "eModifierTypeFlag_Single", value: 128, isUnsigned: true)
!25 = !DIEnumerator(name: "eModifierTypeFlag_NoUserAdd", value: 256, isUnsigned: true)
!26 = !DIEnumerator(name: "eModifierTypeFlag_UsesPreview", value: 512, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DerivedMeshType", file: !28, line: 128, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "DM_TYPE_CDDM", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "DM_TYPE_EDITBMESH", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "DM_TYPE_CCGDM", value: 2, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDirtyFlag", file: !28, line: 164, baseType: !7, size: 32, elements: !34)
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "DM_DIRTY_TESS_CDLAYERS", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "DM_DIRTY_MCOL_UPDATE_DRAW", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "DM_DIRTY_NORMALS", value: 4, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMForeachFlag", file: !28, line: 159, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "DM_FOREACH_NOP", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "DM_FOREACH_USE_NORMAL", value: 1, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawOption", file: !28, line: 134, baseType: !7, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !28, line: 152, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !6, line: 110, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 339, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!63 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!67 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!69 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!70 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!71 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!72 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!73 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!74 = !{!75, !142}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "CollisionModifierData", file: !77, line: 584, baseType: !78)
!77 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CollisionModifierData", file: !77, line: 568, size: 1536, elements: !79)
!79 = !{!80, !103, !118, !119, !120, !121, !122, !123, !134, !135, !136, !137, !138}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !78, file: !77, line: 569, baseType: !81, size: 896)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !77, line: 110, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !77, line: 99, size: 896, elements: !83)
!83 = !{!84, !86, !87, !89, !90, !91, !92, !97, !101}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !77, line: 100, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !82, file: !77, line: 100, baseType: !85, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !77, line: 102, baseType: !88, size: 32, offset: 128)
!88 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !82, file: !77, line: 102, baseType: !88, size: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !82, file: !77, line: 103, baseType: !88, size: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !82, file: !77, line: 103, baseType: !88, size: 32, offset: 224)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !77, line: 104, baseType: !93, size: 512, offset: 256)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 512, elements: !95)
!94 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !{!96}
!96 = !DISubrange(count: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !82, file: !77, line: 107, baseType: !98, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !100, line: 40, flags: DIFlagFwdDecl)
!100 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!101 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !82, file: !77, line: 109, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !78, file: !77, line: 571, baseType: !104, size: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !106, line: 65, size: 160, elements: !107)
!106 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!107 = !{!108, !113, !116, !117}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !105, file: !106, line: 66, baseType: !109, size: 96)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 96, elements: !111)
!110 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!111 = !{!112}
!112 = !DISubrange(count: 3)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !105, file: !106, line: 67, baseType: !114, size: 48, offset: 96)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 48, elements: !111)
!115 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !105, file: !106, line: 68, baseType: !94, size: 8, offset: 144)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !105, file: !106, line: 68, baseType: !94, size: 8, offset: 152)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "xnew", scope: !78, file: !77, line: 572, baseType: !104, size: 64, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "xold", scope: !78, file: !77, line: 573, baseType: !104, size: 64, offset: 1024)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "current_xnew", scope: !78, file: !77, line: 574, baseType: !104, size: 64, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "current_x", scope: !78, file: !77, line: 575, baseType: !104, size: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "current_v", scope: !78, file: !77, line: 576, baseType: !104, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mfaces", scope: !78, file: !77, line: 578, baseType: !124, size: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !106, line: 42, size: 160, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !125, file: !106, line: 43, baseType: !7, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !125, file: !106, line: 43, baseType: !7, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !125, file: !106, line: 43, baseType: !7, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !125, file: !106, line: 43, baseType: !7, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !125, file: !106, line: 44, baseType: !115, size: 16, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !125, file: !106, line: 45, baseType: !94, size: 8, offset: 144)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !125, file: !106, line: 45, baseType: !94, size: 8, offset: 152)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "numverts", scope: !78, file: !77, line: 580, baseType: !7, size: 32, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "numfaces", scope: !78, file: !77, line: 581, baseType: !7, size: 32, offset: 1376)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "time_x", scope: !78, file: !77, line: 582, baseType: !110, size: 32, offset: 1408)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "time_xnew", scope: !78, file: !77, line: 582, baseType: !110, size: 32, offset: 1440)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "bvhtree", scope: !78, file: !77, line: 583, baseType: !139, size: 64, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTree", file: !141, line: 42, flags: DIFlagFwdDecl)
!141 = !DIFile(filename: "blender/source/blender/blenlib/BLI_kdopbvh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!143 = !{!0}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !146)
!146 = !{!147, !151, !152, !153, !155, !157, !161, !1610, !1615, !1621, !1625, !1629, !1633, !1637, !1643, !1644, !1648, !1656, !1660, !1661, !1670, !1679}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !6, line: 123, baseType: !148, size: 256)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !145, file: !6, line: 128, baseType: !148, size: 256, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !145, file: !6, line: 131, baseType: !88, size: 32, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !6, line: 133, baseType: !154, size: 32, offset: 544)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !145, file: !6, line: 134, baseType: !156, size: 32, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !145, file: !6, line: 142, baseType: !158, size: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !85, !85}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !145, file: !6, line: 151, baseType: !162, size: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !85, !165, !1192, !1473, !88, !1609}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !61, line: 115, size: 11392, elements: !167)
!167 = !{!168, !234, !238, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !255, !265, !279, !280, !321, !322, !325, !326, !342, !343, !344, !345, !346, !347, !348, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !367, !368, !369, !370, !371, !372, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !464, !465, !466, !467, !468, !469, !470, !471, !472, !838, !1180, !1181, !1182, !1183, !1184, !1185, !1188, !1191, !1575, !1576, !1580, !1581, !1582, !1583, !1584, !1585, !1587, !1590, !1593, !1594, !1597, !1598}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !61, line: 116, baseType: !169, size: 960)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !170, line: 130, baseType: !171)
!170 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !170, line: 117, size: 960, elements: !172)
!172 = !{!173, !175, !176, !178, !197, !201, !202, !203, !204, !205}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !170, line: 118, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !170, line: 118, baseType: !174, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !171, file: !170, line: 119, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !171, file: !170, line: 120, baseType: !179, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !170, line: 136, size: 17600, elements: !181)
!181 = !{!182, !183, !185, !188, !192, !193, !194}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !180, file: !170, line: 137, baseType: !169, size: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !180, file: !170, line: 138, baseType: !184, size: 64, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !180, file: !170, line: 139, baseType: !186, size: 64, offset: 1024)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !170, line: 43, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !170, line: 140, baseType: !189, size: 8192, offset: 1088)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8192, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 1024)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !180, file: !170, line: 141, baseType: !189, size: 8192, offset: 9280)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !180, file: !170, line: 148, baseType: !179, size: 64, offset: 17472)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !180, file: !170, line: 150, baseType: !195, size: 64, offset: 17536)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !170, line: 45, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !170, line: 121, baseType: !198, size: 528, offset: 256)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 528, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 66)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !170, line: 126, baseType: !115, size: 16, offset: 784)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !171, file: !170, line: 127, baseType: !88, size: 32, offset: 800)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !171, file: !170, line: 128, baseType: !88, size: 32, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !171, file: !170, line: 128, baseType: !88, size: 32, offset: 864)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !171, file: !170, line: 129, baseType: !206, size: 64, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !170, line: 75, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !170, line: 62, size: 1024, elements: !209)
!209 = !{!210, !212, !213, !214, !215, !216, !217, !218, !232, !233}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !170, line: 63, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !208, file: !170, line: 63, baseType: !211, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !170, line: 64, baseType: !94, size: 8, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !208, file: !170, line: 64, baseType: !94, size: 8, offset: 136)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !208, file: !170, line: 65, baseType: !115, size: 16, offset: 144)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !170, line: 66, baseType: !93, size: 512, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !208, file: !170, line: 67, baseType: !88, size: 32, offset: 672)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !170, line: 69, baseType: !219, size: 256, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !170, line: 60, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !170, line: 48, size: 256, elements: !221)
!221 = !{!222, !223, !230, !231}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !220, file: !170, line: 49, baseType: !174, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !220, file: !170, line: 58, baseType: !224, size: 128, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !225, line: 71, baseType: !226)
!225 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !225, line: 69, size: 128, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !226, file: !225, line: 70, baseType: !174, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !226, file: !225, line: 70, baseType: !174, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !220, file: !170, line: 59, baseType: !88, size: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !220, file: !170, line: 59, baseType: !88, size: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !208, file: !170, line: 70, baseType: !88, size: 32, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !208, file: !170, line: 74, baseType: !88, size: 32, offset: 992)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !166, file: !61, line: 117, baseType: !235, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !237, line: 45, flags: DIFlagFwdDecl)
!237 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !166, file: !61, line: 119, baseType: !239, size: 64, offset: 1024)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !61, line: 57, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !166, file: !61, line: 121, baseType: !115, size: 16, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !166, file: !61, line: 121, baseType: !115, size: 16, offset: 1104)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !166, file: !61, line: 122, baseType: !88, size: 32, offset: 1120)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !166, file: !61, line: 122, baseType: !88, size: 32, offset: 1152)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !166, file: !61, line: 122, baseType: !88, size: 32, offset: 1184)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !166, file: !61, line: 123, baseType: !93, size: 512, offset: 1216)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !166, file: !61, line: 124, baseType: !165, size: 64, offset: 1728)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !166, file: !61, line: 124, baseType: !165, size: 64, offset: 1792)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !166, file: !61, line: 127, baseType: !165, size: 64, offset: 1856)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !166, file: !61, line: 127, baseType: !165, size: 64, offset: 1920)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !166, file: !61, line: 127, baseType: !165, size: 64, offset: 1984)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !166, file: !61, line: 128, baseType: !253, size: 64, offset: 2048)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !237, line: 46, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !166, file: !61, line: 130, baseType: !256, size: 64, offset: 2112)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !61, line: 97, size: 832, elements: !258)
!258 = !{!259, !263, !264}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !257, file: !61, line: 98, baseType: !260, size: 768)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 768, elements: !261)
!261 = !{!262, !112}
!262 = !DISubrange(count: 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !257, file: !61, line: 99, baseType: !88, size: 32, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !257, file: !61, line: 99, baseType: !88, size: 32, offset: 800)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !166, file: !61, line: 131, baseType: !266, size: 64, offset: 2176)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !268, line: 486, size: 1600, elements: !269)
!268 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !267, file: !268, line: 487, baseType: !169, size: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !267, file: !268, line: 489, baseType: !224, size: 128, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !267, file: !268, line: 490, baseType: !224, size: 128, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !267, file: !268, line: 491, baseType: !224, size: 128, offset: 1216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !267, file: !268, line: 492, baseType: !224, size: 128, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !268, line: 494, baseType: !88, size: 32, offset: 1472)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !267, file: !268, line: 495, baseType: !88, size: 32, offset: 1504)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !267, file: !268, line: 497, baseType: !88, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !267, file: !268, line: 498, baseType: !88, size: 32, offset: 1568)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !166, file: !61, line: 132, baseType: !266, size: 64, offset: 2240)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !166, file: !61, line: 133, baseType: !281, size: 64, offset: 2304)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !268, line: 334, size: 1728, elements: !283)
!283 = !{!284, !285, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !320}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !282, file: !268, line: 335, baseType: !224, size: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !282, file: !268, line: 336, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !268, line: 47, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !282, file: !268, line: 338, baseType: !115, size: 16, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !282, file: !268, line: 338, baseType: !115, size: 16, offset: 208)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !282, file: !268, line: 339, baseType: !7, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !282, file: !268, line: 340, baseType: !88, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !282, file: !268, line: 342, baseType: !110, size: 32, offset: 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !282, file: !268, line: 343, baseType: !109, size: 96, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !282, file: !268, line: 344, baseType: !109, size: 96, offset: 416)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !282, file: !268, line: 347, baseType: !224, size: 128, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !282, file: !268, line: 349, baseType: !88, size: 32, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !282, file: !268, line: 350, baseType: !88, size: 32, offset: 672)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !282, file: !268, line: 351, baseType: !174, size: 64, offset: 704)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !282, file: !268, line: 352, baseType: !174, size: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !282, file: !268, line: 354, baseType: !301, size: 384, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !268, line: 116, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !268, line: 94, size: 384, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !302, file: !268, line: 96, baseType: !88, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !302, file: !268, line: 96, baseType: !88, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !302, file: !268, line: 97, baseType: !88, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !302, file: !268, line: 97, baseType: !88, size: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !302, file: !268, line: 99, baseType: !115, size: 16, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !302, file: !268, line: 100, baseType: !115, size: 16, offset: 144)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !302, file: !268, line: 102, baseType: !115, size: 16, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !302, file: !268, line: 105, baseType: !115, size: 16, offset: 176)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !302, file: !268, line: 108, baseType: !115, size: 16, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !302, file: !268, line: 109, baseType: !115, size: 16, offset: 208)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !302, file: !268, line: 111, baseType: !115, size: 16, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !302, file: !268, line: 112, baseType: !115, size: 16, offset: 240)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !302, file: !268, line: 114, baseType: !88, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !302, file: !268, line: 114, baseType: !88, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !302, file: !268, line: 115, baseType: !88, size: 32, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !302, file: !268, line: 115, baseType: !88, size: 32, offset: 352)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !282, file: !268, line: 355, baseType: !93, size: 512, offset: 1216)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !61, line: 134, baseType: !174, size: 64, offset: 2368)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !166, file: !61, line: 136, baseType: !323, size: 64, offset: 2432)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !61, line: 58, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !166, file: !61, line: 138, baseType: !301, size: 384, offset: 2496)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !166, file: !61, line: 139, baseType: !327, size: 64, offset: 2880)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !268, line: 80, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !268, line: 72, size: 192, elements: !330)
!330 = !{!331, !338, !339, !340, !341}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !329, file: !268, line: 73, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !268, line: 59, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !268, line: 56, size: 128, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !334, file: !268, line: 57, baseType: !109, size: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !334, file: !268, line: 58, baseType: !88, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !329, file: !268, line: 74, baseType: !88, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !329, file: !268, line: 76, baseType: !88, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !329, file: !268, line: 77, baseType: !88, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !329, file: !268, line: 79, baseType: !88, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !166, file: !61, line: 141, baseType: !224, size: 128, offset: 2944)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !166, file: !61, line: 142, baseType: !224, size: 128, offset: 3072)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !166, file: !61, line: 143, baseType: !224, size: 128, offset: 3200)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !166, file: !61, line: 144, baseType: !224, size: 128, offset: 3328)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !166, file: !61, line: 146, baseType: !88, size: 32, offset: 3456)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !166, file: !61, line: 147, baseType: !88, size: 32, offset: 3488)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !166, file: !61, line: 150, baseType: !349, size: 64, offset: 3520)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !61, line: 50, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !166, file: !61, line: 151, baseType: !102, size: 64, offset: 3584)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !166, file: !61, line: 152, baseType: !88, size: 32, offset: 3648)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !166, file: !61, line: 153, baseType: !88, size: 32, offset: 3680)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !166, file: !61, line: 156, baseType: !109, size: 96, offset: 3712)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !166, file: !61, line: 156, baseType: !109, size: 96, offset: 3808)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !166, file: !61, line: 156, baseType: !109, size: 96, offset: 3904)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !166, file: !61, line: 157, baseType: !109, size: 96, offset: 4000)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !166, file: !61, line: 158, baseType: !109, size: 96, offset: 4096)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !166, file: !61, line: 159, baseType: !109, size: 96, offset: 4192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !166, file: !61, line: 160, baseType: !109, size: 96, offset: 4288)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !166, file: !61, line: 160, baseType: !109, size: 96, offset: 4384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !166, file: !61, line: 161, baseType: !364, size: 128, offset: 4480)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 4)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !166, file: !61, line: 161, baseType: !364, size: 128, offset: 4608)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !166, file: !61, line: 162, baseType: !109, size: 96, offset: 4736)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !166, file: !61, line: 162, baseType: !109, size: 96, offset: 4832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !166, file: !61, line: 163, baseType: !110, size: 32, offset: 4928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !166, file: !61, line: 163, baseType: !110, size: 32, offset: 4960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !166, file: !61, line: 164, baseType: !373, size: 512, offset: 4992)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 512, elements: !374)
!374 = !{!366, !366}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !166, file: !61, line: 165, baseType: !373, size: 512, offset: 5504)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !166, file: !61, line: 166, baseType: !373, size: 512, offset: 6016)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !166, file: !61, line: 167, baseType: !373, size: 512, offset: 6528)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !166, file: !61, line: 176, baseType: !373, size: 512, offset: 7040)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !166, file: !61, line: 178, baseType: !7, size: 32, offset: 7552)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !61, line: 180, baseType: !115, size: 16, offset: 7584)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !166, file: !61, line: 181, baseType: !115, size: 16, offset: 7600)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !166, file: !61, line: 183, baseType: !115, size: 16, offset: 7616)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !166, file: !61, line: 183, baseType: !115, size: 16, offset: 7632)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !166, file: !61, line: 184, baseType: !115, size: 16, offset: 7648)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !166, file: !61, line: 184, baseType: !115, size: 16, offset: 7664)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !166, file: !61, line: 185, baseType: !115, size: 16, offset: 7680)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !166, file: !61, line: 186, baseType: !115, size: 16, offset: 7696)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !166, file: !61, line: 187, baseType: !115, size: 16, offset: 7712)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !166, file: !61, line: 188, baseType: !94, size: 8, offset: 7728)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !166, file: !61, line: 189, baseType: !94, size: 8, offset: 7736)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !166, file: !61, line: 192, baseType: !88, size: 32, offset: 7744)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !166, file: !61, line: 192, baseType: !88, size: 32, offset: 7776)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !166, file: !61, line: 192, baseType: !88, size: 32, offset: 7808)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !166, file: !61, line: 192, baseType: !88, size: 32, offset: 7840)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !166, file: !61, line: 194, baseType: !88, size: 32, offset: 7872)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !166, file: !61, line: 202, baseType: !110, size: 32, offset: 7904)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !166, file: !61, line: 202, baseType: !110, size: 32, offset: 7936)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !166, file: !61, line: 202, baseType: !110, size: 32, offset: 7968)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !166, file: !61, line: 211, baseType: !110, size: 32, offset: 8000)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !166, file: !61, line: 212, baseType: !110, size: 32, offset: 8032)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !166, file: !61, line: 213, baseType: !110, size: 32, offset: 8064)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !166, file: !61, line: 214, baseType: !110, size: 32, offset: 8096)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !166, file: !61, line: 215, baseType: !110, size: 32, offset: 8128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !166, file: !61, line: 216, baseType: !110, size: 32, offset: 8160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !166, file: !61, line: 219, baseType: !110, size: 32, offset: 8192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !166, file: !61, line: 220, baseType: !110, size: 32, offset: 8224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !166, file: !61, line: 221, baseType: !110, size: 32, offset: 8256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !166, file: !61, line: 224, baseType: !409, size: 16, offset: 8288)
!409 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !166, file: !61, line: 224, baseType: !409, size: 16, offset: 8304)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !166, file: !61, line: 226, baseType: !115, size: 16, offset: 8320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !166, file: !61, line: 228, baseType: !94, size: 8, offset: 8336)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !166, file: !61, line: 229, baseType: !94, size: 8, offset: 8344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !166, file: !61, line: 231, baseType: !115, size: 16, offset: 8352)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !166, file: !61, line: 232, baseType: !94, size: 8, offset: 8368)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !166, file: !61, line: 233, baseType: !94, size: 8, offset: 8376)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !166, file: !61, line: 234, baseType: !110, size: 32, offset: 8384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !166, file: !61, line: 235, baseType: !110, size: 32, offset: 8416)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !166, file: !61, line: 237, baseType: !224, size: 128, offset: 8448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !166, file: !61, line: 238, baseType: !224, size: 128, offset: 8576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !166, file: !61, line: 239, baseType: !224, size: 128, offset: 8704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !166, file: !61, line: 240, baseType: !224, size: 128, offset: 8832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !166, file: !61, line: 242, baseType: !110, size: 32, offset: 8960)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !166, file: !61, line: 244, baseType: !115, size: 16, offset: 8992)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !166, file: !61, line: 245, baseType: !409, size: 16, offset: 9008)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !166, file: !61, line: 246, baseType: !364, size: 128, offset: 9024)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !166, file: !61, line: 248, baseType: !88, size: 32, offset: 9152)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !166, file: !61, line: 249, baseType: !88, size: 32, offset: 9184)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !166, file: !61, line: 251, baseType: !430, size: 64, offset: 9216)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !432, line: 215, size: 960, elements: !433)
!432 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !431, file: !432, line: 216, baseType: !88, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !431, file: !432, line: 217, baseType: !110, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !431, file: !432, line: 218, baseType: !110, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !431, file: !432, line: 219, baseType: !110, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !431, file: !432, line: 221, baseType: !88, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !431, file: !432, line: 222, baseType: !88, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !431, file: !432, line: 223, baseType: !88, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !431, file: !432, line: 224, baseType: !88, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !431, file: !432, line: 226, baseType: !110, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !431, file: !432, line: 227, baseType: !110, size: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !431, file: !432, line: 228, baseType: !110, size: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !431, file: !432, line: 229, baseType: !110, size: 32, offset: 352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !431, file: !432, line: 231, baseType: !110, size: 32, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !431, file: !432, line: 232, baseType: !110, size: 32, offset: 416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !431, file: !432, line: 233, baseType: !110, size: 32, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !431, file: !432, line: 234, baseType: !110, size: 32, offset: 480)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !431, file: !432, line: 236, baseType: !110, size: 32, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !431, file: !432, line: 237, baseType: !110, size: 32, offset: 544)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !431, file: !432, line: 238, baseType: !110, size: 32, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !431, file: !432, line: 239, baseType: !110, size: 32, offset: 608)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !431, file: !432, line: 241, baseType: !110, size: 32, offset: 640)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !431, file: !432, line: 242, baseType: !110, size: 32, offset: 672)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !431, file: !432, line: 243, baseType: !110, size: 32, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !431, file: !432, line: 244, baseType: !110, size: 32, offset: 736)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !431, file: !432, line: 246, baseType: !110, size: 32, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !431, file: !432, line: 247, baseType: !110, size: 32, offset: 800)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !431, file: !432, line: 248, baseType: !88, size: 32, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !431, file: !432, line: 249, baseType: !88, size: 32, offset: 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !431, file: !432, line: 250, baseType: !110, size: 32, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !431, file: !432, line: 251, baseType: !110, size: 32, offset: 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !166, file: !61, line: 253, baseType: !94, size: 8, offset: 9280)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !166, file: !61, line: 254, baseType: !94, size: 8, offset: 9288)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !166, file: !61, line: 255, baseType: !115, size: 16, offset: 9296)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !166, file: !61, line: 256, baseType: !109, size: 96, offset: 9312)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !166, file: !61, line: 258, baseType: !224, size: 128, offset: 9408)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !166, file: !61, line: 259, baseType: !224, size: 128, offset: 9536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !166, file: !61, line: 260, baseType: !224, size: 128, offset: 9664)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !166, file: !61, line: 261, baseType: !224, size: 128, offset: 9792)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !166, file: !61, line: 263, baseType: !473, size: 64, offset: 9920)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !432, line: 61, size: 1280, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !832, !835, !836, !837}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !432, line: 62, baseType: !88, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !474, file: !432, line: 63, baseType: !115, size: 16, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !474, file: !432, line: 64, baseType: !115, size: 16, offset: 48)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !474, file: !432, line: 65, baseType: !115, size: 16, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !474, file: !432, line: 66, baseType: !115, size: 16, offset: 80)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !474, file: !432, line: 67, baseType: !115, size: 16, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !474, file: !432, line: 68, baseType: !115, size: 16, offset: 112)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !474, file: !432, line: 68, baseType: !115, size: 16, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !474, file: !432, line: 69, baseType: !115, size: 16, offset: 144)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !474, file: !432, line: 72, baseType: !110, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !474, file: !432, line: 73, baseType: !110, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !474, file: !432, line: 74, baseType: !110, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !474, file: !432, line: 77, baseType: !110, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !474, file: !432, line: 80, baseType: !110, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !474, file: !432, line: 81, baseType: !110, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !474, file: !432, line: 82, baseType: !110, size: 32, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !474, file: !432, line: 83, baseType: !110, size: 32, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !474, file: !432, line: 84, baseType: !110, size: 32, offset: 416)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !474, file: !432, line: 85, baseType: !110, size: 32, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !474, file: !432, line: 88, baseType: !110, size: 32, offset: 480)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !474, file: !432, line: 89, baseType: !110, size: 32, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !474, file: !432, line: 90, baseType: !110, size: 32, offset: 544)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !474, file: !432, line: 91, baseType: !110, size: 32, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !474, file: !432, line: 92, baseType: !110, size: 32, offset: 608)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !474, file: !432, line: 93, baseType: !110, size: 32, offset: 640)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !474, file: !432, line: 95, baseType: !110, size: 32, offset: 672)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !474, file: !432, line: 98, baseType: !110, size: 32, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !474, file: !432, line: 99, baseType: !110, size: 32, offset: 736)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !474, file: !432, line: 100, baseType: !110, size: 32, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !474, file: !432, line: 103, baseType: !110, size: 32, offset: 800)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !474, file: !432, line: 103, baseType: !110, size: 32, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !474, file: !432, line: 104, baseType: !110, size: 32, offset: 864)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !474, file: !432, line: 104, baseType: !110, size: 32, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !474, file: !432, line: 104, baseType: !110, size: 32, offset: 928)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !474, file: !432, line: 104, baseType: !110, size: 32, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !474, file: !432, line: 107, baseType: !110, size: 32, offset: 992)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !474, file: !432, line: 108, baseType: !513, size: 64, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !237, line: 202, size: 3328, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !584, !587, !588, !671, !695, !723, !724, !801, !822, !830, !831}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !514, file: !237, line: 203, baseType: !169, size: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !514, file: !237, line: 204, baseType: !235, size: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !514, file: !237, line: 206, baseType: !110, size: 32, offset: 1024)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !514, file: !237, line: 206, baseType: !110, size: 32, offset: 1056)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !514, file: !237, line: 207, baseType: !110, size: 32, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !514, file: !237, line: 207, baseType: !110, size: 32, offset: 1120)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !514, file: !237, line: 207, baseType: !110, size: 32, offset: 1152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !514, file: !237, line: 207, baseType: !110, size: 32, offset: 1184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !514, file: !237, line: 207, baseType: !110, size: 32, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !514, file: !237, line: 207, baseType: !110, size: 32, offset: 1248)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !514, file: !237, line: 208, baseType: !110, size: 32, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !514, file: !237, line: 208, baseType: !110, size: 32, offset: 1312)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !514, file: !237, line: 211, baseType: !110, size: 32, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !514, file: !237, line: 211, baseType: !110, size: 32, offset: 1376)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !514, file: !237, line: 211, baseType: !110, size: 32, offset: 1408)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !514, file: !237, line: 211, baseType: !110, size: 32, offset: 1440)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !514, file: !237, line: 211, baseType: !110, size: 32, offset: 1472)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !514, file: !237, line: 214, baseType: !110, size: 32, offset: 1504)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !514, file: !237, line: 214, baseType: !110, size: 32, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !514, file: !237, line: 217, baseType: !110, size: 32, offset: 1568)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !514, file: !237, line: 218, baseType: !110, size: 32, offset: 1600)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !514, file: !237, line: 219, baseType: !110, size: 32, offset: 1632)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !514, file: !237, line: 220, baseType: !110, size: 32, offset: 1664)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !514, file: !237, line: 221, baseType: !110, size: 32, offset: 1696)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !514, file: !237, line: 222, baseType: !115, size: 16, offset: 1728)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !514, file: !237, line: 222, baseType: !115, size: 16, offset: 1744)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !514, file: !237, line: 224, baseType: !115, size: 16, offset: 1760)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !514, file: !237, line: 224, baseType: !115, size: 16, offset: 1776)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !514, file: !237, line: 227, baseType: !115, size: 16, offset: 1792)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !514, file: !237, line: 227, baseType: !115, size: 16, offset: 1808)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !514, file: !237, line: 229, baseType: !115, size: 16, offset: 1824)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !237, line: 229, baseType: !115, size: 16, offset: 1840)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !237, line: 230, baseType: !115, size: 16, offset: 1856)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !514, file: !237, line: 230, baseType: !115, size: 16, offset: 1872)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !514, file: !237, line: 232, baseType: !110, size: 32, offset: 1888)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !514, file: !237, line: 232, baseType: !110, size: 32, offset: 1920)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !514, file: !237, line: 232, baseType: !110, size: 32, offset: 1952)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !514, file: !237, line: 232, baseType: !110, size: 32, offset: 1984)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !514, file: !237, line: 233, baseType: !88, size: 32, offset: 2016)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !514, file: !237, line: 234, baseType: !88, size: 32, offset: 2048)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !514, file: !237, line: 235, baseType: !115, size: 16, offset: 2080)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !514, file: !237, line: 235, baseType: !115, size: 16, offset: 2096)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !514, file: !237, line: 236, baseType: !115, size: 16, offset: 2112)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !514, file: !237, line: 239, baseType: !115, size: 16, offset: 2128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !514, file: !237, line: 240, baseType: !88, size: 32, offset: 2144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !514, file: !237, line: 241, baseType: !88, size: 32, offset: 2176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !514, file: !237, line: 241, baseType: !88, size: 32, offset: 2208)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !514, file: !237, line: 241, baseType: !88, size: 32, offset: 2240)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !514, file: !237, line: 243, baseType: !110, size: 32, offset: 2272)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !514, file: !237, line: 243, baseType: !110, size: 32, offset: 2304)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !514, file: !237, line: 244, baseType: !110, size: 32, offset: 2336)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !514, file: !237, line: 246, baseType: !568, size: 320, offset: 2368)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !100, line: 50, size: 320, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !568, file: !100, line: 51, baseType: !98, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !568, file: !100, line: 53, baseType: !88, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !568, file: !100, line: 54, baseType: !88, size: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !568, file: !100, line: 55, baseType: !88, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !568, file: !100, line: 55, baseType: !88, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !568, file: !100, line: 56, baseType: !94, size: 8, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !568, file: !100, line: 56, baseType: !94, size: 8, offset: 200)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !568, file: !100, line: 57, baseType: !94, size: 8, offset: 208)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !568, file: !100, line: 57, baseType: !94, size: 8, offset: 216)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !568, file: !100, line: 59, baseType: !115, size: 16, offset: 224)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !568, file: !100, line: 59, baseType: !115, size: 16, offset: 240)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !568, file: !100, line: 59, baseType: !115, size: 16, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !100, line: 61, baseType: !115, size: 16, offset: 272)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !568, file: !100, line: 63, baseType: !88, size: 32, offset: 288)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !514, file: !237, line: 248, baseType: !585, size: 64, offset: 2688)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !237, line: 248, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !514, file: !237, line: 249, baseType: !253, size: 64, offset: 2752)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !514, file: !237, line: 250, baseType: !589, size: 64, offset: 2816)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !100, line: 77, size: 15424, elements: !591)
!591 = !{!592, !593, !594, !597, !600, !603, !606, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !625, !626, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !660, !661, !665}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !590, file: !100, line: 78, baseType: !169, size: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !590, file: !100, line: 80, baseType: !189, size: 8192, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !590, file: !100, line: 82, baseType: !595, size: 64, offset: 9152)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !100, line: 43, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !590, file: !100, line: 83, baseType: !598, size: 64, offset: 9216)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !170, line: 46, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !590, file: !100, line: 86, baseType: !601, size: 64, offset: 9280)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !100, line: 41, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !590, file: !100, line: 87, baseType: !604, size: 64, offset: 9344)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !100, line: 44, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !590, file: !100, line: 89, baseType: !607, size: 512, offset: 9408)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 512, elements: !608)
!608 = !{!262}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !590, file: !100, line: 90, baseType: !115, size: 16, offset: 9920)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !590, file: !100, line: 90, baseType: !115, size: 16, offset: 9936)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !590, file: !100, line: 92, baseType: !115, size: 16, offset: 9952)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !100, line: 92, baseType: !115, size: 16, offset: 9968)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !590, file: !100, line: 93, baseType: !115, size: 16, offset: 9984)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !590, file: !100, line: 93, baseType: !115, size: 16, offset: 10000)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !590, file: !100, line: 94, baseType: !88, size: 32, offset: 10016)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !590, file: !100, line: 97, baseType: !115, size: 16, offset: 10048)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !590, file: !100, line: 97, baseType: !115, size: 16, offset: 10064)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !590, file: !100, line: 98, baseType: !115, size: 16, offset: 10080)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !590, file: !100, line: 98, baseType: !115, size: 16, offset: 10096)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !590, file: !100, line: 99, baseType: !115, size: 16, offset: 10112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !590, file: !100, line: 99, baseType: !115, size: 16, offset: 10128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !590, file: !100, line: 100, baseType: !7, size: 32, offset: 10144)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !590, file: !100, line: 101, baseType: !624, size: 64, offset: 10176)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !590, file: !100, line: 103, baseType: !195, size: 64, offset: 10240)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !590, file: !100, line: 104, baseType: !627, size: 64, offset: 10304)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !170, line: 159, size: 448, elements: !629)
!629 = !{!630, !634, !635, !637, !638, !640}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !628, file: !170, line: 161, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 2)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !628, file: !170, line: 162, baseType: !631, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !628, file: !170, line: 163, baseType: !636, size: 32, offset: 128)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 32, elements: !632)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !628, file: !170, line: 164, baseType: !636, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !628, file: !170, line: 165, baseType: !639, size: 128, offset: 192)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 128, elements: !632)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !628, file: !170, line: 166, baseType: !641, size: 128, offset: 320)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 128, elements: !632)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !590, file: !100, line: 107, baseType: !110, size: 32, offset: 10368)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !590, file: !100, line: 108, baseType: !88, size: 32, offset: 10400)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !590, file: !100, line: 109, baseType: !115, size: 16, offset: 10432)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !590, file: !100, line: 110, baseType: !115, size: 16, offset: 10448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !590, file: !100, line: 113, baseType: !88, size: 32, offset: 10464)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !590, file: !100, line: 113, baseType: !88, size: 32, offset: 10496)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !590, file: !100, line: 114, baseType: !94, size: 8, offset: 10528)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !590, file: !100, line: 114, baseType: !94, size: 8, offset: 10536)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !590, file: !100, line: 115, baseType: !115, size: 16, offset: 10544)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !590, file: !100, line: 116, baseType: !364, size: 128, offset: 10560)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !590, file: !100, line: 119, baseType: !110, size: 32, offset: 10688)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !590, file: !100, line: 119, baseType: !110, size: 32, offset: 10720)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !590, file: !100, line: 122, baseType: !655, size: 512, offset: 10752)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !656, line: 182, baseType: !657)
!656 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !656, line: 180, size: 512, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !656, line: 181, baseType: !93, size: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !590, file: !100, line: 123, baseType: !94, size: 8, offset: 11264)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !590, file: !100, line: 125, baseType: !662, size: 56, offset: 11272)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 56, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 7)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !590, file: !100, line: 126, baseType: !666, size: 4096, offset: 11328)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 4096, elements: !608)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !100, line: 69, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !100, line: 67, size: 512, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !668, file: !100, line: 68, baseType: !93, size: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !514, file: !237, line: 251, baseType: !672, size: 64, offset: 2880)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !237, line: 113, size: 6208, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !684}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !673, file: !237, line: 114, baseType: !115, size: 16)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !673, file: !237, line: 114, baseType: !115, size: 16, offset: 16)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !673, file: !237, line: 115, baseType: !94, size: 8, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !673, file: !237, line: 115, baseType: !94, size: 8, offset: 40)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !673, file: !237, line: 116, baseType: !94, size: 8, offset: 48)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !673, file: !237, line: 117, baseType: !681, size: 8, offset: 56)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 1)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !673, file: !237, line: 119, baseType: !685, size: 6144, offset: 64)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 6144, elements: !149)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !237, line: 109, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !237, line: 106, size: 192, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !687, file: !237, line: 107, baseType: !110, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !687, file: !237, line: 107, baseType: !110, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !687, file: !237, line: 107, baseType: !110, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !687, file: !237, line: 107, baseType: !110, size: 32, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !687, file: !237, line: 107, baseType: !110, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !687, file: !237, line: 108, baseType: !88, size: 32, offset: 160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !514, file: !237, line: 252, baseType: !696, size: 64, offset: 2944)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !237, line: 122, size: 1600, elements: !698)
!698 = !{!699, !700, !701, !707, !708, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !697, file: !237, line: 123, baseType: !165, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !697, file: !237, line: 124, baseType: !589, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !697, file: !237, line: 125, baseType: !702, size: 384, offset: 128)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 384, elements: !705)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !656, line: 136, flags: DIFlagFwdDecl)
!705 = !{!706}
!706 = !DISubrange(count: 6)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !697, file: !237, line: 126, baseType: !373, size: 512, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !697, file: !237, line: 127, baseType: !709, size: 288, offset: 1024)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 288, elements: !710)
!710 = !{!112, !112}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !697, file: !237, line: 128, baseType: !115, size: 16, offset: 1312)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !697, file: !237, line: 128, baseType: !115, size: 16, offset: 1328)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !697, file: !237, line: 129, baseType: !110, size: 32, offset: 1344)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !697, file: !237, line: 129, baseType: !110, size: 32, offset: 1376)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !697, file: !237, line: 130, baseType: !110, size: 32, offset: 1408)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !697, file: !237, line: 131, baseType: !7, size: 32, offset: 1440)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !697, file: !237, line: 132, baseType: !115, size: 16, offset: 1472)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !697, file: !237, line: 132, baseType: !115, size: 16, offset: 1488)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !697, file: !237, line: 133, baseType: !88, size: 32, offset: 1504)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !697, file: !237, line: 133, baseType: !88, size: 32, offset: 1536)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !697, file: !237, line: 134, baseType: !115, size: 16, offset: 1568)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !697, file: !237, line: 134, baseType: !115, size: 16, offset: 1584)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !514, file: !237, line: 253, baseType: !627, size: 64, offset: 3008)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !514, file: !237, line: 254, baseType: !725, size: 64, offset: 3072)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !237, line: 137, size: 832, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !726, file: !237, line: 138, baseType: !115, size: 16)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !726, file: !237, line: 140, baseType: !115, size: 16, offset: 16)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !726, file: !237, line: 141, baseType: !110, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !726, file: !237, line: 142, baseType: !110, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !726, file: !237, line: 143, baseType: !115, size: 16, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !726, file: !237, line: 144, baseType: !115, size: 16, offset: 112)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !726, file: !237, line: 145, baseType: !88, size: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !726, file: !237, line: 147, baseType: !88, size: 32, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !726, file: !237, line: 149, baseType: !165, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !726, file: !237, line: 150, baseType: !88, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !726, file: !237, line: 151, baseType: !115, size: 16, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !726, file: !237, line: 152, baseType: !115, size: 16, offset: 304)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !726, file: !237, line: 154, baseType: !174, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !726, file: !237, line: 155, baseType: !742, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !726, file: !237, line: 157, baseType: !110, size: 32, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !726, file: !237, line: 158, baseType: !115, size: 16, offset: 480)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !726, file: !237, line: 159, baseType: !115, size: 16, offset: 496)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !726, file: !237, line: 160, baseType: !115, size: 16, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !726, file: !237, line: 161, baseType: !114, size: 48, offset: 528)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !726, file: !237, line: 162, baseType: !110, size: 32, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !726, file: !237, line: 164, baseType: !110, size: 32, offset: 608)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !726, file: !237, line: 164, baseType: !110, size: 32, offset: 640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !726, file: !237, line: 164, baseType: !110, size: 32, offset: 672)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !726, file: !237, line: 165, baseType: !672, size: 64, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !726, file: !237, line: 167, baseType: !754, size: 64, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !656, line: 72, size: 3072, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !770, !771, !797, !798, !799, !800}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !755, file: !656, line: 73, baseType: !88, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !755, file: !656, line: 73, baseType: !88, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !755, file: !656, line: 74, baseType: !88, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !755, file: !656, line: 75, baseType: !88, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !755, file: !656, line: 77, baseType: !762, size: 128, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !763, line: 95, baseType: !764)
!763 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !763, line: 92, size: 128, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !764, file: !763, line: 93, baseType: !110, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !764, file: !763, line: 93, baseType: !110, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !764, file: !763, line: 94, baseType: !110, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !764, file: !763, line: 94, baseType: !110, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !755, file: !656, line: 77, baseType: !762, size: 128, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !755, file: !656, line: 79, baseType: !772, size: 2304, offset: 384)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 2304, elements: !365)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !656, line: 67, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !656, line: 55, size: 576, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !783, !784, !793, !794, !795, !796}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !774, file: !656, line: 56, baseType: !115, size: 16)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !774, file: !656, line: 56, baseType: !115, size: 16, offset: 16)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !774, file: !656, line: 58, baseType: !110, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !774, file: !656, line: 59, baseType: !110, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !774, file: !656, line: 59, baseType: !110, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !774, file: !656, line: 60, baseType: !782, size: 64, offset: 128)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !632)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !774, file: !656, line: 60, baseType: !782, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !774, file: !656, line: 61, baseType: !785, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !656, line: 47, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !656, line: 44, size: 96, elements: !788)
!788 = !{!789, !790, !791, !792}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !787, file: !656, line: 45, baseType: !110, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !787, file: !656, line: 45, baseType: !110, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !787, file: !656, line: 46, baseType: !115, size: 16, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !787, file: !656, line: 46, baseType: !115, size: 16, offset: 80)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !774, file: !656, line: 62, baseType: !785, size: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !774, file: !656, line: 64, baseType: !785, size: 64, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !774, file: !656, line: 65, baseType: !782, size: 64, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !774, file: !656, line: 66, baseType: !782, size: 64, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !755, file: !656, line: 80, baseType: !109, size: 96, offset: 2688)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !755, file: !656, line: 80, baseType: !109, size: 96, offset: 2784)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !755, file: !656, line: 81, baseType: !109, size: 96, offset: 2880)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !755, file: !656, line: 83, baseType: !109, size: 96, offset: 2976)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !514, file: !237, line: 255, baseType: !802, size: 64, offset: 3136)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !237, line: 170, size: 8704, elements: !804)
!804 = !{!805, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !803, file: !237, line: 171, baseType: !806, size: 96)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 96, elements: !111)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !803, file: !237, line: 172, baseType: !88, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !803, file: !237, line: 173, baseType: !115, size: 16, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !803, file: !237, line: 174, baseType: !115, size: 16, offset: 144)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !803, file: !237, line: 175, baseType: !115, size: 16, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !803, file: !237, line: 176, baseType: !115, size: 16, offset: 176)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !803, file: !237, line: 177, baseType: !115, size: 16, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !803, file: !237, line: 178, baseType: !115, size: 16, offset: 208)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !803, file: !237, line: 179, baseType: !88, size: 32, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !803, file: !237, line: 181, baseType: !165, size: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !803, file: !237, line: 182, baseType: !110, size: 32, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !803, file: !237, line: 183, baseType: !88, size: 32, offset: 352)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !803, file: !237, line: 184, baseType: !189, size: 8192, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !803, file: !237, line: 187, baseType: !742, size: 64, offset: 8576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !803, file: !237, line: 188, baseType: !88, size: 32, offset: 8640)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !803, file: !237, line: 189, baseType: !88, size: 32, offset: 8672)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !514, file: !237, line: 256, baseType: !823, size: 64, offset: 3200)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OceanTex", file: !237, line: 193, size: 640, elements: !825)
!825 = !{!826, !827, !828, !829}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !824, file: !237, line: 194, baseType: !165, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "oceanmod", scope: !824, file: !237, line: 195, baseType: !93, size: 512, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !824, file: !237, line: 197, baseType: !88, size: 32, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !824, file: !237, line: 198, baseType: !88, size: 32, offset: 608)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !514, file: !237, line: 258, baseType: !94, size: 8, offset: 3264)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !514, file: !237, line: 259, baseType: !662, size: 56, offset: 3272)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rng", scope: !474, file: !432, line: 111, baseType: !833, size: 64, offset: 1088)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "RNG", file: !432, line: 111, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "f_noise", scope: !474, file: !432, line: 112, baseType: !110, size: 32, offset: 1152)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !474, file: !432, line: 113, baseType: !88, size: 32, offset: 1184)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "f_source", scope: !474, file: !432, line: 115, baseType: !165, size: 64, offset: 1216)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !166, file: !61, line: 264, baseType: !839, size: 64, offset: 9984)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !432, line: 268, size: 3776, elements: !841)
!841 = !{!842, !843, !844, !847, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !899, !900, !901, !1160, !1161, !1176, !1177, !1178, !1179}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !840, file: !432, line: 270, baseType: !88, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "totspring", scope: !840, file: !432, line: 270, baseType: !88, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bpoint", scope: !840, file: !432, line: 271, baseType: !845, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodyPoint", file: !432, line: 271, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bspring", scope: !840, file: !432, line: 272, baseType: !848, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodySpring", file: !432, line: 272, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !840, file: !432, line: 273, baseType: !94, size: 8, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "msg_lock", scope: !840, file: !432, line: 274, baseType: !94, size: 8, offset: 200)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "msg_value", scope: !840, file: !432, line: 275, baseType: !115, size: 16, offset: 208)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "nodemass", scope: !840, file: !432, line: 280, baseType: !110, size: 32, offset: 224)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Mass", scope: !840, file: !432, line: 281, baseType: !93, size: 512, offset: 256)
