; ModuleID = 'blender/source/blender/editors/space_image/image_edit.c'
source_filename = "blender/source/blender/editors/space_image/image_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.Image = type { %struct.ID, [1024 x i8], %struct.MovieCache*, %struct.GPUTexture*, %struct.anim*, %struct.RenderResult*, [8 x %struct.RenderResult*], i16, i16, i16, i16, i16, i16, i32, i16, i16, i16, i16, i16, i16, i32, i32*, %struct.PackedFile*, %struct.PreviewImage*, float, i32, i16, i16, i32, i32, i8, i8, i16, [4 x float], float, float, %struct.ColorManagedColorspaceSettings, i8, [7 x i8], [8 x %struct.RenderSlot] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.MovieCache = type opaque
%struct.GPUTexture = type opaque

!39 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !25, line: 131, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!44 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!45 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!46 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !25, line: 123, baseType: !5, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54}
!49 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!50 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!51 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!52 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!53 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!54 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 182, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !11, line: 666, baseType: !5, size: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71}
!64 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!70 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!71 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BrushFlags", file: !73, line: 187, baseType: !74, size: 32, elements: !75)
!73 = !DIFile(filename: "blender/source/blender/makesdna/DNA_brush_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!76 = !DIEnumerator(name: "BRUSH_AIRBRUSH", value: 1)
!77 = !DIEnumerator(name: "BRUSH_TORUS", value: 2)
!78 = !DIEnumerator(name: "BRUSH_ALPHA_PRESSURE", value: 4)
!79 = !DIEnumerator(name: "BRUSH_SIZE_PRESSURE", value: 8)
!80 = !DIEnumerator(name: "BRUSH_JITTER_PRESSURE", value: 16)
!81 = !DIEnumerator(name: "BRUSH_SPACING_PRESSURE", value: 32)
!82 = !DIEnumerator(name: "BRUSH_UNUSED", value: 64)
!83 = !DIEnumerator(name: "BRUSH_RAKE", value: 128)
!84 = !DIEnumerator(name: "BRUSH_ANCHORED", value: 256)
!85 = !DIEnumerator(name: "BRUSH_DIR_IN", value: 512)
!86 = !DIEnumerator(name: "BRUSH_SPACE", value: 1024)
!87 = !DIEnumerator(name: "BRUSH_SMOOTH_STROKE", value: 2048)
!88 = !DIEnumerator(name: "BRUSH_PERSISTENT", value: 4096)
!89 = !DIEnumerator(name: "BRUSH_ACCUMULATE", value: 8192)
!90 = !DIEnumerator(name: "BRUSH_LOCK_ALPHA", value: 16384)
!91 = !DIEnumerator(name: "BRUSH_ORIGINAL_NORMAL", value: 32768)
!92 = !DIEnumerator(name: "BRUSH_OFFSET_PRESSURE", value: 65536)
!93 = !DIEnumerator(name: "BRUSH_SPACE_ATTEN", value: 262144)
!94 = !DIEnumerator(name: "BRUSH_ADAPTIVE_SPACE", value: 524288)
!95 = !DIEnumerator(name: "BRUSH_LOCK_SIZE", value: 1048576)
!96 = !DIEnumerator(name: "BRUSH_USE_GRADIENT", value: 2097152)
!97 = !DIEnumerator(name: "BRUSH_EDGE_TO_EDGE", value: 4194304)
!98 = !DIEnumerator(name: "BRUSH_DRAG_DOT", value: 8388608)
!99 = !DIEnumerator(name: "BRUSH_INVERSE_SMOOTH_PRESSURE", value: 16777216)
!100 = !DIEnumerator(name: "BRUSH_RANDOM_ROTATION", value: 33554432)
!101 = !DIEnumerator(name: "BRUSH_PLANE_TRIM", value: 67108864)
!102 = !DIEnumerator(name: "BRUSH_FRONTFACE", value: 134217728)
!103 = !DIEnumerator(name: "BRUSH_CUSTOM_ICON", value: 268435456)
!104 = !DIEnumerator(name: "BRUSH_LINE", value: 536870912)
!105 = !DIEnumerator(name: "BRUSH_ABSOLUTE_JITTER", value: 1073741824)
!106 = !DIEnumerator(name: "BRUSH_CURVE", value: -2147483648)
!107 = !{!108, !109, !178}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !111, line: 130, baseType: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !111, line: 117, size: 960, elements: !113)
!113 = !{!114, !115, !116, !118, !137, !141, !143, !144, !145, !146}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !111, line: 118, baseType: !108, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !112, file: !111, line: 118, baseType: !108, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !112, file: !111, line: 119, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !112, file: !111, line: 120, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !111, line: 136, size: 17600, elements: !121)
!121 = !{!122, !123, !124, !127, !132, !133, !134}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !120, file: !111, line: 137, baseType: !110, size: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !120, file: !111, line: 138, baseType: !109, size: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !120, file: !111, line: 139, baseType: !125, size: 64, offset: 1024)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !111, line: 43, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !111, line: 140, baseType: !128, size: 8192, offset: 1088)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 8192, elements: !130)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !{!131}
!131 = !DISubrange(count: 1024)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !120, file: !111, line: 141, baseType: !128, size: 8192, offset: 9280)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !120, file: !111, line: 148, baseType: !119, size: 64, offset: 17472)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !120, file: !111, line: 150, baseType: !135, size: 64, offset: 17536)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !111, line: 45, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !111, line: 121, baseType: !138, size: 528, offset: 256)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 528, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 66)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !112, file: !111, line: 126, baseType: !142, size: 16, offset: 784)
!142 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !112, file: !111, line: 127, baseType: !74, size: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !112, file: !111, line: 128, baseType: !74, size: 32, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !112, file: !111, line: 128, baseType: !74, size: 32, offset: 864)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !112, file: !111, line: 129, baseType: !147, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !111, line: 75, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !111, line: 62, size: 1024, elements: !150)
!150 = !{!151, !153, !154, !155, !156, !157, !161, !162, !176, !177}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !111, line: 63, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !111, line: 63, baseType: !152, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !111, line: 64, baseType: !129, size: 8, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !149, file: !111, line: 64, baseType: !129, size: 8, offset: 136)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !149, file: !111, line: 65, baseType: !142, size: 16, offset: 144)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !111, line: 66, baseType: !158, size: 512, offset: 160)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 512, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !149, file: !111, line: 67, baseType: !74, size: 32, offset: 672)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !111, line: 69, baseType: !163, size: 256, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !111, line: 60, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !111, line: 48, size: 256, elements: !165)
!165 = !{!166, !167, !174, !175}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !164, file: !111, line: 49, baseType: !108, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !164, file: !111, line: 58, baseType: !168, size: 128, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !169, line: 71, baseType: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !169, line: 69, size: 128, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !170, file: !169, line: 70, baseType: !108, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !170, file: !169, line: 70, baseType: !108, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !164, file: !111, line: 59, baseType: !74, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !164, file: !111, line: 59, baseType: !74, size: 32, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !149, file: !111, line: 70, baseType: !74, size: 32, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !149, file: !111, line: 74, baseType: !74, size: 32, offset: 992)
!178 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!179 = !{i32 7, !"Dwarf Version", i32 4}
!180 = !{i32 2, !"Debug Info Version", i32 3}
!181 = !{i32 1, !"wchar_size", i32 4}
!182 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!183 = distinct !DISubprogram(name: "ED_space_image", scope: !1, file: !1, line: 57, type: !184, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2153)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !273}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !188, line: 77, size: 15424, elements: !189)
!188 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!189 = !{!190, !191, !192, !195, !198, !201, !204, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !224, !225, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !254, !255, !256, !262, !263, !267}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !187, file: !188, line: 78, baseType: !110, size: 960)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !188, line: 80, baseType: !128, size: 8192, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !187, file: !188, line: 82, baseType: !193, size: 64, offset: 9152)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !188, line: 43, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !187, file: !188, line: 83, baseType: !196, size: 64, offset: 9216)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !111, line: 46, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !187, file: !188, line: 86, baseType: !199, size: 64, offset: 9280)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !188, line: 41, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !187, file: !188, line: 87, baseType: !202, size: 64, offset: 9344)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !188, line: 44, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !187, file: !188, line: 89, baseType: !205, size: 512, offset: 9408)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 512, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 8)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !187, file: !188, line: 90, baseType: !142, size: 16, offset: 9920)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !187, file: !188, line: 90, baseType: !142, size: 16, offset: 9936)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !187, file: !188, line: 92, baseType: !142, size: 16, offset: 9952)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !187, file: !188, line: 92, baseType: !142, size: 16, offset: 9968)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !187, file: !188, line: 93, baseType: !142, size: 16, offset: 9984)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !187, file: !188, line: 93, baseType: !142, size: 16, offset: 10000)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !187, file: !188, line: 94, baseType: !74, size: 32, offset: 10016)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !187, file: !188, line: 97, baseType: !142, size: 16, offset: 10048)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !187, file: !188, line: 97, baseType: !142, size: 16, offset: 10064)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !187, file: !188, line: 98, baseType: !142, size: 16, offset: 10080)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !187, file: !188, line: 98, baseType: !142, size: 16, offset: 10096)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !187, file: !188, line: 99, baseType: !142, size: 16, offset: 10112)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !187, file: !188, line: 99, baseType: !142, size: 16, offset: 10128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !187, file: !188, line: 100, baseType: !5, size: 32, offset: 10144)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !187, file: !188, line: 101, baseType: !223, size: 64, offset: 10176)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !187, file: !188, line: 103, baseType: !135, size: 64, offset: 10240)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !187, file: !188, line: 104, baseType: !226, size: 64, offset: 10304)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !111, line: 159, size: 448, elements: !228)
!228 = !{!229, !233, !234, !236, !237, !239}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !227, file: !111, line: 161, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 2)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !227, file: !111, line: 162, baseType: !230, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !227, file: !111, line: 163, baseType: !235, size: 32, offset: 128)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 32, elements: !231)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !227, file: !111, line: 164, baseType: !235, size: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !227, file: !111, line: 165, baseType: !238, size: 128, offset: 192)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 128, elements: !231)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !227, file: !111, line: 166, baseType: !240, size: 128, offset: 320)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 128, elements: !231)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !187, file: !188, line: 107, baseType: !178, size: 32, offset: 10368)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !187, file: !188, line: 108, baseType: !74, size: 32, offset: 10400)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !187, file: !188, line: 109, baseType: !142, size: 16, offset: 10432)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !187, file: !188, line: 110, baseType: !142, size: 16, offset: 10448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !187, file: !188, line: 113, baseType: !74, size: 32, offset: 10464)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !187, file: !188, line: 113, baseType: !74, size: 32, offset: 10496)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !187, file: !188, line: 114, baseType: !129, size: 8, offset: 10528)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !187, file: !188, line: 114, baseType: !129, size: 8, offset: 10536)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !187, file: !188, line: 115, baseType: !142, size: 16, offset: 10544)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !187, file: !188, line: 116, baseType: !251, size: 128, offset: 10560)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 128, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 4)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !187, file: !188, line: 119, baseType: !178, size: 32, offset: 10688)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !187, file: !188, line: 119, baseType: !178, size: 32, offset: 10720)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !187, file: !188, line: 122, baseType: !257, size: 512, offset: 10752)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !258, line: 182, baseType: !259)
!258 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !258, line: 180, size: 512, elements: !260)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !259, file: !258, line: 181, baseType: !158, size: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !187, file: !188, line: 123, baseType: !129, size: 8, offset: 11264)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !187, file: !188, line: 125, baseType: !264, size: 56, offset: 11272)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 56, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 7)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !187, file: !188, line: 126, baseType: !268, size: 4096, offset: 11328)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 4096, elements: !206)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !188, line: 69, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !188, line: 67, size: 512, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !270, file: !188, line: 68, baseType: !158, size: 512)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceImage", file: !4, line: 743, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceImage", file: !4, line: 710, size: 84672, elements: !276)
!276 = !{!277, !290, !291, !292, !293, !294, !295, !2085, !2086, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !4, line: 711, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !281)
!281 = !{!282, !284, !285, !286, !287, !288}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !4, line: 86, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !280, file: !4, line: 86, baseType: !283, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !280, file: !4, line: 87, baseType: !168, size: 128, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !280, file: !4, line: 88, baseType: !74, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !280, file: !4, line: 89, baseType: !178, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !280, file: !4, line: 90, baseType: !289, size: 128, offset: 320)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, elements: !206)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !275, file: !4, line: 711, baseType: !278, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !275, file: !4, line: 712, baseType: !168, size: 128, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !275, file: !4, line: 713, baseType: !74, size: 32, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !4, line: 715, baseType: !74, size: 32, offset: 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !275, file: !4, line: 717, baseType: !186, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !275, file: !4, line: 718, baseType: !296, size: 320, offset: 384)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !188, line: 50, size: 320, elements: !297)
!297 = !{!298, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !296, file: !188, line: 51, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !301, line: 1216, size: 39680, elements: !302)
!301 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!302 = !{!303, !304, !308, !576, !579, !580, !581, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !607, !681, !1039, !1705, !1708, !1948, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1970, !1971, !1972, !1973, !1974, !1982, !2048, !2055, !2056, !2063, !2064, !2065, !2066, !2067, !2068, !2069}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !300, file: !301, line: 1217, baseType: !110, size: 960)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !300, file: !301, line: 1218, baseType: !305, size: 64, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !307, line: 45, flags: DIFlagFwdDecl)
!307 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!308 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !300, file: !301, line: 1220, baseType: !309, size: 64, offset: 1024)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !11, line: 115, size: 11392, elements: !311)
!311 = !{!312, !313, !314, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !331, !341, !355, !356, !400, !401, !404, !405, !421, !422, !423, !424, !425, !426, !427, !431, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !509, !510, !511, !512, !513, !514, !515, !516, !517, !520, !523, !526, !527, !528, !529, !530, !533, !536, !539, !540, !546, !547, !548, !549, !550, !551, !553, !556, !559, !561, !564, !565}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !310, file: !11, line: 116, baseType: !110, size: 960)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !310, file: !11, line: 117, baseType: !305, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !310, file: !11, line: 119, baseType: !315, size: 64, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !11, line: 57, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !11, line: 121, baseType: !142, size: 16, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !310, file: !11, line: 121, baseType: !142, size: 16, offset: 1104)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !310, file: !11, line: 122, baseType: !74, size: 32, offset: 1120)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !310, file: !11, line: 122, baseType: !74, size: 32, offset: 1152)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !310, file: !11, line: 122, baseType: !74, size: 32, offset: 1184)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !310, file: !11, line: 123, baseType: !158, size: 512, offset: 1216)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !310, file: !11, line: 124, baseType: !309, size: 64, offset: 1728)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !310, file: !11, line: 124, baseType: !309, size: 64, offset: 1792)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !310, file: !11, line: 127, baseType: !309, size: 64, offset: 1856)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !310, file: !11, line: 127, baseType: !309, size: 64, offset: 1920)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !310, file: !11, line: 127, baseType: !309, size: 64, offset: 1984)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !310, file: !11, line: 128, baseType: !329, size: 64, offset: 2048)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !307, line: 46, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !310, file: !11, line: 130, baseType: !332, size: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !11, line: 97, size: 832, elements: !334)
!334 = !{!335, !339, !340}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !333, file: !11, line: 98, baseType: !336, size: 768)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 768, elements: !337)
!337 = !{!207, !338}
!338 = !DISubrange(count: 3)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !11, line: 99, baseType: !74, size: 32, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !333, file: !11, line: 99, baseType: !74, size: 32, offset: 800)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !310, file: !11, line: 131, baseType: !342, size: 64, offset: 2176)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !344, line: 486, size: 1600, elements: !345)
!344 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !343, file: !344, line: 487, baseType: !110, size: 960)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !343, file: !344, line: 489, baseType: !168, size: 128, offset: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !343, file: !344, line: 490, baseType: !168, size: 128, offset: 1088)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !343, file: !344, line: 491, baseType: !168, size: 128, offset: 1216)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !343, file: !344, line: 492, baseType: !168, size: 128, offset: 1344)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !343, file: !344, line: 494, baseType: !74, size: 32, offset: 1472)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !343, file: !344, line: 495, baseType: !74, size: 32, offset: 1504)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !343, file: !344, line: 497, baseType: !74, size: 32, offset: 1536)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !343, file: !344, line: 498, baseType: !74, size: 32, offset: 1568)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !310, file: !11, line: 132, baseType: !342, size: 64, offset: 2240)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !310, file: !11, line: 133, baseType: !357, size: 64, offset: 2304)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !344, line: 334, size: 1728, elements: !359)
!359 = !{!360, !361, !365, !366, !367, !368, !369, !370, !373, !374, !375, !376, !377, !378, !379, !399}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !358, file: !344, line: 335, baseType: !168, size: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !358, file: !344, line: 336, baseType: !362, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !364, line: 51, flags: DIFlagFwdDecl)
!364 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !358, file: !344, line: 338, baseType: !142, size: 16, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !358, file: !344, line: 338, baseType: !142, size: 16, offset: 208)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !358, file: !344, line: 339, baseType: !5, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !358, file: !344, line: 340, baseType: !74, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !358, file: !344, line: 342, baseType: !178, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !358, file: !344, line: 343, baseType: !371, size: 96, offset: 320)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 96, elements: !372)
!372 = !{!338}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !358, file: !344, line: 344, baseType: !371, size: 96, offset: 416)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !358, file: !344, line: 347, baseType: !168, size: 128, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !358, file: !344, line: 349, baseType: !74, size: 32, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !358, file: !344, line: 350, baseType: !74, size: 32, offset: 672)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !358, file: !344, line: 351, baseType: !108, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !358, file: !344, line: 352, baseType: !108, size: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !358, file: !344, line: 354, baseType: !380, size: 384, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !344, line: 116, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !344, line: 94, size: 384, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !381, file: !344, line: 96, baseType: !74, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !381, file: !344, line: 96, baseType: !74, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !381, file: !344, line: 97, baseType: !74, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !381, file: !344, line: 97, baseType: !74, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !381, file: !344, line: 99, baseType: !142, size: 16, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !381, file: !344, line: 100, baseType: !142, size: 16, offset: 144)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !381, file: !344, line: 102, baseType: !142, size: 16, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !381, file: !344, line: 105, baseType: !142, size: 16, offset: 176)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !381, file: !344, line: 108, baseType: !142, size: 16, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !381, file: !344, line: 109, baseType: !142, size: 16, offset: 208)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !381, file: !344, line: 111, baseType: !142, size: 16, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !381, file: !344, line: 112, baseType: !142, size: 16, offset: 240)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !381, file: !344, line: 114, baseType: !74, size: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !381, file: !344, line: 114, baseType: !74, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !381, file: !344, line: 115, baseType: !74, size: 32, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !381, file: !344, line: 115, baseType: !74, size: 32, offset: 352)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !358, file: !344, line: 355, baseType: !158, size: 512, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !11, line: 134, baseType: !108, size: 64, offset: 2368)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !310, file: !11, line: 136, baseType: !402, size: 64, offset: 2432)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !11, line: 58, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !310, file: !11, line: 138, baseType: !380, size: 384, offset: 2496)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !310, file: !11, line: 139, baseType: !406, size: 64, offset: 2880)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !344, line: 80, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !344, line: 72, size: 192, elements: !409)
!409 = !{!410, !417, !418, !419, !420}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !408, file: !344, line: 73, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !344, line: 59, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !344, line: 56, size: 128, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !413, file: !344, line: 57, baseType: !371, size: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !413, file: !344, line: 58, baseType: !74, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !408, file: !344, line: 74, baseType: !74, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !408, file: !344, line: 76, baseType: !74, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !408, file: !344, line: 77, baseType: !74, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !408, file: !344, line: 79, baseType: !74, size: 32, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !310, file: !11, line: 141, baseType: !168, size: 128, offset: 2944)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !310, file: !11, line: 142, baseType: !168, size: 128, offset: 3072)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !310, file: !11, line: 143, baseType: !168, size: 128, offset: 3200)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !310, file: !11, line: 144, baseType: !168, size: 128, offset: 3328)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !310, file: !11, line: 146, baseType: !74, size: 32, offset: 3456)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !310, file: !11, line: 147, baseType: !74, size: 32, offset: 3488)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !310, file: !11, line: 150, baseType: !428, size: 64, offset: 3520)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !364, line: 46, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !310, file: !11, line: 151, baseType: !432, size: 64, offset: 3584)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !310, file: !11, line: 152, baseType: !74, size: 32, offset: 3648)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !310, file: !11, line: 153, baseType: !74, size: 32, offset: 3680)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !310, file: !11, line: 156, baseType: !371, size: 96, offset: 3712)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !310, file: !11, line: 156, baseType: !371, size: 96, offset: 3808)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !310, file: !11, line: 156, baseType: !371, size: 96, offset: 3904)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !310, file: !11, line: 157, baseType: !371, size: 96, offset: 4000)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !310, file: !11, line: 158, baseType: !371, size: 96, offset: 4096)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !310, file: !11, line: 159, baseType: !371, size: 96, offset: 4192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !310, file: !11, line: 160, baseType: !371, size: 96, offset: 4288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !310, file: !11, line: 160, baseType: !371, size: 96, offset: 4384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !310, file: !11, line: 161, baseType: !251, size: 128, offset: 4480)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !310, file: !11, line: 161, baseType: !251, size: 128, offset: 4608)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !310, file: !11, line: 162, baseType: !371, size: 96, offset: 4736)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !310, file: !11, line: 162, baseType: !371, size: 96, offset: 4832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !310, file: !11, line: 163, baseType: !178, size: 32, offset: 4928)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !310, file: !11, line: 163, baseType: !178, size: 32, offset: 4960)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !310, file: !11, line: 164, baseType: !450, size: 512, offset: 4992)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 512, elements: !451)
!451 = !{!253, !253}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !310, file: !11, line: 165, baseType: !450, size: 512, offset: 5504)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !310, file: !11, line: 166, baseType: !450, size: 512, offset: 6016)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !310, file: !11, line: 167, baseType: !450, size: 512, offset: 6528)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !310, file: !11, line: 176, baseType: !450, size: 512, offset: 7040)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !310, file: !11, line: 178, baseType: !5, size: 32, offset: 7552)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !310, file: !11, line: 180, baseType: !142, size: 16, offset: 7584)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !310, file: !11, line: 181, baseType: !142, size: 16, offset: 7600)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !310, file: !11, line: 183, baseType: !142, size: 16, offset: 7616)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !310, file: !11, line: 183, baseType: !142, size: 16, offset: 7632)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !310, file: !11, line: 184, baseType: !142, size: 16, offset: 7648)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !310, file: !11, line: 184, baseType: !142, size: 16, offset: 7664)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !310, file: !11, line: 185, baseType: !142, size: 16, offset: 7680)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !310, file: !11, line: 186, baseType: !142, size: 16, offset: 7696)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !310, file: !11, line: 187, baseType: !142, size: 16, offset: 7712)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !310, file: !11, line: 188, baseType: !129, size: 8, offset: 7728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !310, file: !11, line: 189, baseType: !129, size: 8, offset: 7736)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !310, file: !11, line: 192, baseType: !74, size: 32, offset: 7744)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !310, file: !11, line: 192, baseType: !74, size: 32, offset: 7776)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !310, file: !11, line: 192, baseType: !74, size: 32, offset: 7808)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !310, file: !11, line: 192, baseType: !74, size: 32, offset: 7840)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !310, file: !11, line: 194, baseType: !74, size: 32, offset: 7872)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !310, file: !11, line: 202, baseType: !178, size: 32, offset: 7904)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !310, file: !11, line: 202, baseType: !178, size: 32, offset: 7936)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !310, file: !11, line: 202, baseType: !178, size: 32, offset: 7968)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !310, file: !11, line: 211, baseType: !178, size: 32, offset: 8000)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !310, file: !11, line: 212, baseType: !178, size: 32, offset: 8032)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !310, file: !11, line: 213, baseType: !178, size: 32, offset: 8064)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !310, file: !11, line: 214, baseType: !178, size: 32, offset: 8096)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !310, file: !11, line: 215, baseType: !178, size: 32, offset: 8128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !310, file: !11, line: 216, baseType: !178, size: 32, offset: 8160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !310, file: !11, line: 219, baseType: !178, size: 32, offset: 8192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !310, file: !11, line: 220, baseType: !178, size: 32, offset: 8224)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !310, file: !11, line: 221, baseType: !178, size: 32, offset: 8256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !310, file: !11, line: 224, baseType: !486, size: 16, offset: 8288)
!486 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !310, file: !11, line: 224, baseType: !486, size: 16, offset: 8304)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !310, file: !11, line: 226, baseType: !142, size: 16, offset: 8320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !310, file: !11, line: 228, baseType: !129, size: 8, offset: 8336)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !310, file: !11, line: 229, baseType: !129, size: 8, offset: 8344)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !310, file: !11, line: 231, baseType: !142, size: 16, offset: 8352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !310, file: !11, line: 232, baseType: !129, size: 8, offset: 8368)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !310, file: !11, line: 233, baseType: !129, size: 8, offset: 8376)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !310, file: !11, line: 234, baseType: !178, size: 32, offset: 8384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !310, file: !11, line: 235, baseType: !178, size: 32, offset: 8416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !310, file: !11, line: 237, baseType: !168, size: 128, offset: 8448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !310, file: !11, line: 238, baseType: !168, size: 128, offset: 8576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !310, file: !11, line: 239, baseType: !168, size: 128, offset: 8704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !310, file: !11, line: 240, baseType: !168, size: 128, offset: 8832)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !310, file: !11, line: 242, baseType: !178, size: 32, offset: 8960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !310, file: !11, line: 244, baseType: !142, size: 16, offset: 8992)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !310, file: !11, line: 245, baseType: !486, size: 16, offset: 9008)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !310, file: !11, line: 246, baseType: !251, size: 128, offset: 9024)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !310, file: !11, line: 248, baseType: !74, size: 32, offset: 9152)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !310, file: !11, line: 249, baseType: !74, size: 32, offset: 9184)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !310, file: !11, line: 251, baseType: !507, size: 64, offset: 9216)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !11, line: 251, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !310, file: !11, line: 253, baseType: !129, size: 8, offset: 9280)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !310, file: !11, line: 254, baseType: !129, size: 8, offset: 9288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !310, file: !11, line: 255, baseType: !142, size: 16, offset: 9296)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !310, file: !11, line: 256, baseType: !371, size: 96, offset: 9312)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !310, file: !11, line: 258, baseType: !168, size: 128, offset: 9408)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !310, file: !11, line: 259, baseType: !168, size: 128, offset: 9536)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !310, file: !11, line: 260, baseType: !168, size: 128, offset: 9664)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !310, file: !11, line: 261, baseType: !168, size: 128, offset: 9792)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !310, file: !11, line: 263, baseType: !518, size: 64, offset: 9920)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !11, line: 52, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !310, file: !11, line: 264, baseType: !521, size: 64, offset: 9984)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !11, line: 53, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !310, file: !11, line: 265, baseType: !524, size: 64, offset: 10048)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !344, line: 46, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !310, file: !11, line: 267, baseType: !129, size: 8, offset: 10112)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !310, file: !11, line: 268, baseType: !129, size: 8, offset: 10120)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !310, file: !11, line: 269, baseType: !142, size: 16, offset: 10128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !310, file: !11, line: 270, baseType: !178, size: 32, offset: 10144)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !310, file: !11, line: 272, baseType: !531, size: 64, offset: 10176)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !11, line: 54, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !310, file: !11, line: 275, baseType: !534, size: 64, offset: 10240)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !11, line: 275, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !310, file: !11, line: 277, baseType: !537, size: 64, offset: 10304)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !11, line: 56, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !310, file: !11, line: 277, baseType: !537, size: 64, offset: 10368)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !310, file: !11, line: 278, baseType: !541, size: 64, offset: 10432)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !542, line: 27, baseType: !543)
!542 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !544, line: 45, baseType: !545)
!544 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!545 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !310, file: !11, line: 279, baseType: !541, size: 64, offset: 10496)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !310, file: !11, line: 280, baseType: !5, size: 32, offset: 10560)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !310, file: !11, line: 281, baseType: !5, size: 32, offset: 10592)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !310, file: !11, line: 283, baseType: !168, size: 128, offset: 10624)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !310, file: !11, line: 284, baseType: !168, size: 128, offset: 10752)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !310, file: !11, line: 285, baseType: !552, size: 64, offset: 10880)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !310, file: !11, line: 287, baseType: !554, size: 64, offset: 10944)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !11, line: 59, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !310, file: !11, line: 288, baseType: !557, size: 64, offset: 11008)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !11, line: 288, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !310, file: !11, line: 290, baseType: !560, size: 64, offset: 11072)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 64, elements: !231)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !310, file: !11, line: 291, baseType: !562, size: 64, offset: 11136)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !188, line: 65, baseType: !296)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !310, file: !11, line: 293, baseType: !168, size: 128, offset: 11200)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !310, file: !11, line: 294, baseType: !566, size: 64, offset: 11328)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !11, line: 113, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !11, line: 108, size: 256, elements: !569)
!569 = !{!570, !572, !573, !574, !575}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !568, file: !11, line: 109, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !568, file: !11, line: 109, baseType: !571, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !568, file: !11, line: 110, baseType: !309, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !568, file: !11, line: 111, baseType: !74, size: 32, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !568, file: !11, line: 112, baseType: !178, size: 32, offset: 224)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !300, file: !301, line: 1221, baseType: !577, size: 64, offset: 1088)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !301, line: 52, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 1223, baseType: !299, size: 64, offset: 1152)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !300, file: !301, line: 1225, baseType: !168, size: 128, offset: 1216)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !300, file: !301, line: 1226, baseType: !582, size: 64, offset: 1344)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !301, line: 69, size: 320, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !583, file: !301, line: 70, baseType: !582, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !583, file: !301, line: 70, baseType: !582, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !583, file: !301, line: 71, baseType: !5, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !583, file: !301, line: 71, baseType: !5, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !583, file: !301, line: 72, baseType: !74, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !583, file: !301, line: 73, baseType: !142, size: 16, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !583, file: !301, line: 73, baseType: !142, size: 16, offset: 240)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !583, file: !301, line: 74, baseType: !309, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !300, file: !301, line: 1227, baseType: !309, size: 64, offset: 1408)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !300, file: !301, line: 1229, baseType: !371, size: 96, offset: 1472)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !300, file: !301, line: 1230, baseType: !371, size: 96, offset: 1568)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !300, file: !301, line: 1231, baseType: !371, size: 96, offset: 1664)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !300, file: !301, line: 1231, baseType: !371, size: 96, offset: 1760)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !300, file: !301, line: 1233, baseType: !5, size: 32, offset: 1856)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !300, file: !301, line: 1234, baseType: !74, size: 32, offset: 1888)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !300, file: !301, line: 1235, baseType: !5, size: 32, offset: 1920)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !300, file: !301, line: 1237, baseType: !142, size: 16, offset: 1952)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !300, file: !301, line: 1239, baseType: !129, size: 8, offset: 1968)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !300, file: !301, line: 1240, baseType: !604, size: 8, offset: 1976)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 8, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 1)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !300, file: !301, line: 1242, baseType: !608, size: 64, offset: 1984)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !610, line: 328, size: 3456, elements: !611)
!610 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!611 = !{!612, !613, !614, !617, !618, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !647, !648, !649, !652, !657, !658, !661, !665, !669, !673, !677, !678, !679, !680}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !609, file: !610, line: 329, baseType: !110, size: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !609, file: !610, line: 330, baseType: !305, size: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !609, file: !610, line: 332, baseType: !615, size: 64, offset: 1024)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !610, line: 332, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !609, file: !610, line: 333, baseType: !158, size: 512, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !609, file: !610, line: 335, baseType: !619, size: 64, offset: 1600)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !621, line: 41, flags: DIFlagFwdDecl)
!621 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !609, file: !610, line: 337, baseType: !402, size: 64, offset: 1664)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !609, file: !610, line: 338, baseType: !560, size: 64, offset: 1728)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !609, file: !610, line: 340, baseType: !168, size: 128, offset: 1792)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !609, file: !610, line: 340, baseType: !168, size: 128, offset: 1920)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !609, file: !610, line: 342, baseType: !74, size: 32, offset: 2048)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !609, file: !610, line: 342, baseType: !74, size: 32, offset: 2080)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !609, file: !610, line: 343, baseType: !74, size: 32, offset: 2112)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !609, file: !610, line: 345, baseType: !74, size: 32, offset: 2144)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !609, file: !610, line: 346, baseType: !74, size: 32, offset: 2176)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !609, file: !610, line: 347, baseType: !142, size: 16, offset: 2208)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !609, file: !610, line: 348, baseType: !142, size: 16, offset: 2224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !609, file: !610, line: 349, baseType: !74, size: 32, offset: 2240)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !609, file: !610, line: 351, baseType: !74, size: 32, offset: 2272)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !609, file: !610, line: 353, baseType: !142, size: 16, offset: 2304)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !609, file: !610, line: 354, baseType: !142, size: 16, offset: 2320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !609, file: !610, line: 355, baseType: !74, size: 32, offset: 2336)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !609, file: !610, line: 357, baseType: !639, size: 128, offset: 2368)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !640, line: 95, baseType: !641)
!640 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !640, line: 92, size: 128, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !641, file: !640, line: 93, baseType: !178, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !641, file: !640, line: 93, baseType: !178, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !641, file: !640, line: 94, baseType: !178, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !641, file: !640, line: 94, baseType: !178, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !609, file: !610, line: 363, baseType: !168, size: 128, offset: 2496)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !609, file: !610, line: 363, baseType: !168, size: 128, offset: 2624)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !609, file: !610, line: 368, baseType: !650, size: 64, offset: 2752)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !610, line: 48, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !609, file: !610, line: 372, baseType: !653, size: 32, offset: 2816)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !610, line: 274, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !610, line: 271, size: 32, elements: !655)
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !654, file: !610, line: 273, baseType: !5, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !609, file: !610, line: 373, baseType: !74, size: 32, offset: 2848)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !609, file: !610, line: 382, baseType: !659, size: 64, offset: 2880)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !610, line: 46, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !609, file: !610, line: 385, baseType: !662, size: 64, offset: 2944)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !108, !178}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !609, file: !610, line: 386, baseType: !666, size: 64, offset: 3008)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !108, !432}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !609, file: !610, line: 387, baseType: !670, size: 64, offset: 3072)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!74, !108}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !609, file: !610, line: 388, baseType: !674, size: 64, offset: 3136)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !108}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !609, file: !610, line: 389, baseType: !108, size: 64, offset: 3200)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !609, file: !610, line: 389, baseType: !108, size: 64, offset: 3264)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !609, file: !610, line: 389, baseType: !108, size: 64, offset: 3328)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !609, file: !610, line: 389, baseType: !108, size: 64, offset: 3392)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !300, file: !301, line: 1244, baseType: !682, size: 64, offset: 2048)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !684, line: 200, size: 17024, elements: !685)
!684 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!685 = !{!686, !687, !688, !689, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !683, file: !684, line: 201, baseType: !552, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !683, file: !684, line: 202, baseType: !168, size: 128, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !683, file: !684, line: 203, baseType: !168, size: 128, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !683, file: !684, line: 206, baseType: !690, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !684, line: 190, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !684, line: 126, size: 2816, elements: !693)
!693 = !{!694, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !785, !786, !787, !788, !993, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1031}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !692, file: !684, line: 127, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !692, file: !684, line: 127, baseType: !695, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !692, file: !684, line: 128, baseType: !108, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !692, file: !684, line: 129, baseType: !108, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !692, file: !684, line: 130, baseType: !158, size: 512, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !692, file: !684, line: 132, baseType: !74, size: 32, offset: 768)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !692, file: !684, line: 132, baseType: !74, size: 32, offset: 800)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !692, file: !684, line: 133, baseType: !74, size: 32, offset: 832)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !692, file: !684, line: 134, baseType: !74, size: 32, offset: 864)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !692, file: !684, line: 134, baseType: !74, size: 32, offset: 896)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !692, file: !684, line: 134, baseType: !74, size: 32, offset: 928)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !692, file: !684, line: 135, baseType: !74, size: 32, offset: 960)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !692, file: !684, line: 135, baseType: !74, size: 32, offset: 992)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !692, file: !684, line: 136, baseType: !74, size: 32, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !692, file: !684, line: 136, baseType: !74, size: 32, offset: 1056)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !692, file: !684, line: 137, baseType: !74, size: 32, offset: 1088)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !692, file: !684, line: 137, baseType: !74, size: 32, offset: 1120)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !692, file: !684, line: 138, baseType: !178, size: 32, offset: 1152)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !692, file: !684, line: 139, baseType: !178, size: 32, offset: 1184)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !692, file: !684, line: 139, baseType: !178, size: 32, offset: 1216)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !692, file: !684, line: 141, baseType: !142, size: 16, offset: 1248)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !692, file: !684, line: 142, baseType: !142, size: 16, offset: 1264)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !692, file: !684, line: 143, baseType: !74, size: 32, offset: 1280)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !692, file: !684, line: 144, baseType: !74, size: 32, offset: 1312)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !692, file: !684, line: 146, baseType: !720, size: 64, offset: 1344)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !684, line: 114, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !684, line: 99, size: 7232, elements: !723)
!723 = !{!724, !726, !727, !728, !729, !730, !731, !742, !746, !758, !767, !774, !784}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !722, file: !684, line: 100, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !722, file: !684, line: 100, baseType: !725, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !722, file: !684, line: 101, baseType: !74, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !722, file: !684, line: 101, baseType: !74, size: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !722, file: !684, line: 102, baseType: !74, size: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !722, file: !684, line: 102, baseType: !74, size: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !722, file: !684, line: 103, baseType: !732, size: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !684, line: 59, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !684, line: 56, size: 2112, elements: !735)
!735 = !{!736, !740, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !684, line: 57, baseType: !737, size: 2048)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 2048, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !734, file: !684, line: 58, baseType: !74, size: 32, offset: 2048)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !734, file: !684, line: 58, baseType: !74, size: 32, offset: 2080)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !722, file: !684, line: 106, baseType: !743, size: 6144, offset: 320)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 6144, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 768)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !722, file: !684, line: 107, baseType: !747, size: 64, offset: 6464)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !684, line: 97, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !684, line: 83, size: 8320, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !749, file: !684, line: 84, baseType: !743, size: 6144)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !749, file: !684, line: 87, baseType: !737, size: 2048, offset: 6144)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !749, file: !684, line: 88, baseType: !199, size: 64, offset: 8192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !749, file: !684, line: 90, baseType: !142, size: 16, offset: 8256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !749, file: !684, line: 92, baseType: !142, size: 16, offset: 8272)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !749, file: !684, line: 93, baseType: !142, size: 16, offset: 8288)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !749, file: !684, line: 95, baseType: !142, size: 16, offset: 8304)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !722, file: !684, line: 108, baseType: !759, size: 64, offset: 6528)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !684, line: 66, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !684, line: 61, size: 128, elements: !762)
!762 = !{!763, !764, !765, !766}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !761, file: !684, line: 62, baseType: !74, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !761, file: !684, line: 63, baseType: !74, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !761, file: !684, line: 64, baseType: !74, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !761, file: !684, line: 65, baseType: !74, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !722, file: !684, line: 109, baseType: !768, size: 64, offset: 6592)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !684, line: 71, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !684, line: 68, size: 64, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !770, file: !684, line: 69, baseType: !74, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !770, file: !684, line: 70, baseType: !74, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !722, file: !684, line: 110, baseType: !775, size: 64, offset: 6656)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !684, line: 81, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !684, line: 73, size: 352, elements: !778)
!778 = !{!779, !780, !781, !782, !783}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !777, file: !684, line: 74, baseType: !371, size: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !777, file: !684, line: 75, baseType: !371, size: 96, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !777, file: !684, line: 76, baseType: !371, size: 96, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !777, file: !684, line: 77, baseType: !74, size: 32, offset: 288)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !777, file: !684, line: 78, baseType: !74, size: 32, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !722, file: !684, line: 113, baseType: !257, size: 512, offset: 6720)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !692, file: !684, line: 148, baseType: !329, size: 64, offset: 1408)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !692, file: !684, line: 151, baseType: !299, size: 64, offset: 1472)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !692, file: !684, line: 152, baseType: !309, size: 64, offset: 1536)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !692, file: !684, line: 153, baseType: !789, size: 64, offset: 1600)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !791, line: 64, size: 19136, elements: !792)
!791 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!792 = !{!793, !794, !795, !796, !797, !798, !800, !801, !802, !803, !806, !807, !979, !980, !988, !989, !990, !991, !992}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !790, file: !791, line: 65, baseType: !110, size: 960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !790, file: !791, line: 66, baseType: !305, size: 64, offset: 960)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !790, file: !791, line: 68, baseType: !128, size: 8192, offset: 1024)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !790, file: !791, line: 70, baseType: !74, size: 32, offset: 9216)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !790, file: !791, line: 71, baseType: !74, size: 32, offset: 9248)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !790, file: !791, line: 72, baseType: !799, size: 64, offset: 9280)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 64, elements: !231)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !790, file: !791, line: 74, baseType: !178, size: 32, offset: 9344)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !790, file: !791, line: 74, baseType: !178, size: 32, offset: 9376)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !790, file: !791, line: 76, baseType: !199, size: 64, offset: 9408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !790, file: !791, line: 77, baseType: !804, size: 64, offset: 9472)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !791, line: 77, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !790, file: !791, line: 78, baseType: !402, size: 64, offset: 9536)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !790, file: !791, line: 80, baseType: !808, size: 2624, offset: 9600)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !809, line: 340, size: 2624, elements: !810)
!809 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!810 = !{!811, !839, !857, !858, !859, !874, !932, !933, !959, !960, !961, !962, !968}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !808, file: !809, line: 341, baseType: !812, size: 576)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !809, line: 251, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !809, line: 207, size: 576, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !813, file: !809, line: 208, baseType: !74, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !813, file: !809, line: 211, baseType: !142, size: 16, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !813, file: !809, line: 212, baseType: !142, size: 16, offset: 48)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !813, file: !809, line: 213, baseType: !178, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !813, file: !809, line: 214, baseType: !142, size: 16, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !813, file: !809, line: 215, baseType: !142, size: 16, offset: 112)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !813, file: !809, line: 216, baseType: !142, size: 16, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !813, file: !809, line: 217, baseType: !142, size: 16, offset: 144)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !813, file: !809, line: 218, baseType: !142, size: 16, offset: 160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !813, file: !809, line: 219, baseType: !142, size: 16, offset: 176)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !813, file: !809, line: 220, baseType: !178, size: 32, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !813, file: !809, line: 222, baseType: !142, size: 16, offset: 224)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !813, file: !809, line: 225, baseType: !142, size: 16, offset: 240)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !813, file: !809, line: 228, baseType: !74, size: 32, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !813, file: !809, line: 229, baseType: !74, size: 32, offset: 288)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !813, file: !809, line: 233, baseType: !74, size: 32, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !813, file: !809, line: 236, baseType: !142, size: 16, offset: 352)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !813, file: !809, line: 236, baseType: !142, size: 16, offset: 368)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !813, file: !809, line: 241, baseType: !178, size: 32, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !813, file: !809, line: 244, baseType: !74, size: 32, offset: 416)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !813, file: !809, line: 244, baseType: !74, size: 32, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !813, file: !809, line: 245, baseType: !178, size: 32, offset: 480)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !813, file: !809, line: 248, baseType: !178, size: 32, offset: 512)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !813, file: !809, line: 250, baseType: !74, size: 32, offset: 544)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !808, file: !809, line: 342, baseType: !840, size: 448, offset: 576)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !809, line: 79, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !809, line: 61, size: 448, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !841, file: !809, line: 62, baseType: !108, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !841, file: !809, line: 64, baseType: !142, size: 16, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !841, file: !809, line: 65, baseType: !142, size: 16, offset: 80)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !841, file: !809, line: 67, baseType: !178, size: 32, offset: 96)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !841, file: !809, line: 68, baseType: !178, size: 32, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !841, file: !809, line: 69, baseType: !178, size: 32, offset: 160)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !841, file: !809, line: 70, baseType: !142, size: 16, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !841, file: !809, line: 71, baseType: !142, size: 16, offset: 208)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !841, file: !809, line: 72, baseType: !560, size: 64, offset: 224)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !841, file: !809, line: 75, baseType: !178, size: 32, offset: 288)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !841, file: !809, line: 75, baseType: !178, size: 32, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !841, file: !809, line: 75, baseType: !178, size: 32, offset: 352)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !841, file: !809, line: 78, baseType: !178, size: 32, offset: 384)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !841, file: !809, line: 78, baseType: !178, size: 32, offset: 416)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !808, file: !809, line: 343, baseType: !168, size: 128, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !808, file: !809, line: 344, baseType: !168, size: 128, offset: 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !808, file: !809, line: 345, baseType: !860, size: 192, offset: 1280)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !809, line: 278, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !809, line: 270, size: 192, elements: !862)
!862 = !{!863, !864, !865, !866, !867}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !861, file: !809, line: 271, baseType: !74, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !861, file: !809, line: 273, baseType: !178, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !861, file: !809, line: 275, baseType: !74, size: 32, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !861, file: !809, line: 276, baseType: !74, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !861, file: !809, line: 277, baseType: !868, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !809, line: 55, size: 576, elements: !870)
!870 = !{!871, !872, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !869, file: !809, line: 56, baseType: !74, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !869, file: !809, line: 57, baseType: !178, size: 32, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !869, file: !809, line: 58, baseType: !450, size: 512, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !808, file: !809, line: 346, baseType: !875, size: 384, offset: 1472)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !809, line: 268, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !809, line: 253, size: 384, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !926, !927, !928, !929, !930, !931}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !876, file: !809, line: 254, baseType: !74, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !876, file: !809, line: 255, baseType: !74, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !876, file: !809, line: 255, baseType: !74, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !876, file: !809, line: 258, baseType: !178, size: 32, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !876, file: !809, line: 259, baseType: !883, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !809, line: 164, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !809, line: 108, size: 1664, elements: !886)
!886 = !{!887, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !885, file: !809, line: 109, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !885, file: !809, line: 109, baseType: !888, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !809, line: 111, baseType: !158, size: 512, offset: 128)
