; ModuleID = 'blender/source/blender/editors/space_buttons/buttons_ops.c'
source_filename = "blender/source/blender/editors/space_buttons/buttons_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!901 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922}
!903 = !DIEnumerator(name: "USER_AUTOSAVE", value: 1, isUnsigned: true)
!904 = !DIEnumerator(name: "USER_SCENEGLOBAL", value: 16, isUnsigned: true)
!905 = !DIEnumerator(name: "USER_TRACKBALL", value: 32, isUnsigned: true)
!906 = !DIEnumerator(name: "USER_MAT_ON_OB", value: 256, isUnsigned: true)
!907 = !DIEnumerator(name: "USER_TOOLTIPS", value: 2048, isUnsigned: true)
!908 = !DIEnumerator(name: "USER_TWOBUTTONMOUSE", value: 4096, isUnsigned: true)
!909 = !DIEnumerator(name: "USER_NONUMPAD", value: 8192, isUnsigned: true)
!910 = !DIEnumerator(name: "USER_LMOUSESELECT", value: 16384, isUnsigned: true)
!911 = !DIEnumerator(name: "USER_FILECOMPRESS", value: 32768, isUnsigned: true)
!912 = !DIEnumerator(name: "USER_SAVE_PREVIEWS", value: 65536, isUnsigned: true)
!913 = !DIEnumerator(name: "USER_CUSTOM_RANGE", value: 131072, isUnsigned: true)
!914 = !DIEnumerator(name: "USER_ADD_EDITMODE", value: 262144, isUnsigned: true)
!915 = !DIEnumerator(name: "USER_ADD_VIEWALIGNED", value: 524288, isUnsigned: true)
!916 = !DIEnumerator(name: "USER_RELPATHS", value: 1048576, isUnsigned: true)
!917 = !DIEnumerator(name: "USER_RELEASECONFIRM", value: 2097152, isUnsigned: true)
!918 = !DIEnumerator(name: "USER_SCRIPT_AUTOEXEC_DISABLE", value: 4194304, isUnsigned: true)
!919 = !DIEnumerator(name: "USER_FILENOUI", value: 8388608, isUnsigned: true)
!920 = !DIEnumerator(name: "USER_NONEGFRAMES", value: 16777216, isUnsigned: true)
!921 = !DIEnumerator(name: "USER_TXT_TABSTOSPACES_DISABLE", value: 33554432, isUnsigned: true)
!922 = !DIEnumerator(name: "USER_TOOLTIPS_PYTHON", value: 67108864, isUnsigned: true)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !924, line: 107, baseType: !5, size: 32, elements: !925)
!924 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!925 = !{!926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!926 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!927 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!928 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!929 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!930 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!931 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!932 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!933 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!934 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!935 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!936 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!937 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!938 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!939 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!940 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!941 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!942 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!943 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!944 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!945 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!946 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!947 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!948 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!949 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!950 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!951 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!952 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!953 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!954 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!955 = !{!956, !958}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!959 = !{i32 7, !"Dwarf Version", i32 4}
!960 = !{i32 2, !"Debug Info Version", i32 3}
!961 = !{i32 1, !"wchar_size", i32 4}
!962 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!963 = distinct !DISubprogram(name: "BUTTONS_OT_toolbox", scope: !1, file: !1, line: 83, type: !964, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2494)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !886, line: 568, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !886, line: 508, size: 1536, elements: !969)
!969 = !{!970, !973, !974, !975, !976, !2420, !2424, !2430, !2434, !2435, !2439, !2440, !2441, !2442, !2446, !2447, !2462, !2463, !2467, !2493}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !886, line: 509, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !968, file: !886, line: 510, baseType: !971, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !968, file: !886, line: 511, baseType: !971, size: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !968, file: !886, line: 512, baseType: !971, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !968, file: !886, line: 518, baseType: !977, size: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!980, !981, !983}
!980 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !924, line: 44, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !866, line: 328, size: 1344, elements: !985)
!985 = !{!986, !987, !988, !992, !1023, !1025, !1026, !1027, !1039, !2413, !2414, !2415, !2418, !2419}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !984, file: !866, line: 329, baseType: !983, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !984, file: !866, line: 329, baseType: !983, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !984, file: !866, line: 332, baseType: !989, size: 512, offset: 128)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 512, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !984, file: !866, line: 333, baseType: !993, size: 64, offset: 640)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !995, line: 75, baseType: !996)
!995 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !995, line: 62, size: 1024, elements: !997)
!997 = !{!998, !1000, !1001, !1002, !1003, !1005, !1006, !1007, !1021, !1022}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !996, file: !995, line: 63, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !996, file: !995, line: 63, baseType: !999, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !996, file: !995, line: 64, baseType: !957, size: 8, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !996, file: !995, line: 64, baseType: !957, size: 8, offset: 136)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !996, file: !995, line: 65, baseType: !1004, size: 16, offset: 144)
!1004 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !995, line: 66, baseType: !989, size: 512, offset: 160)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !996, file: !995, line: 67, baseType: !980, size: 32, offset: 672)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !996, file: !995, line: 69, baseType: !1008, size: 256, offset: 704)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !995, line: 60, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !995, line: 48, size: 256, elements: !1010)
!1010 = !{!1011, !1012, !1019, !1020}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1009, file: !995, line: 49, baseType: !958, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1009, file: !995, line: 58, baseType: !1013, size: 128, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1014, line: 71, baseType: !1015)
!1014 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1014, line: 69, size: 128, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1015, file: !1014, line: 70, baseType: !958, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1015, file: !1014, line: 70, baseType: !958, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1009, file: !995, line: 59, baseType: !980, size: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1009, file: !995, line: 59, baseType: !980, size: 32, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !996, file: !995, line: 70, baseType: !980, size: 32, offset: 960)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !996, file: !995, line: 74, baseType: !980, size: 32, offset: 992)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !984, file: !866, line: 336, baseType: !1024, size: 64, offset: 704)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !984, file: !866, line: 337, baseType: !958, size: 64, offset: 768)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !984, file: !866, line: 338, baseType: !958, size: 64, offset: 832)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !984, file: !866, line: 340, baseType: !1028, size: 64, offset: 896)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !924, line: 55, size: 192, elements: !1030)
!1030 = !{!1031, !1035, !1038}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1029, file: !924, line: 58, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1029, file: !924, line: 56, size: 64, elements: !1033)
!1033 = !{!1034}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1032, file: !924, line: 57, baseType: !958, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1029, file: !924, line: 60, baseType: !1036, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !924, line: 41, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1029, file: !924, line: 61, baseType: !958, size: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !984, file: !866, line: 341, baseType: !1040, size: 64, offset: 960)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !866, line: 106, size: 320, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1041, file: !866, line: 107, baseType: !1013, size: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !1041, file: !866, line: 108, baseType: !980, size: 32, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !1041, file: !866, line: 109, baseType: !980, size: 32, offset: 160)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1041, file: !866, line: 110, baseType: !980, size: 32, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1041, file: !866, line: 110, baseType: !980, size: 32, offset: 224)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !1041, file: !866, line: 111, baseType: !1049, size: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !886, line: 490, size: 768, elements: !1051)
!1051 = !{!1052, !1053, !1054, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1050, file: !886, line: 491, baseType: !1049, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1050, file: !886, line: 491, baseType: !1049, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1050, file: !886, line: 493, baseType: !1055, size: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !866, line: 169, size: 2048, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2379, !2382, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1056, file: !866, line: 170, baseType: !1055, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1056, file: !866, line: 170, baseType: !1055, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1056, file: !866, line: 172, baseType: !958, size: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1056, file: !866, line: 174, baseType: !1062, size: 64, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1064, line: 49, size: 1984, elements: !1065)
!1064 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1065 = !{!1066, !1102, !1103, !1104, !1105, !1106, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1063, file: !1064, line: 50, baseType: !1067, size: 960)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !995, line: 130, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !995, line: 117, size: 960, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1074, !1093, !1097, !1098, !1099, !1100, !1101}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1068, file: !995, line: 118, baseType: !958, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1068, file: !995, line: 118, baseType: !958, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1068, file: !995, line: 119, baseType: !1073, size: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1068, file: !995, line: 120, baseType: !1075, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !995, line: 136, size: 17600, elements: !1077)
!1077 = !{!1078, !1079, !1081, !1084, !1088, !1089, !1090}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1076, file: !995, line: 137, baseType: !1067, size: 960)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1076, file: !995, line: 138, baseType: !1080, size: 64, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1076, file: !995, line: 139, baseType: !1082, size: 64, offset: 1024)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !995, line: 43, flags: DIFlagFwdDecl)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1076, file: !995, line: 140, baseType: !1085, size: 8192, offset: 1088)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 8192, elements: !1086)
!1086 = !{!1087}
!1087 = !DISubrange(count: 1024)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1076, file: !995, line: 141, baseType: !1085, size: 8192, offset: 9280)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1076, file: !995, line: 148, baseType: !1075, size: 64, offset: 17472)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1076, file: !995, line: 150, baseType: !1091, size: 64, offset: 17536)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !995, line: 45, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1068, file: !995, line: 121, baseType: !1094, size: 528, offset: 256)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 528, elements: !1095)
!1095 = !{!1096}
!1096 = !DISubrange(count: 66)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1068, file: !995, line: 126, baseType: !1004, size: 16, offset: 784)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1068, file: !995, line: 127, baseType: !980, size: 32, offset: 800)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1068, file: !995, line: 128, baseType: !980, size: 32, offset: 832)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1068, file: !995, line: 128, baseType: !980, size: 32, offset: 864)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1068, file: !995, line: 129, baseType: !993, size: 64, offset: 896)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1063, file: !1064, line: 52, baseType: !1013, size: 128, offset: 960)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1063, file: !1064, line: 53, baseType: !1013, size: 128, offset: 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1063, file: !1064, line: 54, baseType: !1013, size: 128, offset: 1216)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1063, file: !1064, line: 55, baseType: !1013, size: 128, offset: 1344)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1063, file: !1064, line: 57, baseType: !1107, size: 64, offset: 1472)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1109, line: 1216, size: 39680, elements: !1110)
!1109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1110 = !{!1111, !1112, !1116, !1119, !1122, !1123, !1124, !1136, !1137, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1154, !1231, !1668, !1883, !1886, !2174, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2196, !2197, !2198, !2199, !2200, !2208, !2275, !2282, !2283, !2290, !2291, !2297, !2298, !2299, !2300, !2301}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1108, file: !1109, line: 1217, baseType: !1067, size: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1108, file: !1109, line: 1218, baseType: !1113, size: 64, offset: 960)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1115, line: 45, flags: DIFlagFwdDecl)
!1115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1108, file: !1109, line: 1220, baseType: !1117, size: 64, offset: 1024)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1115, line: 49, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1108, file: !1109, line: 1221, baseType: !1120, size: 64, offset: 1088)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1109, line: 52, flags: DIFlagFwdDecl)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1108, file: !1109, line: 1223, baseType: !1107, size: 64, offset: 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1108, file: !1109, line: 1225, baseType: !1013, size: 128, offset: 1216)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1108, file: !1109, line: 1226, baseType: !1125, size: 64, offset: 1344)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1109, line: 69, size: 320, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1126, file: !1109, line: 70, baseType: !1125, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1126, file: !1109, line: 70, baseType: !1125, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1126, file: !1109, line: 71, baseType: !5, size: 32, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1126, file: !1109, line: 71, baseType: !5, size: 32, offset: 160)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1126, file: !1109, line: 72, baseType: !980, size: 32, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1126, file: !1109, line: 73, baseType: !1004, size: 16, offset: 224)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1126, file: !1109, line: 73, baseType: !1004, size: 16, offset: 240)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1126, file: !1109, line: 74, baseType: !1117, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1108, file: !1109, line: 1227, baseType: !1117, size: 64, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1108, file: !1109, line: 1229, baseType: !1138, size: 96, offset: 1472)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 96, elements: !1140)
!1139 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1140 = !{!1141}
!1141 = !DISubrange(count: 3)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1108, file: !1109, line: 1230, baseType: !1138, size: 96, offset: 1568)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1108, file: !1109, line: 1231, baseType: !1138, size: 96, offset: 1664)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1108, file: !1109, line: 1231, baseType: !1138, size: 96, offset: 1760)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1108, file: !1109, line: 1233, baseType: !5, size: 32, offset: 1856)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1108, file: !1109, line: 1234, baseType: !980, size: 32, offset: 1888)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1108, file: !1109, line: 1235, baseType: !5, size: 32, offset: 1920)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1108, file: !1109, line: 1237, baseType: !1004, size: 16, offset: 1952)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1108, file: !1109, line: 1239, baseType: !957, size: 8, offset: 1968)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1108, file: !1109, line: 1240, baseType: !1151, size: 8, offset: 1976)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 8, elements: !1152)
!1152 = !{!1153}
!1153 = !DISubrange(count: 1)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1108, file: !1109, line: 1242, baseType: !1155, size: 64, offset: 1984)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1157, line: 328, size: 3456, elements: !1158)
!1157 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1158 = !{!1159, !1160, !1161, !1164, !1165, !1166, !1170, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1197, !1198, !1199, !1202, !1207, !1208, !1211, !1215, !1219, !1223, !1227, !1228, !1229, !1230}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1156, file: !1157, line: 329, baseType: !1067, size: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1156, file: !1157, line: 330, baseType: !1113, size: 64, offset: 960)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1156, file: !1157, line: 332, baseType: !1162, size: 64, offset: 1024)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1157, line: 332, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1156, file: !1157, line: 333, baseType: !989, size: 512, offset: 1088)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1156, file: !1157, line: 335, baseType: !1036, size: 64, offset: 1600)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1156, file: !1157, line: 337, baseType: !1167, size: 64, offset: 1664)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1169, line: 45, flags: DIFlagFwdDecl)
!1169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1156, file: !1157, line: 338, baseType: !1171, size: 64, offset: 1728)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 64, elements: !1172)
!1172 = !{!1173}
!1173 = !DISubrange(count: 2)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1156, file: !1157, line: 340, baseType: !1013, size: 128, offset: 1792)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1156, file: !1157, line: 340, baseType: !1013, size: 128, offset: 1920)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1156, file: !1157, line: 342, baseType: !980, size: 32, offset: 2048)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1156, file: !1157, line: 342, baseType: !980, size: 32, offset: 2080)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1156, file: !1157, line: 343, baseType: !980, size: 32, offset: 2112)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1156, file: !1157, line: 345, baseType: !980, size: 32, offset: 2144)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1156, file: !1157, line: 346, baseType: !980, size: 32, offset: 2176)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1156, file: !1157, line: 347, baseType: !1004, size: 16, offset: 2208)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1156, file: !1157, line: 348, baseType: !1004, size: 16, offset: 2224)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1156, file: !1157, line: 349, baseType: !980, size: 32, offset: 2240)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1156, file: !1157, line: 351, baseType: !980, size: 32, offset: 2272)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1156, file: !1157, line: 353, baseType: !1004, size: 16, offset: 2304)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1156, file: !1157, line: 354, baseType: !1004, size: 16, offset: 2320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1156, file: !1157, line: 355, baseType: !980, size: 32, offset: 2336)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1156, file: !1157, line: 357, baseType: !1189, size: 128, offset: 2368)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1190, line: 95, baseType: !1191)
!1190 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1190, line: 92, size: 128, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1191, file: !1190, line: 93, baseType: !1139, size: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1191, file: !1190, line: 93, baseType: !1139, size: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1191, file: !1190, line: 94, baseType: !1139, size: 32, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1191, file: !1190, line: 94, baseType: !1139, size: 32, offset: 96)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1156, file: !1157, line: 363, baseType: !1013, size: 128, offset: 2496)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1156, file: !1157, line: 363, baseType: !1013, size: 128, offset: 2624)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1156, file: !1157, line: 368, baseType: !1200, size: 64, offset: 2752)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1157, line: 48, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1156, file: !1157, line: 372, baseType: !1203, size: 32, offset: 2816)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1157, line: 274, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1157, line: 271, size: 32, elements: !1205)
!1205 = !{!1206}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1204, file: !1157, line: 273, baseType: !5, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1156, file: !1157, line: 373, baseType: !980, size: 32, offset: 2848)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1156, file: !1157, line: 382, baseType: !1209, size: 64, offset: 2880)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1157, line: 46, flags: DIFlagFwdDecl)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1156, file: !1157, line: 385, baseType: !1212, size: 64, offset: 2944)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{null, !958, !1139}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1156, file: !1157, line: 386, baseType: !1216, size: 64, offset: 3008)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{null, !958, !956}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1156, file: !1157, line: 387, baseType: !1220, size: 64, offset: 3072)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!980, !958}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1156, file: !1157, line: 388, baseType: !1224, size: 64, offset: 3136)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{null, !958}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1156, file: !1157, line: 389, baseType: !958, size: 64, offset: 3200)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1156, file: !1157, line: 389, baseType: !958, size: 64, offset: 3264)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1156, file: !1157, line: 389, baseType: !958, size: 64, offset: 3328)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1156, file: !1157, line: 389, baseType: !958, size: 64, offset: 3392)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1108, file: !1109, line: 1244, baseType: !1232, size: 64, offset: 2048)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1234, line: 200, size: 17024, elements: !1235)
!1234 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1235 = !{!1236, !1238, !1239, !1240, !1661, !1662, !1663, !1664, !1665, !1666, !1667}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1233, file: !1234, line: 201, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1233, file: !1234, line: 202, baseType: !1013, size: 128, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1233, file: !1234, line: 203, baseType: !1013, size: 128, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1233, file: !1234, line: 206, baseType: !1241, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1234, line: 190, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1234, line: 126, size: 2816, elements: !1244)
!1244 = !{!1245, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1344, !1347, !1348, !1349, !1632, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1660}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1243, file: !1234, line: 127, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1243, file: !1234, line: 127, baseType: !1246, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1243, file: !1234, line: 128, baseType: !958, size: 64, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1243, file: !1234, line: 129, baseType: !958, size: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1243, file: !1234, line: 130, baseType: !989, size: 512, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1243, file: !1234, line: 132, baseType: !980, size: 32, offset: 768)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1243, file: !1234, line: 132, baseType: !980, size: 32, offset: 800)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1243, file: !1234, line: 133, baseType: !980, size: 32, offset: 832)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1243, file: !1234, line: 134, baseType: !980, size: 32, offset: 864)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1243, file: !1234, line: 134, baseType: !980, size: 32, offset: 896)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1243, file: !1234, line: 134, baseType: !980, size: 32, offset: 928)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1243, file: !1234, line: 135, baseType: !980, size: 32, offset: 960)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1243, file: !1234, line: 135, baseType: !980, size: 32, offset: 992)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1243, file: !1234, line: 136, baseType: !980, size: 32, offset: 1024)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1243, file: !1234, line: 136, baseType: !980, size: 32, offset: 1056)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1243, file: !1234, line: 137, baseType: !980, size: 32, offset: 1088)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1243, file: !1234, line: 137, baseType: !980, size: 32, offset: 1120)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1243, file: !1234, line: 138, baseType: !1139, size: 32, offset: 1152)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1243, file: !1234, line: 139, baseType: !1139, size: 32, offset: 1184)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1243, file: !1234, line: 139, baseType: !1139, size: 32, offset: 1216)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1243, file: !1234, line: 141, baseType: !1004, size: 16, offset: 1248)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1243, file: !1234, line: 142, baseType: !1004, size: 16, offset: 1264)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1243, file: !1234, line: 143, baseType: !980, size: 32, offset: 1280)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1243, file: !1234, line: 144, baseType: !980, size: 32, offset: 1312)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1243, file: !1234, line: 146, baseType: !1271, size: 64, offset: 1344)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1234, line: 114, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1234, line: 99, size: 7232, elements: !1274)
!1274 = !{!1275, !1277, !1278, !1279, !1280, !1281, !1282, !1293, !1297, !1312, !1321, !1328, !1338}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1273, file: !1234, line: 100, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1273, file: !1234, line: 100, baseType: !1276, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1273, file: !1234, line: 101, baseType: !980, size: 32, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1273, file: !1234, line: 101, baseType: !980, size: 32, offset: 160)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1273, file: !1234, line: 102, baseType: !980, size: 32, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1273, file: !1234, line: 102, baseType: !980, size: 32, offset: 224)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1273, file: !1234, line: 103, baseType: !1283, size: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1234, line: 59, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1234, line: 56, size: 2112, elements: !1286)
!1286 = !{!1287, !1291, !1292}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1285, file: !1234, line: 57, baseType: !1288, size: 2048)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 2048, elements: !1289)
!1289 = !{!1290}
!1290 = !DISubrange(count: 256)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1285, file: !1234, line: 58, baseType: !980, size: 32, offset: 2048)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1285, file: !1234, line: 58, baseType: !980, size: 32, offset: 2080)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1273, file: !1234, line: 106, baseType: !1294, size: 6144, offset: 320)
!1294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 6144, elements: !1295)
!1295 = !{!1296}
!1296 = !DISubrange(count: 768)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1273, file: !1234, line: 107, baseType: !1298, size: 64, offset: 6464)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1234, line: 97, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1234, line: 83, size: 8320, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1308, !1309, !1310, !1311}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1300, file: !1234, line: 84, baseType: !1294, size: 6144)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1300, file: !1234, line: 87, baseType: !1288, size: 2048, offset: 6144)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1300, file: !1234, line: 88, baseType: !1305, size: 64, offset: 8192)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1307, line: 41, flags: DIFlagFwdDecl)
!1307 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1300, file: !1234, line: 90, baseType: !1004, size: 16, offset: 8256)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1300, file: !1234, line: 92, baseType: !1004, size: 16, offset: 8272)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1300, file: !1234, line: 93, baseType: !1004, size: 16, offset: 8288)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1300, file: !1234, line: 95, baseType: !1004, size: 16, offset: 8304)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1273, file: !1234, line: 108, baseType: !1313, size: 64, offset: 6528)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1234, line: 66, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1234, line: 61, size: 128, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1315, file: !1234, line: 62, baseType: !980, size: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1315, file: !1234, line: 63, baseType: !980, size: 32, offset: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1315, file: !1234, line: 64, baseType: !980, size: 32, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1315, file: !1234, line: 65, baseType: !980, size: 32, offset: 96)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1273, file: !1234, line: 109, baseType: !1322, size: 64, offset: 6592)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1234, line: 71, baseType: !1324)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1234, line: 68, size: 64, elements: !1325)
!1325 = !{!1326, !1327}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1324, file: !1234, line: 69, baseType: !980, size: 32)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1324, file: !1234, line: 70, baseType: !980, size: 32, offset: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1273, file: !1234, line: 110, baseType: !1329, size: 64, offset: 6656)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1234, line: 81, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1234, line: 73, size: 352, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1336, !1337}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1331, file: !1234, line: 74, baseType: !1138, size: 96)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1331, file: !1234, line: 75, baseType: !1138, size: 96, offset: 96)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1331, file: !1234, line: 76, baseType: !1138, size: 96, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1331, file: !1234, line: 77, baseType: !980, size: 32, offset: 288)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1331, file: !1234, line: 78, baseType: !980, size: 32, offset: 320)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1273, file: !1234, line: 113, baseType: !1339, size: 512, offset: 6720)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1340, line: 182, baseType: !1341)
!1340 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1340, line: 180, size: 512, elements: !1342)
!1342 = !{!1343}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1341, file: !1340, line: 181, baseType: !989, size: 512)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1243, file: !1234, line: 148, baseType: !1345, size: 64, offset: 1408)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1115, line: 46, flags: DIFlagFwdDecl)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1243, file: !1234, line: 151, baseType: !1107, size: 64, offset: 1472)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1243, file: !1234, line: 152, baseType: !1117, size: 64, offset: 1536)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1243, file: !1234, line: 153, baseType: !1350, size: 64, offset: 1600)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1352, line: 64, size: 19136, elements: !1353)
!1352 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1361, !1362, !1363, !1364, !1367, !1368, !1618, !1619, !1627, !1628, !1629, !1630, !1631}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1351, file: !1352, line: 65, baseType: !1067, size: 960)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1351, file: !1352, line: 66, baseType: !1113, size: 64, offset: 960)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1351, file: !1352, line: 68, baseType: !1085, size: 8192, offset: 1024)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1351, file: !1352, line: 70, baseType: !980, size: 32, offset: 9216)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1351, file: !1352, line: 71, baseType: !980, size: 32, offset: 9248)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1351, file: !1352, line: 72, baseType: !1360, size: 64, offset: 9280)
!1360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 64, elements: !1172)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1351, file: !1352, line: 74, baseType: !1139, size: 32, offset: 9344)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1351, file: !1352, line: 74, baseType: !1139, size: 32, offset: 9376)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1351, file: !1352, line: 76, baseType: !1305, size: 64, offset: 9408)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1351, file: !1352, line: 77, baseType: !1365, size: 64, offset: 9472)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1352, line: 77, flags: DIFlagFwdDecl)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1351, file: !1352, line: 78, baseType: !1167, size: 64, offset: 9536)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1351, file: !1352, line: 80, baseType: !1369, size: 2624, offset: 9600)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1169, line: 340, size: 2624, elements: !1370)
!1370 = !{!1371, !1399, !1417, !1418, !1419, !1437, !1495, !1496, !1598, !1599, !1600, !1601, !1607}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1369, file: !1169, line: 341, baseType: !1372, size: 576)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1169, line: 251, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1169, line: 207, size: 576, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1373, file: !1169, line: 208, baseType: !980, size: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1373, file: !1169, line: 211, baseType: !1004, size: 16, offset: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1373, file: !1169, line: 212, baseType: !1004, size: 16, offset: 48)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1373, file: !1169, line: 213, baseType: !1139, size: 32, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1373, file: !1169, line: 214, baseType: !1004, size: 16, offset: 96)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1373, file: !1169, line: 215, baseType: !1004, size: 16, offset: 112)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1373, file: !1169, line: 216, baseType: !1004, size: 16, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1373, file: !1169, line: 217, baseType: !1004, size: 16, offset: 144)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1373, file: !1169, line: 218, baseType: !1004, size: 16, offset: 160)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1373, file: !1169, line: 219, baseType: !1004, size: 16, offset: 176)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1373, file: !1169, line: 220, baseType: !1139, size: 32, offset: 192)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1373, file: !1169, line: 222, baseType: !1004, size: 16, offset: 224)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1373, file: !1169, line: 225, baseType: !1004, size: 16, offset: 240)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1373, file: !1169, line: 228, baseType: !980, size: 32, offset: 256)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1373, file: !1169, line: 229, baseType: !980, size: 32, offset: 288)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1373, file: !1169, line: 233, baseType: !980, size: 32, offset: 320)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1373, file: !1169, line: 236, baseType: !1004, size: 16, offset: 352)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1373, file: !1169, line: 236, baseType: !1004, size: 16, offset: 368)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1373, file: !1169, line: 241, baseType: !1139, size: 32, offset: 384)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1373, file: !1169, line: 244, baseType: !980, size: 32, offset: 416)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1373, file: !1169, line: 244, baseType: !980, size: 32, offset: 448)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1373, file: !1169, line: 245, baseType: !1139, size: 32, offset: 480)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1373, file: !1169, line: 248, baseType: !1139, size: 32, offset: 512)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1373, file: !1169, line: 250, baseType: !980, size: 32, offset: 544)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1369, file: !1169, line: 342, baseType: !1400, size: 448, offset: 576)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1169, line: 79, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1169, line: 61, size: 448, elements: !1402)
!1402 = !{!1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1401, file: !1169, line: 62, baseType: !958, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1401, file: !1169, line: 64, baseType: !1004, size: 16, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1401, file: !1169, line: 65, baseType: !1004, size: 16, offset: 80)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1401, file: !1169, line: 67, baseType: !1139, size: 32, offset: 96)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1401, file: !1169, line: 68, baseType: !1139, size: 32, offset: 128)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1401, file: !1169, line: 69, baseType: !1139, size: 32, offset: 160)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1401, file: !1169, line: 70, baseType: !1004, size: 16, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1401, file: !1169, line: 71, baseType: !1004, size: 16, offset: 208)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1401, file: !1169, line: 72, baseType: !1171, size: 64, offset: 224)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1401, file: !1169, line: 75, baseType: !1139, size: 32, offset: 288)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1401, file: !1169, line: 75, baseType: !1139, size: 32, offset: 320)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1401, file: !1169, line: 75, baseType: !1139, size: 32, offset: 352)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1401, file: !1169, line: 78, baseType: !1139, size: 32, offset: 384)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1401, file: !1169, line: 78, baseType: !1139, size: 32, offset: 416)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1369, file: !1169, line: 343, baseType: !1013, size: 128, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1369, file: !1169, line: 344, baseType: !1013, size: 128, offset: 1152)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1369, file: !1169, line: 345, baseType: !1420, size: 192, offset: 1280)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1169, line: 278, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1169, line: 270, size: 192, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1426, !1427}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1421, file: !1169, line: 271, baseType: !980, size: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1421, file: !1169, line: 273, baseType: !1139, size: 32, offset: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1421, file: !1169, line: 275, baseType: !980, size: 32, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1421, file: !1169, line: 276, baseType: !980, size: 32, offset: 96)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1421, file: !1169, line: 277, baseType: !1428, size: 64, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1169, line: 55, size: 576, elements: !1430)
!1430 = !{!1431, !1432, !1433}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1429, file: !1169, line: 56, baseType: !980, size: 32)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1429, file: !1169, line: 57, baseType: !1139, size: 32, offset: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1429, file: !1169, line: 58, baseType: !1434, size: 512, offset: 64)
!1434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 512, elements: !1435)
!1435 = !{!1436, !1436}
!1436 = !DISubrange(count: 4)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1369, file: !1169, line: 346, baseType: !1438, size: 384, offset: 1472)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1169, line: 268, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1169, line: 253, size: 384, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444, !1445, !1489, !1490, !1491, !1492, !1493, !1494}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1439, file: !1169, line: 254, baseType: !980, size: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1439, file: !1169, line: 255, baseType: !980, size: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1439, file: !1169, line: 255, baseType: !980, size: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1439, file: !1169, line: 258, baseType: !1139, size: 32, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1439, file: !1169, line: 259, baseType: !1446, size: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1169, line: 164, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1169, line: 108, size: 1664, elements: !1449)
!1449 = !{!1450, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1448, file: !1169, line: 109, baseType: !1451, size: 64)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1448, file: !1169, line: 109, baseType: !1451, size: 64, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1448, file: !1169, line: 111, baseType: !989, size: 512, offset: 128)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1448, file: !1169, line: 119, baseType: !1171, size: 64, offset: 640)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1448, file: !1169, line: 119, baseType: !1171, size: 64, offset: 704)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1448, file: !1169, line: 125, baseType: !1171, size: 64, offset: 768)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1448, file: !1169, line: 125, baseType: !1171, size: 64, offset: 832)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1448, file: !1169, line: 127, baseType: !1171, size: 64, offset: 896)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1448, file: !1169, line: 130, baseType: !980, size: 32, offset: 960)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1448, file: !1169, line: 131, baseType: !980, size: 32, offset: 992)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1448, file: !1169, line: 132, baseType: !1462, size: 64, offset: 1024)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1169, line: 106, baseType: !1464)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1169, line: 81, size: 512, elements: !1465)
!1465 = !{!1466, !1467, !1470, !1471, !1472, !1473}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1464, file: !1169, line: 82, baseType: !1171, size: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1464, file: !1169, line: 97, baseType: !1468, size: 256, offset: 64)
!1468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 256, elements: !1469)
!1469 = !{!1436, !1173}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1464, file: !1169, line: 102, baseType: !1171, size: 64, offset: 320)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1464, file: !1169, line: 102, baseType: !1171, size: 64, offset: 384)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1464, file: !1169, line: 104, baseType: !980, size: 32, offset: 448)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1464, file: !1169, line: 105, baseType: !980, size: 32, offset: 480)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1448, file: !1169, line: 135, baseType: !1138, size: 96, offset: 1088)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1448, file: !1169, line: 136, baseType: !1139, size: 32, offset: 1184)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1448, file: !1169, line: 139, baseType: !980, size: 32, offset: 1216)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1448, file: !1169, line: 139, baseType: !980, size: 32, offset: 1248)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1448, file: !1169, line: 139, baseType: !980, size: 32, offset: 1280)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1448, file: !1169, line: 140, baseType: !1138, size: 96, offset: 1312)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1448, file: !1169, line: 143, baseType: !1004, size: 16, offset: 1408)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1448, file: !1169, line: 144, baseType: !1004, size: 16, offset: 1424)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1448, file: !1169, line: 145, baseType: !1004, size: 16, offset: 1440)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1448, file: !1169, line: 148, baseType: !1004, size: 16, offset: 1456)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1448, file: !1169, line: 149, baseType: !980, size: 32, offset: 1472)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1448, file: !1169, line: 150, baseType: !1139, size: 32, offset: 1504)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1448, file: !1169, line: 152, baseType: !1167, size: 64, offset: 1536)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1448, file: !1169, line: 163, baseType: !1139, size: 32, offset: 1600)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1448, file: !1169, line: 163, baseType: !1139, size: 32, offset: 1632)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1439, file: !1169, line: 261, baseType: !1139, size: 32, offset: 192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1439, file: !1169, line: 261, baseType: !1139, size: 32, offset: 224)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1439, file: !1169, line: 261, baseType: !1139, size: 32, offset: 256)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1439, file: !1169, line: 263, baseType: !980, size: 32, offset: 288)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1439, file: !1169, line: 266, baseType: !980, size: 32, offset: 320)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1439, file: !1169, line: 267, baseType: !1139, size: 32, offset: 352)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1369, file: !1169, line: 347, baseType: !1446, size: 64, offset: 1856)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1369, file: !1169, line: 348, baseType: !1497, size: 64, offset: 1920)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64)
!1498 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1169, line: 205, baseType: !1499)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1169, line: 186, size: 1024, elements: !1500)
!1500 = !{!1501, !1503, !1504, !1505, !1507, !1508, !1509, !1517, !1518, !1519, !1596, !1597}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1499, file: !1169, line: 187, baseType: !1502, size: 64)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1499, file: !1169, line: 187, baseType: !1502, size: 64, offset: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1499, file: !1169, line: 189, baseType: !989, size: 512, offset: 128)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1499, file: !1169, line: 191, baseType: !1506, size: 64, offset: 640)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1499, file: !1169, line: 193, baseType: !980, size: 32, offset: 704)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1499, file: !1169, line: 193, baseType: !980, size: 32, offset: 736)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1499, file: !1169, line: 195, baseType: !1510, size: 64, offset: 768)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1169, line: 184, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1169, line: 166, size: 320, elements: !1513)
!1513 = !{!1514, !1515, !1516}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1512, file: !1169, line: 180, baseType: !1468, size: 256)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1512, file: !1169, line: 182, baseType: !980, size: 32, offset: 256)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1512, file: !1169, line: 183, baseType: !980, size: 32, offset: 288)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1499, file: !1169, line: 196, baseType: !980, size: 32, offset: 832)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1499, file: !1169, line: 198, baseType: !980, size: 32, offset: 864)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1499, file: !1169, line: 200, baseType: !1520, size: 64, offset: 896)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1307, line: 77, size: 15424, elements: !1522)
!1522 = !{!1523, !1524, !1525, !1528, !1531, !1532, !1535, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1555, !1556, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1582, !1583, !1584, !1585, !1586, !1590}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1521, file: !1307, line: 78, baseType: !1067, size: 960)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1521, file: !1307, line: 80, baseType: !1085, size: 8192, offset: 960)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1521, file: !1307, line: 82, baseType: !1526, size: 64, offset: 9152)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1527 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1307, line: 43, flags: DIFlagFwdDecl)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1521, file: !1307, line: 83, baseType: !1529, size: 64, offset: 9216)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64)
!1530 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !995, line: 46, flags: DIFlagFwdDecl)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1521, file: !1307, line: 86, baseType: !1305, size: 64, offset: 9280)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1521, file: !1307, line: 87, baseType: !1533, size: 64, offset: 9344)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
!1534 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1307, line: 44, flags: DIFlagFwdDecl)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1521, file: !1307, line: 89, baseType: !1536, size: 512, offset: 9408)
!1536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1533, size: 512, elements: !1537)
!1537 = !{!1538}
!1538 = !DISubrange(count: 8)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1521, file: !1307, line: 90, baseType: !1004, size: 16, offset: 9920)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1521, file: !1307, line: 90, baseType: !1004, size: 16, offset: 9936)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1521, file: !1307, line: 92, baseType: !1004, size: 16, offset: 9952)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1521, file: !1307, line: 92, baseType: !1004, size: 16, offset: 9968)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1521, file: !1307, line: 93, baseType: !1004, size: 16, offset: 9984)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1521, file: !1307, line: 93, baseType: !1004, size: 16, offset: 10000)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1521, file: !1307, line: 94, baseType: !980, size: 32, offset: 10016)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1521, file: !1307, line: 97, baseType: !1004, size: 16, offset: 10048)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1521, file: !1307, line: 97, baseType: !1004, size: 16, offset: 10064)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1521, file: !1307, line: 98, baseType: !1004, size: 16, offset: 10080)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1521, file: !1307, line: 98, baseType: !1004, size: 16, offset: 10096)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1521, file: !1307, line: 99, baseType: !1004, size: 16, offset: 10112)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1521, file: !1307, line: 99, baseType: !1004, size: 16, offset: 10128)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1521, file: !1307, line: 100, baseType: !5, size: 32, offset: 10144)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1521, file: !1307, line: 101, baseType: !1554, size: 64, offset: 10176)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1521, file: !1307, line: 103, baseType: !1091, size: 64, offset: 10240)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1521, file: !1307, line: 104, baseType: !1557, size: 64, offset: 10304)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64)
!1558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !995, line: 159, size: 448, elements: !1559)
!1559 = !{!1560, !1562, !1563, !1565, !1566, !1568}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1558, file: !995, line: 161, baseType: !1561, size: 64)
!1561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1172)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1558, file: !995, line: 162, baseType: !1561, size: 64, offset: 64)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1558, file: !995, line: 163, baseType: !1564, size: 32, offset: 128)
!1564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1004, size: 32, elements: !1172)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1558, file: !995, line: 164, baseType: !1564, size: 32, offset: 160)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1558, file: !995, line: 165, baseType: !1567, size: 128, offset: 192)
!1567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1554, size: 128, elements: !1172)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1558, file: !995, line: 166, baseType: !1569, size: 128, offset: 320)
!1569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1529, size: 128, elements: !1172)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1521, file: !1307, line: 107, baseType: !1139, size: 32, offset: 10368)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1521, file: !1307, line: 108, baseType: !980, size: 32, offset: 10400)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1521, file: !1307, line: 109, baseType: !1004, size: 16, offset: 10432)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1521, file: !1307, line: 110, baseType: !1004, size: 16, offset: 10448)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1521, file: !1307, line: 113, baseType: !980, size: 32, offset: 10464)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1521, file: !1307, line: 113, baseType: !980, size: 32, offset: 10496)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1521, file: !1307, line: 114, baseType: !957, size: 8, offset: 10528)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1521, file: !1307, line: 114, baseType: !957, size: 8, offset: 10536)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1521, file: !1307, line: 115, baseType: !1004, size: 16, offset: 10544)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1521, file: !1307, line: 116, baseType: !1580, size: 128, offset: 10560)
!1580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 128, elements: !1581)
!1581 = !{!1436}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1521, file: !1307, line: 119, baseType: !1139, size: 32, offset: 10688)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1521, file: !1307, line: 119, baseType: !1139, size: 32, offset: 10720)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1521, file: !1307, line: 122, baseType: !1339, size: 512, offset: 10752)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1521, file: !1307, line: 123, baseType: !957, size: 8, offset: 11264)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1521, file: !1307, line: 125, baseType: !1587, size: 56, offset: 11272)
!1587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 56, elements: !1588)
!1588 = !{!1589}
!1589 = !DISubrange(count: 7)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1521, file: !1307, line: 126, baseType: !1591, size: 4096, offset: 11328)
!1591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1592, size: 4096, elements: !1537)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1307, line: 69, baseType: !1593)
!1593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1307, line: 67, size: 512, elements: !1594)
!1594 = !{!1595}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1593, file: !1307, line: 68, baseType: !989, size: 512)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1499, file: !1169, line: 201, baseType: !1139, size: 32, offset: 960)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1499, file: !1169, line: 204, baseType: !980, size: 32, offset: 992)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1369, file: !1169, line: 350, baseType: !1013, size: 128, offset: 1984)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1369, file: !1169, line: 351, baseType: !980, size: 32, offset: 2112)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1369, file: !1169, line: 351, baseType: !980, size: 32, offset: 2144)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1369, file: !1169, line: 353, baseType: !1602, size: 64, offset: 2176)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !1169, line: 297, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !1169, line: 295, size: 2048, elements: !1605)
!1605 = !{!1606}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1604, file: !1169, line: 296, baseType: !1288, size: 2048)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1369, file: !1169, line: 355, baseType: !1608, size: 384, offset: 2240)
!1608 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !1169, line: 338, baseType: !1609)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !1169, line: 322, size: 384, elements: !1610)
!1610 = !{!1611, !1612, !1613, !1614, !1615, !1616, !1617}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1609, file: !1169, line: 323, baseType: !980, size: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1609, file: !1169, line: 325, baseType: !1004, size: 16, offset: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1609, file: !1169, line: 326, baseType: !1004, size: 16, offset: 48)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1609, file: !1169, line: 331, baseType: !1013, size: 128, offset: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1609, file: !1169, line: 334, baseType: !1013, size: 128, offset: 192)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1609, file: !1169, line: 335, baseType: !980, size: 32, offset: 320)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1609, file: !1169, line: 337, baseType: !980, size: 32, offset: 352)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1351, file: !1352, line: 81, baseType: !958, size: 64, offset: 12224)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1351, file: !1352, line: 85, baseType: !1620, size: 6208, offset: 12288)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1352, line: 55, size: 6208, elements: !1621)
!1621 = !{!1622, !1623, !1624, !1625, !1626}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1620, file: !1352, line: 56, baseType: !1294, size: 6144)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1620, file: !1352, line: 58, baseType: !1004, size: 16, offset: 6144)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1620, file: !1352, line: 59, baseType: !1004, size: 16, offset: 6160)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1620, file: !1352, line: 60, baseType: !1004, size: 16, offset: 6176)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1620, file: !1352, line: 61, baseType: !1004, size: 16, offset: 6192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1351, file: !1352, line: 86, baseType: !980, size: 32, offset: 18496)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1351, file: !1352, line: 88, baseType: !980, size: 32, offset: 18528)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1351, file: !1352, line: 90, baseType: !980, size: 32, offset: 18560)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1351, file: !1352, line: 94, baseType: !980, size: 32, offset: 18592)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1351, file: !1352, line: 100, baseType: !1339, size: 512, offset: 18624)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1243, file: !1234, line: 154, baseType: !1633, size: 64, offset: 1664)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64)
!1634 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1635, line: 264, flags: DIFlagFwdDecl)
!1635 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1243, file: !1234, line: 156, baseType: !1305, size: 64, offset: 1728)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1243, file: !1234, line: 158, baseType: !1139, size: 32, offset: 1792)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1243, file: !1234, line: 159, baseType: !1139, size: 32, offset: 1824)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1243, file: !1234, line: 162, baseType: !1246, size: 64, offset: 1856)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1243, file: !1234, line: 162, baseType: !1246, size: 64, offset: 1920)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1243, file: !1234, line: 162, baseType: !1246, size: 64, offset: 1984)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1243, file: !1234, line: 164, baseType: !1013, size: 128, offset: 2048)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1243, file: !1234, line: 166, baseType: !1644, size: 64, offset: 2176)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64)
!1645 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1234, line: 51, flags: DIFlagFwdDecl)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1243, file: !1234, line: 167, baseType: !958, size: 64, offset: 2240)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1243, file: !1234, line: 168, baseType: !1139, size: 32, offset: 2304)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1243, file: !1234, line: 170, baseType: !1139, size: 32, offset: 2336)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !1243, file: !1234, line: 170, baseType: !1139, size: 32, offset: 2368)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !1243, file: !1234, line: 171, baseType: !1139, size: 32, offset: 2400)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !1243, file: !1234, line: 173, baseType: !958, size: 64, offset: 2432)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !1243, file: !1234, line: 175, baseType: !980, size: 32, offset: 2496)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !1243, file: !1234, line: 176, baseType: !980, size: 32, offset: 2528)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !1243, file: !1234, line: 179, baseType: !980, size: 32, offset: 2560)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !1243, file: !1234, line: 180, baseType: !1139, size: 32, offset: 2592)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1243, file: !1234, line: 183, baseType: !980, size: 32, offset: 2624)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1243, file: !1234, line: 185, baseType: !957, size: 8, offset: 2656)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1243, file: !1234, line: 186, baseType: !1659, size: 24, offset: 2664)
!1659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 24, elements: !1140)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1243, file: !1234, line: 189, baseType: !1013, size: 128, offset: 2688)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !1233, file: !1234, line: 207, baseType: !1085, size: 8192, offset: 384)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !1233, file: !1234, line: 208, baseType: !1085, size: 8192, offset: 8576)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !1233, file: !1234, line: 210, baseType: !980, size: 32, offset: 16768)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !1233, file: !1234, line: 210, baseType: !980, size: 32, offset: 16800)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !1233, file: !1234, line: 211, baseType: !980, size: 32, offset: 16832)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1233, file: !1234, line: 211, baseType: !980, size: 32, offset: 16864)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !1233, file: !1234, line: 212, baseType: !1189, size: 128, offset: 16896)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !1108, file: !1109, line: 1246, baseType: !1669, size: 64, offset: 2112)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !1109, line: 1067, size: 5184, elements: !1671)
!1671 = !{!1672, !1702, !1703, !1718, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1740, !1756, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1866}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1670, file: !1109, line: 1068, baseType: !1673, size: 64)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64)
!1674 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !1109, line: 934, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !1109, line: 925, size: 576, elements: !1676)
!1676 = !{!1677, !1694, !1695, !1696, !1697, !1698, !1701}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1675, file: !1109, line: 926, baseType: !1678, size: 320)
!1678 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !1109, line: 830, baseType: !1679)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !1109, line: 813, size: 320, elements: !1680)
!1680 = !{!1681, !1684, !1687, !1688, !1691, !1692, !1693}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1679, file: !1109, line: 814, baseType: !1682, size: 64)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64)
!1683 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !1109, line: 51, flags: DIFlagFwdDecl)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1679, file: !1109, line: 815, baseType: !1685, size: 64, offset: 64)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64)
!1686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !1109, line: 815, flags: DIFlagFwdDecl)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1679, file: !1109, line: 818, baseType: !958, size: 64, offset: 128)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1679, file: !1109, line: 819, baseType: !1689, size: 32, offset: 192)
!1689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1690, size: 32, elements: !1581)
!1690 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1679, file: !1109, line: 822, baseType: !980, size: 32, offset: 224)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1679, file: !1109, line: 826, baseType: !980, size: 32, offset: 256)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1679, file: !1109, line: 829, baseType: !980, size: 32, offset: 288)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1675, file: !1109, line: 928, baseType: !1004, size: 16, offset: 320)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1675, file: !1109, line: 928, baseType: !1004, size: 16, offset: 336)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1675, file: !1109, line: 929, baseType: !980, size: 32, offset: 352)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1675, file: !1109, line: 930, baseType: !1554, size: 64, offset: 384)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1675, file: !1109, line: 931, baseType: !1699, size: 64, offset: 448)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64)
!1700 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !1109, line: 931, flags: DIFlagFwdDecl)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1675, file: !1109, line: 933, baseType: !958, size: 64, offset: 512)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1670, file: !1109, line: 1069, baseType: !1673, size: 64, offset: 64)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1670, file: !1109, line: 1070, baseType: !1704, size: 64, offset: 128)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64)
!1705 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !1109, line: 916, baseType: !1706)
!1706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !1109, line: 891, size: 704, elements: !1707)
!1707 = !{!1708, !1709, !1710, !1712, !1713, !1714, !1715, !1716, !1717}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1706, file: !1109, line: 892, baseType: !1678, size: 320)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1706, file: !1109, line: 896, baseType: !980, size: 32, offset: 320)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1706, file: !1109, line: 900, baseType: !1711, size: 96, offset: 352)
!1711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 96, elements: !1140)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1706, file: !1109, line: 903, baseType: !1139, size: 32, offset: 448)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1706, file: !1109, line: 906, baseType: !980, size: 32, offset: 480)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1706, file: !1109, line: 909, baseType: !1139, size: 32, offset: 512)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1706, file: !1109, line: 912, baseType: !1139, size: 32, offset: 544)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1706, file: !1109, line: 914, baseType: !1117, size: 64, offset: 576)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1706, file: !1109, line: 915, baseType: !958, size: 64, offset: 640)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1670, file: !1109, line: 1071, baseType: !1719, size: 64, offset: 192)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64)
!1720 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !1109, line: 920, baseType: !1721)
!1721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !1109, line: 918, size: 320, elements: !1722)
!1722 = !{!1723}
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1721, file: !1109, line: 919, baseType: !1678, size: 320)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1670, file: !1109, line: 1075, baseType: !1139, size: 32, offset: 256)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1670, file: !1109, line: 1077, baseType: !1139, size: 32, offset: 288)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1670, file: !1109, line: 1078, baseType: !1139, size: 32, offset: 320)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1670, file: !1109, line: 1079, baseType: !1004, size: 16, offset: 352)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1670, file: !1109, line: 1082, baseType: !1004, size: 16, offset: 368)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1670, file: !1109, line: 1085, baseType: !957, size: 8, offset: 384)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1670, file: !1109, line: 1086, baseType: !957, size: 8, offset: 392)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1670, file: !1109, line: 1087, baseType: !957, size: 8, offset: 400)
