; ModuleID = 'blender/source/blender/editors/space_node/node_draw.c'
source_filename = "blender/source/blender/editors/space_node/node_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "max_depth", scope: !2, file: !3, line: 1286, type: !3739, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "drawnodespace", scope: !3, file: !3, line: 1257, type: !4, scopeLine: 1258, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2234, retainedNodes: !3733)
!3 = !DIFile(filename: "blender/source/blender/editors/space_node/node_draw.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !9, line: 69, baseType: !10)
!9 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !11, line: 44, flags: DIFlagFwdDecl)
!11 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !14, line: 267, baseType: !15)
!14 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !14, line: 230, size: 3072, elements: !16)
!16 = !{!17, !19, !20, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !14, line: 231, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !15, file: !14, line: 231, baseType: !18, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !15, file: !14, line: 233, baseType: !21, size: 1280, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !22, line: 71, baseType: !23)
!22 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !22, line: 40, size: 1280, elements: !24)
!24 = !{!25, !35, !36, !45, !46, !47, !51, !52, !53, !54, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !69, !70, !71, !74}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !23, file: !22, line: 41, baseType: !26, size: 128)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !27, line: 95, baseType: !28)
!27 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !27, line: 92, size: 128, elements: !29)
!29 = !{!30, !32, !33, !34}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !28, file: !27, line: 93, baseType: !31, size: 32)
!31 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !28, file: !27, line: 93, baseType: !31, size: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !28, file: !27, line: 94, baseType: !31, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !28, file: !27, line: 94, baseType: !31, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !23, file: !22, line: 41, baseType: !26, size: 128, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !23, file: !22, line: 42, baseType: !37, size: 128, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !27, line: 89, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !27, line: 86, size: 128, elements: !39)
!39 = !{!40, !42, !43, !44}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !38, file: !27, line: 87, baseType: !41, size: 32)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !38, file: !27, line: 87, baseType: !41, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !38, file: !27, line: 88, baseType: !41, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !38, file: !27, line: 88, baseType: !41, size: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !23, file: !22, line: 42, baseType: !37, size: 128, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !23, file: !22, line: 43, baseType: !37, size: 128, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !23, file: !22, line: 45, baseType: !48, size: 64, offset: 640)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 2)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !23, file: !22, line: 45, baseType: !48, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !23, file: !22, line: 46, baseType: !31, size: 32, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !23, file: !22, line: 46, baseType: !31, size: 32, offset: 800)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !23, file: !22, line: 48, baseType: !55, size: 16, offset: 832)
!55 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !23, file: !22, line: 49, baseType: !55, size: 16, offset: 848)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !23, file: !22, line: 51, baseType: !55, size: 16, offset: 864)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !23, file: !22, line: 52, baseType: !55, size: 16, offset: 880)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !23, file: !22, line: 53, baseType: !55, size: 16, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !23, file: !22, line: 55, baseType: !55, size: 16, offset: 912)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !23, file: !22, line: 56, baseType: !55, size: 16, offset: 928)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !23, file: !22, line: 58, baseType: !55, size: 16, offset: 944)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !23, file: !22, line: 58, baseType: !55, size: 16, offset: 960)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !23, file: !22, line: 59, baseType: !55, size: 16, offset: 976)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !23, file: !22, line: 59, baseType: !55, size: 16, offset: 992)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !23, file: !22, line: 61, baseType: !55, size: 16, offset: 1008)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !23, file: !22, line: 63, baseType: !68, size: 64, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !23, file: !22, line: 64, baseType: !41, size: 32, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !23, file: !22, line: 65, baseType: !41, size: 32, offset: 1120)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !23, file: !22, line: 68, baseType: !72, size: 64, offset: 1152)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !22, line: 68, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !23, file: !22, line: 69, baseType: !75, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !77, line: 490, size: 768, elements: !78)
!77 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!78 = !{!79, !80, !81, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !77, line: 491, baseType: !75, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !76, file: !77, line: 491, baseType: !75, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !76, file: !77, line: 493, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !84, line: 169, size: 2048, elements: !85)
!84 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !{!86, !87, !88, !90, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2170, !2173, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !84, line: 170, baseType: !82, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !83, file: !84, line: 170, baseType: !82, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !83, file: !84, line: 172, baseType: !89, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !83, file: !84, line: 174, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !14, line: 49, size: 1984, elements: !93)
!93 = !{!94, !163, !164, !165, !166, !167, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !92, file: !14, line: 50, baseType: !95, size: 960)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !96, line: 130, baseType: !97)
!96 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !96, line: 117, size: 960, elements: !98)
!98 = !{!99, !100, !101, !103, !123, !127, !128, !129, !130, !131}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !96, line: 118, baseType: !89, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !97, file: !96, line: 118, baseType: !89, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !97, file: !96, line: 119, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !97, file: !96, line: 120, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !96, line: 136, size: 17600, elements: !106)
!106 = !{!107, !108, !110, !113, !118, !119, !120}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !96, line: 137, baseType: !95, size: 960)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !105, file: !96, line: 138, baseType: !109, size: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !105, file: !96, line: 139, baseType: !111, size: 64, offset: 1024)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !96, line: 43, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !96, line: 140, baseType: !114, size: 8192, offset: 1088)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8192, elements: !116)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !{!117}
!117 = !DISubrange(count: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !105, file: !96, line: 141, baseType: !114, size: 8192, offset: 9280)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !105, file: !96, line: 148, baseType: !104, size: 64, offset: 17472)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !105, file: !96, line: 150, baseType: !121, size: 64, offset: 17536)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !96, line: 45, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !97, file: !96, line: 121, baseType: !124, size: 528, offset: 256)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 528, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 66)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !97, file: !96, line: 126, baseType: !55, size: 16, offset: 784)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !97, file: !96, line: 127, baseType: !41, size: 32, offset: 800)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !97, file: !96, line: 128, baseType: !41, size: 32, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !97, file: !96, line: 128, baseType: !41, size: 32, offset: 864)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !97, file: !96, line: 129, baseType: !132, size: 64, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !96, line: 75, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !96, line: 62, size: 1024, elements: !135)
!135 = !{!136, !138, !139, !140, !141, !142, !146, !147, !161, !162}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !96, line: 63, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !96, line: 63, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !96, line: 64, baseType: !115, size: 8, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !134, file: !96, line: 64, baseType: !115, size: 8, offset: 136)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !96, line: 65, baseType: !55, size: 16, offset: 144)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !96, line: 66, baseType: !143, size: 512, offset: 160)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !134, file: !96, line: 67, baseType: !41, size: 32, offset: 672)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !96, line: 69, baseType: !148, size: 256, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !96, line: 60, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !96, line: 48, size: 256, elements: !150)
!150 = !{!151, !152, !159, !160}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !149, file: !96, line: 49, baseType: !89, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !149, file: !96, line: 58, baseType: !153, size: 128, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !154, line: 71, baseType: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !154, line: 69, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !155, file: !154, line: 70, baseType: !89, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !155, file: !154, line: 70, baseType: !89, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !149, file: !96, line: 59, baseType: !41, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !149, file: !96, line: 59, baseType: !41, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !134, file: !96, line: 70, baseType: !41, size: 32, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !134, file: !96, line: 74, baseType: !41, size: 32, offset: 992)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !92, file: !14, line: 52, baseType: !153, size: 128, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !92, file: !14, line: 53, baseType: !153, size: 128, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !92, file: !14, line: 54, baseType: !153, size: 128, offset: 1216)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !92, file: !14, line: 55, baseType: !153, size: 128, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !92, file: !14, line: 57, baseType: !168, size: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !170, line: 1216, size: 39680, elements: !171)
!170 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = !{!172, !173, !177, !181, !1138, !1139, !1140, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1509, !1723, !1726, !1966, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1988, !1989, !1990, !1991, !1992, !2000, !2066, !2073, !2074, !2081, !2082, !2088, !2089, !2090, !2091, !2092}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !169, file: !170, line: 1217, baseType: !95, size: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !169, file: !170, line: 1218, baseType: !174, size: 64, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !176, line: 42, flags: DIFlagFwdDecl)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lamp_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !169, file: !170, line: 1220, baseType: !178, size: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !180, line: 49, flags: DIFlagFwdDecl)
!180 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !169, file: !170, line: 1221, baseType: !182, size: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !184, line: 52, size: 4224, elements: !185)
!184 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!185 = !{!186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !258, !1133, !1134, !1135, !1136, !1137}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !183, file: !184, line: 53, baseType: !95, size: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !183, file: !184, line: 54, baseType: !174, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !183, file: !184, line: 56, baseType: !55, size: 16, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !183, file: !184, line: 56, baseType: !55, size: 16, offset: 1040)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !183, file: !184, line: 57, baseType: !55, size: 16, offset: 1056)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !183, file: !184, line: 57, baseType: !55, size: 16, offset: 1072)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !183, file: !184, line: 59, baseType: !31, size: 32, offset: 1088)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !183, file: !184, line: 59, baseType: !31, size: 32, offset: 1120)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !183, file: !184, line: 59, baseType: !31, size: 32, offset: 1152)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !183, file: !184, line: 60, baseType: !31, size: 32, offset: 1184)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !183, file: !184, line: 60, baseType: !31, size: 32, offset: 1216)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !183, file: !184, line: 60, baseType: !31, size: 32, offset: 1248)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !183, file: !184, line: 61, baseType: !31, size: 32, offset: 1280)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !183, file: !184, line: 61, baseType: !31, size: 32, offset: 1312)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !183, file: !184, line: 61, baseType: !31, size: 32, offset: 1344)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !183, file: !184, line: 68, baseType: !31, size: 32, offset: 1376)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !183, file: !184, line: 68, baseType: !31, size: 32, offset: 1408)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !183, file: !184, line: 68, baseType: !31, size: 32, offset: 1440)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !183, file: !184, line: 69, baseType: !31, size: 32, offset: 1472)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !183, file: !184, line: 69, baseType: !31, size: 32, offset: 1504)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !183, file: !184, line: 74, baseType: !31, size: 32, offset: 1536)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !183, file: !184, line: 79, baseType: !31, size: 32, offset: 1568)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !183, file: !184, line: 81, baseType: !55, size: 16, offset: 1600)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !183, file: !184, line: 91, baseType: !55, size: 16, offset: 1616)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !183, file: !184, line: 92, baseType: !55, size: 16, offset: 1632)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !183, file: !184, line: 93, baseType: !55, size: 16, offset: 1648)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !183, file: !184, line: 94, baseType: !55, size: 16, offset: 1664)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !183, file: !184, line: 94, baseType: !55, size: 16, offset: 1680)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !183, file: !184, line: 94, baseType: !55, size: 16, offset: 1696)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !183, file: !184, line: 94, baseType: !55, size: 16, offset: 1712)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !183, file: !184, line: 96, baseType: !31, size: 32, offset: 1728)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !183, file: !184, line: 96, baseType: !31, size: 32, offset: 1760)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !183, file: !184, line: 96, baseType: !31, size: 32, offset: 1792)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !183, file: !184, line: 96, baseType: !31, size: 32, offset: 1824)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !183, file: !184, line: 98, baseType: !31, size: 32, offset: 1856)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !183, file: !184, line: 98, baseType: !31, size: 32, offset: 1888)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !183, file: !184, line: 98, baseType: !31, size: 32, offset: 1920)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !183, file: !184, line: 98, baseType: !31, size: 32, offset: 1952)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !183, file: !184, line: 99, baseType: !31, size: 32, offset: 1984)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !183, file: !184, line: 99, baseType: !31, size: 32, offset: 2016)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !183, file: !184, line: 100, baseType: !31, size: 32, offset: 2048)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !183, file: !184, line: 100, baseType: !31, size: 32, offset: 2080)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !183, file: !184, line: 103, baseType: !55, size: 16, offset: 2112)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !183, file: !184, line: 103, baseType: !55, size: 16, offset: 2128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !183, file: !184, line: 103, baseType: !55, size: 16, offset: 2144)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !183, file: !184, line: 103, baseType: !55, size: 16, offset: 2160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !183, file: !184, line: 106, baseType: !31, size: 32, offset: 2176)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !183, file: !184, line: 106, baseType: !31, size: 32, offset: 2208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !183, file: !184, line: 106, baseType: !31, size: 32, offset: 2240)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !183, file: !184, line: 106, baseType: !31, size: 32, offset: 2272)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !183, file: !184, line: 107, baseType: !55, size: 16, offset: 2304)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !183, file: !184, line: 107, baseType: !55, size: 16, offset: 2320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !183, file: !184, line: 107, baseType: !55, size: 16, offset: 2336)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !183, file: !184, line: 107, baseType: !55, size: 16, offset: 2352)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !183, file: !184, line: 108, baseType: !31, size: 32, offset: 2368)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !183, file: !184, line: 108, baseType: !31, size: 32, offset: 2400)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !183, file: !184, line: 109, baseType: !31, size: 32, offset: 2432)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !183, file: !184, line: 109, baseType: !31, size: 32, offset: 2464)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !183, file: !184, line: 110, baseType: !31, size: 32, offset: 2496)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !183, file: !184, line: 110, baseType: !31, size: 32, offset: 2528)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !183, file: !184, line: 110, baseType: !31, size: 32, offset: 2560)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !183, file: !184, line: 111, baseType: !55, size: 16, offset: 2592)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !183, file: !184, line: 111, baseType: !55, size: 16, offset: 2608)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !183, file: !184, line: 112, baseType: !55, size: 16, offset: 2624)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !183, file: !184, line: 112, baseType: !55, size: 16, offset: 2640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !183, file: !184, line: 112, baseType: !55, size: 16, offset: 2656)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !183, file: !184, line: 115, baseType: !55, size: 16, offset: 2672)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !183, file: !184, line: 118, baseType: !68, size: 64, offset: 2688)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !183, file: !184, line: 118, baseType: !68, size: 64, offset: 2752)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !183, file: !184, line: 121, baseType: !256, size: 64, offset: 2816)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !176, line: 45, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !183, file: !184, line: 122, baseType: !259, size: 1152, offset: 2880)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 1152, elements: !1131)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !180, line: 57, size: 2496, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !261, file: !180, line: 59, baseType: !55, size: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !261, file: !180, line: 59, baseType: !55, size: 16, offset: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !261, file: !180, line: 59, baseType: !55, size: 16, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !261, file: !180, line: 59, baseType: !55, size: 16, offset: 48)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !261, file: !180, line: 60, baseType: !178, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !261, file: !180, line: 61, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !180, line: 202, size: 3328, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !341, !839, !840, !918, !944, !972, !973, !1041, !1062, !1070, !1071}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !270, file: !180, line: 203, baseType: !95, size: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !270, file: !180, line: 204, baseType: !174, size: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !270, file: !180, line: 206, baseType: !31, size: 32, offset: 1024)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !270, file: !180, line: 206, baseType: !31, size: 32, offset: 1056)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !270, file: !180, line: 207, baseType: !31, size: 32, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !270, file: !180, line: 207, baseType: !31, size: 32, offset: 1120)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !270, file: !180, line: 207, baseType: !31, size: 32, offset: 1152)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !270, file: !180, line: 207, baseType: !31, size: 32, offset: 1184)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !270, file: !180, line: 207, baseType: !31, size: 32, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !270, file: !180, line: 207, baseType: !31, size: 32, offset: 1248)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !270, file: !180, line: 208, baseType: !31, size: 32, offset: 1280)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !270, file: !180, line: 208, baseType: !31, size: 32, offset: 1312)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !270, file: !180, line: 211, baseType: !31, size: 32, offset: 1344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !270, file: !180, line: 211, baseType: !31, size: 32, offset: 1376)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !270, file: !180, line: 211, baseType: !31, size: 32, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !270, file: !180, line: 211, baseType: !31, size: 32, offset: 1440)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !270, file: !180, line: 211, baseType: !31, size: 32, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !270, file: !180, line: 214, baseType: !31, size: 32, offset: 1504)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !270, file: !180, line: 214, baseType: !31, size: 32, offset: 1536)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !270, file: !180, line: 217, baseType: !31, size: 32, offset: 1568)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !270, file: !180, line: 218, baseType: !31, size: 32, offset: 1600)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !270, file: !180, line: 219, baseType: !31, size: 32, offset: 1632)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !270, file: !180, line: 220, baseType: !31, size: 32, offset: 1664)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !270, file: !180, line: 221, baseType: !31, size: 32, offset: 1696)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !270, file: !180, line: 222, baseType: !55, size: 16, offset: 1728)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !270, file: !180, line: 222, baseType: !55, size: 16, offset: 1744)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !270, file: !180, line: 224, baseType: !55, size: 16, offset: 1760)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !270, file: !180, line: 224, baseType: !55, size: 16, offset: 1776)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !270, file: !180, line: 227, baseType: !55, size: 16, offset: 1792)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !270, file: !180, line: 227, baseType: !55, size: 16, offset: 1808)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !270, file: !180, line: 229, baseType: !55, size: 16, offset: 1824)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !180, line: 229, baseType: !55, size: 16, offset: 1840)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !270, file: !180, line: 230, baseType: !55, size: 16, offset: 1856)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !270, file: !180, line: 230, baseType: !55, size: 16, offset: 1872)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !270, file: !180, line: 232, baseType: !31, size: 32, offset: 1888)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !270, file: !180, line: 232, baseType: !31, size: 32, offset: 1920)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !270, file: !180, line: 232, baseType: !31, size: 32, offset: 1952)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !270, file: !180, line: 232, baseType: !31, size: 32, offset: 1984)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !270, file: !180, line: 233, baseType: !41, size: 32, offset: 2016)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !270, file: !180, line: 234, baseType: !41, size: 32, offset: 2048)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !270, file: !180, line: 235, baseType: !55, size: 16, offset: 2080)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !270, file: !180, line: 235, baseType: !55, size: 16, offset: 2096)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !270, file: !180, line: 236, baseType: !55, size: 16, offset: 2112)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !270, file: !180, line: 239, baseType: !55, size: 16, offset: 2128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !270, file: !180, line: 240, baseType: !41, size: 32, offset: 2144)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !270, file: !180, line: 241, baseType: !41, size: 32, offset: 2176)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !270, file: !180, line: 241, baseType: !41, size: 32, offset: 2208)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !270, file: !180, line: 241, baseType: !41, size: 32, offset: 2240)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !270, file: !180, line: 243, baseType: !31, size: 32, offset: 2272)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !270, file: !180, line: 243, baseType: !31, size: 32, offset: 2304)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !270, file: !180, line: 244, baseType: !31, size: 32, offset: 2336)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !270, file: !180, line: 246, baseType: !324, size: 320, offset: 2368)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !325, line: 50, size: 320, elements: !326)
!325 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !324, file: !325, line: 51, baseType: !168, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !324, file: !325, line: 53, baseType: !41, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !324, file: !325, line: 54, baseType: !41, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !324, file: !325, line: 55, baseType: !41, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !324, file: !325, line: 55, baseType: !41, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !324, file: !325, line: 56, baseType: !115, size: 8, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !324, file: !325, line: 56, baseType: !115, size: 8, offset: 200)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !324, file: !325, line: 57, baseType: !115, size: 8, offset: 208)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !324, file: !325, line: 57, baseType: !115, size: 8, offset: 216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !324, file: !325, line: 59, baseType: !55, size: 16, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !324, file: !325, line: 59, baseType: !55, size: 16, offset: 240)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !324, file: !325, line: 59, baseType: !55, size: 16, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !324, file: !325, line: 61, baseType: !55, size: 16, offset: 272)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !324, file: !325, line: 63, baseType: !41, size: 32, offset: 288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !270, file: !180, line: 248, baseType: !342, size: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !344, line: 328, size: 3456, elements: !345)
!344 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!345 = !{!346, !347, !348, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !817, !818, !819, !822, !826, !830, !834, !835, !836, !837, !838}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !343, file: !344, line: 329, baseType: !95, size: 960)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !343, file: !344, line: 330, baseType: !174, size: 64, offset: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !343, file: !344, line: 332, baseType: !349, size: 64, offset: 1024)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !351, line: 283, size: 4096, elements: !352)
!351 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !{!353, !354, !355, !356, !360, !361, !365, !756, !764, !768, !774, !778, !779, !780, !781, !785, !786}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !351, line: 284, baseType: !41, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !350, file: !351, line: 285, baseType: !143, size: 512, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !350, file: !351, line: 287, baseType: !143, size: 512, offset: 544)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !350, file: !351, line: 288, baseType: !357, size: 2048, offset: 1056)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2048, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !350, file: !351, line: 289, baseType: !41, size: 32, offset: 3104)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !350, file: !351, line: 292, baseType: !362, size: 64, offset: 3136)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !342}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !350, file: !351, line: 293, baseType: !366, size: 64, offset: 3200)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !342, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !344, line: 167, size: 3712, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !344, line: 168, baseType: !369, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !370, file: !344, line: 168, baseType: !369, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !370, file: !344, line: 168, baseType: !369, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !370, file: !344, line: 170, baseType: !132, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !370, file: !344, line: 172, baseType: !377, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !351, line: 144, size: 6016, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !557, !558, !559, !619, !623, !627, !628, !635, !640, !644, !645, !646, !647, !651, !652, !656, !660, !664, !668, !672, !676, !680, !681, !688, !690, !699, !708}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !351, line: 145, baseType: !89, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !378, file: !351, line: 145, baseType: !89, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !378, file: !351, line: 146, baseType: !55, size: 16, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !378, file: !351, line: 148, baseType: !143, size: 512, offset: 144)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !351, line: 149, baseType: !41, size: 32, offset: 672)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !378, file: !351, line: 151, baseType: !143, size: 512, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !378, file: !351, line: 152, baseType: !357, size: 2048, offset: 1216)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !378, file: !351, line: 153, baseType: !41, size: 32, offset: 3264)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !378, file: !351, line: 155, baseType: !31, size: 32, offset: 3296)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !378, file: !351, line: 155, baseType: !31, size: 32, offset: 3328)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !378, file: !351, line: 155, baseType: !31, size: 32, offset: 3360)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !378, file: !351, line: 156, baseType: !31, size: 32, offset: 3392)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !378, file: !351, line: 156, baseType: !31, size: 32, offset: 3424)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !378, file: !351, line: 156, baseType: !31, size: 32, offset: 3456)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !378, file: !351, line: 157, baseType: !55, size: 16, offset: 3488)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !378, file: !351, line: 157, baseType: !55, size: 16, offset: 3504)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !378, file: !351, line: 157, baseType: !55, size: 16, offset: 3520)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !378, file: !351, line: 160, baseType: !398, size: 64, offset: 3584)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !351, line: 109, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !351, line: 98, size: 1408, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !556}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !400, file: !351, line: 99, baseType: !41, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !400, file: !351, line: 99, baseType: !41, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !351, line: 100, baseType: !143, size: 512, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !400, file: !351, line: 101, baseType: !31, size: 32, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !400, file: !351, line: 101, baseType: !31, size: 32, offset: 608)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !400, file: !351, line: 101, baseType: !31, size: 32, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !400, file: !351, line: 101, baseType: !31, size: 32, offset: 672)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !400, file: !351, line: 102, baseType: !31, size: 32, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !400, file: !351, line: 102, baseType: !31, size: 32, offset: 736)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !400, file: !351, line: 103, baseType: !41, size: 32, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !400, file: !351, line: 104, baseType: !41, size: 32, offset: 800)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !400, file: !351, line: 107, baseType: !414, size: 64, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !344, line: 87, size: 2816, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !537}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !415, file: !344, line: 88, baseType: !414, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !415, file: !344, line: 88, baseType: !414, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !415, file: !344, line: 88, baseType: !414, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !415, file: !344, line: 90, baseType: !132, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !415, file: !344, line: 92, baseType: !143, size: 512, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !344, line: 94, baseType: !143, size: 512, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !415, file: !344, line: 99, baseType: !89, size: 64, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !415, file: !344, line: 101, baseType: !55, size: 16, offset: 1344)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !344, line: 101, baseType: !55, size: 16, offset: 1360)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !415, file: !344, line: 102, baseType: !55, size: 16, offset: 1376)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !415, file: !344, line: 103, baseType: !55, size: 16, offset: 1392)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !415, file: !344, line: 104, baseType: !429, size: 64, offset: 1408)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !351, line: 114, size: 1600, elements: !431)
!431 = !{!432, !433, !453, !457, !461, !465, !469, !473, !474, !478, !507, !508, !509}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !430, file: !351, line: 115, baseType: !143, size: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !430, file: !351, line: 117, baseType: !434, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437, !438, !440, !440, !451}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !14, line: 46, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !11, line: 55, size: 192, elements: !442)
!442 = !{!443, !447, !450}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !441, file: !11, line: 58, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !11, line: 56, size: 64, elements: !445)
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !444, file: !11, line: 57, baseType: !89, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !11, line: 60, baseType: !448, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !344, line: 335, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !11, line: 61, baseType: !89, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !430, file: !351, line: 118, baseType: !454, size: 64, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !437, !440, !440, !68}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !430, file: !351, line: 120, baseType: !458, size: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !437, !438, !440}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !430, file: !351, line: 121, baseType: !462, size: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !437, !440, !68}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !430, file: !351, line: 122, baseType: !466, size: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !342, !414, !448}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !430, file: !351, line: 123, baseType: !470, size: 64, offset: 832)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !342, !414, !369, !414, !451}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !430, file: !351, line: 124, baseType: !470, size: 64, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !430, file: !351, line: 125, baseType: !475, size: 64, offset: 960)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !342, !414, !369, !414}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !430, file: !351, line: 128, baseType: !479, size: 256, offset: 1024)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !11, line: 436, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !11, line: 430, size: 256, elements: !481)
!481 = !{!482, !483, !486, !502}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !480, file: !11, line: 431, baseType: !89, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !480, file: !11, line: 432, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !11, line: 417, baseType: !449)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !480, file: !11, line: 433, baseType: !487, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !11, line: 408, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!41, !437, !440, !491, !493}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !11, line: 38, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !11, line: 348, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !11, line: 337, size: 256, elements: !496)
!496 = !{!497, !498, !499, !500, !501}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !495, file: !11, line: 339, baseType: !89, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !495, file: !11, line: 342, baseType: !491, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !495, file: !11, line: 345, baseType: !41, size: 32, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !495, file: !11, line: 347, baseType: !41, size: 32, offset: 160)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !495, file: !11, line: 347, baseType: !41, size: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !480, file: !11, line: 434, baseType: !503, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !11, line: 409, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !89}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !430, file: !351, line: 129, baseType: !479, size: 256, offset: 1280)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !430, file: !351, line: 132, baseType: !41, size: 32, offset: 1536)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !430, file: !351, line: 132, baseType: !41, size: 32, offset: 1568)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !415, file: !344, line: 105, baseType: !143, size: 512, offset: 1472)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !415, file: !344, line: 107, baseType: !31, size: 32, offset: 1984)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !415, file: !344, line: 107, baseType: !31, size: 32, offset: 2016)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !415, file: !344, line: 109, baseType: !89, size: 64, offset: 2048)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !415, file: !344, line: 112, baseType: !55, size: 16, offset: 2112)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !415, file: !344, line: 114, baseType: !55, size: 16, offset: 2128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !415, file: !344, line: 115, baseType: !41, size: 32, offset: 2144)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !415, file: !344, line: 117, baseType: !89, size: 64, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !415, file: !344, line: 122, baseType: !41, size: 32, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !415, file: !344, line: 124, baseType: !41, size: 32, offset: 2272)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !415, file: !344, line: 126, baseType: !414, size: 64, offset: 2304)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !415, file: !344, line: 128, baseType: !522, size: 64, offset: 2368)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !344, line: 298, size: 448, elements: !524)
!524 = !{!525, !526, !527, !530, !531, !534, !535, !536}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !523, file: !344, line: 299, baseType: !522, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !523, file: !344, line: 299, baseType: !522, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !523, file: !344, line: 301, baseType: !528, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !344, line: 218, baseType: !370)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !523, file: !344, line: 301, baseType: !528, size: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !523, file: !344, line: 302, baseType: !532, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !344, line: 132, baseType: !415)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !523, file: !344, line: 302, baseType: !532, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !523, file: !344, line: 304, baseType: !41, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !523, file: !344, line: 305, baseType: !41, size: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !415, file: !344, line: 131, baseType: !538, size: 384, offset: 2432)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !344, line: 73, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !344, line: 62, size: 384, elements: !540)
!540 = !{!541, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !539, file: !344, line: 63, baseType: !542, size: 128)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 4)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !539, file: !344, line: 64, baseType: !31, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !539, file: !344, line: 64, baseType: !31, size: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !539, file: !344, line: 65, baseType: !89, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !539, file: !344, line: 66, baseType: !55, size: 16, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !539, file: !344, line: 67, baseType: !55, size: 16, offset: 272)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !539, file: !344, line: 68, baseType: !55, size: 16, offset: 288)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !539, file: !344, line: 69, baseType: !55, size: 16, offset: 304)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !539, file: !344, line: 70, baseType: !55, size: 16, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !539, file: !344, line: 71, baseType: !55, size: 16, offset: 336)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !539, file: !344, line: 72, baseType: !555, size: 32, offset: 352)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !49)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !400, file: !351, line: 108, baseType: !143, size: 512, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !378, file: !351, line: 160, baseType: !398, size: 64, offset: 3648)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !378, file: !351, line: 162, baseType: !143, size: 512, offset: 3712)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !378, file: !351, line: 165, baseType: !560, size: 64, offset: 4224)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !563, !18, !565, !342, !369, !614}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !567, line: 925, size: 3200, elements: !568)
!567 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!568 = !{!569, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !566, file: !567, line: 926, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !567, line: 91, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !567, line: 85, size: 448, elements: !573)
!573 = !{!574, !576, !577, !578, !579, !580}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !572, file: !567, line: 86, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !572, file: !567, line: 86, baseType: !575, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !572, file: !567, line: 87, baseType: !153, size: 128, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !572, file: !567, line: 88, baseType: !41, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !572, file: !567, line: 89, baseType: !31, size: 32, offset: 288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !572, file: !567, line: 90, baseType: !581, size: 128, offset: 320)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !566, file: !567, line: 926, baseType: !570, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !566, file: !567, line: 927, baseType: !153, size: 128, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !566, file: !567, line: 928, baseType: !41, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !566, file: !567, line: 929, baseType: !31, size: 32, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !566, file: !567, line: 930, baseType: !581, size: 128, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !566, file: !567, line: 932, baseType: !21, size: 1280, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !566, file: !567, line: 934, baseType: !102, size: 64, offset: 1728)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !566, file: !567, line: 934, baseType: !102, size: 64, offset: 1792)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !566, file: !567, line: 935, baseType: !55, size: 16, offset: 1856)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !566, file: !567, line: 935, baseType: !55, size: 16, offset: 1872)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !566, file: !567, line: 936, baseType: !31, size: 32, offset: 1888)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !566, file: !567, line: 936, baseType: !31, size: 32, offset: 1920)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !566, file: !567, line: 938, baseType: !31, size: 32, offset: 1952)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !566, file: !567, line: 938, baseType: !31, size: 32, offset: 1984)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !566, file: !567, line: 939, baseType: !31, size: 32, offset: 2016)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !566, file: !567, line: 940, baseType: !48, size: 64, offset: 2048)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "treepath", scope: !566, file: !567, line: 947, baseType: !153, size: 128, offset: 2112)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !566, file: !567, line: 949, baseType: !342, size: 64, offset: 2240)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "edittree", scope: !566, file: !567, line: 949, baseType: !342, size: 64, offset: 2304)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tree_idname", scope: !566, file: !567, line: 952, baseType: !143, size: 512, offset: 2368)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "treetype", scope: !566, file: !567, line: 953, baseType: !41, size: 32, offset: 2880)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !566, file: !567, line: 954, baseType: !41, size: 32, offset: 2912)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "texfrom", scope: !566, file: !567, line: 956, baseType: !55, size: 16, offset: 2944)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "shaderfrom", scope: !566, file: !567, line: 957, baseType: !55, size: 16, offset: 2960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !566, file: !567, line: 958, baseType: !55, size: 16, offset: 2976)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !566, file: !567, line: 959, baseType: !55, size: 16, offset: 2992)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "linkdrag", scope: !566, file: !567, line: 960, baseType: !153, size: 128, offset: 3008)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !566, file: !567, line: 962, baseType: !612, size: 64, offset: 3136)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !170, line: 61, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !344, line: 274, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !344, line: 271, size: 32, elements: !616)
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !615, file: !344, line: 273, baseType: !618, size: 32)
!618 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !378, file: !351, line: 168, baseType: !620, size: 64, offset: 4288)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !563, !342, !369}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !378, file: !351, line: 171, baseType: !624, size: 64, offset: 4352)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !438, !437, !440}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !378, file: !351, line: 173, baseType: !624, size: 64, offset: 4416)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !378, file: !351, line: 176, baseType: !629, size: 64, offset: 4480)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !565, !632, !369, !41, !41}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !634, line: 136, flags: DIFlagFwdDecl)
!634 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!635 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !378, file: !351, line: 179, baseType: !636, size: 64, offset: 4544)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !342, !369, !639, !41}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !378, file: !351, line: 181, baseType: !641, size: 64, offset: 4608)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!41, !369, !41, !41}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !378, file: !351, line: 183, baseType: !641, size: 64, offset: 4672)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !378, file: !351, line: 185, baseType: !641, size: 64, offset: 4736)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !378, file: !351, line: 188, baseType: !366, size: 64, offset: 4800)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !378, file: !351, line: 190, baseType: !648, size: 64, offset: 4864)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !342, !369, !102}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !378, file: !351, line: 193, baseType: !366, size: 64, offset: 4928)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !378, file: !351, line: 195, baseType: !653, size: 64, offset: 4992)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !369}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !378, file: !351, line: 197, baseType: !657, size: 64, offset: 5056)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !342, !369, !369}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !378, file: !351, line: 200, baseType: !661, size: 64, offset: 5120)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !563, !440}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !378, file: !351, line: 201, baseType: !665, size: 64, offset: 5184)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !440}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !378, file: !351, line: 202, baseType: !669, size: 64, offset: 5248)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !440, !369}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !378, file: !351, line: 205, baseType: !673, size: 64, offset: 5312)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!41, !377, !342}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !378, file: !351, line: 207, baseType: !677, size: 64, offset: 5376)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!41, !369, !342}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !378, file: !351, line: 210, baseType: !366, size: 64, offset: 5440)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !378, file: !351, line: 213, baseType: !682, size: 64, offset: 5504)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !351, line: 135, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!89, !686, !369, !614}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !351, line: 62, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !378, file: !351, line: 214, baseType: !689, size: 64, offset: 5568)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !351, line: 136, baseType: !504)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !378, file: !351, line: 215, baseType: !691, size: 64, offset: 5632)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !351, line: 137, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !89, !41, !369, !695, !697, !697}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !351, line: 63, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !378, file: !351, line: 217, baseType: !700, size: 64, offset: 5696)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !351, line: 138, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!41, !704, !369, !695, !706, !706}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !351, line: 64, flags: DIFlagFwdDecl)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !351, line: 66, flags: DIFlagFwdDecl)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !378, file: !351, line: 220, baseType: !479, size: 256, offset: 5760)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !370, file: !344, line: 173, baseType: !143, size: 512, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !344, line: 175, baseType: !143, size: 512, offset: 832)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !344, line: 176, baseType: !41, size: 32, offset: 1344)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !370, file: !344, line: 177, baseType: !55, size: 16, offset: 1376)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !370, file: !344, line: 177, baseType: !55, size: 16, offset: 1392)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !370, file: !344, line: 178, baseType: !55, size: 16, offset: 1408)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !370, file: !344, line: 178, baseType: !55, size: 16, offset: 1424)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !370, file: !344, line: 179, baseType: !55, size: 16, offset: 1440)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !370, file: !344, line: 179, baseType: !55, size: 16, offset: 1456)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !370, file: !344, line: 180, baseType: !55, size: 16, offset: 1472)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !370, file: !344, line: 181, baseType: !55, size: 16, offset: 1488)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !370, file: !344, line: 182, baseType: !721, size: 96, offset: 1504)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 3)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !370, file: !344, line: 184, baseType: !153, size: 128, offset: 1600)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !370, file: !344, line: 184, baseType: !153, size: 128, offset: 1728)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !370, file: !344, line: 185, baseType: !369, size: 64, offset: 1856)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !370, file: !344, line: 186, baseType: !102, size: 64, offset: 1920)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !370, file: !344, line: 187, baseType: !89, size: 64, offset: 1984)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !370, file: !344, line: 188, baseType: !369, size: 64, offset: 2048)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !370, file: !344, line: 189, baseType: !153, size: 128, offset: 2112)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !370, file: !344, line: 191, baseType: !31, size: 32, offset: 2240)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !370, file: !344, line: 191, baseType: !31, size: 32, offset: 2272)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !370, file: !344, line: 192, baseType: !31, size: 32, offset: 2304)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !370, file: !344, line: 192, baseType: !31, size: 32, offset: 2336)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !370, file: !344, line: 193, baseType: !31, size: 32, offset: 2368)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !370, file: !344, line: 194, baseType: !31, size: 32, offset: 2400)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !370, file: !344, line: 194, baseType: !31, size: 32, offset: 2432)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !370, file: !344, line: 196, baseType: !41, size: 32, offset: 2464)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !370, file: !344, line: 198, baseType: !143, size: 512, offset: 2496)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !370, file: !344, line: 199, baseType: !55, size: 16, offset: 3008)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !370, file: !344, line: 199, baseType: !55, size: 16, offset: 3024)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !370, file: !344, line: 200, baseType: !31, size: 32, offset: 3040)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !370, file: !344, line: 200, baseType: !31, size: 32, offset: 3072)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !370, file: !344, line: 202, baseType: !55, size: 16, offset: 3104)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !370, file: !344, line: 202, baseType: !55, size: 16, offset: 3120)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !370, file: !344, line: 203, baseType: !89, size: 64, offset: 3136)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !370, file: !344, line: 204, baseType: !26, size: 128, offset: 3200)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !370, file: !344, line: 205, baseType: !26, size: 128, offset: 3328)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !370, file: !344, line: 206, baseType: !26, size: 128, offset: 3456)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !370, file: !344, line: 215, baseType: !55, size: 16, offset: 3584)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !370, file: !344, line: 215, baseType: !55, size: 16, offset: 3600)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !370, file: !344, line: 216, baseType: !41, size: 32, offset: 3616)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !370, file: !344, line: 217, baseType: !754, size: 64, offset: 3648)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !344, line: 51, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !350, file: !351, line: 294, baseType: !757, size: 64, offset: 3264)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !168, !89, !760}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeClassCallback", file: !351, line: 282, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !89, !41, !451}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !350, file: !351, line: 296, baseType: !765, size: 64, offset: 3328)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!41, !563, !349}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "get_from_context", scope: !350, file: !351, line: 298, baseType: !769, size: 64, offset: 3392)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !563, !349, !772, !773, !773}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "localize", scope: !350, file: !351, line: 302, baseType: !775, size: 64, offset: 3456)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !342, !342}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "local_sync", scope: !350, file: !351, line: 303, baseType: !775, size: 64, offset: 3520)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "local_merge", scope: !350, file: !351, line: 304, baseType: !775, size: 64, offset: 3584)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !350, file: !351, line: 307, baseType: !362, size: 64, offset: 3648)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "validate_link", scope: !350, file: !351, line: 309, baseType: !782, size: 64, offset: 3712)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!41, !342, !522}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "node_add_init", scope: !350, file: !351, line: 311, baseType: !366, size: 64, offset: 3776)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !350, file: !351, line: 314, baseType: !479, size: 256, offset: 3840)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !343, file: !344, line: 333, baseType: !143, size: 512, offset: 1088)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !343, file: !344, line: 335, baseType: !448, size: 64, offset: 1600)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !343, file: !344, line: 337, baseType: !612, size: 64, offset: 1664)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !343, file: !344, line: 338, baseType: !48, size: 64, offset: 1728)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !343, file: !344, line: 340, baseType: !153, size: 128, offset: 1792)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !343, file: !344, line: 340, baseType: !153, size: 128, offset: 1920)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !343, file: !344, line: 342, baseType: !41, size: 32, offset: 2048)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !343, file: !344, line: 342, baseType: !41, size: 32, offset: 2080)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !343, file: !344, line: 343, baseType: !41, size: 32, offset: 2112)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !343, file: !344, line: 345, baseType: !41, size: 32, offset: 2144)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !343, file: !344, line: 346, baseType: !41, size: 32, offset: 2176)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !343, file: !344, line: 347, baseType: !55, size: 16, offset: 2208)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !343, file: !344, line: 348, baseType: !55, size: 16, offset: 2224)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !343, file: !344, line: 349, baseType: !41, size: 32, offset: 2240)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !343, file: !344, line: 351, baseType: !41, size: 32, offset: 2272)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !343, file: !344, line: 353, baseType: !55, size: 16, offset: 2304)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !343, file: !344, line: 354, baseType: !55, size: 16, offset: 2320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !343, file: !344, line: 355, baseType: !41, size: 32, offset: 2336)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !343, file: !344, line: 357, baseType: !26, size: 128, offset: 2368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !343, file: !344, line: 363, baseType: !153, size: 128, offset: 2496)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !343, file: !344, line: 363, baseType: !153, size: 128, offset: 2624)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !343, file: !344, line: 368, baseType: !809, size: 64, offset: 2752)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !351, line: 500, size: 64, elements: !811)
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !810, file: !351, line: 502, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !815, line: 48, baseType: !816)
!815 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !567, line: 74, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !343, file: !344, line: 372, baseType: !614, size: 32, offset: 2816)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !343, file: !344, line: 373, baseType: !41, size: 32, offset: 2848)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !343, file: !344, line: 382, baseType: !820, size: 64, offset: 2880)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !344, line: 46, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !343, file: !344, line: 385, baseType: !823, size: 64, offset: 2944)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !89, !31}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !343, file: !344, line: 386, baseType: !827, size: 64, offset: 3008)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !89, !639}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !343, file: !344, line: 387, baseType: !831, size: 64, offset: 3072)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!41, !89}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !343, file: !344, line: 388, baseType: !504, size: 64, offset: 3136)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !343, file: !344, line: 389, baseType: !89, size: 64, offset: 3200)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !343, file: !344, line: 389, baseType: !89, size: 64, offset: 3264)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !343, file: !344, line: 389, baseType: !89, size: 64, offset: 3328)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !343, file: !344, line: 389, baseType: !89, size: 64, offset: 3392)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !270, file: !180, line: 249, baseType: !256, size: 64, offset: 2752)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !270, file: !180, line: 250, baseType: !841, size: 64, offset: 2816)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !325, line: 77, size: 15424, elements: !843)
!843 = !{!844, !845, !846, !849, !852, !855, !858, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !876, !877, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !907, !908, !912}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !842, file: !325, line: 78, baseType: !95, size: 960)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !842, file: !325, line: 80, baseType: !114, size: 8192, offset: 960)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !842, file: !325, line: 82, baseType: !847, size: 64, offset: 9152)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !325, line: 43, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !842, file: !325, line: 83, baseType: !850, size: 64, offset: 9216)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !96, line: 46, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !842, file: !325, line: 86, baseType: !853, size: 64, offset: 9280)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !325, line: 41, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !842, file: !325, line: 87, baseType: !856, size: 64, offset: 9344)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !325, line: 44, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !842, file: !325, line: 89, baseType: !859, size: 512, offset: 9408)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 512, elements: !582)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !842, file: !325, line: 90, baseType: !55, size: 16, offset: 9920)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !842, file: !325, line: 90, baseType: !55, size: 16, offset: 9936)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !842, file: !325, line: 92, baseType: !55, size: 16, offset: 9952)
