; ModuleID = 'blender/source/blender/modifiers/intern/MOD_util.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!117 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!118 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!119 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!120 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!121 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!122 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!123 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!124 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!125 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!126 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!127 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!128 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!129 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!130 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!131 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!132 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!133 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 339, baseType: !5, size: 32, elements: !136)
!135 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!137 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!138 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!139 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!140 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!141 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!142 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!143 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!144 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!145 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!146 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!147 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !149, line: 110, baseType: !5, size: 32, elements: !150)
!149 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_modifier.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = !{!151, !152, !153, !154}
!151 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!153 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!154 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !149, line: 47, baseType: !5, size: 32, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162}
!157 = !DIEnumerator(name: "eModifierTypeType_None", value: 0, isUnsigned: true)
!158 = !DIEnumerator(name: "eModifierTypeType_OnlyDeform", value: 1, isUnsigned: true)
!159 = !DIEnumerator(name: "eModifierTypeType_Constructive", value: 2, isUnsigned: true)
!160 = !DIEnumerator(name: "eModifierTypeType_Nonconstructive", value: 3, isUnsigned: true)
!161 = !DIEnumerator(name: "eModifierTypeType_DeformOrConstruct", value: 4, isUnsigned: true)
!162 = !DIEnumerator(name: "eModifierTypeType_NonGeometrical", value: 5, isUnsigned: true)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !149, line: 73, baseType: !5, size: 32, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!165 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsMesh", value: 1, isUnsigned: true)
!166 = !DIEnumerator(name: "eModifierTypeFlag_AcceptsCVs", value: 2, isUnsigned: true)
!167 = !DIEnumerator(name: "eModifierTypeFlag_SupportsMapping", value: 4, isUnsigned: true)
!168 = !DIEnumerator(name: "eModifierTypeFlag_SupportsEditmode", value: 8, isUnsigned: true)
!169 = !DIEnumerator(name: "eModifierTypeFlag_EnableInEditmode", value: 16, isUnsigned: true)
!170 = !DIEnumerator(name: "eModifierTypeFlag_RequiresOriginalData", value: 32, isUnsigned: true)
!171 = !DIEnumerator(name: "eModifierTypeFlag_UsesPointCache", value: 64, isUnsigned: true)
!172 = !DIEnumerator(name: "eModifierTypeFlag_Single", value: 128, isUnsigned: true)
!173 = !DIEnumerator(name: "eModifierTypeFlag_NoUserAdd", value: 256, isUnsigned: true)
!174 = !DIEnumerator(name: "eModifierTypeFlag_UsesPreview", value: 512, isUnsigned: true)
!175 = !{!176, !208, !1743}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ArmatureModifierData", file: !32, line: 535, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArmatureModifierData", file: !32, line: 527, size: 1600, elements: !179)
!179 = !{!180, !1737, !1738, !1739, !1740, !1741, !1742}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !178, file: !32, line: 528, baseType: !181, size: 896)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !32, line: 110, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !32, line: 99, size: 896, elements: !183)
!183 = !{!184, !186, !187, !189, !190, !191, !192, !197, !1736}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !32, line: 100, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !32, line: 100, baseType: !185, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !32, line: 102, baseType: !188, size: 32, offset: 128)
!188 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !182, file: !32, line: 102, baseType: !188, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !182, file: !32, line: 103, baseType: !188, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !182, file: !32, line: 103, baseType: !188, size: 32, offset: 224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !32, line: 104, baseType: !193, size: 512, offset: 256)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 512, elements: !195)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !{!196}
!196 = !DISubrange(count: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !182, file: !32, line: 107, baseType: !198, size: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !200, line: 1216, size: 39680, elements: !201)
!200 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!201 = !{!202, !269, !273, !1045, !1048, !1049, !1050, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1076, !1080, !1083, !1307, !1310, !1610, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1632, !1633, !1634, !1635, !1636, !1644, !1710, !1717, !1718, !1725, !1728, !1729, !1730, !1731, !1732, !1733}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !199, file: !200, line: 1217, baseType: !203, size: 960)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !204, line: 130, baseType: !205)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !204, line: 117, size: 960, elements: !206)
!206 = !{!207, !209, !210, !212, !231, !235, !237, !238, !239, !240}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !204, line: 118, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !204, line: 118, baseType: !208, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !205, file: !204, line: 119, baseType: !211, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !205, file: !204, line: 120, baseType: !213, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !204, line: 136, size: 17600, elements: !215)
!215 = !{!216, !217, !219, !222, !226, !227, !228}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !214, file: !204, line: 137, baseType: !203, size: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !214, file: !204, line: 138, baseType: !218, size: 64, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !214, file: !204, line: 139, baseType: !220, size: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !204, line: 43, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !204, line: 140, baseType: !223, size: 8192, offset: 1088)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 8192, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !214, file: !204, line: 141, baseType: !223, size: 8192, offset: 9280)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !214, file: !204, line: 148, baseType: !213, size: 64, offset: 17472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !214, file: !204, line: 150, baseType: !229, size: 64, offset: 17536)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !204, line: 45, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !204, line: 121, baseType: !232, size: 528, offset: 256)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 528, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 66)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !204, line: 126, baseType: !236, size: 16, offset: 784)
!236 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !205, file: !204, line: 127, baseType: !188, size: 32, offset: 800)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !205, file: !204, line: 128, baseType: !188, size: 32, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !205, file: !204, line: 128, baseType: !188, size: 32, offset: 864)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !205, file: !204, line: 129, baseType: !241, size: 64, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !204, line: 75, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !204, line: 62, size: 1024, elements: !244)
!244 = !{!245, !247, !248, !249, !250, !251, !252, !253, !267, !268}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !204, line: 63, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !204, line: 63, baseType: !246, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !204, line: 64, baseType: !194, size: 8, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !243, file: !204, line: 64, baseType: !194, size: 8, offset: 136)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !204, line: 65, baseType: !236, size: 16, offset: 144)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !204, line: 66, baseType: !193, size: 512, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !243, file: !204, line: 67, baseType: !188, size: 32, offset: 672)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !204, line: 69, baseType: !254, size: 256, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !204, line: 60, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !204, line: 48, size: 256, elements: !256)
!256 = !{!257, !258, !265, !266}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !255, file: !204, line: 49, baseType: !208, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !255, file: !204, line: 58, baseType: !259, size: 128, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !260, line: 71, baseType: !261)
!260 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !260, line: 69, size: 128, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !261, file: !260, line: 70, baseType: !208, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !261, file: !260, line: 70, baseType: !208, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !255, file: !204, line: 59, baseType: !188, size: 32, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !255, file: !204, line: 59, baseType: !188, size: 32, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !204, line: 70, baseType: !188, size: 32, offset: 960)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !243, file: !204, line: 74, baseType: !188, size: 32, offset: 992)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !199, file: !200, line: 1218, baseType: !270, size: 64, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !272, line: 48, flags: DIFlagFwdDecl)
!272 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !199, file: !200, line: 1220, baseType: !274, size: 64, offset: 1024)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !135, line: 115, size: 11392, elements: !276)
!276 = !{!277, !278, !279, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !296, !308, !322, !323, !366, !367, !370, !371, !387, !388, !389, !390, !391, !392, !393, !397, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !413, !414, !415, !416, !417, !418, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !478, !479, !480, !481, !482, !483, !484, !485, !486, !489, !492, !495, !496, !497, !498, !499, !502, !505, !992, !993, !999, !1000, !1001, !1002, !1003, !1004, !1006, !1009, !1012, !1014, !1033, !1034}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !275, file: !135, line: 116, baseType: !203, size: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !275, file: !135, line: 117, baseType: !270, size: 64, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !275, file: !135, line: 119, baseType: !280, size: 64, offset: 1024)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !135, line: 57, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !135, line: 121, baseType: !236, size: 16, offset: 1088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !275, file: !135, line: 121, baseType: !236, size: 16, offset: 1104)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !275, file: !135, line: 122, baseType: !188, size: 32, offset: 1120)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !275, file: !135, line: 122, baseType: !188, size: 32, offset: 1152)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !275, file: !135, line: 122, baseType: !188, size: 32, offset: 1184)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !275, file: !135, line: 123, baseType: !193, size: 512, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !275, file: !135, line: 124, baseType: !274, size: 64, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !275, file: !135, line: 124, baseType: !274, size: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !275, file: !135, line: 127, baseType: !274, size: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !275, file: !135, line: 127, baseType: !274, size: 64, offset: 1920)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !275, file: !135, line: 127, baseType: !274, size: 64, offset: 1984)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !275, file: !135, line: 128, baseType: !294, size: 64, offset: 2048)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !272, line: 44, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !275, file: !135, line: 130, baseType: !297, size: 64, offset: 2112)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !135, line: 97, size: 832, elements: !299)
!299 = !{!300, !306, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !298, file: !135, line: 98, baseType: !301, size: 768)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 768, elements: !303)
!302 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!303 = !{!304, !305}
!304 = !DISubrange(count: 8)
!305 = !DISubrange(count: 3)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !135, line: 99, baseType: !188, size: 32, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !298, file: !135, line: 99, baseType: !188, size: 32, offset: 800)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !275, file: !135, line: 131, baseType: !309, size: 64, offset: 2176)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !311, line: 486, size: 1600, elements: !312)
!311 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !310, file: !311, line: 487, baseType: !203, size: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !310, file: !311, line: 489, baseType: !259, size: 128, offset: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !310, file: !311, line: 490, baseType: !259, size: 128, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !310, file: !311, line: 491, baseType: !259, size: 128, offset: 1216)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !310, file: !311, line: 492, baseType: !259, size: 128, offset: 1344)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !310, file: !311, line: 494, baseType: !188, size: 32, offset: 1472)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !310, file: !311, line: 495, baseType: !188, size: 32, offset: 1504)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !310, file: !311, line: 497, baseType: !188, size: 32, offset: 1536)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !310, file: !311, line: 498, baseType: !188, size: 32, offset: 1568)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !275, file: !135, line: 132, baseType: !309, size: 64, offset: 2240)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !275, file: !135, line: 133, baseType: !324, size: 64, offset: 2304)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !311, line: 334, size: 1728, elements: !326)
!326 = !{!327, !328, !331, !332, !333, !334, !335, !336, !339, !340, !341, !342, !343, !344, !345, !365}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !325, file: !311, line: 335, baseType: !259, size: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !325, file: !311, line: 336, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !272, line: 51, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !311, line: 338, baseType: !236, size: 16, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !325, file: !311, line: 338, baseType: !236, size: 16, offset: 208)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !325, file: !311, line: 339, baseType: !5, size: 32, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !325, file: !311, line: 340, baseType: !188, size: 32, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !325, file: !311, line: 342, baseType: !302, size: 32, offset: 288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !325, file: !311, line: 343, baseType: !337, size: 96, offset: 320)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 96, elements: !338)
!338 = !{!305}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !325, file: !311, line: 344, baseType: !337, size: 96, offset: 416)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !325, file: !311, line: 347, baseType: !259, size: 128, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !325, file: !311, line: 349, baseType: !188, size: 32, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !325, file: !311, line: 350, baseType: !188, size: 32, offset: 672)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !325, file: !311, line: 351, baseType: !208, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !325, file: !311, line: 352, baseType: !208, size: 64, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !325, file: !311, line: 354, baseType: !346, size: 384, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !311, line: 116, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !311, line: 94, size: 384, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !347, file: !311, line: 96, baseType: !188, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !347, file: !311, line: 96, baseType: !188, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !347, file: !311, line: 97, baseType: !188, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !347, file: !311, line: 97, baseType: !188, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !347, file: !311, line: 99, baseType: !236, size: 16, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !347, file: !311, line: 100, baseType: !236, size: 16, offset: 144)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !347, file: !311, line: 102, baseType: !236, size: 16, offset: 160)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !347, file: !311, line: 105, baseType: !236, size: 16, offset: 176)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !347, file: !311, line: 108, baseType: !236, size: 16, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !347, file: !311, line: 109, baseType: !236, size: 16, offset: 208)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !347, file: !311, line: 111, baseType: !236, size: 16, offset: 224)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !347, file: !311, line: 112, baseType: !236, size: 16, offset: 240)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !347, file: !311, line: 114, baseType: !188, size: 32, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !347, file: !311, line: 114, baseType: !188, size: 32, offset: 288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !347, file: !311, line: 115, baseType: !188, size: 32, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !347, file: !311, line: 115, baseType: !188, size: 32, offset: 352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !325, file: !311, line: 355, baseType: !193, size: 512, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !135, line: 134, baseType: !208, size: 64, offset: 2368)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !275, file: !135, line: 136, baseType: !368, size: 64, offset: 2432)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !135, line: 58, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !275, file: !135, line: 138, baseType: !346, size: 384, offset: 2496)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !275, file: !135, line: 139, baseType: !372, size: 64, offset: 2880)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !311, line: 80, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !311, line: 72, size: 192, elements: !375)
!375 = !{!376, !383, !384, !385, !386}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !374, file: !311, line: 73, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !311, line: 59, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !311, line: 56, size: 128, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !379, file: !311, line: 57, baseType: !337, size: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !311, line: 58, baseType: !188, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !374, file: !311, line: 74, baseType: !188, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !374, file: !311, line: 76, baseType: !188, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !374, file: !311, line: 77, baseType: !188, size: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !374, file: !311, line: 79, baseType: !188, size: 32, offset: 160)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !275, file: !135, line: 141, baseType: !259, size: 128, offset: 2944)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !275, file: !135, line: 142, baseType: !259, size: 128, offset: 3072)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !275, file: !135, line: 143, baseType: !259, size: 128, offset: 3200)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !275, file: !135, line: 144, baseType: !259, size: 128, offset: 3328)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !275, file: !135, line: 146, baseType: !188, size: 32, offset: 3456)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !275, file: !135, line: 147, baseType: !188, size: 32, offset: 3488)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !275, file: !135, line: 150, baseType: !394, size: 64, offset: 3520)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !272, line: 46, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !275, file: !135, line: 151, baseType: !398, size: 64, offset: 3584)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !275, file: !135, line: 152, baseType: !188, size: 32, offset: 3648)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !275, file: !135, line: 153, baseType: !188, size: 32, offset: 3680)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !275, file: !135, line: 156, baseType: !337, size: 96, offset: 3712)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !275, file: !135, line: 156, baseType: !337, size: 96, offset: 3808)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !275, file: !135, line: 156, baseType: !337, size: 96, offset: 3904)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !275, file: !135, line: 157, baseType: !337, size: 96, offset: 4000)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !275, file: !135, line: 158, baseType: !337, size: 96, offset: 4096)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !275, file: !135, line: 159, baseType: !337, size: 96, offset: 4192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !275, file: !135, line: 160, baseType: !337, size: 96, offset: 4288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !275, file: !135, line: 160, baseType: !337, size: 96, offset: 4384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !275, file: !135, line: 161, baseType: !410, size: 128, offset: 4480)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 128, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 4)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !275, file: !135, line: 161, baseType: !410, size: 128, offset: 4608)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !275, file: !135, line: 162, baseType: !337, size: 96, offset: 4736)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !275, file: !135, line: 162, baseType: !337, size: 96, offset: 4832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !275, file: !135, line: 163, baseType: !302, size: 32, offset: 4928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !275, file: !135, line: 163, baseType: !302, size: 32, offset: 4960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !275, file: !135, line: 164, baseType: !419, size: 512, offset: 4992)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 512, elements: !420)
!420 = !{!412, !412}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !275, file: !135, line: 165, baseType: !419, size: 512, offset: 5504)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !275, file: !135, line: 166, baseType: !419, size: 512, offset: 6016)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !275, file: !135, line: 167, baseType: !419, size: 512, offset: 6528)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !275, file: !135, line: 176, baseType: !419, size: 512, offset: 7040)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !275, file: !135, line: 178, baseType: !5, size: 32, offset: 7552)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !135, line: 180, baseType: !236, size: 16, offset: 7584)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !275, file: !135, line: 181, baseType: !236, size: 16, offset: 7600)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !275, file: !135, line: 183, baseType: !236, size: 16, offset: 7616)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !275, file: !135, line: 183, baseType: !236, size: 16, offset: 7632)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !275, file: !135, line: 184, baseType: !236, size: 16, offset: 7648)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !275, file: !135, line: 184, baseType: !236, size: 16, offset: 7664)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !275, file: !135, line: 185, baseType: !236, size: 16, offset: 7680)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !275, file: !135, line: 186, baseType: !236, size: 16, offset: 7696)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !275, file: !135, line: 187, baseType: !236, size: 16, offset: 7712)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !275, file: !135, line: 188, baseType: !194, size: 8, offset: 7728)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !275, file: !135, line: 189, baseType: !194, size: 8, offset: 7736)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !275, file: !135, line: 192, baseType: !188, size: 32, offset: 7744)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !275, file: !135, line: 192, baseType: !188, size: 32, offset: 7776)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !275, file: !135, line: 192, baseType: !188, size: 32, offset: 7808)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !275, file: !135, line: 192, baseType: !188, size: 32, offset: 7840)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !275, file: !135, line: 194, baseType: !188, size: 32, offset: 7872)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !275, file: !135, line: 202, baseType: !302, size: 32, offset: 7904)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !275, file: !135, line: 202, baseType: !302, size: 32, offset: 7936)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !275, file: !135, line: 202, baseType: !302, size: 32, offset: 7968)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !275, file: !135, line: 211, baseType: !302, size: 32, offset: 8000)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !275, file: !135, line: 212, baseType: !302, size: 32, offset: 8032)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !275, file: !135, line: 213, baseType: !302, size: 32, offset: 8064)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !275, file: !135, line: 214, baseType: !302, size: 32, offset: 8096)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !275, file: !135, line: 215, baseType: !302, size: 32, offset: 8128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !275, file: !135, line: 216, baseType: !302, size: 32, offset: 8160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !275, file: !135, line: 219, baseType: !302, size: 32, offset: 8192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !275, file: !135, line: 220, baseType: !302, size: 32, offset: 8224)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !275, file: !135, line: 221, baseType: !302, size: 32, offset: 8256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !275, file: !135, line: 224, baseType: !455, size: 16, offset: 8288)
!455 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !275, file: !135, line: 224, baseType: !455, size: 16, offset: 8304)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !275, file: !135, line: 226, baseType: !236, size: 16, offset: 8320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !275, file: !135, line: 228, baseType: !194, size: 8, offset: 8336)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !275, file: !135, line: 229, baseType: !194, size: 8, offset: 8344)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !275, file: !135, line: 231, baseType: !236, size: 16, offset: 8352)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !275, file: !135, line: 232, baseType: !194, size: 8, offset: 8368)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !275, file: !135, line: 233, baseType: !194, size: 8, offset: 8376)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !275, file: !135, line: 234, baseType: !302, size: 32, offset: 8384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !275, file: !135, line: 235, baseType: !302, size: 32, offset: 8416)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !275, file: !135, line: 237, baseType: !259, size: 128, offset: 8448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !275, file: !135, line: 238, baseType: !259, size: 128, offset: 8576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !275, file: !135, line: 239, baseType: !259, size: 128, offset: 8704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !275, file: !135, line: 240, baseType: !259, size: 128, offset: 8832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !275, file: !135, line: 242, baseType: !302, size: 32, offset: 8960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !275, file: !135, line: 244, baseType: !236, size: 16, offset: 8992)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !275, file: !135, line: 245, baseType: !455, size: 16, offset: 9008)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !275, file: !135, line: 246, baseType: !410, size: 128, offset: 9024)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !275, file: !135, line: 248, baseType: !188, size: 32, offset: 9152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !275, file: !135, line: 249, baseType: !188, size: 32, offset: 9184)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !275, file: !135, line: 251, baseType: !476, size: 64, offset: 9216)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !135, line: 251, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !275, file: !135, line: 253, baseType: !194, size: 8, offset: 9280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !275, file: !135, line: 254, baseType: !194, size: 8, offset: 9288)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !275, file: !135, line: 255, baseType: !236, size: 16, offset: 9296)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !275, file: !135, line: 256, baseType: !337, size: 96, offset: 9312)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !275, file: !135, line: 258, baseType: !259, size: 128, offset: 9408)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !275, file: !135, line: 259, baseType: !259, size: 128, offset: 9536)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !275, file: !135, line: 260, baseType: !259, size: 128, offset: 9664)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !275, file: !135, line: 261, baseType: !259, size: 128, offset: 9792)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !275, file: !135, line: 263, baseType: !487, size: 64, offset: 9920)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !135, line: 52, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !275, file: !135, line: 264, baseType: !490, size: 64, offset: 9984)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !135, line: 53, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !275, file: !135, line: 265, baseType: !493, size: 64, offset: 10048)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !311, line: 46, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !275, file: !135, line: 267, baseType: !194, size: 8, offset: 10112)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !275, file: !135, line: 268, baseType: !194, size: 8, offset: 10120)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !275, file: !135, line: 269, baseType: !236, size: 16, offset: 10128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !275, file: !135, line: 270, baseType: !302, size: 32, offset: 10144)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !275, file: !135, line: 272, baseType: !500, size: 64, offset: 10176)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !32, line: 732, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !275, file: !135, line: 275, baseType: !503, size: 64, offset: 10240)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !135, line: 275, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !275, file: !135, line: 277, baseType: !506, size: 64, offset: 10304)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !508)
!508 = !{!509, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !560, !563, !565, !566, !568, !569, !570, !571, !577, !582, !583, !587, !588, !589, !590, !591, !604, !616, !630, !634, !638, !642, !651, !663, !667, !671, !675, !679, !683, !684, !685, !686, !687, !688, !692, !693, !694, !695, !699, !700, !701, !702, !703, !708, !709, !710, !711, !712, !716, !717, !718, !719, !720, !727, !738, !743, !749, !759, !765, !776, !783, !790, !794, !799, !803, !808, !809, !810, !817, !823, !824, !825, !830, !831, !840, !949, !953, !961, !965, !969, !973, !981, !991}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !507, file: !4, line: 180, baseType: !510, size: 1600)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !39, line: 73, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !39, line: 64, size: 1600, elements: !512)
!512 = !{!513, !528, !532, !533, !534, !535, !538}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !511, file: !39, line: 65, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !39, line: 53, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !39, line: 42, size: 832, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !516, file: !39, line: 43, baseType: !188, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !516, file: !39, line: 44, baseType: !188, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !516, file: !39, line: 45, baseType: !188, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !516, file: !39, line: 46, baseType: !188, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !516, file: !39, line: 47, baseType: !188, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !516, file: !39, line: 48, baseType: !188, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !516, file: !39, line: 49, baseType: !188, size: 32, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !516, file: !39, line: 50, baseType: !188, size: 32, offset: 224)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !516, file: !39, line: 51, baseType: !193, size: 512, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !516, file: !39, line: 52, baseType: !208, size: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !511, file: !39, line: 66, baseType: !529, size: 1312, offset: 64)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 1312, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 41)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !511, file: !39, line: 69, baseType: !188, size: 32, offset: 1376)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !511, file: !39, line: 69, baseType: !188, size: 32, offset: 1408)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !511, file: !39, line: 70, baseType: !188, size: 32, offset: 1440)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !511, file: !39, line: 71, baseType: !536, size: 64, offset: 1472)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !39, line: 71, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !511, file: !39, line: 72, baseType: !539, size: 64, offset: 1536)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !39, line: 59, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !39, line: 57, size: 8192, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !541, file: !39, line: 58, baseType: !223, size: 8192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !507, file: !4, line: 180, baseType: !510, size: 1600, offset: 1600)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !507, file: !4, line: 180, baseType: !510, size: 1600, offset: 3200)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !507, file: !4, line: 180, baseType: !510, size: 1600, offset: 4800)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !507, file: !4, line: 180, baseType: !510, size: 1600, offset: 6400)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !507, file: !4, line: 181, baseType: !188, size: 32, offset: 8000)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !507, file: !4, line: 181, baseType: !188, size: 32, offset: 8032)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !507, file: !4, line: 181, baseType: !188, size: 32, offset: 8064)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !507, file: !4, line: 181, baseType: !188, size: 32, offset: 8096)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !507, file: !4, line: 181, baseType: !188, size: 32, offset: 8128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !507, file: !4, line: 182, baseType: !188, size: 32, offset: 8160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !507, file: !4, line: 183, baseType: !188, size: 32, offset: 8192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !507, file: !4, line: 184, baseType: !556, size: 64, offset: 8256)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !557, line: 124, baseType: !558)
!557 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !557, line: 124, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !507, file: !4, line: 185, baseType: !561, size: 64, offset: 8320)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !507, file: !4, line: 186, baseType: !564, size: 32, offset: 8384)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !507, file: !4, line: 187, baseType: !302, size: 32, offset: 8416)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !507, file: !4, line: 188, baseType: !567, size: 32, offset: 8448)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !507, file: !4, line: 189, baseType: !188, size: 32, offset: 8480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !507, file: !4, line: 190, baseType: !394, size: 64, offset: 8512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !507, file: !4, line: 193, baseType: !194, size: 8, offset: 8576)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !507, file: !4, line: 196, baseType: !572, size: 64, offset: 8640)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !507)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !507, file: !4, line: 199, baseType: !578, size: 64, offset: 8704)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !575, !581}
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !507, file: !4, line: 202, baseType: !572, size: 64, offset: 8768)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !507, file: !4, line: 207, baseType: !584, size: 64, offset: 8832)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!188, !575}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !507, file: !4, line: 208, baseType: !584, size: 64, offset: 8896)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !507, file: !4, line: 209, baseType: !584, size: 64, offset: 8960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !507, file: !4, line: 210, baseType: !584, size: 64, offset: 9024)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !507, file: !4, line: 211, baseType: !584, size: 64, offset: 9088)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !507, file: !4, line: 218, baseType: !592, size: 64, offset: 9152)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !575, !188, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !597, line: 65, size: 160, elements: !598)
!597 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!598 = !{!599, !600, !602, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !596, file: !597, line: 66, baseType: !337, size: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !596, file: !597, line: 67, baseType: !601, size: 48, offset: 96)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 48, elements: !338)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !596, file: !597, line: 68, baseType: !194, size: 8, offset: 144)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !596, file: !597, line: 68, baseType: !194, size: 8, offset: 152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !507, file: !4, line: 219, baseType: !605, size: 64, offset: 9216)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !575, !188, !608}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !597, line: 48, size: 96, elements: !610)
!610 = !{!611, !612, !613, !614, !615}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !609, file: !597, line: 49, baseType: !5, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !609, file: !597, line: 49, baseType: !5, size: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !609, file: !597, line: 50, baseType: !194, size: 8, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !609, file: !597, line: 50, baseType: !194, size: 8, offset: 72)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !609, file: !597, line: 51, baseType: !236, size: 16, offset: 80)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !507, file: !4, line: 220, baseType: !617, size: 64, offset: 9280)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !575, !188, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !597, line: 42, size: 160, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !621, file: !597, line: 43, baseType: !5, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !621, file: !597, line: 43, baseType: !5, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !621, file: !597, line: 43, baseType: !5, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !621, file: !597, line: 43, baseType: !5, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !621, file: !597, line: 44, baseType: !236, size: 16, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !621, file: !597, line: 45, baseType: !194, size: 8, offset: 144)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !621, file: !597, line: 45, baseType: !194, size: 8, offset: 152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !507, file: !4, line: 227, baseType: !631, size: 64, offset: 9344)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!595, !575}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !507, file: !4, line: 228, baseType: !635, size: 64, offset: 9408)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!608, !575}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !507, file: !4, line: 229, baseType: !639, size: 64, offset: 9472)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!620, !575}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !507, file: !4, line: 230, baseType: !643, size: 64, offset: 9536)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!646, !575}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !597, line: 88, size: 64, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !647, file: !597, line: 89, baseType: !5, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !647, file: !597, line: 90, baseType: !5, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !507, file: !4, line: 231, baseType: !652, size: 64, offset: 9600)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!655, !575}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !597, line: 79, size: 96, elements: !657)
!657 = !{!658, !659, !660, !661, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !656, file: !597, line: 81, baseType: !188, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !656, file: !597, line: 82, baseType: !188, size: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !656, file: !597, line: 83, baseType: !236, size: 16, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !656, file: !597, line: 84, baseType: !194, size: 8, offset: 80)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !656, file: !597, line: 84, baseType: !194, size: 8, offset: 88)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !507, file: !4, line: 236, baseType: !664, size: 64, offset: 9664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !575, !595}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !507, file: !4, line: 237, baseType: !668, size: 64, offset: 9728)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !575, !608}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !507, file: !4, line: 238, baseType: !672, size: 64, offset: 9792)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !575, !620}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !507, file: !4, line: 239, baseType: !676, size: 64, offset: 9856)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !575, !646}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !507, file: !4, line: 240, baseType: !680, size: 64, offset: 9920)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !575, !655}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !507, file: !4, line: 245, baseType: !631, size: 64, offset: 9984)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !507, file: !4, line: 246, baseType: !635, size: 64, offset: 10048)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !507, file: !4, line: 247, baseType: !639, size: 64, offset: 10112)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !507, file: !4, line: 248, baseType: !643, size: 64, offset: 10176)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !507, file: !4, line: 249, baseType: !652, size: 64, offset: 10240)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !507, file: !4, line: 255, baseType: !689, size: 64, offset: 10304)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!208, !575, !188, !188}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !507, file: !4, line: 256, baseType: !689, size: 64, offset: 10368)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !507, file: !4, line: 257, baseType: !689, size: 64, offset: 10432)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !507, file: !4, line: 258, baseType: !689, size: 64, offset: 10496)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !507, file: !4, line: 264, baseType: !696, size: 64, offset: 10560)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!208, !575, !188}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !507, file: !4, line: 265, baseType: !696, size: 64, offset: 10624)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !507, file: !4, line: 266, baseType: !696, size: 64, offset: 10688)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !507, file: !4, line: 267, baseType: !696, size: 64, offset: 10752)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !507, file: !4, line: 268, baseType: !696, size: 64, offset: 10816)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !507, file: !4, line: 272, baseType: !704, size: 64, offset: 10880)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!707, !575}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !507, file: !4, line: 273, baseType: !704, size: 64, offset: 10944)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !507, file: !4, line: 274, baseType: !704, size: 64, offset: 11008)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !507, file: !4, line: 275, baseType: !704, size: 64, offset: 11072)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !507, file: !4, line: 276, baseType: !704, size: 64, offset: 11136)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !507, file: !4, line: 279, baseType: !713, size: 64, offset: 11200)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !575, !188, !707, !188}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !507, file: !4, line: 280, baseType: !713, size: 64, offset: 11264)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !507, file: !4, line: 281, baseType: !713, size: 64, offset: 11328)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !507, file: !4, line: 284, baseType: !584, size: 64, offset: 11392)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !507, file: !4, line: 285, baseType: !584, size: 64, offset: 11456)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !507, file: !4, line: 286, baseType: !721, size: 64, offset: 11520)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!724, !575}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !507, file: !4, line: 287, baseType: !728, size: 64, offset: 11584)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!731, !575}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !734)
!734 = !{!735, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !733, file: !4, line: 118, baseType: !736, size: 128)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !411)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !733, file: !4, line: 119, baseType: !736, size: 128, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !507, file: !4, line: 288, baseType: !739, size: 64, offset: 11648)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !575}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !507, file: !4, line: 289, baseType: !744, size: 64, offset: 11712)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !575, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !507, file: !4, line: 290, baseType: !750, size: 64, offset: 11776)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!753, !575}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !755, file: !4, line: 124, baseType: !236, size: 16)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !755, file: !4, line: 125, baseType: !194, size: 8, offset: 16)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !507, file: !4, line: 291, baseType: !760, size: 64, offset: 11840)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!763, !575}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !507, file: !4, line: 299, baseType: !766, size: 64, offset: 11904)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !575, !769, !208, !775}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !208, !188, !772, !772, !773}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !4, line: 162, baseType: !15)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !507, file: !4, line: 309, baseType: !777, size: 64, offset: 11968)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !575, !780, !208}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !208, !188, !772, !772}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !507, file: !4, line: 317, baseType: !784, size: 64, offset: 12032)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !575, !787, !208, !775}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !208, !188, !188, !772, !772}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !507, file: !4, line: 327, baseType: !791, size: 64, offset: 12096)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !575, !780, !208, !775}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !507, file: !4, line: 337, baseType: !795, size: 64, offset: 12160)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !575, !798, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !507, file: !4, line: 344, baseType: !800, size: 64, offset: 12224)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !575, !188, !798}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !507, file: !4, line: 347, baseType: !804, size: 64, offset: 12288)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !575, !807}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !507, file: !4, line: 350, baseType: !800, size: 64, offset: 12352)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !507, file: !4, line: 351, baseType: !800, size: 64, offset: 12416)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !507, file: !4, line: 355, baseType: !811, size: 64, offset: 12480)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!814, !274, !575}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !816)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !4, line: 355, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !507, file: !4, line: 359, baseType: !818, size: 64, offset: 12544)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!821, !274, !575}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !4, line: 100, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !507, file: !4, line: 364, baseType: !572, size: 64, offset: 12608)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !507, file: !4, line: 367, baseType: !572, size: 64, offset: 12672)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !507, file: !4, line: 373, baseType: !826, size: 64, offset: 12736)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !575, !829, !829}
!829 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !507, file: !4, line: 376, baseType: !572, size: 64, offset: 12800)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !507, file: !4, line: 385, baseType: !832, size: 64, offset: 12864)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !575, !835, !829, !836}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !4, line: 146, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!188, !188, !208}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !507, file: !4, line: 391, baseType: !841, size: 64, offset: 12928)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !575, !844, !944, !208, !948}
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !4, line: 150, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!848, !849, !943, !188}
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !4, line: 143, baseType: !19)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !597, line: 160, size: 384, elements: !851)
!851 = !{!852, !856, !938, !939, !940, !941, !942}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !850, file: !597, line: 161, baseType: !853, size: 256)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 256, elements: !854)
!854 = !{!412, !855}
!855 = !DISubrange(count: 2)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !850, file: !597, line: 162, baseType: !857, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !859, line: 77, size: 15424, elements: !860)
!859 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!860 = !{!861, !862, !863, !866, !869, !872, !875, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !927, !928, !932}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !858, file: !859, line: 78, baseType: !203, size: 960)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !858, file: !859, line: 80, baseType: !223, size: 8192, offset: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !858, file: !859, line: 82, baseType: !864, size: 64, offset: 9152)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !859, line: 43, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !858, file: !859, line: 83, baseType: !867, size: 64, offset: 9216)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !204, line: 46, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !858, file: !859, line: 86, baseType: !870, size: 64, offset: 9280)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !859, line: 41, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !858, file: !859, line: 87, baseType: !873, size: 64, offset: 9344)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !859, line: 44, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !858, file: !859, line: 89, baseType: !876, size: 512, offset: 9408)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !873, size: 512, elements: !877)
!877 = !{!304}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !858, file: !859, line: 90, baseType: !236, size: 16, offset: 9920)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !858, file: !859, line: 90, baseType: !236, size: 16, offset: 9936)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !858, file: !859, line: 92, baseType: !236, size: 16, offset: 9952)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !858, file: !859, line: 92, baseType: !236, size: 16, offset: 9968)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !858, file: !859, line: 93, baseType: !236, size: 16, offset: 9984)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !858, file: !859, line: 93, baseType: !236, size: 16, offset: 10000)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !858, file: !859, line: 94, baseType: !188, size: 32, offset: 10016)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !858, file: !859, line: 97, baseType: !236, size: 16, offset: 10048)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !858, file: !859, line: 97, baseType: !236, size: 16, offset: 10064)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !858, file: !859, line: 98, baseType: !236, size: 16, offset: 10080)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !858, file: !859, line: 98, baseType: !236, size: 16, offset: 10096)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !858, file: !859, line: 99, baseType: !236, size: 16, offset: 10112)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !858, file: !859, line: 99, baseType: !236, size: 16, offset: 10128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !858, file: !859, line: 100, baseType: !5, size: 32, offset: 10144)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !858, file: !859, line: 101, baseType: !764, size: 64, offset: 10176)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !858, file: !859, line: 103, baseType: !229, size: 64, offset: 10240)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !858, file: !859, line: 104, baseType: !895, size: 64, offset: 10304)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !204, line: 159, size: 448, elements: !897)
!897 = !{!898, !901, !902, !904, !905, !907}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !896, file: !204, line: 161, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !900)
!900 = !{!855}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !896, file: !204, line: 162, baseType: !899, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !896, file: !204, line: 163, baseType: !903, size: 32, offset: 128)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 32, elements: !900)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !896, file: !204, line: 164, baseType: !903, size: 32, offset: 160)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !896, file: !204, line: 165, baseType: !906, size: 128, offset: 192)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 128, elements: !900)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !896, file: !204, line: 166, baseType: !908, size: 128, offset: 320)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 128, elements: !900)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !858, file: !859, line: 107, baseType: !302, size: 32, offset: 10368)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !858, file: !859, line: 108, baseType: !188, size: 32, offset: 10400)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !858, file: !859, line: 109, baseType: !236, size: 16, offset: 10432)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !858, file: !859, line: 110, baseType: !236, size: 16, offset: 10448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !858, file: !859, line: 113, baseType: !188, size: 32, offset: 10464)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !858, file: !859, line: 113, baseType: !188, size: 32, offset: 10496)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !858, file: !859, line: 114, baseType: !194, size: 8, offset: 10528)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !858, file: !859, line: 114, baseType: !194, size: 8, offset: 10536)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !858, file: !859, line: 115, baseType: !236, size: 16, offset: 10544)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !858, file: !859, line: 116, baseType: !410, size: 128, offset: 10560)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !858, file: !859, line: 119, baseType: !302, size: 32, offset: 10688)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !858, file: !859, line: 119, baseType: !302, size: 32, offset: 10720)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !858, file: !859, line: 122, baseType: !922, size: 512, offset: 10752)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !923, line: 182, baseType: !924)
!923 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !923, line: 180, size: 512, elements: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !924, file: !923, line: 181, baseType: !193, size: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !858, file: !859, line: 123, baseType: !194, size: 8, offset: 11264)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !858, file: !859, line: 125, baseType: !929, size: 56, offset: 11272)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 56, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 7)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !858, file: !859, line: 126, baseType: !933, size: 4096, offset: 11328)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 4096, elements: !877)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !859, line: 69, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !859, line: 67, size: 512, elements: !936)
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !859, line: 68, baseType: !193, size: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !850, file: !597, line: 163, baseType: !194, size: 8, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !850, file: !597, line: 163, baseType: !194, size: 8, offset: 328)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !850, file: !597, line: 164, baseType: !236, size: 16, offset: 336)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !850, file: !597, line: 164, baseType: !236, size: 16, offset: 352)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !850, file: !597, line: 164, baseType: !236, size: 16, offset: 368)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !4, line: 147, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!188, !208, !188, !188}
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !4, line: 157, baseType: !25)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !507, file: !4, line: 400, baseType: !950, size: 64, offset: 12992)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !575, !836}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !507, file: !4, line: 415, baseType: !954, size: 64, offset: 13056)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !575, !957, !836, !944, !208, !948}
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !4, line: 149, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!848, !208, !188}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !507, file: !4, line: 425, baseType: !962, size: 64, offset: 13120)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !575, !957, !944, !208, !948}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !507, file: !4, line: 435, baseType: !966, size: 64, offset: 13184)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !575, !836, !957, !208}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !507, file: !4, line: 444, baseType: !970, size: 64, offset: 13248)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !575, !957, !208}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !507, file: !4, line: 455, baseType: !974, size: 64, offset: 13312)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !575, !957, !977, !208}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !4, line: 148, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !208, !188, !302}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !507, file: !4, line: 464, baseType: !982, size: 64, offset: 13376)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !575, !985, !988, !208}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !208, !188, !208}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!829, !208, !188}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !507, file: !4, line: 470, baseType: !572, size: 64, offset: 13440)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !275, file: !135, line: 277, baseType: !506, size: 64, offset: 10368)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !275, file: !135, line: 278, baseType: !994, size: 64, offset: 10432)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !995, line: 27, baseType: !996)
!995 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !997, line: 45, baseType: !998)
!997 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!998 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !275, file: !135, line: 279, baseType: !994, size: 64, offset: 10496)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !275, file: !135, line: 280, baseType: !5, size: 32, offset: 10560)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !275, file: !135, line: 281, baseType: !5, size: 32, offset: 10592)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !275, file: !135, line: 283, baseType: !259, size: 128, offset: 10624)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !275, file: !135, line: 284, baseType: !259, size: 128, offset: 10752)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !275, file: !135, line: 285, baseType: !1005, size: 64, offset: 10880)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !275, file: !135, line: 287, baseType: !1007, size: 64, offset: 10944)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !135, line: 59, flags: DIFlagFwdDecl)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !275, file: !135, line: 288, baseType: !1010, size: 64, offset: 11008)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !135, line: 288, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !275, file: !135, line: 290, baseType: !1013, size: 64, offset: 11072)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 64, elements: !900)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !275, file: !135, line: 291, baseType: !1015, size: 64, offset: 11136)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !859, line: 65, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !859, line: 50, size: 320, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1017, file: !859, line: 51, baseType: !198, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1017, file: !859, line: 53, baseType: !188, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1017, file: !859, line: 54, baseType: !188, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1017, file: !859, line: 55, baseType: !188, size: 32, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1017, file: !859, line: 55, baseType: !188, size: 32, offset: 160)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1017, file: !859, line: 56, baseType: !194, size: 8, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1017, file: !859, line: 56, baseType: !194, size: 8, offset: 200)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1017, file: !859, line: 57, baseType: !194, size: 8, offset: 208)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1017, file: !859, line: 57, baseType: !194, size: 8, offset: 216)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1017, file: !859, line: 59, baseType: !236, size: 16, offset: 224)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1017, file: !859, line: 59, baseType: !236, size: 16, offset: 240)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1017, file: !859, line: 59, baseType: !236, size: 16, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1017, file: !859, line: 61, baseType: !236, size: 16, offset: 272)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1017, file: !859, line: 63, baseType: !188, size: 32, offset: 288)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !275, file: !135, line: 293, baseType: !259, size: 128, offset: 11200)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !275, file: !135, line: 294, baseType: !1035, size: 64, offset: 11328)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !135, line: 113, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !135, line: 108, size: 256, elements: !1038)
!1038 = !{!1039, !1041, !1042, !1043, !1044}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1037, file: !135, line: 109, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1037, file: !135, line: 109, baseType: !1040, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1037, file: !135, line: 110, baseType: !274, size: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1037, file: !135, line: 111, baseType: !188, size: 32, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1037, file: !135, line: 112, baseType: !302, size: 32, offset: 224)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !199, file: !200, line: 1221, baseType: !1046, size: 64, offset: 1088)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !200, line: 52, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !199, file: !200, line: 1223, baseType: !198, size: 64, offset: 1152)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !199, file: !200, line: 1225, baseType: !259, size: 128, offset: 1216)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !199, file: !200, line: 1226, baseType: !1051, size: 64, offset: 1344)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !200, line: 69, size: 320, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1052, file: !200, line: 70, baseType: !1051, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1052, file: !200, line: 70, baseType: !1051, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1052, file: !200, line: 71, baseType: !5, size: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1052, file: !200, line: 71, baseType: !5, size: 32, offset: 160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1052, file: !200, line: 72, baseType: !188, size: 32, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1052, file: !200, line: 73, baseType: !236, size: 16, offset: 224)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1052, file: !200, line: 73, baseType: !236, size: 16, offset: 240)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1052, file: !200, line: 74, baseType: !274, size: 64, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !199, file: !200, line: 1227, baseType: !274, size: 64, offset: 1408)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !199, file: !200, line: 1229, baseType: !337, size: 96, offset: 1472)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !199, file: !200, line: 1230, baseType: !337, size: 96, offset: 1568)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !199, file: !200, line: 1231, baseType: !337, size: 96, offset: 1664)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !199, file: !200, line: 1231, baseType: !337, size: 96, offset: 1760)
