; ModuleID = 'blender/source/blender/editors/space_outliner/outliner_tree.c'
source_filename = "blender/source/blender/editors/space_outliner/outliner_tree.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!106 = !DIEnumerator(name: "eModifierType_Explode", value: 21, isUnsigned: true)
!107 = !DIEnumerator(name: "eModifierType_Cloth", value: 22, isUnsigned: true)
!108 = !DIEnumerator(name: "eModifierType_Collision", value: 23, isUnsigned: true)
!109 = !DIEnumerator(name: "eModifierType_Bevel", value: 24, isUnsigned: true)
!110 = !DIEnumerator(name: "eModifierType_Shrinkwrap", value: 25, isUnsigned: true)
!111 = !DIEnumerator(name: "eModifierType_Fluidsim", value: 26, isUnsigned: true)
!112 = !DIEnumerator(name: "eModifierType_Mask", value: 27, isUnsigned: true)
!113 = !DIEnumerator(name: "eModifierType_SimpleDeform", value: 28, isUnsigned: true)
!114 = !DIEnumerator(name: "eModifierType_Multires", value: 29, isUnsigned: true)
!115 = !DIEnumerator(name: "eModifierType_Surface", value: 30, isUnsigned: true)
!116 = !DIEnumerator(name: "eModifierType_Smoke", value: 31, isUnsigned: true)
!117 = !DIEnumerator(name: "eModifierType_ShapeKey", value: 32, isUnsigned: true)
!118 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!119 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!120 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!121 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!122 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!123 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!124 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!125 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!126 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!127 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!128 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!129 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!130 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!131 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!132 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!133 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!134 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ScenePassType", file: !136, line: 213, baseType: !137, size: 32, elements: !138)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!139 = !DIEnumerator(name: "SCE_PASS_COMBINED", value: 1)
!140 = !DIEnumerator(name: "SCE_PASS_Z", value: 2)
!141 = !DIEnumerator(name: "SCE_PASS_RGBA", value: 4)
!142 = !DIEnumerator(name: "SCE_PASS_DIFFUSE", value: 8)
!143 = !DIEnumerator(name: "SCE_PASS_SPEC", value: 16)
!144 = !DIEnumerator(name: "SCE_PASS_SHADOW", value: 32)
!145 = !DIEnumerator(name: "SCE_PASS_AO", value: 64)
!146 = !DIEnumerator(name: "SCE_PASS_REFLECT", value: 128)
!147 = !DIEnumerator(name: "SCE_PASS_NORMAL", value: 256)
!148 = !DIEnumerator(name: "SCE_PASS_VECTOR", value: 512)
!149 = !DIEnumerator(name: "SCE_PASS_REFRACT", value: 1024)
!150 = !DIEnumerator(name: "SCE_PASS_INDEXOB", value: 2048)
!151 = !DIEnumerator(name: "SCE_PASS_UV", value: 4096)
!152 = !DIEnumerator(name: "SCE_PASS_INDIRECT", value: 8192)
!153 = !DIEnumerator(name: "SCE_PASS_MIST", value: 16384)
!154 = !DIEnumerator(name: "SCE_PASS_RAYHITS", value: 32768)
!155 = !DIEnumerator(name: "SCE_PASS_EMIT", value: 65536)
!156 = !DIEnumerator(name: "SCE_PASS_ENVIRONMENT", value: 131072)
!157 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!158 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!159 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!160 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!161 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!162 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!163 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!164 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!165 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!166 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!167 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!168 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!169 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!170 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!171 = !{!172, !173, !242, !244, !288, !289, !290, !291, !298, !368, !398, !2306, !2328, !2330, !2332, !2497, !2600, !2649, !2651, !2653, !2678, !2758, !2778, !2780, !2782, !2874, !2876, !2926, !2971, !2993, !3002, !3013, !3028, !137}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !175, line: 130, baseType: !176)
!175 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !175, line: 117, size: 960, elements: !177)
!177 = !{!178, !179, !180, !182, !201, !205, !207, !208, !209, !210}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !175, line: 118, baseType: !172, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !176, file: !175, line: 118, baseType: !172, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !176, file: !175, line: 119, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !176, file: !175, line: 120, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !175, line: 136, size: 17600, elements: !185)
!185 = !{!186, !187, !188, !191, !196, !197, !198}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !184, file: !175, line: 137, baseType: !174, size: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !184, file: !175, line: 138, baseType: !173, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !184, file: !175, line: 139, baseType: !189, size: 64, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !175, line: 43, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !175, line: 140, baseType: !192, size: 8192, offset: 1088)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 8192, elements: !194)
!193 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!194 = !{!195}
!195 = !DISubrange(count: 1024)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !184, file: !175, line: 141, baseType: !192, size: 8192, offset: 9280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !184, file: !175, line: 148, baseType: !183, size: 64, offset: 17472)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !184, file: !175, line: 150, baseType: !199, size: 64, offset: 17536)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !175, line: 45, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !176, file: !175, line: 121, baseType: !202, size: 528, offset: 256)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 528, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 66)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !176, file: !175, line: 126, baseType: !206, size: 16, offset: 784)
!206 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !176, file: !175, line: 127, baseType: !137, size: 32, offset: 800)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !176, file: !175, line: 128, baseType: !137, size: 32, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !176, file: !175, line: 128, baseType: !137, size: 32, offset: 864)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !176, file: !175, line: 129, baseType: !211, size: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !175, line: 75, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !175, line: 62, size: 1024, elements: !214)
!214 = !{!215, !217, !218, !219, !220, !221, !225, !226, !240, !241}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !175, line: 63, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !213, file: !175, line: 63, baseType: !216, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !175, line: 64, baseType: !193, size: 8, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !213, file: !175, line: 64, baseType: !193, size: 8, offset: 136)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !213, file: !175, line: 65, baseType: !206, size: 16, offset: 144)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !175, line: 66, baseType: !222, size: 512, offset: 160)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 512, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !213, file: !175, line: 67, baseType: !137, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !175, line: 69, baseType: !227, size: 256, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !175, line: 60, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !175, line: 48, size: 256, elements: !229)
!229 = !{!230, !231, !238, !239}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !228, file: !175, line: 49, baseType: !172, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !228, file: !175, line: 58, baseType: !232, size: 128, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !233, line: 71, baseType: !234)
!233 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !233, line: 69, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !234, file: !233, line: 70, baseType: !172, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !234, file: !233, line: 70, baseType: !172, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !228, file: !175, line: 59, baseType: !137, size: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !228, file: !175, line: 59, baseType: !137, size: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !213, file: !175, line: 70, baseType: !137, size: 32, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !213, file: !175, line: 74, baseType: !137, size: 32, offset: 992)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Library", file: !175, line: 151, baseType: !184)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeElement", file: !246, line: 60, baseType: !247)
!246 = !DIFile(filename: "blender/source/blender/editors/space_outliner/outliner_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TreeElement", file: !246, line: 48, size: 832, elements: !248)
!248 = !{!249, !251, !252, !253, !254, !255, !256, !267, !268, !269, !270, !271, !274, !275}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !246, line: 49, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !247, file: !246, line: 49, baseType: !250, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !247, file: !246, line: 49, baseType: !250, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "subtree", scope: !247, file: !246, line: 50, baseType: !232, size: 128, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "xs", scope: !247, file: !246, line: 51, baseType: !137, size: 32, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ys", scope: !247, file: !246, line: 51, baseType: !137, size: 32, offset: 352)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "store_elem", scope: !247, file: !246, line: 52, baseType: !257, size: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeStoreElem", file: !259, line: 42, baseType: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_outliner_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TreeStoreElem", file: !259, line: 39, size: 128, elements: !261)
!261 = !{!262, !263, !264, !265, !266}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !259, line: 40, baseType: !206, size: 16)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !260, file: !259, line: 40, baseType: !206, size: 16, offset: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !259, line: 40, baseType: !206, size: 16, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !260, file: !259, line: 40, baseType: !206, size: 16, offset: 48)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !260, file: !259, line: 41, baseType: !181, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !246, line: 53, baseType: !206, size: 16, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !247, file: !246, line: 54, baseType: !206, size: 16, offset: 464)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "idcode", scope: !247, file: !246, line: 55, baseType: !206, size: 16, offset: 480)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "xend", scope: !247, file: !246, line: 56, baseType: !206, size: 16, offset: 496)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !247, file: !246, line: 57, baseType: !272, size: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "directdata", scope: !247, file: !246, line: 58, baseType: !172, size: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "rnaptr", scope: !247, file: !246, line: 59, baseType: !276, size: 192, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !62, line: 62, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !62, line: 55, size: 192, elements: !278)
!278 = !{!279, !283, !287}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !277, file: !62, line: 58, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !277, file: !62, line: 56, size: 64, elements: !281)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !62, line: 57, baseType: !172, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !62, line: 60, baseType: !284, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !286, line: 49, flags: DIFlagFwdDecl)
!286 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_fcurve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !62, line: 61, baseType: !172, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "IdAdtTemplate", file: !293, line: 914, baseType: !294)
!293 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IdAdtTemplate", file: !293, line: 911, size: 1024, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !294, file: !293, line: 912, baseType: !174, size: 960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !294, file: !293, line: 913, baseType: !298, size: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimData", file: !293, line: 869, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !293, line: 838, size: 768, elements: !301)
!301 = !{!302, !317, !318, !328, !329, !361, !362, !363, !364, !365, !366, !367}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !300, file: !293, line: 840, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !305, line: 499, baseType: !306)
!305 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !305, line: 486, size: 1600, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !306, file: !305, line: 487, baseType: !174, size: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !306, file: !305, line: 489, baseType: !232, size: 128, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !306, file: !305, line: 490, baseType: !232, size: 128, offset: 1088)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !306, file: !305, line: 491, baseType: !232, size: 128, offset: 1216)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !306, file: !305, line: 492, baseType: !232, size: 128, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !306, file: !305, line: 494, baseType: !137, size: 32, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !306, file: !305, line: 495, baseType: !137, size: 32, offset: 1504)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !306, file: !305, line: 497, baseType: !137, size: 32, offset: 1536)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !306, file: !305, line: 498, baseType: !137, size: 32, offset: 1568)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !300, file: !293, line: 844, baseType: !303, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !300, file: !293, line: 848, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !293, line: 549, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !293, line: 544, size: 320, elements: !322)
!322 = !{!323, !325, !326, !327}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !293, line: 545, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !321, file: !293, line: 545, baseType: !324, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !321, file: !293, line: 547, baseType: !303, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !321, file: !293, line: 548, baseType: !232, size: 128, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !300, file: !293, line: 851, baseType: !232, size: 128, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !300, file: !293, line: 853, baseType: !330, size: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !293, line: 594, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !293, line: 561, size: 1664, elements: !333)
!333 = !{!334, !336, !337, !338, !339, !340, !341, !342, !343, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !293, line: 562, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !332, file: !293, line: 562, baseType: !335, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !332, file: !293, line: 564, baseType: !232, size: 128, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !332, file: !293, line: 565, baseType: !303, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !332, file: !293, line: 566, baseType: !319, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !332, file: !293, line: 568, baseType: !232, size: 128, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !332, file: !293, line: 569, baseType: !232, size: 128, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !293, line: 571, baseType: !222, size: 512, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !332, file: !293, line: 573, baseType: !344, size: 32, offset: 1152)
!344 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !332, file: !293, line: 574, baseType: !344, size: 32, offset: 1184)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !332, file: !293, line: 576, baseType: !344, size: 32, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !332, file: !293, line: 576, baseType: !344, size: 32, offset: 1248)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !332, file: !293, line: 577, baseType: !344, size: 32, offset: 1280)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !332, file: !293, line: 577, baseType: !344, size: 32, offset: 1312)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !332, file: !293, line: 579, baseType: !344, size: 32, offset: 1344)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !332, file: !293, line: 580, baseType: !344, size: 32, offset: 1376)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !332, file: !293, line: 582, baseType: !344, size: 32, offset: 1408)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !332, file: !293, line: 582, baseType: !344, size: 32, offset: 1440)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !332, file: !293, line: 583, baseType: !206, size: 16, offset: 1472)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !332, file: !293, line: 585, baseType: !206, size: 16, offset: 1488)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !332, file: !293, line: 586, baseType: !206, size: 16, offset: 1504)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !293, line: 588, baseType: !206, size: 16, offset: 1520)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !332, file: !293, line: 590, baseType: !172, size: 64, offset: 1536)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !293, line: 592, baseType: !137, size: 32, offset: 1600)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !332, file: !293, line: 593, baseType: !137, size: 32, offset: 1632)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !300, file: !293, line: 858, baseType: !232, size: 128, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !300, file: !293, line: 859, baseType: !232, size: 128, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !300, file: !293, line: 862, baseType: !137, size: 32, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !300, file: !293, line: 863, baseType: !137, size: 32, offset: 672)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !300, file: !293, line: 866, baseType: !206, size: 16, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !300, file: !293, line: 867, baseType: !206, size: 16, offset: 720)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !300, file: !293, line: 868, baseType: !344, size: 32, offset: 736)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !33, line: 190, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !33, line: 126, size: 2816, elements: !371)
!371 = !{!372, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !474, !478, !2277, !2278, !2279, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !33, line: 127, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !370, file: !33, line: 127, baseType: !373, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !370, file: !33, line: 128, baseType: !172, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !370, file: !33, line: 129, baseType: !172, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !33, line: 130, baseType: !222, size: 512, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !33, line: 132, baseType: !137, size: 32, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !370, file: !33, line: 132, baseType: !137, size: 32, offset: 800)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !370, file: !33, line: 133, baseType: !137, size: 32, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !370, file: !33, line: 134, baseType: !137, size: 32, offset: 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !370, file: !33, line: 134, baseType: !137, size: 32, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !370, file: !33, line: 134, baseType: !137, size: 32, offset: 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !370, file: !33, line: 135, baseType: !137, size: 32, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !370, file: !33, line: 135, baseType: !137, size: 32, offset: 992)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !370, file: !33, line: 136, baseType: !137, size: 32, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !370, file: !33, line: 136, baseType: !137, size: 32, offset: 1056)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !370, file: !33, line: 137, baseType: !137, size: 32, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !370, file: !33, line: 137, baseType: !137, size: 32, offset: 1120)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !370, file: !33, line: 138, baseType: !344, size: 32, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !370, file: !33, line: 139, baseType: !344, size: 32, offset: 1184)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !370, file: !33, line: 139, baseType: !344, size: 32, offset: 1216)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !370, file: !33, line: 141, baseType: !206, size: 16, offset: 1248)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !370, file: !33, line: 142, baseType: !206, size: 16, offset: 1264)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !370, file: !33, line: 143, baseType: !137, size: 32, offset: 1280)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !370, file: !33, line: 144, baseType: !137, size: 32, offset: 1312)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !370, file: !33, line: 146, baseType: !398, size: 64, offset: 1344)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !33, line: 114, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !33, line: 99, size: 7232, elements: !401)
!401 = !{!402, !404, !405, !406, !407, !408, !409, !420, !424, !439, !448, !455, !468}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !33, line: 100, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !400, file: !33, line: 100, baseType: !403, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !400, file: !33, line: 101, baseType: !137, size: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !400, file: !33, line: 101, baseType: !137, size: 32, offset: 160)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !400, file: !33, line: 102, baseType: !137, size: 32, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !400, file: !33, line: 102, baseType: !137, size: 32, offset: 224)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !400, file: !33, line: 103, baseType: !410, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !33, line: 59, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !33, line: 56, size: 2112, elements: !413)
!413 = !{!414, !418, !419}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !33, line: 57, baseType: !415, size: 2048)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 2048, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !412, file: !33, line: 58, baseType: !137, size: 32, offset: 2048)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !412, file: !33, line: 58, baseType: !137, size: 32, offset: 2080)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !400, file: !33, line: 106, baseType: !421, size: 6144, offset: 320)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 6144, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 768)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !400, file: !33, line: 107, baseType: !425, size: 64, offset: 6464)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !33, line: 97, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !33, line: 83, size: 8320, elements: !428)
!428 = !{!429, !430, !431, !435, !436, !437, !438}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !427, file: !33, line: 84, baseType: !421, size: 6144)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !427, file: !33, line: 87, baseType: !415, size: 2048, offset: 6144)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !427, file: !33, line: 88, baseType: !432, size: 64, offset: 8192)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !434, line: 41, flags: DIFlagFwdDecl)
!434 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !427, file: !33, line: 90, baseType: !206, size: 16, offset: 8256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !427, file: !33, line: 92, baseType: !206, size: 16, offset: 8272)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !427, file: !33, line: 93, baseType: !206, size: 16, offset: 8288)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !427, file: !33, line: 95, baseType: !206, size: 16, offset: 8304)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !400, file: !33, line: 108, baseType: !440, size: 64, offset: 6528)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !33, line: 66, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !33, line: 61, size: 128, elements: !443)
!443 = !{!444, !445, !446, !447}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !442, file: !33, line: 62, baseType: !137, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !442, file: !33, line: 63, baseType: !137, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !442, file: !33, line: 64, baseType: !137, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !442, file: !33, line: 65, baseType: !137, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !400, file: !33, line: 109, baseType: !449, size: 64, offset: 6592)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !33, line: 71, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !33, line: 68, size: 64, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !451, file: !33, line: 69, baseType: !137, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !451, file: !33, line: 70, baseType: !137, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !400, file: !33, line: 110, baseType: !456, size: 64, offset: 6656)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !33, line: 81, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !33, line: 73, size: 352, elements: !459)
!459 = !{!460, !464, !465, !466, !467}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !458, file: !33, line: 74, baseType: !461, size: 96)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 96, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 3)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !458, file: !33, line: 75, baseType: !461, size: 96, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !458, file: !33, line: 76, baseType: !461, size: 96, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !33, line: 77, baseType: !137, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !458, file: !33, line: 78, baseType: !137, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !400, file: !33, line: 113, baseType: !469, size: 512, offset: 6720)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !470, line: 182, baseType: !471)
!470 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !470, line: 180, size: 512, elements: !472)
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !471, file: !470, line: 181, baseType: !222, size: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !370, file: !33, line: 148, baseType: !475, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !477, line: 46, flags: DIFlagFwdDecl)
!477 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !370, file: !33, line: 151, baseType: !479, size: 64, offset: 1472)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !136, line: 1216, size: 39680, elements: !481)
!481 = !{!482, !483, !485, !1363, !1444, !1445, !1446, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1485, !1700, !1703, !1949, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1971, !1972, !1973, !1974, !1975, !1983, !2049, !2056, !2057, !2064, !2269, !2270, !2271, !2272, !2273, !2274}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !480, file: !136, line: 1217, baseType: !174, size: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !480, file: !136, line: 1218, baseType: !484, size: 64, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !480, file: !136, line: 1220, baseType: !486, size: 64, offset: 1024)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !72, line: 115, size: 11392, elements: !488)
!488 = !{!489, !490, !491, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !516, !518, !519, !560, !561, !564, !565, !581, !582, !583, !584, !585, !586, !587, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1309, !1312, !1313, !1314, !1315, !1316, !1317, !1320, !1323, !1327, !1328, !1334, !1335, !1336, !1337, !1338, !1339, !1341, !1344, !1347, !1348, !1351, !1352}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !487, file: !72, line: 116, baseType: !174, size: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !487, file: !72, line: 117, baseType: !484, size: 64, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !487, file: !72, line: 119, baseType: !492, size: 64, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !72, line: 57, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !487, file: !72, line: 121, baseType: !206, size: 16, offset: 1088)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !487, file: !72, line: 121, baseType: !206, size: 16, offset: 1104)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !487, file: !72, line: 122, baseType: !137, size: 32, offset: 1120)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !487, file: !72, line: 122, baseType: !137, size: 32, offset: 1152)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !487, file: !72, line: 122, baseType: !137, size: 32, offset: 1184)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !487, file: !72, line: 123, baseType: !222, size: 512, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !487, file: !72, line: 124, baseType: !486, size: 64, offset: 1728)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !487, file: !72, line: 124, baseType: !486, size: 64, offset: 1792)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !487, file: !72, line: 127, baseType: !486, size: 64, offset: 1856)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !487, file: !72, line: 127, baseType: !486, size: 64, offset: 1920)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !487, file: !72, line: 127, baseType: !486, size: 64, offset: 1984)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !487, file: !72, line: 128, baseType: !475, size: 64, offset: 2048)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !487, file: !72, line: 130, baseType: !507, size: 64, offset: 2112)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !72, line: 97, size: 832, elements: !509)
!509 = !{!510, !514, !515}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !508, file: !72, line: 98, baseType: !511, size: 768)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 768, elements: !512)
!512 = !{!513, !463}
!513 = !DISubrange(count: 8)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !508, file: !72, line: 99, baseType: !137, size: 32, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !508, file: !72, line: 99, baseType: !137, size: 32, offset: 800)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !487, file: !72, line: 131, baseType: !517, size: 64, offset: 2176)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !487, file: !72, line: 132, baseType: !517, size: 64, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !487, file: !72, line: 133, baseType: !520, size: 64, offset: 2304)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !305, line: 334, size: 1728, elements: !522)
!522 = !{!523, !524, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !559}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !521, file: !305, line: 335, baseType: !232, size: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !521, file: !305, line: 336, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !305, line: 47, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !305, line: 338, baseType: !206, size: 16, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !521, file: !305, line: 338, baseType: !206, size: 16, offset: 208)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !521, file: !305, line: 339, baseType: !5, size: 32, offset: 224)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !521, file: !305, line: 340, baseType: !137, size: 32, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !521, file: !305, line: 342, baseType: !344, size: 32, offset: 288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !521, file: !305, line: 343, baseType: !461, size: 96, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !521, file: !305, line: 344, baseType: !461, size: 96, offset: 416)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !521, file: !305, line: 347, baseType: !232, size: 128, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !521, file: !305, line: 349, baseType: !137, size: 32, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !521, file: !305, line: 350, baseType: !137, size: 32, offset: 672)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !521, file: !305, line: 351, baseType: !172, size: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !521, file: !305, line: 352, baseType: !172, size: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !521, file: !305, line: 354, baseType: !540, size: 384, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !305, line: 116, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !305, line: 94, size: 384, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !541, file: !305, line: 96, baseType: !137, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !541, file: !305, line: 96, baseType: !137, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !541, file: !305, line: 97, baseType: !137, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !541, file: !305, line: 97, baseType: !137, size: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !541, file: !305, line: 99, baseType: !206, size: 16, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !541, file: !305, line: 100, baseType: !206, size: 16, offset: 144)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !541, file: !305, line: 102, baseType: !206, size: 16, offset: 160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !541, file: !305, line: 105, baseType: !206, size: 16, offset: 176)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !541, file: !305, line: 108, baseType: !206, size: 16, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !541, file: !305, line: 109, baseType: !206, size: 16, offset: 208)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !541, file: !305, line: 111, baseType: !206, size: 16, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !541, file: !305, line: 112, baseType: !206, size: 16, offset: 240)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !541, file: !305, line: 114, baseType: !137, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !541, file: !305, line: 114, baseType: !137, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !541, file: !305, line: 115, baseType: !137, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !541, file: !305, line: 115, baseType: !137, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !521, file: !305, line: 355, baseType: !222, size: 512, offset: 1216)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !487, file: !72, line: 134, baseType: !172, size: 64, offset: 2368)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !487, file: !72, line: 136, baseType: !562, size: 64, offset: 2432)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !136, line: 61, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !487, file: !72, line: 138, baseType: !540, size: 384, offset: 2496)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !487, file: !72, line: 139, baseType: !566, size: 64, offset: 2880)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !305, line: 80, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !305, line: 72, size: 192, elements: !569)
!569 = !{!570, !577, !578, !579, !580}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !568, file: !305, line: 73, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !305, line: 59, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !305, line: 56, size: 128, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !573, file: !305, line: 57, baseType: !461, size: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !573, file: !305, line: 58, baseType: !137, size: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !568, file: !305, line: 74, baseType: !137, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !568, file: !305, line: 76, baseType: !137, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !568, file: !305, line: 77, baseType: !137, size: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !305, line: 79, baseType: !137, size: 32, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !487, file: !72, line: 141, baseType: !232, size: 128, offset: 2944)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !487, file: !72, line: 142, baseType: !232, size: 128, offset: 3072)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !487, file: !72, line: 143, baseType: !232, size: 128, offset: 3200)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !487, file: !72, line: 144, baseType: !232, size: 128, offset: 3328)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !487, file: !72, line: 146, baseType: !137, size: 32, offset: 3456)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !487, file: !72, line: 147, baseType: !137, size: 32, offset: 3488)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !487, file: !72, line: 150, baseType: !588, size: 64, offset: 3520)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !591, line: 93, size: 7552, elements: !592)
!591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !641, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !710, !711, !712, !713, !714, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !1173, !1174, !1175, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1221}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !590, file: !591, line: 94, baseType: !174, size: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !590, file: !591, line: 95, baseType: !484, size: 64, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !590, file: !591, line: 97, baseType: !206, size: 16, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !591, line: 97, baseType: !206, size: 16, offset: 1040)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !590, file: !591, line: 99, baseType: !344, size: 32, offset: 1056)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !590, file: !591, line: 99, baseType: !344, size: 32, offset: 1088)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !590, file: !591, line: 99, baseType: !344, size: 32, offset: 1120)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !590, file: !591, line: 100, baseType: !344, size: 32, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !590, file: !591, line: 100, baseType: !344, size: 32, offset: 1184)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !590, file: !591, line: 100, baseType: !344, size: 32, offset: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !590, file: !591, line: 101, baseType: !344, size: 32, offset: 1248)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !590, file: !591, line: 101, baseType: !344, size: 32, offset: 1280)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !590, file: !591, line: 101, baseType: !344, size: 32, offset: 1312)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !590, file: !591, line: 102, baseType: !344, size: 32, offset: 1344)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !590, file: !591, line: 102, baseType: !344, size: 32, offset: 1376)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !590, file: !591, line: 102, baseType: !344, size: 32, offset: 1408)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !590, file: !591, line: 103, baseType: !344, size: 32, offset: 1440)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !590, file: !591, line: 103, baseType: !344, size: 32, offset: 1472)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !590, file: !591, line: 103, baseType: !344, size: 32, offset: 1504)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !590, file: !591, line: 103, baseType: !344, size: 32, offset: 1536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !590, file: !591, line: 103, baseType: !344, size: 32, offset: 1568)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !590, file: !591, line: 104, baseType: !344, size: 32, offset: 1600)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !590, file: !591, line: 104, baseType: !344, size: 32, offset: 1632)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !590, file: !591, line: 104, baseType: !344, size: 32, offset: 1664)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !590, file: !591, line: 104, baseType: !344, size: 32, offset: 1696)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !590, file: !591, line: 104, baseType: !344, size: 32, offset: 1728)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !590, file: !591, line: 105, baseType: !344, size: 32, offset: 1760)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !590, file: !591, line: 108, baseType: !621, size: 704, offset: 1792)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !591, line: 53, size: 704, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !621, file: !591, line: 54, baseType: !344, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !621, file: !591, line: 55, baseType: !344, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !621, file: !591, line: 56, baseType: !344, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !621, file: !591, line: 57, baseType: !344, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !621, file: !591, line: 59, baseType: !461, size: 96, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !621, file: !591, line: 60, baseType: !461, size: 96, offset: 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !621, file: !591, line: 61, baseType: !461, size: 96, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !621, file: !591, line: 63, baseType: !344, size: 32, offset: 416)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !621, file: !591, line: 64, baseType: !344, size: 32, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !621, file: !591, line: 65, baseType: !344, size: 32, offset: 480)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !621, file: !591, line: 67, baseType: !206, size: 16, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !621, file: !591, line: 68, baseType: !206, size: 16, offset: 528)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !621, file: !591, line: 69, baseType: !206, size: 16, offset: 544)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !621, file: !591, line: 70, baseType: !206, size: 16, offset: 560)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !621, file: !591, line: 72, baseType: !344, size: 32, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !621, file: !591, line: 73, baseType: !344, size: 32, offset: 608)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !621, file: !591, line: 74, baseType: !344, size: 32, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !621, file: !591, line: 75, baseType: !344, size: 32, offset: 672)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !590, file: !591, line: 109, baseType: !642, size: 128, offset: 2496)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !591, line: 79, size: 128, elements: !643)
!643 = !{!644, !645, !646, !647}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !642, file: !591, line: 80, baseType: !137, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !642, file: !591, line: 81, baseType: !137, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !642, file: !591, line: 82, baseType: !137, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !642, file: !591, line: 83, baseType: !137, size: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !590, file: !591, line: 111, baseType: !344, size: 32, offset: 2624)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !590, file: !591, line: 111, baseType: !344, size: 32, offset: 2656)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !590, file: !591, line: 112, baseType: !344, size: 32, offset: 2688)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !590, file: !591, line: 112, baseType: !344, size: 32, offset: 2720)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !590, file: !591, line: 113, baseType: !344, size: 32, offset: 2752)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !590, file: !591, line: 114, baseType: !344, size: 32, offset: 2784)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !590, file: !591, line: 114, baseType: !344, size: 32, offset: 2816)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !590, file: !591, line: 115, baseType: !206, size: 16, offset: 2848)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !590, file: !591, line: 115, baseType: !206, size: 16, offset: 2864)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !590, file: !591, line: 116, baseType: !206, size: 16, offset: 2880)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !590, file: !591, line: 117, baseType: !193, size: 8, offset: 2896)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !590, file: !591, line: 117, baseType: !193, size: 8, offset: 2904)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !590, file: !591, line: 119, baseType: !344, size: 32, offset: 2912)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !590, file: !591, line: 119, baseType: !344, size: 32, offset: 2944)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !590, file: !591, line: 120, baseType: !206, size: 16, offset: 2976)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !590, file: !591, line: 120, baseType: !206, size: 16, offset: 2992)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !590, file: !591, line: 121, baseType: !344, size: 32, offset: 3008)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !590, file: !591, line: 121, baseType: !344, size: 32, offset: 3040)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !590, file: !591, line: 122, baseType: !344, size: 32, offset: 3072)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !590, file: !591, line: 123, baseType: !344, size: 32, offset: 3104)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !590, file: !591, line: 124, baseType: !206, size: 16, offset: 3136)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !590, file: !591, line: 125, baseType: !206, size: 16, offset: 3152)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !590, file: !591, line: 127, baseType: !137, size: 32, offset: 3168)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !590, file: !591, line: 127, baseType: !137, size: 32, offset: 3200)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !590, file: !591, line: 128, baseType: !137, size: 32, offset: 3232)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !590, file: !591, line: 128, baseType: !137, size: 32, offset: 3264)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !590, file: !591, line: 129, baseType: !206, size: 16, offset: 3296)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !590, file: !591, line: 129, baseType: !206, size: 16, offset: 3312)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !590, file: !591, line: 129, baseType: !206, size: 16, offset: 3328)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !590, file: !591, line: 129, baseType: !206, size: 16, offset: 3344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !590, file: !591, line: 130, baseType: !344, size: 32, offset: 3360)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !590, file: !591, line: 130, baseType: !344, size: 32, offset: 3392)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !590, file: !591, line: 130, baseType: !344, size: 32, offset: 3424)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !590, file: !591, line: 130, baseType: !344, size: 32, offset: 3456)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !590, file: !591, line: 131, baseType: !344, size: 32, offset: 3488)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !590, file: !591, line: 131, baseType: !344, size: 32, offset: 3520)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !590, file: !591, line: 131, baseType: !344, size: 32, offset: 3552)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !590, file: !591, line: 131, baseType: !344, size: 32, offset: 3584)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !590, file: !591, line: 132, baseType: !344, size: 32, offset: 3616)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !590, file: !591, line: 132, baseType: !344, size: 32, offset: 3648)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !590, file: !591, line: 133, baseType: !222, size: 512, offset: 3680)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !590, file: !591, line: 135, baseType: !344, size: 32, offset: 4192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !590, file: !591, line: 136, baseType: !344, size: 32, offset: 4224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !590, file: !591, line: 137, baseType: !344, size: 32, offset: 4256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !590, file: !591, line: 138, baseType: !137, size: 32, offset: 4288)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !590, file: !591, line: 141, baseType: !193, size: 8, offset: 4320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !590, file: !591, line: 141, baseType: !193, size: 8, offset: 4328)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !590, file: !591, line: 141, baseType: !193, size: 8, offset: 4336)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !590, file: !591, line: 141, baseType: !193, size: 8, offset: 4344)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !590, file: !591, line: 142, baseType: !206, size: 16, offset: 4352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !590, file: !591, line: 142, baseType: !206, size: 16, offset: 4368)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !590, file: !591, line: 142, baseType: !206, size: 16, offset: 4384)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !590, file: !591, line: 145, baseType: !193, size: 8, offset: 4400)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !590, file: !591, line: 145, baseType: !193, size: 8, offset: 4408)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !590, file: !591, line: 148, baseType: !206, size: 16, offset: 4416)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !590, file: !591, line: 148, baseType: !206, size: 16, offset: 4432)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !590, file: !591, line: 149, baseType: !344, size: 32, offset: 4448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !590, file: !591, line: 149, baseType: !344, size: 32, offset: 4480)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !590, file: !591, line: 152, baseType: !707, size: 128, offset: 4512)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 128, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 4)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !590, file: !591, line: 153, baseType: !344, size: 32, offset: 4640)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !590, file: !591, line: 154, baseType: !344, size: 32, offset: 4672)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !590, file: !591, line: 157, baseType: !206, size: 16, offset: 4704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !590, file: !591, line: 157, baseType: !206, size: 16, offset: 4720)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !590, file: !591, line: 160, baseType: !715, size: 64, offset: 4736)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !477, line: 113, size: 6208, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !727}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !716, file: !477, line: 114, baseType: !206, size: 16)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !716, file: !477, line: 114, baseType: !206, size: 16, offset: 16)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !716, file: !477, line: 115, baseType: !193, size: 8, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !716, file: !477, line: 115, baseType: !193, size: 8, offset: 40)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !716, file: !477, line: 116, baseType: !193, size: 8, offset: 48)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !716, file: !477, line: 117, baseType: !724, size: 8, offset: 56)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 8, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 1)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !716, file: !477, line: 119, baseType: !728, size: 6144, offset: 64)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 6144, elements: !738)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !477, line: 109, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !477, line: 106, size: 192, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !730, file: !477, line: 107, baseType: !344, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !730, file: !477, line: 107, baseType: !344, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !730, file: !477, line: 107, baseType: !344, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !730, file: !477, line: 107, baseType: !344, size: 32, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !730, file: !477, line: 107, baseType: !344, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !730, file: !477, line: 108, baseType: !137, size: 32, offset: 160)
!738 = !{!739}
!739 = !DISubrange(count: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !590, file: !591, line: 161, baseType: !715, size: 64, offset: 4800)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !590, file: !591, line: 162, baseType: !193, size: 8, offset: 4864)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !590, file: !591, line: 162, baseType: !193, size: 8, offset: 4872)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !590, file: !591, line: 163, baseType: !193, size: 8, offset: 4880)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !590, file: !591, line: 163, baseType: !193, size: 8, offset: 4888)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !590, file: !591, line: 164, baseType: !206, size: 16, offset: 4896)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !590, file: !591, line: 164, baseType: !206, size: 16, offset: 4912)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !590, file: !591, line: 165, baseType: !344, size: 32, offset: 4928)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !590, file: !591, line: 165, baseType: !344, size: 32, offset: 4960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !590, file: !591, line: 167, baseType: !750, size: 1152, offset: 4992)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 1152, elements: !1171)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !477, line: 57, size: 2496, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !752, file: !477, line: 59, baseType: !206, size: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !752, file: !477, line: 59, baseType: !206, size: 16, offset: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !752, file: !477, line: 59, baseType: !206, size: 16, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !752, file: !477, line: 59, baseType: !206, size: 16, offset: 48)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !752, file: !477, line: 60, baseType: !486, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !752, file: !477, line: 61, baseType: !760, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !477, line: 202, size: 3328, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !831, !905, !906, !980, !981, !1011, !1012, !1081, !1102, !1110, !1111}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !761, file: !477, line: 203, baseType: !174, size: 960)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !761, file: !477, line: 204, baseType: !484, size: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !761, file: !477, line: 206, baseType: !344, size: 32, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !761, file: !477, line: 206, baseType: !344, size: 32, offset: 1056)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !761, file: !477, line: 207, baseType: !344, size: 32, offset: 1088)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !761, file: !477, line: 207, baseType: !344, size: 32, offset: 1120)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !761, file: !477, line: 207, baseType: !344, size: 32, offset: 1152)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !761, file: !477, line: 207, baseType: !344, size: 32, offset: 1184)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !761, file: !477, line: 207, baseType: !344, size: 32, offset: 1216)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !761, file: !477, line: 207, baseType: !344, size: 32, offset: 1248)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !761, file: !477, line: 208, baseType: !344, size: 32, offset: 1280)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !761, file: !477, line: 208, baseType: !344, size: 32, offset: 1312)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !761, file: !477, line: 211, baseType: !344, size: 32, offset: 1344)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !761, file: !477, line: 211, baseType: !344, size: 32, offset: 1376)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !761, file: !477, line: 211, baseType: !344, size: 32, offset: 1408)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !761, file: !477, line: 211, baseType: !344, size: 32, offset: 1440)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !761, file: !477, line: 211, baseType: !344, size: 32, offset: 1472)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !761, file: !477, line: 214, baseType: !344, size: 32, offset: 1504)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !761, file: !477, line: 214, baseType: !344, size: 32, offset: 1536)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !761, file: !477, line: 217, baseType: !344, size: 32, offset: 1568)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !761, file: !477, line: 218, baseType: !344, size: 32, offset: 1600)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !761, file: !477, line: 219, baseType: !344, size: 32, offset: 1632)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !761, file: !477, line: 220, baseType: !344, size: 32, offset: 1664)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !761, file: !477, line: 221, baseType: !344, size: 32, offset: 1696)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !761, file: !477, line: 222, baseType: !206, size: 16, offset: 1728)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !761, file: !477, line: 222, baseType: !206, size: 16, offset: 1744)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !761, file: !477, line: 224, baseType: !206, size: 16, offset: 1760)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !761, file: !477, line: 224, baseType: !206, size: 16, offset: 1776)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !761, file: !477, line: 227, baseType: !206, size: 16, offset: 1792)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !761, file: !477, line: 227, baseType: !206, size: 16, offset: 1808)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !761, file: !477, line: 229, baseType: !206, size: 16, offset: 1824)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !761, file: !477, line: 229, baseType: !206, size: 16, offset: 1840)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !761, file: !477, line: 230, baseType: !206, size: 16, offset: 1856)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !761, file: !477, line: 230, baseType: !206, size: 16, offset: 1872)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !761, file: !477, line: 232, baseType: !344, size: 32, offset: 1888)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !761, file: !477, line: 232, baseType: !344, size: 32, offset: 1920)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !761, file: !477, line: 232, baseType: !344, size: 32, offset: 1952)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !761, file: !477, line: 232, baseType: !344, size: 32, offset: 1984)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !761, file: !477, line: 233, baseType: !137, size: 32, offset: 2016)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !761, file: !477, line: 234, baseType: !137, size: 32, offset: 2048)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !761, file: !477, line: 235, baseType: !206, size: 16, offset: 2080)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !761, file: !477, line: 235, baseType: !206, size: 16, offset: 2096)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !761, file: !477, line: 236, baseType: !206, size: 16, offset: 2112)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !761, file: !477, line: 239, baseType: !206, size: 16, offset: 2128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !761, file: !477, line: 240, baseType: !137, size: 32, offset: 2144)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !761, file: !477, line: 241, baseType: !137, size: 32, offset: 2176)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !761, file: !477, line: 241, baseType: !137, size: 32, offset: 2208)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !761, file: !477, line: 241, baseType: !137, size: 32, offset: 2240)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !761, file: !477, line: 243, baseType: !344, size: 32, offset: 2272)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !761, file: !477, line: 243, baseType: !344, size: 32, offset: 2304)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !761, file: !477, line: 244, baseType: !344, size: 32, offset: 2336)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !761, file: !477, line: 246, baseType: !815, size: 320, offset: 2368)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !434, line: 50, size: 320, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !815, file: !434, line: 51, baseType: !479, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !815, file: !434, line: 53, baseType: !137, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !815, file: !434, line: 54, baseType: !137, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !815, file: !434, line: 55, baseType: !137, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !815, file: !434, line: 55, baseType: !137, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !815, file: !434, line: 56, baseType: !193, size: 8, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !815, file: !434, line: 56, baseType: !193, size: 8, offset: 200)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !815, file: !434, line: 57, baseType: !193, size: 8, offset: 208)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !815, file: !434, line: 57, baseType: !193, size: 8, offset: 216)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !815, file: !434, line: 59, baseType: !206, size: 16, offset: 224)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !815, file: !434, line: 59, baseType: !206, size: 16, offset: 240)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !815, file: !434, line: 59, baseType: !206, size: 16, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !815, file: !434, line: 61, baseType: !206, size: 16, offset: 272)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !815, file: !434, line: 63, baseType: !137, size: 32, offset: 288)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !761, file: !477, line: 248, baseType: !832, size: 64, offset: 2688)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !834, line: 328, size: 3456, elements: !835)
!834 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!835 = !{!836, !837, !838, !841, !842, !843, !844, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !871, !872, !873, !876, !881, !882, !885, !889, !893, !897, !901, !902, !903, !904}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !833, file: !834, line: 329, baseType: !174, size: 960)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !833, file: !834, line: 330, baseType: !484, size: 64, offset: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !833, file: !834, line: 332, baseType: !839, size: 64, offset: 1024)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !834, line: 332, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !833, file: !834, line: 333, baseType: !222, size: 512, offset: 1088)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !833, file: !834, line: 335, baseType: !284, size: 64, offset: 1600)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !833, file: !834, line: 337, baseType: !562, size: 64, offset: 1664)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !833, file: !834, line: 338, baseType: !845, size: 64, offset: 1728)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 64, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 2)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !833, file: !834, line: 340, baseType: !232, size: 128, offset: 1792)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !833, file: !834, line: 340, baseType: !232, size: 128, offset: 1920)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !833, file: !834, line: 342, baseType: !137, size: 32, offset: 2048)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !833, file: !834, line: 342, baseType: !137, size: 32, offset: 2080)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !833, file: !834, line: 343, baseType: !137, size: 32, offset: 2112)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !833, file: !834, line: 345, baseType: !137, size: 32, offset: 2144)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !833, file: !834, line: 346, baseType: !137, size: 32, offset: 2176)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !833, file: !834, line: 347, baseType: !206, size: 16, offset: 2208)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !833, file: !834, line: 348, baseType: !206, size: 16, offset: 2224)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !833, file: !834, line: 349, baseType: !137, size: 32, offset: 2240)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !833, file: !834, line: 351, baseType: !137, size: 32, offset: 2272)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !833, file: !834, line: 353, baseType: !206, size: 16, offset: 2304)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !833, file: !834, line: 354, baseType: !206, size: 16, offset: 2320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !833, file: !834, line: 355, baseType: !137, size: 32, offset: 2336)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !833, file: !834, line: 357, baseType: !863, size: 128, offset: 2368)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !864, line: 95, baseType: !865)
!864 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !864, line: 92, size: 128, elements: !866)
!866 = !{!867, !868, !869, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !865, file: !864, line: 93, baseType: !344, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !865, file: !864, line: 93, baseType: !344, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !865, file: !864, line: 94, baseType: !344, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !865, file: !864, line: 94, baseType: !344, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !833, file: !834, line: 363, baseType: !232, size: 128, offset: 2496)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !833, file: !834, line: 363, baseType: !232, size: 128, offset: 2624)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !833, file: !834, line: 368, baseType: !874, size: 64, offset: 2752)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !834, line: 48, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !833, file: !834, line: 372, baseType: !877, size: 32, offset: 2816)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !834, line: 274, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !834, line: 271, size: 32, elements: !879)
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !878, file: !834, line: 273, baseType: !5, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !833, file: !834, line: 373, baseType: !137, size: 32, offset: 2848)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !833, file: !834, line: 382, baseType: !883, size: 64, offset: 2880)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !834, line: 46, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !833, file: !834, line: 385, baseType: !886, size: 64, offset: 2944)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !172, !344}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !833, file: !834, line: 386, baseType: !890, size: 64, offset: 3008)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !172, !289}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !833, file: !834, line: 387, baseType: !894, size: 64, offset: 3072)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!137, !172}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !833, file: !834, line: 388, baseType: !898, size: 64, offset: 3136)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !172}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !833, file: !834, line: 389, baseType: !172, size: 64, offset: 3200)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !833, file: !834, line: 389, baseType: !172, size: 64, offset: 3264)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !833, file: !834, line: 389, baseType: !172, size: 64, offset: 3328)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !833, file: !834, line: 389, baseType: !172, size: 64, offset: 3392)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !761, file: !477, line: 249, baseType: !475, size: 64, offset: 2752)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !761, file: !477, line: 250, baseType: !907, size: 64, offset: 2816)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !434, line: 77, size: 15424, elements: !909)
!909 = !{!910, !911, !912, !915, !918, !919, !922, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !941, !942, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !974}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !908, file: !434, line: 78, baseType: !174, size: 960)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !434, line: 80, baseType: !192, size: 8192, offset: 960)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !908, file: !434, line: 82, baseType: !913, size: 64, offset: 9152)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !434, line: 43, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !908, file: !434, line: 83, baseType: !916, size: 64, offset: 9216)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !175, line: 46, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !908, file: !434, line: 86, baseType: !432, size: 64, offset: 9280)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !908, file: !434, line: 87, baseType: !920, size: 64, offset: 9344)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !434, line: 44, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !908, file: !434, line: 89, baseType: !923, size: 512, offset: 9408)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 512, elements: !924)
!924 = !{!513}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !908, file: !434, line: 90, baseType: !206, size: 16, offset: 9920)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !908, file: !434, line: 90, baseType: !206, size: 16, offset: 9936)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !908, file: !434, line: 92, baseType: !206, size: 16, offset: 9952)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !908, file: !434, line: 92, baseType: !206, size: 16, offset: 9968)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !908, file: !434, line: 93, baseType: !206, size: 16, offset: 9984)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !908, file: !434, line: 93, baseType: !206, size: 16, offset: 10000)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !908, file: !434, line: 94, baseType: !137, size: 32, offset: 10016)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !908, file: !434, line: 97, baseType: !206, size: 16, offset: 10048)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !908, file: !434, line: 97, baseType: !206, size: 16, offset: 10064)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !908, file: !434, line: 98, baseType: !206, size: 16, offset: 10080)
