; ModuleID = 'blender/source/blender/editors/sculpt_paint/paint_undo.c'
source_filename = "blender/source/blender/editors/sculpt_paint/paint_undo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UndoStack = type { i32, %struct.ListBase, %struct.UndoElem* }
%struct.ListBase = type { i8*, i8* }
%struct.UndoElem = type { %struct.UndoElem*, %struct.UndoElem*, [64 x i8], i64, %struct.ListBase, void (%struct.bContext*, %struct.ListBase*)*, void (%struct.ListBase*)*, i8 (%struct.bContext*, %struct.ListBase*)* }
%struct.bContext = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ImageUndoStack", scope: !2, file: !3, line: 63, type: !31, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !28, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/editors/sculpt_paint/paint_undo.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 39, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/editors/include/ED_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "UNDO_PAINT_IMAGE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "UNDO_PAINT_MESH", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 123, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22}
!14 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!20 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!21 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!22 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !26, line: 90, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !{!0, !29}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "MeshUndoStack", scope: !2, file: !3, line: 64, type: !31, isLocal: true, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "UndoStack", file: !3, line: 61, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UndoStack", file: !3, line: 57, size: 256, elements: !33)
!33 = !{!34, !36, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !32, file: !3, line: 58, baseType: !35, size: 32)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !32, file: !3, line: 59, baseType: !37, size: 128, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !38, line: 71, baseType: !39)
!38 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !38, line: 69, size: 128, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !39, file: !38, line: 70, baseType: !24, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !39, file: !38, line: 70, baseType: !24, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !32, file: !3, line: 60, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "UndoElem", file: !3, line: 55, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UndoElem", file: !3, line: 45, size: 1024, elements: !47)
!47 = !{!48, !50, !51, !56, !57, !58, !67, !72}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !46, file: !3, line: 46, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !46, file: !3, line: 46, baseType: !49, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !46, file: !3, line: 47, baseType: !52, size: 512, offset: 128)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 512, elements: !54)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !{!55}
!55 = !DISubrange(count: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "undosize", scope: !46, file: !3, line: 48, baseType: !25, size: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !46, file: !3, line: 50, baseType: !37, size: 128, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "restore", scope: !46, file: !3, line: 52, baseType: !59, size: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "UndoRestoreCb", file: !6, line: 44, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63, !66}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !65, line: 60, flags: DIFlagFwdDecl)
!65 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !46, file: !3, line: 53, baseType: !68, size: 64, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "UndoFreeCb", file: !6, line: 45, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !66}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !46, file: !3, line: 54, baseType: !73, size: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "UndoCleanupCb", file: !6, line: 46, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !63, !66}
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !{i32 7, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{i32 1, !"wchar_size", i32 4}
!81 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!82 = distinct !DISubprogram(name: "ED_undo_paint_push_begin", scope: !3, file: !3, line: 256, type: !83, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !87)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !35, !85, !59, !68, !73}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!87 = !{}
!88 = !DILocalVariable(name: "type", arg: 1, scope: !82, file: !3, line: 256, type: !35)
!89 = !DILocation(line: 256, column: 35, scope: !82)
!90 = !DILocalVariable(name: "name", arg: 2, scope: !82, file: !3, line: 256, type: !85)
!91 = !DILocation(line: 256, column: 53, scope: !82)
!92 = !DILocalVariable(name: "restore", arg: 3, scope: !82, file: !3, line: 256, type: !59)
!93 = !DILocation(line: 256, column: 73, scope: !82)
!94 = !DILocalVariable(name: "free", arg: 4, scope: !82, file: !3, line: 256, type: !68)
!95 = !DILocation(line: 256, column: 93, scope: !82)
!96 = !DILocalVariable(name: "cleanup", arg: 5, scope: !82, file: !3, line: 256, type: !73)
!97 = !DILocation(line: 256, column: 113, scope: !82)
!98 = !DILocation(line: 258, column: 6, scope: !99)
!99 = distinct !DILexicalBlock(scope: !82, file: !3, line: 258, column: 6)
!100 = !DILocation(line: 258, column: 11, scope: !99)
!101 = !DILocation(line: 258, column: 6, scope: !82)
!102 = !DILocation(line: 259, column: 42, scope: !99)
!103 = !DILocation(line: 259, column: 48, scope: !99)
!104 = !DILocation(line: 259, column: 57, scope: !99)
!105 = !DILocation(line: 259, column: 63, scope: !99)
!106 = !DILocation(line: 259, column: 3, scope: !99)
!107 = !DILocation(line: 260, column: 11, scope: !108)
!108 = distinct !DILexicalBlock(scope: !99, file: !3, line: 260, column: 11)
!109 = !DILocation(line: 260, column: 16, scope: !108)
!110 = !DILocation(line: 260, column: 11, scope: !99)
!111 = !DILocation(line: 261, column: 41, scope: !108)
!112 = !DILocation(line: 261, column: 47, scope: !108)
!113 = !DILocation(line: 261, column: 56, scope: !108)
!114 = !DILocation(line: 261, column: 62, scope: !108)
!115 = !DILocation(line: 261, column: 3, scope: !108)
!116 = !DILocation(line: 262, column: 1, scope: !82)
!117 = distinct !DISubprogram(name: "undo_stack_push_begin", scope: !3, file: !3, line: 82, type: !118, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !87)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !120, !85, !59, !68, !73}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!121 = !DILocalVariable(name: "stack", arg: 1, scope: !117, file: !3, line: 82, type: !120)
!122 = !DILocation(line: 82, column: 46, scope: !117)
!123 = !DILocalVariable(name: "name", arg: 2, scope: !117, file: !3, line: 82, type: !85)
!124 = !DILocation(line: 82, column: 65, scope: !117)
!125 = !DILocalVariable(name: "restore", arg: 3, scope: !117, file: !3, line: 82, type: !59)
!126 = !DILocation(line: 82, column: 85, scope: !117)
!127 = !DILocalVariable(name: "free", arg: 4, scope: !117, file: !3, line: 82, type: !68)
!128 = !DILocation(line: 82, column: 105, scope: !117)
!129 = !DILocalVariable(name: "cleanup", arg: 5, scope: !117, file: !3, line: 82, type: !73)
!130 = !DILocation(line: 82, column: 125, scope: !117)
