; ModuleID = 'blender/source/blender/editors/space_file/filesel.c'
source_filename = "blender/source/blender/editors/space_file/filesel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!69 = !DIEnumerator(name: "FILE_LONGDISPLAY", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "FILE_IMGDISPLAY", value: 3, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUserPref_Flag", file: !34, line: 569, baseType: !5, size: 32, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!73 = !DIEnumerator(name: "USER_AUTOSAVE", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "USER_SCENEGLOBAL", value: 16, isUnsigned: true)
!75 = !DIEnumerator(name: "USER_TRACKBALL", value: 32, isUnsigned: true)
!76 = !DIEnumerator(name: "USER_MAT_ON_OB", value: 256, isUnsigned: true)
!77 = !DIEnumerator(name: "USER_TOOLTIPS", value: 2048, isUnsigned: true)
!78 = !DIEnumerator(name: "USER_TWOBUTTONMOUSE", value: 4096, isUnsigned: true)
!79 = !DIEnumerator(name: "USER_NONUMPAD", value: 8192, isUnsigned: true)
!80 = !DIEnumerator(name: "USER_LMOUSESELECT", value: 16384, isUnsigned: true)
!81 = !DIEnumerator(name: "USER_FILECOMPRESS", value: 32768, isUnsigned: true)
!82 = !DIEnumerator(name: "USER_SAVE_PREVIEWS", value: 65536, isUnsigned: true)
!83 = !DIEnumerator(name: "USER_CUSTOM_RANGE", value: 131072, isUnsigned: true)
!84 = !DIEnumerator(name: "USER_ADD_EDITMODE", value: 262144, isUnsigned: true)
!85 = !DIEnumerator(name: "USER_ADD_VIEWALIGNED", value: 524288, isUnsigned: true)
!86 = !DIEnumerator(name: "USER_RELPATHS", value: 1048576, isUnsigned: true)
!87 = !DIEnumerator(name: "USER_RELEASECONFIRM", value: 2097152, isUnsigned: true)
!88 = !DIEnumerator(name: "USER_SCRIPT_AUTOEXEC_DISABLE", value: 4194304, isUnsigned: true)
!89 = !DIEnumerator(name: "USER_FILENOUI", value: 8388608, isUnsigned: true)
!90 = !DIEnumerator(name: "USER_NONEGFRAMES", value: 16777216, isUnsigned: true)
!91 = !DIEnumerator(name: "USER_TXT_TABSTOSPACES_DISABLE", value: 33554432, isUnsigned: true)
!92 = !DIEnumerator(name: "USER_TOOLTIPS_PYTHON", value: 67108864, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FileSortTypeE", file: !4, line: 634, baseType: !5, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99}
!95 = !DIEnumerator(name: "FILE_SORT_NONE", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "FILE_SORT_ALPHA", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "FILE_SORT_EXTENSION", value: 2, isUnsigned: true)
!98 = !DIEnumerator(name: "FILE_SORT_TIME", value: 3, isUnsigned: true)
!99 = !DIEnumerator(name: "FILE_SORT_SIZE", value: 4, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FileListColumns", file: !101, line: 45, baseType: !5, size: 32, elements: !102)
!101 = !DIFile(filename: "blender/source/blender/editors/include/ED_fileselect.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110}
!103 = !DIEnumerator(name: "COLUMN_NAME", value: 0, isUnsigned: true)
!104 = !DIEnumerator(name: "COLUMN_DATE", value: 1, isUnsigned: true)
!105 = !DIEnumerator(name: "COLUMN_TIME", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "COLUMN_SIZE", value: 3, isUnsigned: true)
!107 = !DIEnumerator(name: "COLUMN_MODE1", value: 4, isUnsigned: true)
!108 = !DIEnumerator(name: "COLUMN_MODE2", value: 5, isUnsigned: true)
!109 = !DIEnumerator(name: "COLUMN_MODE3", value: 6, isUnsigned: true)
!110 = !DIEnumerator(name: "COLUMN_OWNER", value: 7, isUnsigned: true)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDirEntry_SelectFlag", file: !4, line: 700, baseType: !5, size: 32, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIEnumerator(name: "HILITED_FILE", value: 4, isUnsigned: true)
!114 = !DIEnumerator(name: "SELECTED_FILE", value: 8, isUnsigned: true)
!115 = !DIEnumerator(name: "EDITING_FILE", value: 16, isUnsigned: true)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 384, baseType: !5, size: 32, elements: !118)
!117 = !DIFile(filename: "blender/source/blender/windowmanager/wm_event_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!118 = !{!119, !120, !121, !122, !123}
!119 = !DIEnumerator(name: "EVT_FILESELECT_OPEN", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "EVT_FILESELECT_FULL_OPEN", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "EVT_FILESELECT_EXEC", value: 3, isUnsigned: true)
!122 = !DIEnumerator(name: "EVT_FILESELECT_CANCEL", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "EVT_FILESELECT_EXTERNAL_CANCEL", value: 5, isUnsigned: true)
!124 = !{!125, !35, !126}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!127 = !{i32 7, !"Dwarf Version", i32 4}
!128 = !{i32 2, !"Debug Info Version", i32 3}
!129 = !{i32 1, !"wchar_size", i32 4}
!130 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!131 = distinct !DISubprogram(name: "ED_fileselect_get_params", scope: !1, file: !1, line: 82, type: !132, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1740)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !170}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileSelectParams", file: !4, line: 566, size: 16128, elements: !136)
!136 = !{!137, !142, !146, !150, !151, !152, !156, !157, !158, !159, !161, !162, !163, !164, !165, !166}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !135, file: !4, line: 567, baseType: !138, size: 768)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 768, elements: !140)
!139 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!140 = !{!141}
!141 = !DISubrange(count: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !135, file: !4, line: 568, baseType: !143, size: 8448, offset: 768)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8448, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 1056)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !135, file: !4, line: 570, baseType: !147, size: 2048, offset: 9216)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 2048, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "renamefile", scope: !135, file: !4, line: 571, baseType: !147, size: 2048, offset: 11264)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "renameedit", scope: !135, file: !4, line: 572, baseType: !147, size: 2048, offset: 13312)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "filter_glob", scope: !135, file: !4, line: 574, baseType: !153, size: 512, offset: 15360)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 512, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "active_file", scope: !135, file: !4, line: 576, baseType: !35, size: 32, offset: 15872)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sel_first", scope: !135, file: !4, line: 577, baseType: !35, size: 32, offset: 15904)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sel_last", scope: !135, file: !4, line: 578, baseType: !35, size: 32, offset: 15936)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !4, line: 581, baseType: !160, size: 16, offset: 15968)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !135, file: !4, line: 582, baseType: !160, size: 16, offset: 15984)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !135, file: !4, line: 583, baseType: !160, size: 16, offset: 16000)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !135, file: !4, line: 584, baseType: !160, size: 16, offset: 16016)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !135, file: !4, line: 585, baseType: !160, size: 16, offset: 16032)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f_fp", scope: !135, file: !4, line: 588, baseType: !160, size: 16, offset: 16048)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fp_str", scope: !135, file: !4, line: 589, baseType: !167, size: 64, offset: 16064)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 64, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 8)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceFile", file: !4, line: 595, size: 832, elements: !172)
!172 = !{!173, !192, !193, !194, !195, !196, !197, !200, !202, !203, !1714, !1715, !1736, !1737, !1738, !1739}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !4, line: 596, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !177)
!177 = !{!178, !180, !181, !188, !189, !190}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !4, line: 86, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !176, file: !4, line: 86, baseType: !179, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !176, file: !4, line: 87, baseType: !182, size: 128, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !183, line: 71, baseType: !184)
!183 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !183, line: 69, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !184, file: !183, line: 70, baseType: !125, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !184, file: !183, line: 70, baseType: !125, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !176, file: !4, line: 88, baseType: !35, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !176, file: !4, line: 89, baseType: !126, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !176, file: !4, line: 90, baseType: !191, size: 128, offset: 320)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, elements: !168)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !4, line: 596, baseType: !174, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !171, file: !4, line: 597, baseType: !182, size: 128, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !171, file: !4, line: 598, baseType: !35, size: 32, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_offset", scope: !171, file: !4, line: 600, baseType: !35, size: 32, offset: 288)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !171, file: !4, line: 602, baseType: !134, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !171, file: !4, line: 604, baseType: !198, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileList", file: !4, line: 62, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "folders_prev", scope: !171, file: !4, line: 606, baseType: !201, size: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "folders_next", scope: !171, file: !4, line: 607, baseType: !201, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !171, file: !4, line: 614, baseType: !204, size: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !206, line: 328, size: 1344, elements: !207)
!206 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!207 = !{!208, !209, !210, !211, !235, !389, !390, !391, !392, !1707, !1708, !1709, !1712, !1713}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !206, line: 329, baseType: !204, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !206, line: 329, baseType: !204, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !205, file: !206, line: 332, baseType: !153, size: 512, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !205, file: !206, line: 333, baseType: !212, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !214, line: 75, baseType: !215)
!214 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !214, line: 62, size: 1024, elements: !216)
!216 = !{!217, !219, !220, !221, !222, !223, !224, !225, !233, !234}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !214, line: 63, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !215, file: !214, line: 63, baseType: !218, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !214, line: 64, baseType: !139, size: 8, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !215, file: !214, line: 64, baseType: !139, size: 8, offset: 136)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !214, line: 65, baseType: !160, size: 16, offset: 144)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !214, line: 66, baseType: !153, size: 512, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !215, file: !214, line: 67, baseType: !35, size: 32, offset: 672)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !214, line: 69, baseType: !226, size: 256, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !214, line: 60, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !214, line: 48, size: 256, elements: !228)
!228 = !{!229, !230, !231, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !227, file: !214, line: 49, baseType: !125, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !227, file: !214, line: 58, baseType: !182, size: 128, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !227, file: !214, line: 59, baseType: !35, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !227, file: !214, line: 59, baseType: !35, size: 32, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !215, file: !214, line: 70, baseType: !35, size: 32, offset: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !215, file: !214, line: 74, baseType: !35, size: 32, offset: 992)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !205, file: !206, line: 336, baseType: !236, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !238, line: 508, size: 1536, elements: !239)
!238 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!239 = !{!240, !243, !244, !245, !246, !253, !258, !310, !314, !315, !319, !320, !324, !325, !329, !330, !345, !346, !350, !388}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !237, file: !238, line: 509, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !237, file: !238, line: 510, baseType: !241, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !237, file: !238, line: 511, baseType: !241, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !237, file: !238, line: 512, baseType: !241, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !237, file: !238, line: 518, baseType: !247, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!35, !250, !204}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !252, line: 44, flags: DIFlagFwdDecl)
!252 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!253 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !237, file: !238, line: 524, baseType: !254, size: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!257, !250, !204}
!257 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !237, file: !238, line: 530, baseType: !259, size: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!35, !250, !204, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !238, line: 421, size: 960, elements: !265)
!265 = !{!266, !268, !269, !270, !271, !272, !273, !277, !281, !282, !283, !284, !285, !286, !287, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !306, !307, !308, !309}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !238, line: 422, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !264, file: !238, line: 422, baseType: !267, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !238, line: 424, baseType: !160, size: 16, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !264, file: !238, line: 425, baseType: !160, size: 16, offset: 144)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !264, file: !238, line: 426, baseType: !35, size: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !264, file: !238, line: 426, baseType: !35, size: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !264, file: !238, line: 427, baseType: !274, size: 64, offset: 224)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 2)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !264, file: !238, line: 428, baseType: !278, size: 48, offset: 288)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 48, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 6)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !264, file: !238, line: 431, baseType: !139, size: 8, offset: 336)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !264, file: !238, line: 432, baseType: !139, size: 8, offset: 344)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !264, file: !238, line: 435, baseType: !160, size: 16, offset: 352)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !264, file: !238, line: 436, baseType: !160, size: 16, offset: 368)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !264, file: !238, line: 437, baseType: !35, size: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !264, file: !238, line: 437, baseType: !35, size: 32, offset: 416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !264, file: !238, line: 438, baseType: !288, size: 64, offset: 448)
!288 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !264, file: !238, line: 439, baseType: !35, size: 32, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !264, file: !238, line: 439, baseType: !35, size: 32, offset: 544)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !264, file: !238, line: 442, baseType: !160, size: 16, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !264, file: !238, line: 442, baseType: !160, size: 16, offset: 592)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !264, file: !238, line: 442, baseType: !160, size: 16, offset: 608)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !264, file: !238, line: 442, baseType: !160, size: 16, offset: 624)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !264, file: !238, line: 443, baseType: !160, size: 16, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !264, file: !238, line: 446, baseType: !160, size: 16, offset: 656)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !264, file: !238, line: 449, baseType: !241, size: 64, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !264, file: !238, line: 452, baseType: !299, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !238, line: 463, size: 128, elements: !301)
!301 = !{!302, !303, !304, !305}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !300, file: !238, line: 464, baseType: !35, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !300, file: !238, line: 465, baseType: !126, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !300, file: !238, line: 466, baseType: !126, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !300, file: !238, line: 467, baseType: !126, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !264, file: !238, line: 455, baseType: !160, size: 16, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !264, file: !238, line: 456, baseType: !160, size: 16, offset: 848)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !264, file: !238, line: 457, baseType: !35, size: 32, offset: 864)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !264, file: !238, line: 458, baseType: !125, size: 64, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !237, file: !238, line: 531, baseType: !311, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !250, !204}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !237, file: !238, line: 532, baseType: !259, size: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !237, file: !238, line: 536, baseType: !316, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!35, !250}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !237, file: !238, line: 539, baseType: !311, size: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !237, file: !238, line: 542, baseType: !321, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !323, line: 335, flags: DIFlagFwdDecl)
!323 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !237, file: !238, line: 545, baseType: !218, size: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !237, file: !238, line: 549, baseType: !326, size: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !252, line: 333, baseType: !328)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !252, line: 39, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !237, file: !238, line: 552, baseType: !182, size: 128, offset: 896)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !237, file: !238, line: 555, baseType: !331, size: 64, offset: 1024)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !206, line: 281, size: 1088, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !206, line: 282, baseType: !331, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !332, file: !206, line: 282, baseType: !331, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !332, file: !206, line: 284, baseType: !182, size: 128, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !332, file: !206, line: 285, baseType: !182, size: 128, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !332, file: !206, line: 287, baseType: !153, size: 512, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !332, file: !206, line: 288, baseType: !160, size: 16, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !332, file: !206, line: 289, baseType: !160, size: 16, offset: 912)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !206, line: 291, baseType: !160, size: 16, offset: 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !332, file: !206, line: 292, baseType: !160, size: 16, offset: 944)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !332, file: !206, line: 295, baseType: !316, size: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !332, file: !206, line: 296, baseType: !125, size: 64, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !237, file: !238, line: 559, baseType: !125, size: 64, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !237, file: !238, line: 560, baseType: !347, size: 64, offset: 1152)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!35, !250, !236}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !237, file: !238, line: 563, baseType: !351, size: 256, offset: 1216)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !252, line: 436, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !252, line: 430, size: 256, elements: !353)
!353 = !{!354, !355, !358, !383}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !252, line: 431, baseType: !125, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !352, file: !252, line: 432, baseType: !356, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !252, line: 417, baseType: !322)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !352, file: !252, line: 433, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !252, line: 408, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!35, !250, !363, !372, !374}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !252, line: 55, size: 192, elements: !365)
!365 = !{!366, !370, !371}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !364, file: !252, line: 58, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !252, line: 56, size: 64, elements: !368)
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !367, file: !252, line: 57, baseType: !125, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !252, line: 60, baseType: !321, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !252, line: 61, baseType: !125, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !252, line: 38, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !252, line: 348, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !252, line: 337, size: 256, elements: !377)
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !376, file: !252, line: 339, baseType: !125, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !376, file: !252, line: 342, baseType: !372, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !376, file: !252, line: 345, baseType: !35, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !376, file: !252, line: 347, baseType: !35, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !376, file: !252, line: 347, baseType: !35, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !352, file: !252, line: 434, baseType: !384, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !252, line: 409, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !125}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !237, file: !238, line: 566, baseType: !160, size: 16, offset: 1472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !205, file: !206, line: 337, baseType: !125, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !205, file: !206, line: 338, baseType: !125, size: 64, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !205, file: !206, line: 340, baseType: !363, size: 64, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !205, file: !206, line: 341, baseType: !393, size: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !206, line: 106, size: 320, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !394, file: !206, line: 107, baseType: !182, size: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !394, file: !206, line: 108, baseType: !35, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !394, file: !206, line: 109, baseType: !35, size: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !394, file: !206, line: 110, baseType: !35, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !394, file: !206, line: 110, baseType: !35, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !394, file: !206, line: 111, baseType: !402, size: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !238, line: 490, size: 768, elements: !404)
!404 = !{!405, !406, !407, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !403, file: !238, line: 491, baseType: !402, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !403, file: !238, line: 491, baseType: !402, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !403, file: !238, line: 493, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !206, line: 169, size: 2048, elements: !410)
!410 = !{!411, !412, !413, !414, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1676, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !409, file: !206, line: 170, baseType: !408, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !409, file: !206, line: 170, baseType: !408, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !409, file: !206, line: 172, baseType: !125, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !409, file: !206, line: 174, baseType: !415, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !417, line: 49, size: 1984, elements: !418)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = !{!419, !455, !456, !457, !458, !459, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !416, file: !417, line: 50, baseType: !420, size: 960)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !214, line: 130, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !214, line: 117, size: 960, elements: !422)
!422 = !{!423, !424, !425, !427, !446, !450, !451, !452, !453, !454}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !214, line: 118, baseType: !125, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !421, file: !214, line: 118, baseType: !125, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !421, file: !214, line: 119, baseType: !426, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !421, file: !214, line: 120, baseType: !428, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !214, line: 136, size: 17600, elements: !430)
!430 = !{!431, !432, !434, !437, !441, !442, !443}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !429, file: !214, line: 137, baseType: !420, size: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !429, file: !214, line: 138, baseType: !433, size: 64, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !429, file: !214, line: 139, baseType: !435, size: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !214, line: 43, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !429, file: !214, line: 140, baseType: !438, size: 8192, offset: 1088)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8192, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !429, file: !214, line: 141, baseType: !438, size: 8192, offset: 9280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !429, file: !214, line: 148, baseType: !428, size: 64, offset: 17472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !429, file: !214, line: 150, baseType: !444, size: 64, offset: 17536)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !214, line: 45, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !421, file: !214, line: 121, baseType: !447, size: 528, offset: 256)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 528, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 66)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !421, file: !214, line: 126, baseType: !160, size: 16, offset: 784)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !421, file: !214, line: 127, baseType: !35, size: 32, offset: 800)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !421, file: !214, line: 128, baseType: !35, size: 32, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !421, file: !214, line: 128, baseType: !35, size: 32, offset: 864)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !421, file: !214, line: 129, baseType: !212, size: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !416, file: !417, line: 52, baseType: !182, size: 128, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !416, file: !417, line: 53, baseType: !182, size: 128, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !416, file: !417, line: 54, baseType: !182, size: 128, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !416, file: !417, line: 55, baseType: !182, size: 128, offset: 1344)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !416, file: !417, line: 57, baseType: !460, size: 64, offset: 1472)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !462, line: 1216, size: 39680, elements: !463)
!462 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!463 = !{!464, !465, !469, !473, !476, !477, !478, !490, !491, !495, !496, !497, !498, !499, !500, !501, !502, !503, !507, !579, !1006, !1219, !1222, !1508, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1530, !1531, !1532, !1533, !1534, !1542, !1609, !1616, !1617, !1624, !1625, !1631, !1632, !1633, !1634, !1635}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !461, file: !462, line: 1217, baseType: !420, size: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !461, file: !462, line: 1218, baseType: !466, size: 64, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !468, line: 43, flags: DIFlagFwdDecl)
!468 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!469 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !461, file: !462, line: 1220, baseType: !470, size: 64, offset: 1024)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !472, line: 152, flags: DIFlagFwdDecl)
!472 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!473 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !461, file: !462, line: 1221, baseType: !474, size: 64, offset: 1088)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !462, line: 52, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !461, file: !462, line: 1223, baseType: !460, size: 64, offset: 1152)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !461, file: !462, line: 1225, baseType: !182, size: 128, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !461, file: !462, line: 1226, baseType: !479, size: 64, offset: 1344)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !462, line: 69, size: 320, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !487, !488, !489}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !462, line: 70, baseType: !479, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !480, file: !462, line: 70, baseType: !479, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !480, file: !462, line: 71, baseType: !5, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !480, file: !462, line: 71, baseType: !5, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !480, file: !462, line: 72, baseType: !35, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !480, file: !462, line: 73, baseType: !160, size: 16, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !480, file: !462, line: 73, baseType: !160, size: 16, offset: 240)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !480, file: !462, line: 74, baseType: !470, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !461, file: !462, line: 1227, baseType: !470, size: 64, offset: 1408)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !461, file: !462, line: 1229, baseType: !492, size: 96, offset: 1472)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 96, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 3)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !461, file: !462, line: 1230, baseType: !492, size: 96, offset: 1568)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !461, file: !462, line: 1231, baseType: !492, size: 96, offset: 1664)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !461, file: !462, line: 1231, baseType: !492, size: 96, offset: 1760)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !461, file: !462, line: 1233, baseType: !5, size: 32, offset: 1856)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !461, file: !462, line: 1234, baseType: !35, size: 32, offset: 1888)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !461, file: !462, line: 1235, baseType: !5, size: 32, offset: 1920)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !461, file: !462, line: 1237, baseType: !160, size: 16, offset: 1952)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !461, file: !462, line: 1239, baseType: !139, size: 8, offset: 1968)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !461, file: !462, line: 1240, baseType: !504, size: 8, offset: 1976)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 1)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !461, file: !462, line: 1242, baseType: !508, size: 64, offset: 1984)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !323, line: 328, size: 3456, elements: !510)
!510 = !{!511, !512, !513, !516, !517, !518, !522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !547, !548, !549, !552, !557, !558, !561, !565, !570, !574, !575, !576, !577, !578}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !509, file: !323, line: 329, baseType: !420, size: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !509, file: !323, line: 330, baseType: !466, size: 64, offset: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !509, file: !323, line: 332, baseType: !514, size: 64, offset: 1024)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !323, line: 332, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !509, file: !323, line: 333, baseType: !153, size: 512, offset: 1088)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !509, file: !323, line: 335, baseType: !321, size: 64, offset: 1600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !509, file: !323, line: 337, baseType: !519, size: 64, offset: 1664)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !521, line: 45, flags: DIFlagFwdDecl)
!521 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!522 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !509, file: !323, line: 338, baseType: !523, size: 64, offset: 1728)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !275)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !509, file: !323, line: 340, baseType: !182, size: 128, offset: 1792)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !509, file: !323, line: 340, baseType: !182, size: 128, offset: 1920)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !509, file: !323, line: 342, baseType: !35, size: 32, offset: 2048)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !509, file: !323, line: 342, baseType: !35, size: 32, offset: 2080)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !509, file: !323, line: 343, baseType: !35, size: 32, offset: 2112)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !323, line: 345, baseType: !35, size: 32, offset: 2144)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !509, file: !323, line: 346, baseType: !35, size: 32, offset: 2176)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !509, file: !323, line: 347, baseType: !160, size: 16, offset: 2208)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !509, file: !323, line: 348, baseType: !160, size: 16, offset: 2224)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !509, file: !323, line: 349, baseType: !35, size: 32, offset: 2240)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !509, file: !323, line: 351, baseType: !35, size: 32, offset: 2272)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !509, file: !323, line: 353, baseType: !160, size: 16, offset: 2304)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !509, file: !323, line: 354, baseType: !160, size: 16, offset: 2320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !509, file: !323, line: 355, baseType: !35, size: 32, offset: 2336)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !509, file: !323, line: 357, baseType: !539, size: 128, offset: 2368)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !540, line: 95, baseType: !541)
!540 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !540, line: 92, size: 128, elements: !542)
!542 = !{!543, !544, !545, !546}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !541, file: !540, line: 93, baseType: !126, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !541, file: !540, line: 93, baseType: !126, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !541, file: !540, line: 94, baseType: !126, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !541, file: !540, line: 94, baseType: !126, size: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !509, file: !323, line: 363, baseType: !182, size: 128, offset: 2496)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !509, file: !323, line: 363, baseType: !182, size: 128, offset: 2624)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !509, file: !323, line: 368, baseType: !550, size: 64, offset: 2752)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !323, line: 48, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !509, file: !323, line: 372, baseType: !553, size: 32, offset: 2816)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !323, line: 274, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !323, line: 271, size: 32, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !554, file: !323, line: 273, baseType: !5, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !509, file: !323, line: 373, baseType: !35, size: 32, offset: 2848)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !509, file: !323, line: 382, baseType: !559, size: 64, offset: 2880)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !323, line: 46, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !509, file: !323, line: 385, baseType: !562, size: 64, offset: 2944)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !125, !126}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !509, file: !323, line: 386, baseType: !566, size: 64, offset: 3008)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !125, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !509, file: !323, line: 387, baseType: !571, size: 64, offset: 3072)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!35, !125}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !509, file: !323, line: 388, baseType: !385, size: 64, offset: 3136)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !509, file: !323, line: 389, baseType: !125, size: 64, offset: 3200)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !509, file: !323, line: 389, baseType: !125, size: 64, offset: 3264)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !509, file: !323, line: 389, baseType: !125, size: 64, offset: 3328)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !509, file: !323, line: 389, baseType: !125, size: 64, offset: 3392)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !461, file: !462, line: 1244, baseType: !580, size: 64, offset: 2048)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !472, line: 200, size: 17024, elements: !582)
!582 = !{!583, !584, !585, !586, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !581, file: !472, line: 201, baseType: !201, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !581, file: !472, line: 202, baseType: !182, size: 128, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !581, file: !472, line: 203, baseType: !182, size: 128, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !581, file: !472, line: 206, baseType: !587, size: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !472, line: 190, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !472, line: 126, size: 2816, elements: !590)
!590 = !{!591, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !687, !690, !691, !692, !971, !974, !975, !976, !977, !978, !979, !980, !981, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !998}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !589, file: !472, line: 127, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !589, file: !472, line: 127, baseType: !592, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !589, file: !472, line: 128, baseType: !125, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !589, file: !472, line: 129, baseType: !125, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !589, file: !472, line: 130, baseType: !153, size: 512, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !589, file: !472, line: 132, baseType: !35, size: 32, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !589, file: !472, line: 132, baseType: !35, size: 32, offset: 800)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !589, file: !472, line: 133, baseType: !35, size: 32, offset: 832)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !589, file: !472, line: 134, baseType: !35, size: 32, offset: 864)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !589, file: !472, line: 134, baseType: !35, size: 32, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !589, file: !472, line: 134, baseType: !35, size: 32, offset: 928)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !589, file: !472, line: 135, baseType: !35, size: 32, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !589, file: !472, line: 135, baseType: !35, size: 32, offset: 992)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !589, file: !472, line: 136, baseType: !35, size: 32, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !589, file: !472, line: 136, baseType: !35, size: 32, offset: 1056)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !589, file: !472, line: 137, baseType: !35, size: 32, offset: 1088)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !589, file: !472, line: 137, baseType: !35, size: 32, offset: 1120)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !589, file: !472, line: 138, baseType: !126, size: 32, offset: 1152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !589, file: !472, line: 139, baseType: !126, size: 32, offset: 1184)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !589, file: !472, line: 139, baseType: !126, size: 32, offset: 1216)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !589, file: !472, line: 141, baseType: !160, size: 16, offset: 1248)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !589, file: !472, line: 142, baseType: !160, size: 16, offset: 1264)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !589, file: !472, line: 143, baseType: !35, size: 32, offset: 1280)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !589, file: !472, line: 144, baseType: !35, size: 32, offset: 1312)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !589, file: !472, line: 146, baseType: !617, size: 64, offset: 1344)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !472, line: 114, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !472, line: 99, size: 7232, elements: !620)
!620 = !{!621, !623, !624, !625, !626, !627, !628, !636, !640, !655, !664, !671, !681}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !472, line: 100, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !619, file: !472, line: 100, baseType: !622, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !619, file: !472, line: 101, baseType: !35, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !619, file: !472, line: 101, baseType: !35, size: 32, offset: 160)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !619, file: !472, line: 102, baseType: !35, size: 32, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !619, file: !472, line: 102, baseType: !35, size: 32, offset: 224)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !619, file: !472, line: 103, baseType: !629, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !472, line: 59, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !472, line: 56, size: 2112, elements: !632)
!632 = !{!633, !634, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !631, file: !472, line: 57, baseType: !147, size: 2048)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !631, file: !472, line: 58, baseType: !35, size: 32, offset: 2048)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !631, file: !472, line: 58, baseType: !35, size: 32, offset: 2080)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !619, file: !472, line: 106, baseType: !637, size: 6144, offset: 320)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 6144, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 768)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !619, file: !472, line: 107, baseType: !641, size: 64, offset: 6464)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !472, line: 97, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !472, line: 83, size: 8320, elements: !644)
!644 = !{!645, !646, !647, !651, !652, !653, !654}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !643, file: !472, line: 84, baseType: !637, size: 6144)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !643, file: !472, line: 87, baseType: !147, size: 2048, offset: 6144)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !643, file: !472, line: 88, baseType: !648, size: 64, offset: 8192)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !650, line: 41, flags: DIFlagFwdDecl)
!650 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !643, file: !472, line: 90, baseType: !160, size: 16, offset: 8256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !643, file: !472, line: 92, baseType: !160, size: 16, offset: 8272)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !643, file: !472, line: 93, baseType: !160, size: 16, offset: 8288)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !643, file: !472, line: 95, baseType: !160, size: 16, offset: 8304)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !619, file: !472, line: 108, baseType: !656, size: 64, offset: 6528)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !472, line: 66, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !472, line: 61, size: 128, elements: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !658, file: !472, line: 62, baseType: !35, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !658, file: !472, line: 63, baseType: !35, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !658, file: !472, line: 64, baseType: !35, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !658, file: !472, line: 65, baseType: !35, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !619, file: !472, line: 109, baseType: !665, size: 64, offset: 6592)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !472, line: 71, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !472, line: 68, size: 64, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !667, file: !472, line: 69, baseType: !35, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !667, file: !472, line: 70, baseType: !35, size: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !619, file: !472, line: 110, baseType: !672, size: 64, offset: 6656)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !472, line: 81, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !472, line: 73, size: 352, elements: !675)
!675 = !{!676, !677, !678, !679, !680}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !674, file: !472, line: 74, baseType: !492, size: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !674, file: !472, line: 75, baseType: !492, size: 96, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !674, file: !472, line: 76, baseType: !492, size: 96, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !674, file: !472, line: 77, baseType: !35, size: 32, offset: 288)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !674, file: !472, line: 78, baseType: !35, size: 32, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !619, file: !472, line: 113, baseType: !682, size: 512, offset: 6720)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !683, line: 182, baseType: !684)
!683 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !683, line: 180, size: 512, elements: !685)
!685 = !{!686}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !684, file: !683, line: 181, baseType: !153, size: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !589, file: !472, line: 148, baseType: !688, size: 64, offset: 1408)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !472, line: 49, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !589, file: !472, line: 151, baseType: !460, size: 64, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !589, file: !472, line: 152, baseType: !470, size: 64, offset: 1536)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !589, file: !472, line: 153, baseType: !693, size: 64, offset: 1600)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !468, line: 64, size: 19136, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !708, !709, !957, !958, !966, !967, !968, !969, !970}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !694, file: !468, line: 65, baseType: !420, size: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !694, file: !468, line: 66, baseType: !466, size: 64, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !694, file: !468, line: 68, baseType: !438, size: 8192, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !694, file: !468, line: 70, baseType: !35, size: 32, offset: 9216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !694, file: !468, line: 71, baseType: !35, size: 32, offset: 9248)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !694, file: !468, line: 72, baseType: !274, size: 64, offset: 9280)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !694, file: !468, line: 74, baseType: !126, size: 32, offset: 9344)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !694, file: !468, line: 74, baseType: !126, size: 32, offset: 9376)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !694, file: !468, line: 76, baseType: !648, size: 64, offset: 9408)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !694, file: !468, line: 77, baseType: !706, size: 64, offset: 9472)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !468, line: 77, flags: DIFlagFwdDecl)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !694, file: !468, line: 78, baseType: !519, size: 64, offset: 9536)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !694, file: !468, line: 80, baseType: !710, size: 2624, offset: 9600)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !521, line: 340, size: 2624, elements: !711)
!711 = !{!712, !740, !758, !759, !760, !778, !836, !837, !937, !938, !939, !940, !946}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !710, file: !521, line: 341, baseType: !713, size: 576)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !521, line: 251, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !521, line: 207, size: 576, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !714, file: !521, line: 208, baseType: !35, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !714, file: !521, line: 211, baseType: !160, size: 16, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !714, file: !521, line: 212, baseType: !160, size: 16, offset: 48)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !714, file: !521, line: 213, baseType: !126, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !714, file: !521, line: 214, baseType: !160, size: 16, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !714, file: !521, line: 215, baseType: !160, size: 16, offset: 112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !714, file: !521, line: 216, baseType: !160, size: 16, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !714, file: !521, line: 217, baseType: !160, size: 16, offset: 144)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !714, file: !521, line: 218, baseType: !160, size: 16, offset: 160)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !714, file: !521, line: 219, baseType: !160, size: 16, offset: 176)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !714, file: !521, line: 220, baseType: !126, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !714, file: !521, line: 222, baseType: !160, size: 16, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !714, file: !521, line: 225, baseType: !160, size: 16, offset: 240)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !714, file: !521, line: 228, baseType: !35, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !714, file: !521, line: 229, baseType: !35, size: 32, offset: 288)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !714, file: !521, line: 233, baseType: !35, size: 32, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !714, file: !521, line: 236, baseType: !160, size: 16, offset: 352)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !714, file: !521, line: 236, baseType: !160, size: 16, offset: 368)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !714, file: !521, line: 241, baseType: !126, size: 32, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !714, file: !521, line: 244, baseType: !35, size: 32, offset: 416)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !714, file: !521, line: 244, baseType: !35, size: 32, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !714, file: !521, line: 245, baseType: !126, size: 32, offset: 480)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !714, file: !521, line: 248, baseType: !126, size: 32, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !714, file: !521, line: 250, baseType: !35, size: 32, offset: 544)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !710, file: !521, line: 342, baseType: !741, size: 448, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !521, line: 79, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !521, line: 61, size: 448, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !742, file: !521, line: 62, baseType: !125, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !742, file: !521, line: 64, baseType: !160, size: 16, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !742, file: !521, line: 65, baseType: !160, size: 16, offset: 80)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !742, file: !521, line: 67, baseType: !126, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !742, file: !521, line: 68, baseType: !126, size: 32, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !742, file: !521, line: 69, baseType: !126, size: 32, offset: 160)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !742, file: !521, line: 70, baseType: !160, size: 16, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !742, file: !521, line: 71, baseType: !160, size: 16, offset: 208)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !742, file: !521, line: 72, baseType: !523, size: 64, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !742, file: !521, line: 75, baseType: !126, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !742, file: !521, line: 75, baseType: !126, size: 32, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !742, file: !521, line: 75, baseType: !126, size: 32, offset: 352)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !742, file: !521, line: 78, baseType: !126, size: 32, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !742, file: !521, line: 78, baseType: !126, size: 32, offset: 416)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !710, file: !521, line: 343, baseType: !182, size: 128, offset: 1024)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !710, file: !521, line: 344, baseType: !182, size: 128, offset: 1152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !710, file: !521, line: 345, baseType: !761, size: 192, offset: 1280)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !521, line: 278, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !521, line: 270, size: 192, elements: !763)
!763 = !{!764, !765, !766, !767, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !762, file: !521, line: 271, baseType: !35, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !762, file: !521, line: 273, baseType: !126, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !762, file: !521, line: 275, baseType: !35, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !762, file: !521, line: 276, baseType: !35, size: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !762, file: !521, line: 277, baseType: !769, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !521, line: 55, size: 576, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !770, file: !521, line: 56, baseType: !35, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !770, file: !521, line: 57, baseType: !126, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !770, file: !521, line: 58, baseType: !775, size: 512, offset: 64)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !776)
!776 = !{!777, !777}
!777 = !DISubrange(count: 4)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !710, file: !521, line: 346, baseType: !779, size: 384, offset: 1472)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !521, line: 268, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !521, line: 253, size: 384, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !830, !831, !832, !833, !834, !835}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !780, file: !521, line: 254, baseType: !35, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !780, file: !521, line: 255, baseType: !35, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !780, file: !521, line: 255, baseType: !35, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !780, file: !521, line: 258, baseType: !126, size: 32, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !780, file: !521, line: 259, baseType: !787, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !521, line: 164, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !521, line: 108, size: 1664, elements: !790)
!790 = !{!791, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !789, file: !521, line: 109, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !789, file: !521, line: 109, baseType: !792, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !789, file: !521, line: 111, baseType: !153, size: 512, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !789, file: !521, line: 119, baseType: !523, size: 64, offset: 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !789, file: !521, line: 119, baseType: !523, size: 64, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !789, file: !521, line: 125, baseType: !523, size: 64, offset: 768)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !789, file: !521, line: 125, baseType: !523, size: 64, offset: 832)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !789, file: !521, line: 127, baseType: !523, size: 64, offset: 896)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !789, file: !521, line: 130, baseType: !35, size: 32, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !789, file: !521, line: 131, baseType: !35, size: 32, offset: 992)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !789, file: !521, line: 132, baseType: !803, size: 64, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !521, line: 106, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !521, line: 81, size: 512, elements: !806)
!806 = !{!807, !808, !811, !812, !813, !814}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !805, file: !521, line: 82, baseType: !523, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !805, file: !521, line: 97, baseType: !809, size: 256, offset: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 256, elements: !810)
!810 = !{!777, !276}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !805, file: !521, line: 102, baseType: !523, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !805, file: !521, line: 102, baseType: !523, size: 64, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !805, file: !521, line: 104, baseType: !35, size: 32, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !805, file: !521, line: 105, baseType: !35, size: 32, offset: 480)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !789, file: !521, line: 135, baseType: !492, size: 96, offset: 1088)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !789, file: !521, line: 136, baseType: !126, size: 32, offset: 1184)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !789, file: !521, line: 139, baseType: !35, size: 32, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !789, file: !521, line: 139, baseType: !35, size: 32, offset: 1248)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !789, file: !521, line: 139, baseType: !35, size: 32, offset: 1280)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !789, file: !521, line: 140, baseType: !492, size: 96, offset: 1312)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !789, file: !521, line: 143, baseType: !160, size: 16, offset: 1408)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !789, file: !521, line: 144, baseType: !160, size: 16, offset: 1424)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !789, file: !521, line: 145, baseType: !160, size: 16, offset: 1440)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !789, file: !521, line: 148, baseType: !160, size: 16, offset: 1456)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !789, file: !521, line: 149, baseType: !35, size: 32, offset: 1472)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !789, file: !521, line: 150, baseType: !126, size: 32, offset: 1504)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !789, file: !521, line: 152, baseType: !519, size: 64, offset: 1536)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !789, file: !521, line: 163, baseType: !126, size: 32, offset: 1600)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !789, file: !521, line: 163, baseType: !126, size: 32, offset: 1632)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !780, file: !521, line: 261, baseType: !126, size: 32, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !780, file: !521, line: 261, baseType: !126, size: 32, offset: 224)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !780, file: !521, line: 261, baseType: !126, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !780, file: !521, line: 263, baseType: !35, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !780, file: !521, line: 266, baseType: !35, size: 32, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !780, file: !521, line: 267, baseType: !126, size: 32, offset: 352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !710, file: !521, line: 347, baseType: !787, size: 64, offset: 1856)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !710, file: !521, line: 348, baseType: !838, size: 64, offset: 1920)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !521, line: 205, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !521, line: 186, size: 1024, elements: !841)
!841 = !{!842, !844, !845, !846, !848, !849, !850, !858, !859, !860, !935, !936}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !840, file: !521, line: 187, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !840, file: !521, line: 187, baseType: !843, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !840, file: !521, line: 189, baseType: !153, size: 512, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !840, file: !521, line: 191, baseType: !847, size: 64, offset: 640)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !840, file: !521, line: 193, baseType: !35, size: 32, offset: 704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !840, file: !521, line: 193, baseType: !35, size: 32, offset: 736)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !840, file: !521, line: 195, baseType: !851, size: 64, offset: 768)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !521, line: 184, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !521, line: 166, size: 320, elements: !854)
!854 = !{!855, !856, !857}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !853, file: !521, line: 180, baseType: !809, size: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !853, file: !521, line: 182, baseType: !35, size: 32, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !853, file: !521, line: 183, baseType: !35, size: 32, offset: 288)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !840, file: !521, line: 196, baseType: !35, size: 32, offset: 832)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !840, file: !521, line: 198, baseType: !35, size: 32, offset: 864)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !840, file: !521, line: 200, baseType: !861, size: 64, offset: 896)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !650, line: 77, size: 15424, elements: !863)
!863 = !{!864, !865, !866, !869, !872, !873, !876, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !894, !895, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !921, !922, !923, !924, !925, !929}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !862, file: !650, line: 78, baseType: !420, size: 960)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !862, file: !650, line: 80, baseType: !438, size: 8192, offset: 960)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !862, file: !650, line: 82, baseType: !867, size: 64, offset: 9152)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !650, line: 43, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !862, file: !650, line: 83, baseType: !870, size: 64, offset: 9216)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !214, line: 46, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !862, file: !650, line: 86, baseType: !648, size: 64, offset: 9280)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !862, file: !650, line: 87, baseType: !874, size: 64, offset: 9344)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !650, line: 44, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !862, file: !650, line: 89, baseType: !877, size: 512, offset: 9408)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 512, elements: !168)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !862, file: !650, line: 90, baseType: !160, size: 16, offset: 9920)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !862, file: !650, line: 90, baseType: !160, size: 16, offset: 9936)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !862, file: !650, line: 92, baseType: !160, size: 16, offset: 9952)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !862, file: !650, line: 92, baseType: !160, size: 16, offset: 9968)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !862, file: !650, line: 93, baseType: !160, size: 16, offset: 9984)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !862, file: !650, line: 93, baseType: !160, size: 16, offset: 10000)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !862, file: !650, line: 94, baseType: !35, size: 32, offset: 10016)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !862, file: !650, line: 97, baseType: !160, size: 16, offset: 10048)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !862, file: !650, line: 97, baseType: !160, size: 16, offset: 10064)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !862, file: !650, line: 98, baseType: !160, size: 16, offset: 10080)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !862, file: !650, line: 98, baseType: !160, size: 16, offset: 10096)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !862, file: !650, line: 99, baseType: !160, size: 16, offset: 10112)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !862, file: !650, line: 99, baseType: !160, size: 16, offset: 10128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !862, file: !650, line: 100, baseType: !5, size: 32, offset: 10144)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !862, file: !650, line: 101, baseType: !893, size: 64, offset: 10176)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !862, file: !650, line: 103, baseType: !444, size: 64, offset: 10240)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !862, file: !650, line: 104, baseType: !896, size: 64, offset: 10304)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !214, line: 159, size: 448, elements: !898)
!898 = !{!899, !901, !902, !904, !905, !907}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !897, file: !214, line: 161, baseType: !900, size: 64)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !275)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !897, file: !214, line: 162, baseType: !900, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !897, file: !214, line: 163, baseType: !903, size: 32, offset: 128)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 32, elements: !275)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !897, file: !214, line: 164, baseType: !903, size: 32, offset: 160)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !897, file: !214, line: 165, baseType: !906, size: 128, offset: 192)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 128, elements: !275)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !897, file: !214, line: 166, baseType: !908, size: 128, offset: 320)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 128, elements: !275)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !862, file: !650, line: 107, baseType: !126, size: 32, offset: 10368)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !862, file: !650, line: 108, baseType: !35, size: 32, offset: 10400)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !862, file: !650, line: 109, baseType: !160, size: 16, offset: 10432)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !862, file: !650, line: 110, baseType: !160, size: 16, offset: 10448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !862, file: !650, line: 113, baseType: !35, size: 32, offset: 10464)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !862, file: !650, line: 113, baseType: !35, size: 32, offset: 10496)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !862, file: !650, line: 114, baseType: !139, size: 8, offset: 10528)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !862, file: !650, line: 114, baseType: !139, size: 8, offset: 10536)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !862, file: !650, line: 115, baseType: !160, size: 16, offset: 10544)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !862, file: !650, line: 116, baseType: !919, size: 128, offset: 10560)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !920)
!920 = !{!777}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !862, file: !650, line: 119, baseType: !126, size: 32, offset: 10688)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !862, file: !650, line: 119, baseType: !126, size: 32, offset: 10720)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !862, file: !650, line: 122, baseType: !682, size: 512, offset: 10752)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !862, file: !650, line: 123, baseType: !139, size: 8, offset: 11264)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !862, file: !650, line: 125, baseType: !926, size: 56, offset: 11272)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 56, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 7)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !862, file: !650, line: 126, baseType: !930, size: 4096, offset: 11328)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 4096, elements: !168)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !650, line: 69, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !650, line: 67, size: 512, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !932, file: !650, line: 68, baseType: !153, size: 512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !840, file: !521, line: 201, baseType: !126, size: 32, offset: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !840, file: !521, line: 204, baseType: !35, size: 32, offset: 992)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !710, file: !521, line: 350, baseType: !182, size: 128, offset: 1984)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !710, file: !521, line: 351, baseType: !35, size: 32, offset: 2112)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !710, file: !521, line: 351, baseType: !35, size: 32, offset: 2144)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !710, file: !521, line: 353, baseType: !941, size: 64, offset: 2176)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !521, line: 297, baseType: !943)
