; ModuleID = 'blender/source/blender/modifiers/intern/MOD_warp.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_warp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 962, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70}
!63 = !DIEnumerator(name: "eWarp_Falloff_None", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "eWarp_Falloff_Curve", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "eWarp_Falloff_Sharp", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "eWarp_Falloff_Smooth", value: 3, isUnsigned: true)
!67 = !DIEnumerator(name: "eWarp_Falloff_Root", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "eWarp_Falloff_Linear", value: 5, isUnsigned: true)
!69 = !DIEnumerator(name: "eWarp_Falloff_Const", value: 6, isUnsigned: true)
!70 = !DIEnumerator(name: "eWarp_Falloff_Sphere", value: 7, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 76, baseType: !7, size: 32, elements: !73)
!72 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!74 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 393, baseType: !7, size: 32, elements: !116)
!116 = !{!117, !118, !119, !120}
!117 = !DIEnumerator(name: "MOD_DISP_MAP_LOCAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "MOD_DISP_MAP_GLOBAL", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "MOD_DISP_MAP_OBJECT", value: 2, isUnsigned: true)
!120 = !DIEnumerator(name: "MOD_DISP_MAP_UV", value: 3, isUnsigned: true)
!121 = !{!122, !160, !1224, !1234}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "WarpModifierData", file: !61, line: 958, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WarpModifierData", file: !61, line: 939, size: 2432, elements: !125)
!125 = !{!126, !149, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !124, file: !61, line: 940, baseType: !127, size: 896)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !129)
!129 = !{!130, !132, !133, !135, !136, !137, !138, !143, !147}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !128, file: !61, line: 100, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !128, file: !61, line: 100, baseType: !131, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !61, line: 102, baseType: !134, size: 32, offset: 128)
!134 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !128, file: !61, line: 102, baseType: !134, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !128, file: !61, line: 103, baseType: !134, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !128, file: !61, line: 103, baseType: !134, size: 32, offset: 224)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !61, line: 104, baseType: !139, size: 512, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 512, elements: !141)
!140 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !{!142}
!142 = !DISubrange(count: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !128, file: !61, line: 107, baseType: !144, size: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !146, line: 40, flags: DIFlagFwdDecl)
!146 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !128, file: !61, line: 109, baseType: !148, size: 64, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !124, file: !61, line: 942, baseType: !150, size: 64, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !152, line: 202, size: 3328, elements: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = !{!154, !221, !224, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !291, !294, !297, !384, !410, !1103, !1104, !1179, !1200, !1208, !1209}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !152, line: 203, baseType: !155, size: 960)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !156, line: 130, baseType: !157)
!156 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !156, line: 117, size: 960, elements: !158)
!158 = !{!159, !161, !162, !164, !183, !187, !189, !190, !191, !192}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !156, line: 118, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !157, file: !156, line: 118, baseType: !160, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !157, file: !156, line: 119, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !157, file: !156, line: 120, baseType: !165, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !156, line: 136, size: 17600, elements: !167)
!167 = !{!168, !169, !171, !174, !178, !179, !180}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !156, line: 137, baseType: !155, size: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !166, file: !156, line: 138, baseType: !170, size: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !166, file: !156, line: 139, baseType: !172, size: 64, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !156, line: 43, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !156, line: 140, baseType: !175, size: 8192, offset: 1088)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 8192, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !166, file: !156, line: 141, baseType: !175, size: 8192, offset: 9280)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !166, file: !156, line: 148, baseType: !165, size: 64, offset: 17472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !166, file: !156, line: 150, baseType: !181, size: 64, offset: 17536)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !156, line: 45, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !156, line: 121, baseType: !184, size: 528, offset: 256)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 528, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 66)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !157, file: !156, line: 126, baseType: !188, size: 16, offset: 784)
!188 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !157, file: !156, line: 127, baseType: !134, size: 32, offset: 800)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !157, file: !156, line: 128, baseType: !134, size: 32, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !157, file: !156, line: 128, baseType: !134, size: 32, offset: 864)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !157, file: !156, line: 129, baseType: !193, size: 64, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !156, line: 75, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !156, line: 62, size: 1024, elements: !196)
!196 = !{!197, !199, !200, !201, !202, !203, !204, !205, !219, !220}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !156, line: 63, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !195, file: !156, line: 63, baseType: !198, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !156, line: 64, baseType: !140, size: 8, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !195, file: !156, line: 64, baseType: !140, size: 8, offset: 136)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !195, file: !156, line: 65, baseType: !188, size: 16, offset: 144)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !156, line: 66, baseType: !139, size: 512, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !195, file: !156, line: 67, baseType: !134, size: 32, offset: 672)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !156, line: 69, baseType: !206, size: 256, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !156, line: 60, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !156, line: 48, size: 256, elements: !208)
!208 = !{!209, !210, !217, !218}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !207, file: !156, line: 49, baseType: !160, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !207, file: !156, line: 58, baseType: !211, size: 128, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !212, line: 71, baseType: !213)
!212 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !212, line: 69, size: 128, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !213, file: !212, line: 70, baseType: !160, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !213, file: !212, line: 70, baseType: !160, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !207, file: !156, line: 59, baseType: !134, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !207, file: !156, line: 59, baseType: !134, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !195, file: !156, line: 70, baseType: !134, size: 32, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !195, file: !156, line: 74, baseType: !134, size: 32, offset: 992)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !151, file: !152, line: 204, baseType: !222, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !152, line: 45, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !151, file: !152, line: 206, baseType: !225, size: 32, offset: 1024)
!225 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !151, file: !152, line: 206, baseType: !225, size: 32, offset: 1056)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !151, file: !152, line: 207, baseType: !225, size: 32, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !151, file: !152, line: 207, baseType: !225, size: 32, offset: 1120)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !151, file: !152, line: 207, baseType: !225, size: 32, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !151, file: !152, line: 207, baseType: !225, size: 32, offset: 1184)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !151, file: !152, line: 207, baseType: !225, size: 32, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !151, file: !152, line: 207, baseType: !225, size: 32, offset: 1248)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !151, file: !152, line: 208, baseType: !225, size: 32, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !151, file: !152, line: 208, baseType: !225, size: 32, offset: 1312)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !151, file: !152, line: 211, baseType: !225, size: 32, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !151, file: !152, line: 211, baseType: !225, size: 32, offset: 1376)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !151, file: !152, line: 211, baseType: !225, size: 32, offset: 1408)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !151, file: !152, line: 211, baseType: !225, size: 32, offset: 1440)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !151, file: !152, line: 211, baseType: !225, size: 32, offset: 1472)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !151, file: !152, line: 214, baseType: !225, size: 32, offset: 1504)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !151, file: !152, line: 214, baseType: !225, size: 32, offset: 1536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !151, file: !152, line: 217, baseType: !225, size: 32, offset: 1568)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !151, file: !152, line: 218, baseType: !225, size: 32, offset: 1600)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !151, file: !152, line: 219, baseType: !225, size: 32, offset: 1632)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !151, file: !152, line: 220, baseType: !225, size: 32, offset: 1664)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !151, file: !152, line: 221, baseType: !225, size: 32, offset: 1696)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !151, file: !152, line: 222, baseType: !188, size: 16, offset: 1728)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !151, file: !152, line: 222, baseType: !188, size: 16, offset: 1744)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !151, file: !152, line: 224, baseType: !188, size: 16, offset: 1760)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !151, file: !152, line: 224, baseType: !188, size: 16, offset: 1776)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !151, file: !152, line: 227, baseType: !188, size: 16, offset: 1792)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !151, file: !152, line: 227, baseType: !188, size: 16, offset: 1808)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !151, file: !152, line: 229, baseType: !188, size: 16, offset: 1824)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !151, file: !152, line: 229, baseType: !188, size: 16, offset: 1840)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !152, line: 230, baseType: !188, size: 16, offset: 1856)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !151, file: !152, line: 230, baseType: !188, size: 16, offset: 1872)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !151, file: !152, line: 232, baseType: !225, size: 32, offset: 1888)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !151, file: !152, line: 232, baseType: !225, size: 32, offset: 1920)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !151, file: !152, line: 232, baseType: !225, size: 32, offset: 1952)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !151, file: !152, line: 232, baseType: !225, size: 32, offset: 1984)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !151, file: !152, line: 233, baseType: !134, size: 32, offset: 2016)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !151, file: !152, line: 234, baseType: !134, size: 32, offset: 2048)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !151, file: !152, line: 235, baseType: !188, size: 16, offset: 2080)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !151, file: !152, line: 235, baseType: !188, size: 16, offset: 2096)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !151, file: !152, line: 236, baseType: !188, size: 16, offset: 2112)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !151, file: !152, line: 239, baseType: !188, size: 16, offset: 2128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !151, file: !152, line: 240, baseType: !134, size: 32, offset: 2144)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !151, file: !152, line: 241, baseType: !134, size: 32, offset: 2176)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !151, file: !152, line: 241, baseType: !134, size: 32, offset: 2208)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !151, file: !152, line: 241, baseType: !134, size: 32, offset: 2240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !151, file: !152, line: 243, baseType: !225, size: 32, offset: 2272)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !151, file: !152, line: 243, baseType: !225, size: 32, offset: 2304)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !151, file: !152, line: 244, baseType: !225, size: 32, offset: 2336)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !151, file: !152, line: 246, baseType: !275, size: 320, offset: 2368)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !146, line: 50, size: 320, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !275, file: !146, line: 51, baseType: !144, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !275, file: !146, line: 53, baseType: !134, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !275, file: !146, line: 54, baseType: !134, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !275, file: !146, line: 55, baseType: !134, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !275, file: !146, line: 55, baseType: !134, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !275, file: !146, line: 56, baseType: !140, size: 8, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !275, file: !146, line: 56, baseType: !140, size: 8, offset: 200)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !275, file: !146, line: 57, baseType: !140, size: 8, offset: 208)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !275, file: !146, line: 57, baseType: !140, size: 8, offset: 216)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !275, file: !146, line: 59, baseType: !188, size: 16, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !275, file: !146, line: 59, baseType: !188, size: 16, offset: 240)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !275, file: !146, line: 59, baseType: !188, size: 16, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !146, line: 61, baseType: !188, size: 16, offset: 272)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !275, file: !146, line: 63, baseType: !134, size: 32, offset: 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !151, file: !152, line: 248, baseType: !292, size: 64, offset: 2688)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !152, line: 248, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !151, file: !152, line: 249, baseType: !295, size: 64, offset: 2752)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !152, line: 46, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !151, file: !152, line: 250, baseType: !298, size: 64, offset: 2816)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !146, line: 77, size: 15424, elements: !300)
!300 = !{!301, !302, !303, !306, !309, !312, !315, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !335, !336, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !365, !366, !367, !373, !374, !378}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !299, file: !146, line: 78, baseType: !155, size: 960)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !146, line: 80, baseType: !175, size: 8192, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !299, file: !146, line: 82, baseType: !304, size: 64, offset: 9152)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !146, line: 43, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !299, file: !146, line: 83, baseType: !307, size: 64, offset: 9216)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !156, line: 46, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !299, file: !146, line: 86, baseType: !310, size: 64, offset: 9280)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !146, line: 41, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !299, file: !146, line: 87, baseType: !313, size: 64, offset: 9344)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !146, line: 44, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !299, file: !146, line: 89, baseType: !316, size: 512, offset: 9408)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 512, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !299, file: !146, line: 90, baseType: !188, size: 16, offset: 9920)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !299, file: !146, line: 90, baseType: !188, size: 16, offset: 9936)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !299, file: !146, line: 92, baseType: !188, size: 16, offset: 9952)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !299, file: !146, line: 92, baseType: !188, size: 16, offset: 9968)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !299, file: !146, line: 93, baseType: !188, size: 16, offset: 9984)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !299, file: !146, line: 93, baseType: !188, size: 16, offset: 10000)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !299, file: !146, line: 94, baseType: !134, size: 32, offset: 10016)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !299, file: !146, line: 97, baseType: !188, size: 16, offset: 10048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !299, file: !146, line: 97, baseType: !188, size: 16, offset: 10064)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !299, file: !146, line: 98, baseType: !188, size: 16, offset: 10080)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !299, file: !146, line: 98, baseType: !188, size: 16, offset: 10096)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !299, file: !146, line: 99, baseType: !188, size: 16, offset: 10112)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !299, file: !146, line: 99, baseType: !188, size: 16, offset: 10128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !299, file: !146, line: 100, baseType: !7, size: 32, offset: 10144)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !299, file: !146, line: 101, baseType: !334, size: 64, offset: 10176)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !299, file: !146, line: 103, baseType: !181, size: 64, offset: 10240)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !299, file: !146, line: 104, baseType: !337, size: 64, offset: 10304)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !156, line: 159, size: 448, elements: !339)
!339 = !{!340, !344, !345, !347, !348, !350}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !338, file: !156, line: 161, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 2)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !338, file: !156, line: 162, baseType: !341, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !338, file: !156, line: 163, baseType: !346, size: 32, offset: 128)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 32, elements: !342)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !338, file: !156, line: 164, baseType: !346, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !338, file: !156, line: 165, baseType: !349, size: 128, offset: 192)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 128, elements: !342)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !338, file: !156, line: 166, baseType: !351, size: 128, offset: 320)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 128, elements: !342)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !299, file: !146, line: 107, baseType: !225, size: 32, offset: 10368)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !299, file: !146, line: 108, baseType: !134, size: 32, offset: 10400)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !299, file: !146, line: 109, baseType: !188, size: 16, offset: 10432)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !299, file: !146, line: 110, baseType: !188, size: 16, offset: 10448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !299, file: !146, line: 113, baseType: !134, size: 32, offset: 10464)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !299, file: !146, line: 113, baseType: !134, size: 32, offset: 10496)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !299, file: !146, line: 114, baseType: !140, size: 8, offset: 10528)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !299, file: !146, line: 114, baseType: !140, size: 8, offset: 10536)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !299, file: !146, line: 115, baseType: !188, size: 16, offset: 10544)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !299, file: !146, line: 116, baseType: !362, size: 128, offset: 10560)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 4)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !299, file: !146, line: 119, baseType: !225, size: 32, offset: 10688)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !299, file: !146, line: 119, baseType: !225, size: 32, offset: 10720)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !299, file: !146, line: 122, baseType: !368, size: 512, offset: 10752)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !369, line: 182, baseType: !370)
!369 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !369, line: 180, size: 512, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !369, line: 181, baseType: !139, size: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !299, file: !146, line: 123, baseType: !140, size: 8, offset: 11264)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !299, file: !146, line: 125, baseType: !375, size: 56, offset: 11272)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 56, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 7)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !299, file: !146, line: 126, baseType: !379, size: 4096, offset: 11328)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 4096, elements: !317)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !146, line: 69, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !146, line: 67, size: 512, elements: !382)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !146, line: 68, baseType: !139, size: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !151, file: !152, line: 251, baseType: !385, size: 64, offset: 2880)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !152, line: 113, size: 6208, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !397}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !386, file: !152, line: 114, baseType: !188, size: 16)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !386, file: !152, line: 114, baseType: !188, size: 16, offset: 16)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !386, file: !152, line: 115, baseType: !140, size: 8, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !386, file: !152, line: 115, baseType: !140, size: 8, offset: 40)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !386, file: !152, line: 116, baseType: !140, size: 8, offset: 48)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !386, file: !152, line: 117, baseType: !394, size: 8, offset: 56)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 8, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 1)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !386, file: !152, line: 119, baseType: !398, size: 6144, offset: 64)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 6144, elements: !408)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !152, line: 109, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !152, line: 106, size: 192, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !400, file: !152, line: 107, baseType: !225, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !400, file: !152, line: 107, baseType: !225, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !400, file: !152, line: 107, baseType: !225, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !400, file: !152, line: 107, baseType: !225, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !400, file: !152, line: 107, baseType: !225, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !400, file: !152, line: 108, baseType: !134, size: 32, offset: 160)
!408 = !{!409}
!409 = !DISubrange(count: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !151, file: !152, line: 252, baseType: !411, size: 64, offset: 2944)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !152, line: 122, size: 1600, elements: !413)
!413 = !{!414, !1080, !1081, !1087, !1088, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !412, file: !152, line: 123, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !417, line: 115, size: 11392, elements: !418)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = !{!419, !420, !421, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !446, !460, !461, !504, !505, !508, !509, !525, !526, !527, !528, !529, !530, !531, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !612, !613, !614, !615, !616, !617, !618, !619, !620, !623, !626, !629, !630, !631, !632, !633, !636, !639, !1043, !1044, !1050, !1051, !1052, !1053, !1054, !1055, !1057, !1060, !1063, !1065, !1068, !1069}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !416, file: !417, line: 116, baseType: !155, size: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !416, file: !417, line: 117, baseType: !222, size: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !416, file: !417, line: 119, baseType: !422, size: 64, offset: 1024)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !417, line: 57, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !416, file: !417, line: 121, baseType: !188, size: 16, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !416, file: !417, line: 121, baseType: !188, size: 16, offset: 1104)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !416, file: !417, line: 122, baseType: !134, size: 32, offset: 1120)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !416, file: !417, line: 122, baseType: !134, size: 32, offset: 1152)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !416, file: !417, line: 122, baseType: !134, size: 32, offset: 1184)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !416, file: !417, line: 123, baseType: !139, size: 512, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !416, file: !417, line: 124, baseType: !415, size: 64, offset: 1728)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !416, file: !417, line: 124, baseType: !415, size: 64, offset: 1792)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !416, file: !417, line: 127, baseType: !415, size: 64, offset: 1856)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !416, file: !417, line: 127, baseType: !415, size: 64, offset: 1920)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !416, file: !417, line: 127, baseType: !415, size: 64, offset: 1984)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !416, file: !417, line: 128, baseType: !295, size: 64, offset: 2048)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !416, file: !417, line: 130, baseType: !437, size: 64, offset: 2112)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !417, line: 97, size: 832, elements: !439)
!439 = !{!440, !444, !445}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !438, file: !417, line: 98, baseType: !441, size: 768)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 768, elements: !442)
!442 = !{!318, !443}
!443 = !DISubrange(count: 3)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !438, file: !417, line: 99, baseType: !134, size: 32, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !438, file: !417, line: 99, baseType: !134, size: 32, offset: 800)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !416, file: !417, line: 131, baseType: !447, size: 64, offset: 2176)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !449, line: 486, size: 1600, elements: !450)
!449 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !448, file: !449, line: 487, baseType: !155, size: 960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !448, file: !449, line: 489, baseType: !211, size: 128, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !448, file: !449, line: 490, baseType: !211, size: 128, offset: 1088)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !448, file: !449, line: 491, baseType: !211, size: 128, offset: 1216)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !448, file: !449, line: 492, baseType: !211, size: 128, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !448, file: !449, line: 494, baseType: !134, size: 32, offset: 1472)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !448, file: !449, line: 495, baseType: !134, size: 32, offset: 1504)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !448, file: !449, line: 497, baseType: !134, size: 32, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !448, file: !449, line: 498, baseType: !134, size: 32, offset: 1568)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !416, file: !417, line: 132, baseType: !447, size: 64, offset: 2240)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !416, file: !417, line: 133, baseType: !462, size: 64, offset: 2304)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !449, line: 334, size: 1728, elements: !464)
!464 = !{!465, !466, !469, !470, !471, !472, !473, !474, !477, !478, !479, !480, !481, !482, !483, !503}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !463, file: !449, line: 335, baseType: !211, size: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !463, file: !449, line: 336, baseType: !467, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !449, line: 47, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !463, file: !449, line: 338, baseType: !188, size: 16, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !463, file: !449, line: 338, baseType: !188, size: 16, offset: 208)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !463, file: !449, line: 339, baseType: !7, size: 32, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !463, file: !449, line: 340, baseType: !134, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !463, file: !449, line: 342, baseType: !225, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !463, file: !449, line: 343, baseType: !475, size: 96, offset: 320)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 96, elements: !476)
!476 = !{!443}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !463, file: !449, line: 344, baseType: !475, size: 96, offset: 416)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !463, file: !449, line: 347, baseType: !211, size: 128, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !463, file: !449, line: 349, baseType: !134, size: 32, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !463, file: !449, line: 350, baseType: !134, size: 32, offset: 672)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !463, file: !449, line: 351, baseType: !160, size: 64, offset: 704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !463, file: !449, line: 352, baseType: !160, size: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !463, file: !449, line: 354, baseType: !484, size: 384, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !449, line: 116, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !449, line: 94, size: 384, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !485, file: !449, line: 96, baseType: !134, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !485, file: !449, line: 96, baseType: !134, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !485, file: !449, line: 97, baseType: !134, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !485, file: !449, line: 97, baseType: !134, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !485, file: !449, line: 99, baseType: !188, size: 16, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !485, file: !449, line: 100, baseType: !188, size: 16, offset: 144)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !485, file: !449, line: 102, baseType: !188, size: 16, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !485, file: !449, line: 105, baseType: !188, size: 16, offset: 176)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !485, file: !449, line: 108, baseType: !188, size: 16, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !485, file: !449, line: 109, baseType: !188, size: 16, offset: 208)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !485, file: !449, line: 111, baseType: !188, size: 16, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !485, file: !449, line: 112, baseType: !188, size: 16, offset: 240)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !485, file: !449, line: 114, baseType: !134, size: 32, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !485, file: !449, line: 114, baseType: !134, size: 32, offset: 288)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !485, file: !449, line: 115, baseType: !134, size: 32, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !485, file: !449, line: 115, baseType: !134, size: 32, offset: 352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !463, file: !449, line: 355, baseType: !139, size: 512, offset: 1216)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !416, file: !417, line: 134, baseType: !160, size: 64, offset: 2368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !416, file: !417, line: 136, baseType: !506, size: 64, offset: 2432)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !417, line: 58, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !416, file: !417, line: 138, baseType: !484, size: 384, offset: 2496)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !416, file: !417, line: 139, baseType: !510, size: 64, offset: 2880)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !449, line: 80, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !449, line: 72, size: 192, elements: !513)
!513 = !{!514, !521, !522, !523, !524}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !512, file: !449, line: 73, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !449, line: 59, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !449, line: 56, size: 128, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !517, file: !449, line: 57, baseType: !475, size: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !517, file: !449, line: 58, baseType: !134, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !512, file: !449, line: 74, baseType: !134, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !512, file: !449, line: 76, baseType: !134, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !512, file: !449, line: 77, baseType: !134, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !449, line: 79, baseType: !134, size: 32, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !416, file: !417, line: 141, baseType: !211, size: 128, offset: 2944)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !416, file: !417, line: 142, baseType: !211, size: 128, offset: 3072)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !416, file: !417, line: 143, baseType: !211, size: 128, offset: 3200)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !416, file: !417, line: 144, baseType: !211, size: 128, offset: 3328)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !416, file: !417, line: 146, baseType: !134, size: 32, offset: 3456)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !416, file: !417, line: 147, baseType: !134, size: 32, offset: 3488)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !416, file: !417, line: 150, baseType: !532, size: 64, offset: 3520)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !417, line: 50, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !416, file: !417, line: 151, baseType: !148, size: 64, offset: 3584)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !416, file: !417, line: 152, baseType: !134, size: 32, offset: 3648)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !416, file: !417, line: 153, baseType: !134, size: 32, offset: 3680)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !416, file: !417, line: 156, baseType: !475, size: 96, offset: 3712)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !416, file: !417, line: 156, baseType: !475, size: 96, offset: 3808)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !416, file: !417, line: 156, baseType: !475, size: 96, offset: 3904)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !416, file: !417, line: 157, baseType: !475, size: 96, offset: 4000)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !416, file: !417, line: 158, baseType: !475, size: 96, offset: 4096)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !416, file: !417, line: 159, baseType: !475, size: 96, offset: 4192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !416, file: !417, line: 160, baseType: !475, size: 96, offset: 4288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !416, file: !417, line: 160, baseType: !475, size: 96, offset: 4384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !416, file: !417, line: 161, baseType: !362, size: 128, offset: 4480)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !416, file: !417, line: 161, baseType: !362, size: 128, offset: 4608)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !416, file: !417, line: 162, baseType: !475, size: 96, offset: 4736)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !416, file: !417, line: 162, baseType: !475, size: 96, offset: 4832)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !416, file: !417, line: 163, baseType: !225, size: 32, offset: 4928)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !416, file: !417, line: 163, baseType: !225, size: 32, offset: 4960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !416, file: !417, line: 164, baseType: !553, size: 512, offset: 4992)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 512, elements: !554)
!554 = !{!364, !364}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !416, file: !417, line: 165, baseType: !553, size: 512, offset: 5504)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !416, file: !417, line: 166, baseType: !553, size: 512, offset: 6016)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !416, file: !417, line: 167, baseType: !553, size: 512, offset: 6528)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !416, file: !417, line: 176, baseType: !553, size: 512, offset: 7040)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !416, file: !417, line: 178, baseType: !7, size: 32, offset: 7552)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !416, file: !417, line: 180, baseType: !188, size: 16, offset: 7584)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !416, file: !417, line: 181, baseType: !188, size: 16, offset: 7600)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !416, file: !417, line: 183, baseType: !188, size: 16, offset: 7616)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !416, file: !417, line: 183, baseType: !188, size: 16, offset: 7632)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !416, file: !417, line: 184, baseType: !188, size: 16, offset: 7648)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !416, file: !417, line: 184, baseType: !188, size: 16, offset: 7664)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !416, file: !417, line: 185, baseType: !188, size: 16, offset: 7680)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !416, file: !417, line: 186, baseType: !188, size: 16, offset: 7696)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !416, file: !417, line: 187, baseType: !188, size: 16, offset: 7712)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !416, file: !417, line: 188, baseType: !140, size: 8, offset: 7728)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !416, file: !417, line: 189, baseType: !140, size: 8, offset: 7736)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !416, file: !417, line: 192, baseType: !134, size: 32, offset: 7744)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !416, file: !417, line: 192, baseType: !134, size: 32, offset: 7776)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !416, file: !417, line: 192, baseType: !134, size: 32, offset: 7808)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !416, file: !417, line: 192, baseType: !134, size: 32, offset: 7840)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !416, file: !417, line: 194, baseType: !134, size: 32, offset: 7872)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !416, file: !417, line: 202, baseType: !225, size: 32, offset: 7904)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !416, file: !417, line: 202, baseType: !225, size: 32, offset: 7936)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !416, file: !417, line: 202, baseType: !225, size: 32, offset: 7968)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !416, file: !417, line: 211, baseType: !225, size: 32, offset: 8000)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !416, file: !417, line: 212, baseType: !225, size: 32, offset: 8032)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !416, file: !417, line: 213, baseType: !225, size: 32, offset: 8064)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !416, file: !417, line: 214, baseType: !225, size: 32, offset: 8096)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !416, file: !417, line: 215, baseType: !225, size: 32, offset: 8128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !416, file: !417, line: 216, baseType: !225, size: 32, offset: 8160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !416, file: !417, line: 219, baseType: !225, size: 32, offset: 8192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !416, file: !417, line: 220, baseType: !225, size: 32, offset: 8224)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !416, file: !417, line: 221, baseType: !225, size: 32, offset: 8256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !416, file: !417, line: 224, baseType: !589, size: 16, offset: 8288)
!589 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !416, file: !417, line: 224, baseType: !589, size: 16, offset: 8304)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !416, file: !417, line: 226, baseType: !188, size: 16, offset: 8320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !416, file: !417, line: 228, baseType: !140, size: 8, offset: 8336)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !416, file: !417, line: 229, baseType: !140, size: 8, offset: 8344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !416, file: !417, line: 231, baseType: !188, size: 16, offset: 8352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !416, file: !417, line: 232, baseType: !140, size: 8, offset: 8368)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !416, file: !417, line: 233, baseType: !140, size: 8, offset: 8376)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !416, file: !417, line: 234, baseType: !225, size: 32, offset: 8384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !416, file: !417, line: 235, baseType: !225, size: 32, offset: 8416)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !416, file: !417, line: 237, baseType: !211, size: 128, offset: 8448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !416, file: !417, line: 238, baseType: !211, size: 128, offset: 8576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !416, file: !417, line: 239, baseType: !211, size: 128, offset: 8704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !416, file: !417, line: 240, baseType: !211, size: 128, offset: 8832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !416, file: !417, line: 242, baseType: !225, size: 32, offset: 8960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !416, file: !417, line: 244, baseType: !188, size: 16, offset: 8992)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !416, file: !417, line: 245, baseType: !589, size: 16, offset: 9008)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !416, file: !417, line: 246, baseType: !362, size: 128, offset: 9024)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !416, file: !417, line: 248, baseType: !134, size: 32, offset: 9152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !416, file: !417, line: 249, baseType: !134, size: 32, offset: 9184)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !416, file: !417, line: 251, baseType: !610, size: 64, offset: 9216)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !417, line: 251, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !416, file: !417, line: 253, baseType: !140, size: 8, offset: 9280)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !416, file: !417, line: 254, baseType: !140, size: 8, offset: 9288)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !416, file: !417, line: 255, baseType: !188, size: 16, offset: 9296)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !416, file: !417, line: 256, baseType: !475, size: 96, offset: 9312)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !416, file: !417, line: 258, baseType: !211, size: 128, offset: 9408)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !416, file: !417, line: 259, baseType: !211, size: 128, offset: 9536)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !416, file: !417, line: 260, baseType: !211, size: 128, offset: 9664)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !416, file: !417, line: 261, baseType: !211, size: 128, offset: 9792)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !416, file: !417, line: 263, baseType: !621, size: 64, offset: 9920)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !417, line: 52, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !416, file: !417, line: 264, baseType: !624, size: 64, offset: 9984)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !417, line: 53, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !416, file: !417, line: 265, baseType: !627, size: 64, offset: 10048)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !449, line: 46, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !416, file: !417, line: 267, baseType: !140, size: 8, offset: 10112)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !416, file: !417, line: 268, baseType: !140, size: 8, offset: 10120)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !416, file: !417, line: 269, baseType: !188, size: 16, offset: 10128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !416, file: !417, line: 270, baseType: !225, size: 32, offset: 10144)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !416, file: !417, line: 272, baseType: !634, size: 64, offset: 10176)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !417, line: 54, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !416, file: !417, line: 275, baseType: !637, size: 64, offset: 10240)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !417, line: 275, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !416, file: !417, line: 277, baseType: !640, size: 64, offset: 10304)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !642)
!642 = !{!643, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !694, !697, !699, !700, !702, !703, !704, !705, !711, !716, !717, !721, !722, !723, !724, !725, !738, !750, !764, !768, !772, !776, !785, !797, !801, !805, !809, !813, !817, !818, !819, !820, !821, !822, !826, !827, !828, !829, !833, !834, !835, !836, !837, !842, !843, !844, !845, !846, !850, !851, !852, !853, !854, !861, !872, !877, !883, !893, !898, !909, !916, !923, !927, !932, !936, !941, !942, !943, !950, !956, !957, !958, !963, !964, !973, !1000, !1004, !1012, !1016, !1020, !1024, !1032, !1042}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !641, file: !28, line: 180, baseType: !644, size: 1600)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !72, line: 73, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !72, line: 64, size: 1600, elements: !646)
!646 = !{!647, !662, !666, !667, !668, !669, !672}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !645, file: !72, line: 65, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !72, line: 53, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !72, line: 42, size: 832, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !650, file: !72, line: 43, baseType: !134, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !650, file: !72, line: 44, baseType: !134, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !650, file: !72, line: 45, baseType: !134, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !650, file: !72, line: 46, baseType: !134, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !650, file: !72, line: 47, baseType: !134, size: 32, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !650, file: !72, line: 48, baseType: !134, size: 32, offset: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !650, file: !72, line: 49, baseType: !134, size: 32, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !650, file: !72, line: 50, baseType: !134, size: 32, offset: 224)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !650, file: !72, line: 51, baseType: !139, size: 512, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !650, file: !72, line: 52, baseType: !160, size: 64, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !645, file: !72, line: 66, baseType: !663, size: 1312, offset: 64)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 1312, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 41)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !645, file: !72, line: 69, baseType: !134, size: 32, offset: 1376)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !645, file: !72, line: 69, baseType: !134, size: 32, offset: 1408)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !645, file: !72, line: 70, baseType: !134, size: 32, offset: 1440)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !645, file: !72, line: 71, baseType: !670, size: 64, offset: 1472)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !72, line: 71, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !645, file: !72, line: 72, baseType: !673, size: 64, offset: 1536)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !72, line: 59, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !72, line: 57, size: 8192, elements: !676)
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !675, file: !72, line: 58, baseType: !175, size: 8192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !641, file: !28, line: 180, baseType: !644, size: 1600, offset: 1600)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !641, file: !28, line: 180, baseType: !644, size: 1600, offset: 3200)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !641, file: !28, line: 180, baseType: !644, size: 1600, offset: 4800)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !641, file: !28, line: 180, baseType: !644, size: 1600, offset: 6400)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !641, file: !28, line: 181, baseType: !134, size: 32, offset: 8000)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !641, file: !28, line: 181, baseType: !134, size: 32, offset: 8032)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !641, file: !28, line: 181, baseType: !134, size: 32, offset: 8064)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !641, file: !28, line: 181, baseType: !134, size: 32, offset: 8096)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !641, file: !28, line: 181, baseType: !134, size: 32, offset: 8128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !641, file: !28, line: 182, baseType: !134, size: 32, offset: 8160)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !641, file: !28, line: 183, baseType: !134, size: 32, offset: 8192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !641, file: !28, line: 184, baseType: !690, size: 64, offset: 8256)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !691, line: 124, baseType: !692)
!691 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !691, line: 124, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !641, file: !28, line: 185, baseType: !695, size: 64, offset: 8320)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !28, line: 186, baseType: !698, size: 32, offset: 8384)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !641, file: !28, line: 187, baseType: !225, size: 32, offset: 8416)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !641, file: !28, line: 188, baseType: !701, size: 32, offset: 8448)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !641, file: !28, line: 189, baseType: !134, size: 32, offset: 8480)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !641, file: !28, line: 190, baseType: !532, size: 64, offset: 8512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !641, file: !28, line: 193, baseType: !140, size: 8, offset: 8576)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !641, file: !28, line: 196, baseType: !706, size: 64, offset: 8640)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !641)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !641, file: !28, line: 199, baseType: !712, size: 64, offset: 8704)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !709, !715}
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !641, file: !28, line: 202, baseType: !706, size: 64, offset: 8768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !641, file: !28, line: 207, baseType: !718, size: 64, offset: 8832)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!134, !709}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !641, file: !28, line: 208, baseType: !718, size: 64, offset: 8896)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !641, file: !28, line: 209, baseType: !718, size: 64, offset: 8960)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !641, file: !28, line: 210, baseType: !718, size: 64, offset: 9024)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !641, file: !28, line: 211, baseType: !718, size: 64, offset: 9088)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !641, file: !28, line: 218, baseType: !726, size: 64, offset: 9152)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !709, !134, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !731, line: 65, size: 160, elements: !732)
!731 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!732 = !{!733, !734, !736, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !730, file: !731, line: 66, baseType: !475, size: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !730, file: !731, line: 67, baseType: !735, size: 48, offset: 96)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 48, elements: !476)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !730, file: !731, line: 68, baseType: !140, size: 8, offset: 144)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !730, file: !731, line: 68, baseType: !140, size: 8, offset: 152)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !641, file: !28, line: 219, baseType: !739, size: 64, offset: 9216)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !709, !134, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !731, line: 48, size: 96, elements: !744)
!744 = !{!745, !746, !747, !748, !749}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !743, file: !731, line: 49, baseType: !7, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !743, file: !731, line: 49, baseType: !7, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !743, file: !731, line: 50, baseType: !140, size: 8, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !743, file: !731, line: 50, baseType: !140, size: 8, offset: 72)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !743, file: !731, line: 51, baseType: !188, size: 16, offset: 80)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !641, file: !28, line: 220, baseType: !751, size: 64, offset: 9280)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !709, !134, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !731, line: 42, size: 160, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !755, file: !731, line: 43, baseType: !7, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !755, file: !731, line: 43, baseType: !7, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !755, file: !731, line: 43, baseType: !7, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !755, file: !731, line: 43, baseType: !7, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !755, file: !731, line: 44, baseType: !188, size: 16, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !755, file: !731, line: 45, baseType: !140, size: 8, offset: 144)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !755, file: !731, line: 45, baseType: !140, size: 8, offset: 152)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !641, file: !28, line: 227, baseType: !765, size: 64, offset: 9344)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!729, !709}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !641, file: !28, line: 228, baseType: !769, size: 64, offset: 9408)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!742, !709}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !641, file: !28, line: 229, baseType: !773, size: 64, offset: 9472)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!754, !709}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !641, file: !28, line: 230, baseType: !777, size: 64, offset: 9536)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!780, !709}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !731, line: 88, size: 64, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !781, file: !731, line: 89, baseType: !7, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !781, file: !731, line: 90, baseType: !7, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !641, file: !28, line: 231, baseType: !786, size: 64, offset: 9600)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!789, !709}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !731, line: 79, size: 96, elements: !791)
!791 = !{!792, !793, !794, !795, !796}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !790, file: !731, line: 81, baseType: !134, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !790, file: !731, line: 82, baseType: !134, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !790, file: !731, line: 83, baseType: !188, size: 16, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !790, file: !731, line: 84, baseType: !140, size: 8, offset: 80)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !790, file: !731, line: 84, baseType: !140, size: 8, offset: 88)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !641, file: !28, line: 236, baseType: !798, size: 64, offset: 9664)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !709, !729}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !641, file: !28, line: 237, baseType: !802, size: 64, offset: 9728)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !709, !742}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !641, file: !28, line: 238, baseType: !806, size: 64, offset: 9792)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !709, !754}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !641, file: !28, line: 239, baseType: !810, size: 64, offset: 9856)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !709, !780}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !641, file: !28, line: 240, baseType: !814, size: 64, offset: 9920)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !709, !789}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !641, file: !28, line: 245, baseType: !765, size: 64, offset: 9984)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !641, file: !28, line: 246, baseType: !769, size: 64, offset: 10048)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !641, file: !28, line: 247, baseType: !773, size: 64, offset: 10112)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !641, file: !28, line: 248, baseType: !777, size: 64, offset: 10176)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !641, file: !28, line: 249, baseType: !786, size: 64, offset: 10240)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !641, file: !28, line: 255, baseType: !823, size: 64, offset: 10304)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!160, !709, !134, !134}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !641, file: !28, line: 256, baseType: !823, size: 64, offset: 10368)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !641, file: !28, line: 257, baseType: !823, size: 64, offset: 10432)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !641, file: !28, line: 258, baseType: !823, size: 64, offset: 10496)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !641, file: !28, line: 264, baseType: !830, size: 64, offset: 10560)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!160, !709, !134}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !641, file: !28, line: 265, baseType: !830, size: 64, offset: 10624)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !641, file: !28, line: 266, baseType: !830, size: 64, offset: 10688)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !641, file: !28, line: 267, baseType: !830, size: 64, offset: 10752)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !641, file: !28, line: 268, baseType: !830, size: 64, offset: 10816)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !641, file: !28, line: 272, baseType: !838, size: 64, offset: 10880)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!841, !709}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !641, file: !28, line: 273, baseType: !838, size: 64, offset: 10944)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !641, file: !28, line: 274, baseType: !838, size: 64, offset: 11008)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !641, file: !28, line: 275, baseType: !838, size: 64, offset: 11072)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !641, file: !28, line: 276, baseType: !838, size: 64, offset: 11136)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !641, file: !28, line: 279, baseType: !847, size: 64, offset: 11200)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !709, !134, !841, !134}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !641, file: !28, line: 280, baseType: !847, size: 64, offset: 11264)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !641, file: !28, line: 281, baseType: !847, size: 64, offset: 11328)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !641, file: !28, line: 284, baseType: !718, size: 64, offset: 11392)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !641, file: !28, line: 285, baseType: !718, size: 64, offset: 11456)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !641, file: !28, line: 286, baseType: !855, size: 64, offset: 11520)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!858, !709}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !641, file: !28, line: 287, baseType: !862, size: 64, offset: 11584)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!865, !709}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !868)
!868 = !{!869, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !867, file: !28, line: 118, baseType: !870, size: 128)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 128, elements: !363)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !867, file: !28, line: 119, baseType: !870, size: 128, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !641, file: !28, line: 288, baseType: !873, size: 64, offset: 11648)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!876, !709}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !641, file: !28, line: 289, baseType: !878, size: 64, offset: 11712)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{null, !709, !881}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !641, file: !28, line: 290, baseType: !884, size: 64, offset: 11776)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!887, !709}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !889, file: !28, line: 124, baseType: !188, size: 16)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !889, file: !28, line: 125, baseType: !140, size: 8, offset: 16)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !641, file: !28, line: 291, baseType: !894, size: 64, offset: 11840)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!897, !709}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !641, file: !28, line: 299, baseType: !899, size: 64, offset: 11904)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !709, !902, !160, !908}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !160, !134, !905, !905, !906}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !641, file: !28, line: 309, baseType: !910, size: 64, offset: 11968)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !709, !913, !160}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !160, !134, !905, !905}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !641, file: !28, line: 317, baseType: !917, size: 64, offset: 12032)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !709, !920, !160, !908}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !160, !134, !134, !905, !905}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !641, file: !28, line: 327, baseType: !924, size: 64, offset: 12096)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !709, !913, !160, !908}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !641, file: !28, line: 337, baseType: !928, size: 64, offset: 12160)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !709, !931, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !641, file: !28, line: 344, baseType: !933, size: 64, offset: 12224)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !709, !134, !931}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !641, file: !28, line: 347, baseType: !937, size: 64, offset: 12288)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !709, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !641, file: !28, line: 350, baseType: !933, size: 64, offset: 12352)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !641, file: !28, line: 351, baseType: !933, size: 64, offset: 12416)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !641, file: !28, line: 355, baseType: !944, size: 64, offset: 12480)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!947, !415, !709}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !641, file: !28, line: 359, baseType: !951, size: 64, offset: 12544)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!954, !415, !709}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !641, file: !28, line: 364, baseType: !706, size: 64, offset: 12608)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !641, file: !28, line: 367, baseType: !706, size: 64, offset: 12672)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !641, file: !28, line: 373, baseType: !959, size: 64, offset: 12736)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !709, !962, !962}
!962 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !641, file: !28, line: 376, baseType: !706, size: 64, offset: 12800)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !641, file: !28, line: 385, baseType: !965, size: 64, offset: 12864)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !709, !968, !962, !969}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!134, !134, !160}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !641, file: !28, line: 391, baseType: !974, size: 64, offset: 12928)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !709, !977, !995, !160, !999}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!981, !982, !994, !134}
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !731, line: 160, size: 384, elements: !984)
!984 = !{!985, !988, !989, !990, !991, !992, !993}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !983, file: !731, line: 161, baseType: !986, size: 256)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 256, elements: !987)
!987 = !{!364, !343}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !983, file: !731, line: 162, baseType: !298, size: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !983, file: !731, line: 163, baseType: !140, size: 8, offset: 320)
