; ModuleID = 'blender/source/blender/editors/transform/transform_constraints.c'
source_filename = "blender/source/blender/editors/transform/transform_constraints.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TransInfo = type { i32, i32, i32, i16, i32, float, float, void (%struct.TransInfo*, i32*)*, i32 (%struct.TransInfo*, %struct.wmEvent*)*, i32, %struct.TransData*, %struct.TransDataExtension*, %struct.TransData2D*, %struct.TransCon, %struct.TransSnap, %struct.NumInput, %struct.MouseInput, i32, float, [20 x i8], [3 x float], [2 x float], [2 x i32], i16, i16, [3 x float], i8, [4 x [4 x float]], [4 x [4 x float]], [4 x [4 x float]], [4 x [4 x float]], i16, i16, i8, i8, [3 x float], [3 x [3 x float]], [3 x [3 x float]], [64 x i8], %struct.Object*, i8*, void (%struct.TransInfo*)*, i16, i16, i16, i16, i16, [4 x float], [4 x float], [3 x float], [3 x float], i8, i8*, %struct.bContext*, %struct.ScrArea*, %struct.ARegion*, %struct.Scene*, %struct.ToolSettings*, %struct.wmTimer*, %struct.wmKeyMap*, %struct.ReportList*, [2 x i32], float, %struct.Object*, [3 x [3 x float]], i8*, i8*, i8*, i8* }
%struct.wmEvent = type opaque

!180 = !DIEnumerator(name: "TH_ACT_MARKER", value: 142, isUnsigned: true)
!181 = !DIEnumerator(name: "TH_SEL_MARKER", value: 143, isUnsigned: true)
!182 = !DIEnumerator(name: "TH_BUNDLE_SOLID", value: 144, isUnsigned: true)
!183 = !DIEnumerator(name: "TH_DIS_MARKER", value: 145, isUnsigned: true)
!184 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!185 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!186 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!187 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!188 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!189 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!190 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!191 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!192 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!193 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!194 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!195 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!196 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!197 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!198 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!199 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!200 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!201 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!202 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!203 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!204 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!205 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!206 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!207 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!208 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!209 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!210 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!211 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!212 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!213 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!214 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!215 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!216 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!217 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!218 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!219 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!220 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!221 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!222 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!223 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!224 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!225 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!226 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!227 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!228 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!229 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!230 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!231 = !{!232, !236, !237}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLubyte", file: !234, line: 278, baseType: !235)
!234 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!237 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!238 = !{i32 7, !"Dwarf Version", i32 4}
!239 = !{i32 2, !"Debug Info Version", i32 3}
!240 = !{i32 1, !"wchar_size", i32 4}
!241 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!242 = distinct !DISubprogram(name: "constraintNumInput", scope: !1, file: !1, line: 82, type: !243, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2194)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !245, !284}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransInfo", file: !4, line: 384, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransInfo", file: !4, line: 299, size: 11136, elements: !248)
!248 = !{!249, !251, !252, !253, !255, !256, !257, !258, !265, !274, !275, !1868, !1869, !1880, !1915, !1956, !1973, !1989, !1990, !1991, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2032, !2108, !2176, !2177, !2178, !2179, !2182, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !247, file: !4, line: 300, baseType: !250, size: 32)
!250 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !4, line: 301, baseType: !250, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !247, file: !4, line: 302, baseType: !250, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !247, file: !4, line: 303, baseType: !254, size: 16, offset: 96)
!254 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !247, file: !4, line: 304, baseType: !250, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !247, file: !4, line: 305, baseType: !237, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fac", scope: !247, file: !4, line: 306, baseType: !237, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !247, file: !4, line: 307, baseType: !259, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !262, !263}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "handleEvent", scope: !247, file: !4, line: 309, baseType: !266, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !262, !270}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "eRedrawFlag", file: !4, line: 71, baseType: !3)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !273, line: 44, flags: DIFlagFwdDecl)
!273 = !DIFile(filename: "blender/source/blender/editors/include/ED_transform.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !247, file: !4, line: 311, baseType: !250, size: 32, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !247, file: !4, line: 312, baseType: !276, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransData", file: !4, line: 285, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransData", file: !4, line: 266, size: 1792, elements: !279)
!279 = !{!280, !281, !282, !283, !285, !289, !290, !291, !292, !295, !296, !297, !1825, !1828, !1856, !1865, !1866, !1867}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !278, file: !4, line: 267, baseType: !237, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rdist", scope: !278, file: !4, line: 268, baseType: !237, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !278, file: !4, line: 269, baseType: !237, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !278, file: !4, line: 270, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "iloc", scope: !278, file: !4, line: 271, baseType: !286, size: 96, offset: 192)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 96, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 3)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !278, file: !4, line: 272, baseType: !284, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ival", scope: !278, file: !4, line: 273, baseType: !237, size: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !278, file: !4, line: 274, baseType: !286, size: 96, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mtx", scope: !278, file: !4, line: 275, baseType: !293, size: 288, offset: 512)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 288, elements: !294)
!294 = !{!288, !288}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "smtx", scope: !278, file: !4, line: 276, baseType: !293, size: 288, offset: 800)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "axismtx", scope: !278, file: !4, line: 277, baseType: !293, size: 288, offset: 1088)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !278, file: !4, line: 278, baseType: !298, size: 64, offset: 1408)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !300, line: 115, size: 11392, elements: !301)
!300 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!301 = !{!302, !371, !375, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !392, !402, !416, !417, !458, !459, !462, !463, !479, !480, !481, !482, !483, !484, !485, !489, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !505, !506, !507, !508, !509, !510, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !570, !571, !572, !573, !574, !575, !576, !577, !578, !581, !584, !587, !588, !589, !590, !591, !594, !597, !600, !601, !607, !608, !609, !610, !611, !612, !614, !617, !620, !624, !1813, !1814}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !299, file: !300, line: 116, baseType: !303, size: 960)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !304, line: 130, baseType: !305)
!304 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !304, line: 117, size: 960, elements: !306)
!306 = !{!307, !308, !309, !311, !331, !335, !336, !337, !338, !339}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !304, line: 118, baseType: !236, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !305, file: !304, line: 118, baseType: !236, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !305, file: !304, line: 119, baseType: !310, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !305, file: !304, line: 120, baseType: !312, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !304, line: 136, size: 17600, elements: !314)
!314 = !{!315, !316, !318, !321, !326, !327, !328}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !313, file: !304, line: 137, baseType: !303, size: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !313, file: !304, line: 138, baseType: !317, size: 64, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !313, file: !304, line: 139, baseType: !319, size: 64, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !304, line: 43, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !304, line: 140, baseType: !322, size: 8192, offset: 1088)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 8192, elements: !324)
!323 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!324 = !{!325}
!325 = !DISubrange(count: 1024)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !313, file: !304, line: 141, baseType: !322, size: 8192, offset: 9280)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !313, file: !304, line: 148, baseType: !312, size: 64, offset: 17472)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !313, file: !304, line: 150, baseType: !329, size: 64, offset: 17536)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !304, line: 45, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !304, line: 121, baseType: !332, size: 528, offset: 256)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 528, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 66)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !305, file: !304, line: 126, baseType: !254, size: 16, offset: 784)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !305, file: !304, line: 127, baseType: !250, size: 32, offset: 800)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !305, file: !304, line: 128, baseType: !250, size: 32, offset: 832)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !305, file: !304, line: 128, baseType: !250, size: 32, offset: 864)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !305, file: !304, line: 129, baseType: !340, size: 64, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !304, line: 75, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !304, line: 62, size: 1024, elements: !343)
!343 = !{!344, !346, !347, !348, !349, !350, !354, !355, !369, !370}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !304, line: 63, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !342, file: !304, line: 63, baseType: !345, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !342, file: !304, line: 64, baseType: !323, size: 8, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !342, file: !304, line: 64, baseType: !323, size: 8, offset: 136)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !342, file: !304, line: 65, baseType: !254, size: 16, offset: 144)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !304, line: 66, baseType: !351, size: 512, offset: 160)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !342, file: !304, line: 67, baseType: !250, size: 32, offset: 672)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !304, line: 69, baseType: !356, size: 256, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !304, line: 60, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !304, line: 48, size: 256, elements: !358)
!358 = !{!359, !360, !367, !368}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !357, file: !304, line: 49, baseType: !236, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !357, file: !304, line: 58, baseType: !361, size: 128, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !362, line: 71, baseType: !363)
!362 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !362, line: 69, size: 128, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !363, file: !362, line: 70, baseType: !236, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !363, file: !362, line: 70, baseType: !236, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !357, file: !304, line: 59, baseType: !250, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !357, file: !304, line: 59, baseType: !250, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !342, file: !304, line: 70, baseType: !250, size: 32, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !342, file: !304, line: 74, baseType: !250, size: 32, offset: 992)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !299, file: !300, line: 117, baseType: !372, size: 64, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !374, line: 45, flags: DIFlagFwdDecl)
!374 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !299, file: !300, line: 119, baseType: !376, size: 64, offset: 1024)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !300, line: 57, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !299, file: !300, line: 121, baseType: !254, size: 16, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !299, file: !300, line: 121, baseType: !254, size: 16, offset: 1104)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !299, file: !300, line: 122, baseType: !250, size: 32, offset: 1120)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !299, file: !300, line: 122, baseType: !250, size: 32, offset: 1152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !299, file: !300, line: 122, baseType: !250, size: 32, offset: 1184)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !299, file: !300, line: 123, baseType: !351, size: 512, offset: 1216)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !299, file: !300, line: 124, baseType: !298, size: 64, offset: 1728)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !299, file: !300, line: 124, baseType: !298, size: 64, offset: 1792)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !299, file: !300, line: 127, baseType: !298, size: 64, offset: 1856)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !299, file: !300, line: 127, baseType: !298, size: 64, offset: 1920)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !299, file: !300, line: 127, baseType: !298, size: 64, offset: 1984)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !299, file: !300, line: 128, baseType: !390, size: 64, offset: 2048)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !374, line: 46, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !299, file: !300, line: 130, baseType: !393, size: 64, offset: 2112)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !300, line: 97, size: 832, elements: !395)
!395 = !{!396, !400, !401}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !394, file: !300, line: 98, baseType: !397, size: 768)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 768, elements: !398)
!398 = !{!399, !288}
!399 = !DISubrange(count: 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !394, file: !300, line: 99, baseType: !250, size: 32, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !394, file: !300, line: 99, baseType: !250, size: 32, offset: 800)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !299, file: !300, line: 131, baseType: !403, size: 64, offset: 2176)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !405, line: 486, size: 1600, elements: !406)
!405 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !404, file: !405, line: 487, baseType: !303, size: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !404, file: !405, line: 489, baseType: !361, size: 128, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !404, file: !405, line: 490, baseType: !361, size: 128, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !404, file: !405, line: 491, baseType: !361, size: 128, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !404, file: !405, line: 492, baseType: !361, size: 128, offset: 1344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !405, line: 494, baseType: !250, size: 32, offset: 1472)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !404, file: !405, line: 495, baseType: !250, size: 32, offset: 1504)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !404, file: !405, line: 497, baseType: !250, size: 32, offset: 1536)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !404, file: !405, line: 498, baseType: !250, size: 32, offset: 1568)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !299, file: !300, line: 132, baseType: !403, size: 64, offset: 2240)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !299, file: !300, line: 133, baseType: !418, size: 64, offset: 2304)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !405, line: 334, size: 1728, elements: !420)
!420 = !{!421, !422, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !457}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !419, file: !405, line: 335, baseType: !361, size: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !419, file: !405, line: 336, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !405, line: 47, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !405, line: 338, baseType: !254, size: 16, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !419, file: !405, line: 338, baseType: !254, size: 16, offset: 208)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !419, file: !405, line: 339, baseType: !5, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !419, file: !405, line: 340, baseType: !250, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !419, file: !405, line: 342, baseType: !237, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !419, file: !405, line: 343, baseType: !286, size: 96, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !419, file: !405, line: 344, baseType: !286, size: 96, offset: 416)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !419, file: !405, line: 347, baseType: !361, size: 128, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !419, file: !405, line: 349, baseType: !250, size: 32, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !419, file: !405, line: 350, baseType: !250, size: 32, offset: 672)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !419, file: !405, line: 351, baseType: !236, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !419, file: !405, line: 352, baseType: !236, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !419, file: !405, line: 354, baseType: !438, size: 384, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !405, line: 116, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !405, line: 94, size: 384, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !439, file: !405, line: 96, baseType: !250, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !439, file: !405, line: 96, baseType: !250, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !439, file: !405, line: 97, baseType: !250, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !439, file: !405, line: 97, baseType: !250, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !439, file: !405, line: 99, baseType: !254, size: 16, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !439, file: !405, line: 100, baseType: !254, size: 16, offset: 144)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !439, file: !405, line: 102, baseType: !254, size: 16, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !439, file: !405, line: 105, baseType: !254, size: 16, offset: 176)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !439, file: !405, line: 108, baseType: !254, size: 16, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !439, file: !405, line: 109, baseType: !254, size: 16, offset: 208)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !439, file: !405, line: 111, baseType: !254, size: 16, offset: 224)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !439, file: !405, line: 112, baseType: !254, size: 16, offset: 240)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !439, file: !405, line: 114, baseType: !250, size: 32, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !439, file: !405, line: 114, baseType: !250, size: 32, offset: 288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !439, file: !405, line: 115, baseType: !250, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !439, file: !405, line: 115, baseType: !250, size: 32, offset: 352)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !419, file: !405, line: 355, baseType: !351, size: 512, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !300, line: 134, baseType: !236, size: 64, offset: 2368)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !299, file: !300, line: 136, baseType: !460, size: 64, offset: 2432)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !300, line: 58, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !299, file: !300, line: 138, baseType: !438, size: 384, offset: 2496)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !299, file: !300, line: 139, baseType: !464, size: 64, offset: 2880)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !405, line: 80, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !405, line: 72, size: 192, elements: !467)
!467 = !{!468, !475, !476, !477, !478}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !466, file: !405, line: 73, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !405, line: 59, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !405, line: 56, size: 128, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !471, file: !405, line: 57, baseType: !286, size: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !471, file: !405, line: 58, baseType: !250, size: 32, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !466, file: !405, line: 74, baseType: !250, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !466, file: !405, line: 76, baseType: !250, size: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !466, file: !405, line: 77, baseType: !250, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !466, file: !405, line: 79, baseType: !250, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !299, file: !300, line: 141, baseType: !361, size: 128, offset: 2944)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !299, file: !300, line: 142, baseType: !361, size: 128, offset: 3072)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !299, file: !300, line: 143, baseType: !361, size: 128, offset: 3200)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !299, file: !300, line: 144, baseType: !361, size: 128, offset: 3328)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !299, file: !300, line: 146, baseType: !250, size: 32, offset: 3456)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !299, file: !300, line: 147, baseType: !250, size: 32, offset: 3488)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !299, file: !300, line: 150, baseType: !486, size: 64, offset: 3520)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !300, line: 50, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !299, file: !300, line: 151, baseType: !490, size: 64, offset: 3584)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !299, file: !300, line: 152, baseType: !250, size: 32, offset: 3648)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !299, file: !300, line: 153, baseType: !250, size: 32, offset: 3680)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !299, file: !300, line: 156, baseType: !286, size: 96, offset: 3712)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !299, file: !300, line: 156, baseType: !286, size: 96, offset: 3808)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !299, file: !300, line: 156, baseType: !286, size: 96, offset: 3904)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !300, line: 157, baseType: !286, size: 96, offset: 4000)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !299, file: !300, line: 158, baseType: !286, size: 96, offset: 4096)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !299, file: !300, line: 159, baseType: !286, size: 96, offset: 4192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !299, file: !300, line: 160, baseType: !286, size: 96, offset: 4288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !299, file: !300, line: 160, baseType: !286, size: 96, offset: 4384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !299, file: !300, line: 161, baseType: !502, size: 128, offset: 4480)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 128, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 4)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !299, file: !300, line: 161, baseType: !502, size: 128, offset: 4608)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !299, file: !300, line: 162, baseType: !286, size: 96, offset: 4736)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !299, file: !300, line: 162, baseType: !286, size: 96, offset: 4832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !299, file: !300, line: 163, baseType: !237, size: 32, offset: 4928)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !299, file: !300, line: 163, baseType: !237, size: 32, offset: 4960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !299, file: !300, line: 164, baseType: !511, size: 512, offset: 4992)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 512, elements: !512)
!512 = !{!504, !504}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !299, file: !300, line: 165, baseType: !511, size: 512, offset: 5504)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !299, file: !300, line: 166, baseType: !511, size: 512, offset: 6016)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !299, file: !300, line: 167, baseType: !511, size: 512, offset: 6528)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !299, file: !300, line: 176, baseType: !511, size: 512, offset: 7040)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !299, file: !300, line: 178, baseType: !5, size: 32, offset: 7552)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !299, file: !300, line: 180, baseType: !254, size: 16, offset: 7584)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !299, file: !300, line: 181, baseType: !254, size: 16, offset: 7600)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !299, file: !300, line: 183, baseType: !254, size: 16, offset: 7616)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !299, file: !300, line: 183, baseType: !254, size: 16, offset: 7632)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !299, file: !300, line: 184, baseType: !254, size: 16, offset: 7648)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !299, file: !300, line: 184, baseType: !254, size: 16, offset: 7664)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !299, file: !300, line: 185, baseType: !254, size: 16, offset: 7680)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !299, file: !300, line: 186, baseType: !254, size: 16, offset: 7696)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !299, file: !300, line: 187, baseType: !254, size: 16, offset: 7712)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !299, file: !300, line: 188, baseType: !323, size: 8, offset: 7728)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !299, file: !300, line: 189, baseType: !323, size: 8, offset: 7736)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !299, file: !300, line: 192, baseType: !250, size: 32, offset: 7744)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !299, file: !300, line: 192, baseType: !250, size: 32, offset: 7776)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !299, file: !300, line: 192, baseType: !250, size: 32, offset: 7808)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !299, file: !300, line: 192, baseType: !250, size: 32, offset: 7840)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !299, file: !300, line: 194, baseType: !250, size: 32, offset: 7872)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !299, file: !300, line: 202, baseType: !237, size: 32, offset: 7904)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !299, file: !300, line: 202, baseType: !237, size: 32, offset: 7936)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !299, file: !300, line: 202, baseType: !237, size: 32, offset: 7968)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !299, file: !300, line: 211, baseType: !237, size: 32, offset: 8000)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !299, file: !300, line: 212, baseType: !237, size: 32, offset: 8032)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !299, file: !300, line: 213, baseType: !237, size: 32, offset: 8064)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !299, file: !300, line: 214, baseType: !237, size: 32, offset: 8096)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !299, file: !300, line: 215, baseType: !237, size: 32, offset: 8128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !299, file: !300, line: 216, baseType: !237, size: 32, offset: 8160)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !299, file: !300, line: 219, baseType: !237, size: 32, offset: 8192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !299, file: !300, line: 220, baseType: !237, size: 32, offset: 8224)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !299, file: !300, line: 221, baseType: !237, size: 32, offset: 8256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !299, file: !300, line: 224, baseType: !547, size: 16, offset: 8288)
!547 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !299, file: !300, line: 224, baseType: !547, size: 16, offset: 8304)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !299, file: !300, line: 226, baseType: !254, size: 16, offset: 8320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !299, file: !300, line: 228, baseType: !323, size: 8, offset: 8336)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !299, file: !300, line: 229, baseType: !323, size: 8, offset: 8344)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !299, file: !300, line: 231, baseType: !254, size: 16, offset: 8352)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !299, file: !300, line: 232, baseType: !323, size: 8, offset: 8368)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !299, file: !300, line: 233, baseType: !323, size: 8, offset: 8376)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !299, file: !300, line: 234, baseType: !237, size: 32, offset: 8384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !299, file: !300, line: 235, baseType: !237, size: 32, offset: 8416)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !299, file: !300, line: 237, baseType: !361, size: 128, offset: 8448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !299, file: !300, line: 238, baseType: !361, size: 128, offset: 8576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !299, file: !300, line: 239, baseType: !361, size: 128, offset: 8704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !299, file: !300, line: 240, baseType: !361, size: 128, offset: 8832)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !299, file: !300, line: 242, baseType: !237, size: 32, offset: 8960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !299, file: !300, line: 244, baseType: !254, size: 16, offset: 8992)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !299, file: !300, line: 245, baseType: !547, size: 16, offset: 9008)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !299, file: !300, line: 246, baseType: !502, size: 128, offset: 9024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !299, file: !300, line: 248, baseType: !250, size: 32, offset: 9152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !299, file: !300, line: 249, baseType: !250, size: 32, offset: 9184)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !299, file: !300, line: 251, baseType: !568, size: 64, offset: 9216)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !300, line: 251, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !299, file: !300, line: 253, baseType: !323, size: 8, offset: 9280)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !299, file: !300, line: 254, baseType: !323, size: 8, offset: 9288)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !299, file: !300, line: 255, baseType: !254, size: 16, offset: 9296)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !299, file: !300, line: 256, baseType: !286, size: 96, offset: 9312)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !299, file: !300, line: 258, baseType: !361, size: 128, offset: 9408)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !299, file: !300, line: 259, baseType: !361, size: 128, offset: 9536)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !299, file: !300, line: 260, baseType: !361, size: 128, offset: 9664)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !299, file: !300, line: 261, baseType: !361, size: 128, offset: 9792)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !299, file: !300, line: 263, baseType: !579, size: 64, offset: 9920)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !300, line: 52, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !299, file: !300, line: 264, baseType: !582, size: 64, offset: 9984)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !300, line: 53, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !299, file: !300, line: 265, baseType: !585, size: 64, offset: 10048)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !405, line: 46, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !299, file: !300, line: 267, baseType: !323, size: 8, offset: 10112)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !299, file: !300, line: 268, baseType: !323, size: 8, offset: 10120)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !299, file: !300, line: 269, baseType: !254, size: 16, offset: 10128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !299, file: !300, line: 270, baseType: !237, size: 32, offset: 10144)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !299, file: !300, line: 272, baseType: !592, size: 64, offset: 10176)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !300, line: 54, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !299, file: !300, line: 275, baseType: !595, size: 64, offset: 10240)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !300, line: 275, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !299, file: !300, line: 277, baseType: !598, size: 64, offset: 10304)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !300, line: 56, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !299, file: !300, line: 277, baseType: !598, size: 64, offset: 10368)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !299, file: !300, line: 278, baseType: !602, size: 64, offset: 10432)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !603, line: 27, baseType: !604)
!603 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !605, line: 45, baseType: !606)
!605 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!606 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !299, file: !300, line: 279, baseType: !602, size: 64, offset: 10496)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !299, file: !300, line: 280, baseType: !5, size: 32, offset: 10560)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !299, file: !300, line: 281, baseType: !5, size: 32, offset: 10592)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !299, file: !300, line: 283, baseType: !361, size: 128, offset: 10624)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !299, file: !300, line: 284, baseType: !361, size: 128, offset: 10752)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !299, file: !300, line: 285, baseType: !613, size: 64, offset: 10880)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !299, file: !300, line: 287, baseType: !615, size: 64, offset: 10944)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !300, line: 59, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !299, file: !300, line: 288, baseType: !618, size: 64, offset: 11008)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !300, line: 288, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !299, file: !300, line: 290, baseType: !621, size: 64, offset: 11072)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 64, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 2)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !299, file: !300, line: 291, baseType: !625, size: 64, offset: 11136)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !627, line: 65, baseType: !628)
!627 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !627, line: 50, size: 320, elements: !629)
!629 = !{!630, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !628, file: !627, line: 51, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !633, line: 1216, size: 39680, elements: !634)
!633 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!634 = !{!635, !636, !637, !638, !641, !642, !643, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !669, !742, !1169, !1383, !1386, !1675, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1697, !1698, !1699, !1700, !1701, !1709, !1776, !1783, !1784, !1791, !1792, !1793, !1794, !1795, !1796, !1797}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !632, file: !633, line: 1217, baseType: !303, size: 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !632, file: !633, line: 1218, baseType: !372, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !632, file: !633, line: 1220, baseType: !298, size: 64, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !632, file: !633, line: 1221, baseType: !639, size: 64, offset: 1088)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !633, line: 52, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !632, file: !633, line: 1223, baseType: !631, size: 64, offset: 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !632, file: !633, line: 1225, baseType: !361, size: 128, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !632, file: !633, line: 1226, baseType: !644, size: 64, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !633, line: 69, size: 320, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !645, file: !633, line: 70, baseType: !644, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !645, file: !633, line: 70, baseType: !644, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !645, file: !633, line: 71, baseType: !5, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !645, file: !633, line: 71, baseType: !5, size: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !645, file: !633, line: 72, baseType: !250, size: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !645, file: !633, line: 73, baseType: !254, size: 16, offset: 224)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !645, file: !633, line: 73, baseType: !254, size: 16, offset: 240)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !645, file: !633, line: 74, baseType: !298, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !632, file: !633, line: 1227, baseType: !298, size: 64, offset: 1408)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !632, file: !633, line: 1229, baseType: !286, size: 96, offset: 1472)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !632, file: !633, line: 1230, baseType: !286, size: 96, offset: 1568)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !632, file: !633, line: 1231, baseType: !286, size: 96, offset: 1664)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !632, file: !633, line: 1231, baseType: !286, size: 96, offset: 1760)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !632, file: !633, line: 1233, baseType: !5, size: 32, offset: 1856)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !632, file: !633, line: 1234, baseType: !250, size: 32, offset: 1888)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !632, file: !633, line: 1235, baseType: !5, size: 32, offset: 1920)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !632, file: !633, line: 1237, baseType: !254, size: 16, offset: 1952)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !632, file: !633, line: 1239, baseType: !323, size: 8, offset: 1968)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !632, file: !633, line: 1240, baseType: !666, size: 8, offset: 1976)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 8, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 1)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !632, file: !633, line: 1242, baseType: !670, size: 64, offset: 1984)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !672, line: 328, size: 3456, elements: !673)
!672 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!673 = !{!674, !675, !676, !679, !680, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !708, !709, !710, !713, !718, !719, !722, !726, !730, !734, !738, !739, !740, !741}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !671, file: !672, line: 329, baseType: !303, size: 960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !671, file: !672, line: 330, baseType: !372, size: 64, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !671, file: !672, line: 332, baseType: !677, size: 64, offset: 1024)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !672, line: 332, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !671, file: !672, line: 333, baseType: !351, size: 512, offset: 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !671, file: !672, line: 335, baseType: !681, size: 64, offset: 1600)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !672, line: 335, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !671, file: !672, line: 337, baseType: !460, size: 64, offset: 1664)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !671, file: !672, line: 338, baseType: !621, size: 64, offset: 1728)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !671, file: !672, line: 340, baseType: !361, size: 128, offset: 1792)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !671, file: !672, line: 340, baseType: !361, size: 128, offset: 1920)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !672, line: 342, baseType: !250, size: 32, offset: 2048)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !671, file: !672, line: 342, baseType: !250, size: 32, offset: 2080)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !671, file: !672, line: 343, baseType: !250, size: 32, offset: 2112)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !671, file: !672, line: 345, baseType: !250, size: 32, offset: 2144)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !671, file: !672, line: 346, baseType: !250, size: 32, offset: 2176)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !671, file: !672, line: 347, baseType: !254, size: 16, offset: 2208)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !671, file: !672, line: 348, baseType: !254, size: 16, offset: 2224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !671, file: !672, line: 349, baseType: !250, size: 32, offset: 2240)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !671, file: !672, line: 351, baseType: !250, size: 32, offset: 2272)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !671, file: !672, line: 353, baseType: !254, size: 16, offset: 2304)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !671, file: !672, line: 354, baseType: !254, size: 16, offset: 2320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !671, file: !672, line: 355, baseType: !250, size: 32, offset: 2336)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !671, file: !672, line: 357, baseType: !700, size: 128, offset: 2368)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !701, line: 95, baseType: !702)
!701 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !701, line: 92, size: 128, elements: !703)
!703 = !{!704, !705, !706, !707}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !702, file: !701, line: 93, baseType: !237, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !702, file: !701, line: 93, baseType: !237, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !702, file: !701, line: 94, baseType: !237, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !702, file: !701, line: 94, baseType: !237, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !671, file: !672, line: 363, baseType: !361, size: 128, offset: 2496)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !671, file: !672, line: 363, baseType: !361, size: 128, offset: 2624)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !671, file: !672, line: 368, baseType: !711, size: 64, offset: 2752)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !672, line: 48, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !671, file: !672, line: 372, baseType: !714, size: 32, offset: 2816)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !672, line: 274, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !672, line: 271, size: 32, elements: !716)
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !672, line: 273, baseType: !5, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !671, file: !672, line: 373, baseType: !250, size: 32, offset: 2848)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !671, file: !672, line: 382, baseType: !720, size: 64, offset: 2880)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !672, line: 46, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !671, file: !672, line: 385, baseType: !723, size: 64, offset: 2944)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !236, !237}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !671, file: !672, line: 386, baseType: !727, size: 64, offset: 3008)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !236, !490}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !671, file: !672, line: 387, baseType: !731, size: 64, offset: 3072)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!250, !236}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !671, file: !672, line: 388, baseType: !735, size: 64, offset: 3136)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !236}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !671, file: !672, line: 389, baseType: !236, size: 64, offset: 3200)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !671, file: !672, line: 389, baseType: !236, size: 64, offset: 3264)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !671, file: !672, line: 389, baseType: !236, size: 64, offset: 3328)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !671, file: !672, line: 389, baseType: !236, size: 64, offset: 3392)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !632, file: !633, line: 1244, baseType: !743, size: 64, offset: 2048)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !745, line: 200, size: 17024, elements: !746)
!745 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!746 = !{!747, !748, !749, !750, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !744, file: !745, line: 201, baseType: !613, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !744, file: !745, line: 202, baseType: !361, size: 128, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !744, file: !745, line: 203, baseType: !361, size: 128, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !744, file: !745, line: 206, baseType: !751, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !745, line: 190, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !745, line: 126, size: 2816, elements: !754)
!754 = !{!755, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !853, !854, !855, !856, !1134, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1161}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !745, line: 127, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !753, file: !745, line: 127, baseType: !756, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !753, file: !745, line: 128, baseType: !236, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !753, file: !745, line: 129, baseType: !236, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !753, file: !745, line: 130, baseType: !351, size: 512, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !753, file: !745, line: 132, baseType: !250, size: 32, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !753, file: !745, line: 132, baseType: !250, size: 32, offset: 800)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !753, file: !745, line: 133, baseType: !250, size: 32, offset: 832)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !753, file: !745, line: 134, baseType: !250, size: 32, offset: 864)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !753, file: !745, line: 134, baseType: !250, size: 32, offset: 896)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !753, file: !745, line: 134, baseType: !250, size: 32, offset: 928)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !753, file: !745, line: 135, baseType: !250, size: 32, offset: 960)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !753, file: !745, line: 135, baseType: !250, size: 32, offset: 992)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !753, file: !745, line: 136, baseType: !250, size: 32, offset: 1024)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !753, file: !745, line: 136, baseType: !250, size: 32, offset: 1056)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !753, file: !745, line: 137, baseType: !250, size: 32, offset: 1088)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !753, file: !745, line: 137, baseType: !250, size: 32, offset: 1120)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !753, file: !745, line: 138, baseType: !237, size: 32, offset: 1152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !753, file: !745, line: 139, baseType: !237, size: 32, offset: 1184)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !753, file: !745, line: 139, baseType: !237, size: 32, offset: 1216)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !753, file: !745, line: 141, baseType: !254, size: 16, offset: 1248)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !753, file: !745, line: 142, baseType: !254, size: 16, offset: 1264)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !753, file: !745, line: 143, baseType: !250, size: 32, offset: 1280)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !753, file: !745, line: 144, baseType: !250, size: 32, offset: 1312)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !753, file: !745, line: 146, baseType: !781, size: 64, offset: 1344)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !745, line: 114, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !745, line: 99, size: 7232, elements: !784)
!784 = !{!785, !787, !788, !789, !790, !791, !792, !803, !807, !821, !830, !837, !847}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !783, file: !745, line: 100, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !783, file: !745, line: 100, baseType: !786, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !783, file: !745, line: 101, baseType: !250, size: 32, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !783, file: !745, line: 101, baseType: !250, size: 32, offset: 160)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !783, file: !745, line: 102, baseType: !250, size: 32, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !783, file: !745, line: 102, baseType: !250, size: 32, offset: 224)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !783, file: !745, line: 103, baseType: !793, size: 64, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !745, line: 59, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !745, line: 56, size: 2112, elements: !796)
!796 = !{!797, !801, !802}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !795, file: !745, line: 57, baseType: !798, size: 2048)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 2048, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !795, file: !745, line: 58, baseType: !250, size: 32, offset: 2048)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !795, file: !745, line: 58, baseType: !250, size: 32, offset: 2080)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !783, file: !745, line: 106, baseType: !804, size: 6144, offset: 320)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 6144, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 768)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !783, file: !745, line: 107, baseType: !808, size: 64, offset: 6464)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !745, line: 97, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !745, line: 83, size: 8320, elements: !811)
!811 = !{!812, !813, !814, !817, !818, !819, !820}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !810, file: !745, line: 84, baseType: !804, size: 6144)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !810, file: !745, line: 87, baseType: !798, size: 2048, offset: 6144)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !810, file: !745, line: 88, baseType: !815, size: 64, offset: 8192)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !627, line: 41, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !810, file: !745, line: 90, baseType: !254, size: 16, offset: 8256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !810, file: !745, line: 92, baseType: !254, size: 16, offset: 8272)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !810, file: !745, line: 93, baseType: !254, size: 16, offset: 8288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !810, file: !745, line: 95, baseType: !254, size: 16, offset: 8304)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !783, file: !745, line: 108, baseType: !822, size: 64, offset: 6528)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !745, line: 66, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !745, line: 61, size: 128, elements: !825)
!825 = !{!826, !827, !828, !829}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !824, file: !745, line: 62, baseType: !250, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !824, file: !745, line: 63, baseType: !250, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !824, file: !745, line: 64, baseType: !250, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !824, file: !745, line: 65, baseType: !250, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !783, file: !745, line: 109, baseType: !831, size: 64, offset: 6592)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !745, line: 71, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !745, line: 68, size: 64, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !833, file: !745, line: 69, baseType: !250, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !833, file: !745, line: 70, baseType: !250, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !783, file: !745, line: 110, baseType: !838, size: 64, offset: 6656)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !745, line: 81, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !745, line: 73, size: 352, elements: !841)
!841 = !{!842, !843, !844, !845, !846}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !840, file: !745, line: 74, baseType: !286, size: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !840, file: !745, line: 75, baseType: !286, size: 96, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !840, file: !745, line: 76, baseType: !286, size: 96, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !840, file: !745, line: 77, baseType: !250, size: 32, offset: 288)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !840, file: !745, line: 78, baseType: !250, size: 32, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !783, file: !745, line: 113, baseType: !848, size: 512, offset: 6720)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !849, line: 182, baseType: !850)
!849 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !849, line: 180, size: 512, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !850, file: !849, line: 181, baseType: !351, size: 512)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !753, file: !745, line: 148, baseType: !390, size: 64, offset: 1408)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !753, file: !745, line: 151, baseType: !631, size: 64, offset: 1472)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !753, file: !745, line: 152, baseType: !298, size: 64, offset: 1536)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !753, file: !745, line: 153, baseType: !857, size: 64, offset: 1600)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !859, line: 64, size: 19136, elements: !860)
!859 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!860 = !{!861, !862, !863, !864, !865, !866, !868, !869, !870, !871, !874, !875, !1120, !1121, !1129, !1130, !1131, !1132, !1133}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !858, file: !859, line: 65, baseType: !303, size: 960)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !858, file: !859, line: 66, baseType: !372, size: 64, offset: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !858, file: !859, line: 68, baseType: !322, size: 8192, offset: 1024)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !858, file: !859, line: 70, baseType: !250, size: 32, offset: 9216)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !858, file: !859, line: 71, baseType: !250, size: 32, offset: 9248)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !858, file: !859, line: 72, baseType: !867, size: 64, offset: 9280)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 64, elements: !622)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !858, file: !859, line: 74, baseType: !237, size: 32, offset: 9344)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !858, file: !859, line: 74, baseType: !237, size: 32, offset: 9376)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !858, file: !859, line: 76, baseType: !815, size: 64, offset: 9408)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !858, file: !859, line: 77, baseType: !872, size: 64, offset: 9472)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !859, line: 77, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !858, file: !859, line: 78, baseType: !460, size: 64, offset: 9536)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !858, file: !859, line: 80, baseType: !876, size: 2624, offset: 9600)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !877, line: 340, size: 2624, elements: !878)
!877 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!878 = !{!879, !907, !925, !926, !927, !942, !1000, !1001, !1100, !1101, !1102, !1103, !1109}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !876, file: !877, line: 341, baseType: !880, size: 576)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !877, line: 251, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !877, line: 207, size: 576, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !881, file: !877, line: 208, baseType: !250, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !881, file: !877, line: 211, baseType: !254, size: 16, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !881, file: !877, line: 212, baseType: !254, size: 16, offset: 48)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !881, file: !877, line: 213, baseType: !237, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !881, file: !877, line: 214, baseType: !254, size: 16, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !881, file: !877, line: 215, baseType: !254, size: 16, offset: 112)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !881, file: !877, line: 216, baseType: !254, size: 16, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !881, file: !877, line: 217, baseType: !254, size: 16, offset: 144)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !881, file: !877, line: 218, baseType: !254, size: 16, offset: 160)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !881, file: !877, line: 219, baseType: !254, size: 16, offset: 176)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !881, file: !877, line: 220, baseType: !237, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !881, file: !877, line: 222, baseType: !254, size: 16, offset: 224)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !881, file: !877, line: 225, baseType: !254, size: 16, offset: 240)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !881, file: !877, line: 228, baseType: !250, size: 32, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !881, file: !877, line: 229, baseType: !250, size: 32, offset: 288)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !881, file: !877, line: 233, baseType: !250, size: 32, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !881, file: !877, line: 236, baseType: !254, size: 16, offset: 352)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !881, file: !877, line: 236, baseType: !254, size: 16, offset: 368)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !881, file: !877, line: 241, baseType: !237, size: 32, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !881, file: !877, line: 244, baseType: !250, size: 32, offset: 416)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !881, file: !877, line: 244, baseType: !250, size: 32, offset: 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !881, file: !877, line: 245, baseType: !237, size: 32, offset: 480)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !881, file: !877, line: 248, baseType: !237, size: 32, offset: 512)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !881, file: !877, line: 250, baseType: !250, size: 32, offset: 544)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !876, file: !877, line: 342, baseType: !908, size: 448, offset: 576)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !877, line: 79, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !877, line: 61, size: 448, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !909, file: !877, line: 62, baseType: !236, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !909, file: !877, line: 64, baseType: !254, size: 16, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !909, file: !877, line: 65, baseType: !254, size: 16, offset: 80)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !909, file: !877, line: 67, baseType: !237, size: 32, offset: 96)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !909, file: !877, line: 68, baseType: !237, size: 32, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !909, file: !877, line: 69, baseType: !237, size: 32, offset: 160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !909, file: !877, line: 70, baseType: !254, size: 16, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !909, file: !877, line: 71, baseType: !254, size: 16, offset: 208)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !909, file: !877, line: 72, baseType: !621, size: 64, offset: 224)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !909, file: !877, line: 75, baseType: !237, size: 32, offset: 288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !909, file: !877, line: 75, baseType: !237, size: 32, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !909, file: !877, line: 75, baseType: !237, size: 32, offset: 352)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !909, file: !877, line: 78, baseType: !237, size: 32, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !909, file: !877, line: 78, baseType: !237, size: 32, offset: 416)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !876, file: !877, line: 343, baseType: !361, size: 128, offset: 1024)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !876, file: !877, line: 344, baseType: !361, size: 128, offset: 1152)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !876, file: !877, line: 345, baseType: !928, size: 192, offset: 1280)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !877, line: 278, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !877, line: 270, size: 192, elements: !930)
!930 = !{!931, !932, !933, !934, !935}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !929, file: !877, line: 271, baseType: !250, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !929, file: !877, line: 273, baseType: !237, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !929, file: !877, line: 275, baseType: !250, size: 32, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !929, file: !877, line: 276, baseType: !250, size: 32, offset: 96)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !929, file: !877, line: 277, baseType: !936, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !877, line: 55, size: 576, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !937, file: !877, line: 56, baseType: !250, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !937, file: !877, line: 57, baseType: !237, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !937, file: !877, line: 58, baseType: !511, size: 512, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !876, file: !877, line: 346, baseType: !943, size: 384, offset: 1472)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !877, line: 268, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !877, line: 253, size: 384, elements: !945)
!945 = !{!946, !947, !948, !949, !950, !994, !995, !996, !997, !998, !999}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !944, file: !877, line: 254, baseType: !250, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !944, file: !877, line: 255, baseType: !250, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !944, file: !877, line: 255, baseType: !250, size: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !944, file: !877, line: 258, baseType: !237, size: 32, offset: 96)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !944, file: !877, line: 259, baseType: !951, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !877, line: 164, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !877, line: 108, size: 1664, elements: !954)
!954 = !{!955, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !953, file: !877, line: 109, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !953, file: !877, line: 109, baseType: !956, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !877, line: 111, baseType: !351, size: 512, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !953, file: !877, line: 119, baseType: !621, size: 64, offset: 640)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !953, file: !877, line: 119, baseType: !621, size: 64, offset: 704)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !953, file: !877, line: 125, baseType: !621, size: 64, offset: 768)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !953, file: !877, line: 125, baseType: !621, size: 64, offset: 832)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !953, file: !877, line: 127, baseType: !621, size: 64, offset: 896)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !953, file: !877, line: 130, baseType: !250, size: 32, offset: 960)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !953, file: !877, line: 131, baseType: !250, size: 32, offset: 992)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !953, file: !877, line: 132, baseType: !967, size: 64, offset: 1024)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !877, line: 106, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !877, line: 81, size: 512, elements: !970)
!970 = !{!971, !972, !975, !976, !977, !978}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !969, file: !877, line: 82, baseType: !621, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !969, file: !877, line: 97, baseType: !973, size: 256, offset: 64)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 256, elements: !974)
!974 = !{!504, !623}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !969, file: !877, line: 102, baseType: !621, size: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !969, file: !877, line: 102, baseType: !621, size: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !969, file: !877, line: 104, baseType: !250, size: 32, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !969, file: !877, line: 105, baseType: !250, size: 32, offset: 480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !953, file: !877, line: 135, baseType: !286, size: 96, offset: 1088)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !953, file: !877, line: 136, baseType: !237, size: 32, offset: 1184)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !953, file: !877, line: 139, baseType: !250, size: 32, offset: 1216)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !953, file: !877, line: 139, baseType: !250, size: 32, offset: 1248)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !953, file: !877, line: 139, baseType: !250, size: 32, offset: 1280)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !953, file: !877, line: 140, baseType: !286, size: 96, offset: 1312)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !953, file: !877, line: 143, baseType: !254, size: 16, offset: 1408)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !953, file: !877, line: 144, baseType: !254, size: 16, offset: 1424)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !953, file: !877, line: 145, baseType: !254, size: 16, offset: 1440)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !953, file: !877, line: 148, baseType: !254, size: 16, offset: 1456)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !953, file: !877, line: 149, baseType: !250, size: 32, offset: 1472)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !953, file: !877, line: 150, baseType: !237, size: 32, offset: 1504)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !953, file: !877, line: 152, baseType: !460, size: 64, offset: 1536)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !953, file: !877, line: 163, baseType: !237, size: 32, offset: 1600)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !953, file: !877, line: 163, baseType: !237, size: 32, offset: 1632)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !944, file: !877, line: 261, baseType: !237, size: 32, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !944, file: !877, line: 261, baseType: !237, size: 32, offset: 224)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !944, file: !877, line: 261, baseType: !237, size: 32, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !944, file: !877, line: 263, baseType: !250, size: 32, offset: 288)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !944, file: !877, line: 266, baseType: !250, size: 32, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !944, file: !877, line: 267, baseType: !237, size: 32, offset: 352)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !876, file: !877, line: 347, baseType: !951, size: 64, offset: 1856)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !876, file: !877, line: 348, baseType: !1002, size: 64, offset: 1920)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !877, line: 205, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !877, line: 186, size: 1024, elements: !1005)
!1005 = !{!1006, !1008, !1009, !1010, !1012, !1013, !1014, !1022, !1023, !1024, !1098, !1099}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1004, file: !877, line: 187, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1004, file: !877, line: 187, baseType: !1007, size: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1004, file: !877, line: 189, baseType: !351, size: 512, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1004, file: !877, line: 191, baseType: !1011, size: 64, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1004, file: !877, line: 193, baseType: !250, size: 32, offset: 704)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1004, file: !877, line: 193, baseType: !250, size: 32, offset: 736)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1004, file: !877, line: 195, baseType: !1015, size: 64, offset: 768)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !877, line: 184, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !877, line: 166, size: 320, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1017, file: !877, line: 180, baseType: !973, size: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1017, file: !877, line: 182, baseType: !250, size: 32, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1017, file: !877, line: 183, baseType: !250, size: 32, offset: 288)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1004, file: !877, line: 196, baseType: !250, size: 32, offset: 832)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1004, file: !877, line: 198, baseType: !250, size: 32, offset: 864)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1004, file: !877, line: 200, baseType: !1025, size: 64, offset: 896)
