; ModuleID = 'blender/source/blender/editors/render/render_opengl.c'
source_filename = "blender/source/blender/editors/render/render_opengl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "jit_ofs", scope: !2, file: !3, line: 234, type: !2571, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "screen_opengl_render_apply", scope: !3, file: !3, line: 121, type: !4, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2277, retainedNodes: !2570)
!3 = !DIFile(filename: "blender/source/blender/editors/render/render_opengl.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "OGLRender", file: !3, line: 108, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OGLRender", file: !3, line: 76, size: 1600, elements: !9)
!9 = !{!10, !151, !156, !1670, !1764, !1964, !2035, !2084, !2085, !2086, !2182, !2185, !2186, !2191, !2192, !2193, !2194, !2205, !2233, !2234, !2235, !2271, !2274}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "bmain", scope: !8, file: !3, line: 77, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Main", file: !13, line: 104, baseType: !14)
!13 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !13, line: 53, size: 15232, elements: !15)
!15 = !{!16, !18, !19, !24, !26, !27, !28, !29, !35, !39, !40, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !145, !148}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !13, line: 54, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !14, file: !13, line: 54, baseType: !17, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !13, line: 55, baseType: !20, size: 8192, offset: 128)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8192, elements: !22)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !{!23}
!23 = !DISubrange(count: 1024)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !14, file: !13, line: 56, baseType: !25, size: 16, offset: 8320)
!25 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !14, file: !13, line: 56, baseType: !25, size: 16, offset: 8336)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !14, file: !13, line: 57, baseType: !25, size: 16, offset: 8352)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !14, file: !13, line: 57, baseType: !25, size: 16, offset: 8368)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !14, file: !13, line: 58, baseType: !30, size: 64, offset: 8384)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 27, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !33, line: 45, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !14, file: !13, line: 59, baseType: !36, size: 128, offset: 8448)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !14, file: !13, line: 60, baseType: !25, size: 16, offset: 8576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !14, file: !13, line: 62, baseType: !41, size: 64, offset: 8640)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !43, line: 136, size: 17600, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !96, !98, !101, !102, !103, !104}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !42, file: !43, line: 137, baseType: !46, size: 960)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !43, line: 130, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !43, line: 117, size: 960, elements: !48)
!48 = !{!49, !51, !52, !54, !55, !59, !60, !62, !63, !64}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !43, line: 118, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !47, file: !43, line: 118, baseType: !50, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !47, file: !43, line: 119, baseType: !53, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !47, file: !43, line: 120, baseType: !41, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !47, file: !43, line: 121, baseType: !56, size: 528, offset: 256)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 528, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 66)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !47, file: !43, line: 126, baseType: !25, size: 16, offset: 784)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !47, file: !43, line: 127, baseType: !61, size: 32, offset: 800)
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !47, file: !43, line: 128, baseType: !61, size: 32, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !47, file: !43, line: 128, baseType: !61, size: 32, offset: 864)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !47, file: !43, line: 129, baseType: !65, size: 64, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !43, line: 75, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !43, line: 62, size: 1024, elements: !68)
!68 = !{!69, !71, !72, !73, !74, !75, !79, !80, !94, !95}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !67, file: !43, line: 63, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !67, file: !43, line: 63, baseType: !70, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !43, line: 64, baseType: !21, size: 8, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !67, file: !43, line: 64, baseType: !21, size: 8, offset: 136)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !67, file: !43, line: 65, baseType: !25, size: 16, offset: 144)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !43, line: 66, baseType: !76, size: 512, offset: 160)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !67, file: !43, line: 67, baseType: !61, size: 32, offset: 672)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !43, line: 69, baseType: !81, size: 256, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !43, line: 60, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !43, line: 48, size: 256, elements: !83)
!83 = !{!84, !85, !92, !93}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !82, file: !43, line: 49, baseType: !50, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !82, file: !43, line: 58, baseType: !86, size: 128, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !87, line: 71, baseType: !88)
!87 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !87, line: 69, size: 128, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !88, file: !87, line: 70, baseType: !50, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !88, file: !87, line: 70, baseType: !50, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !82, file: !43, line: 59, baseType: !61, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !82, file: !43, line: 59, baseType: !61, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, file: !43, line: 70, baseType: !61, size: 32, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !67, file: !43, line: 74, baseType: !61, size: 32, offset: 992)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !42, file: !43, line: 138, baseType: !97, size: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !42, file: !43, line: 139, baseType: !99, size: 64, offset: 1024)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !43, line: 43, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !43, line: 140, baseType: !20, size: 8192, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !42, file: !43, line: 141, baseType: !20, size: 8192, offset: 9280)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !42, file: !43, line: 148, baseType: !41, size: 64, offset: 17472)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !42, file: !43, line: 150, baseType: !105, size: 64, offset: 17536)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !43, line: 45, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !14, file: !13, line: 63, baseType: !86, size: 128, offset: 8704)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !14, file: !13, line: 64, baseType: !86, size: 128, offset: 8832)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !14, file: !13, line: 65, baseType: !86, size: 128, offset: 8960)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !14, file: !13, line: 66, baseType: !86, size: 128, offset: 9088)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !14, file: !13, line: 67, baseType: !86, size: 128, offset: 9216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !14, file: !13, line: 68, baseType: !86, size: 128, offset: 9344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !14, file: !13, line: 69, baseType: !86, size: 128, offset: 9472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !14, file: !13, line: 70, baseType: !86, size: 128, offset: 9600)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !14, file: !13, line: 71, baseType: !86, size: 128, offset: 9728)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !14, file: !13, line: 72, baseType: !86, size: 128, offset: 9856)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !14, file: !13, line: 73, baseType: !86, size: 128, offset: 9984)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !14, file: !13, line: 74, baseType: !86, size: 128, offset: 10112)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !14, file: !13, line: 75, baseType: !86, size: 128, offset: 10240)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !14, file: !13, line: 76, baseType: !86, size: 128, offset: 10368)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !14, file: !13, line: 77, baseType: !86, size: 128, offset: 10496)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !14, file: !13, line: 78, baseType: !86, size: 128, offset: 10624)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !14, file: !13, line: 79, baseType: !86, size: 128, offset: 10752)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !14, file: !13, line: 80, baseType: !86, size: 128, offset: 10880)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !14, file: !13, line: 81, baseType: !86, size: 128, offset: 11008)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !14, file: !13, line: 82, baseType: !86, size: 128, offset: 11136)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !14, file: !13, line: 83, baseType: !86, size: 128, offset: 11264)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !14, file: !13, line: 84, baseType: !86, size: 128, offset: 11392)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !14, file: !13, line: 85, baseType: !86, size: 128, offset: 11520)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !14, file: !13, line: 86, baseType: !86, size: 128, offset: 11648)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !14, file: !13, line: 87, baseType: !86, size: 128, offset: 11776)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !14, file: !13, line: 88, baseType: !86, size: 128, offset: 11904)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !14, file: !13, line: 89, baseType: !86, size: 128, offset: 12032)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !14, file: !13, line: 90, baseType: !86, size: 128, offset: 12160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !14, file: !13, line: 91, baseType: !86, size: 128, offset: 12288)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !14, file: !13, line: 92, baseType: !86, size: 128, offset: 12416)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !14, file: !13, line: 93, baseType: !86, size: 128, offset: 12544)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !14, file: !13, line: 94, baseType: !86, size: 128, offset: 12672)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !14, file: !13, line: 95, baseType: !86, size: 128, offset: 12800)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !14, file: !13, line: 96, baseType: !86, size: 128, offset: 12928)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !14, file: !13, line: 98, baseType: !142, size: 2048, offset: 13056)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !14, file: !13, line: 101, baseType: !146, size: 64, offset: 15104)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !13, line: 49, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !14, file: !13, line: 103, baseType: !149, size: 64, offset: 15168)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !13, line: 51, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !8, file: !3, line: 78, baseType: !152, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "Render", file: !154, line: 58, baseType: !155)
!154 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "Render", file: !154, line: 58, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !8, file: !3, line: 79, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !159, line: 1299, baseType: !160)
!159 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !159, line: 1216, size: 39680, elements: !161)
!161 = !{!162, !163, !166, !457, !460, !461, !462, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !488, !562, !1046, !1261, !1264, !1545, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1567, !1568, !1569, !1570, !1571, !1579, !1646, !1653, !1654, !1661, !1662, !1663, !1664, !1665, !1666, !1667}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !160, file: !159, line: 1217, baseType: !46, size: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !160, file: !159, line: 1218, baseType: !164, size: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !159, line: 58, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !160, file: !159, line: 1220, baseType: !167, size: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !169, line: 115, size: 11392, elements: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !{!171, !172, !173, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !191, !203, !217, !218, !262, !263, !266, !267, !283, !284, !285, !286, !287, !288, !289, !293, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !309, !310, !311, !312, !313, !314, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !374, !375, !376, !377, !378, !379, !380, !381, !382, !385, !388, !392, !393, !394, !395, !396, !399, !402, !405, !406, !407, !408, !409, !410, !411, !412, !414, !417, !420, !424, !445, !446}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !169, line: 116, baseType: !46, size: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !168, file: !169, line: 117, baseType: !164, size: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !168, file: !169, line: 119, baseType: !174, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !169, line: 57, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !169, line: 121, baseType: !25, size: 16, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !168, file: !169, line: 121, baseType: !25, size: 16, offset: 1104)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !168, file: !169, line: 122, baseType: !61, size: 32, offset: 1120)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !168, file: !169, line: 122, baseType: !61, size: 32, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !168, file: !169, line: 122, baseType: !61, size: 32, offset: 1184)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !168, file: !169, line: 123, baseType: !76, size: 512, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !168, file: !169, line: 124, baseType: !167, size: 64, offset: 1728)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !168, file: !169, line: 124, baseType: !167, size: 64, offset: 1792)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !168, file: !169, line: 127, baseType: !167, size: 64, offset: 1856)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !168, file: !169, line: 127, baseType: !167, size: 64, offset: 1920)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !168, file: !169, line: 127, baseType: !167, size: 64, offset: 1984)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !168, file: !169, line: 128, baseType: !188, size: 64, offset: 2048)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !190, line: 46, flags: DIFlagFwdDecl)
!190 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !168, file: !169, line: 130, baseType: !192, size: 64, offset: 2112)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !169, line: 97, size: 832, elements: !194)
!194 = !{!195, !201, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !193, file: !169, line: 98, baseType: !196, size: 768)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 768, elements: !198)
!197 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!198 = !{!199, !200}
!199 = !DISubrange(count: 8)
!200 = !DISubrange(count: 3)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !193, file: !169, line: 99, baseType: !61, size: 32, offset: 768)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !193, file: !169, line: 99, baseType: !61, size: 32, offset: 800)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !168, file: !169, line: 131, baseType: !204, size: 64, offset: 2176)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !206, line: 486, size: 1600, elements: !207)
!206 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !205, file: !206, line: 487, baseType: !46, size: 960)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !205, file: !206, line: 489, baseType: !86, size: 128, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !205, file: !206, line: 490, baseType: !86, size: 128, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !205, file: !206, line: 491, baseType: !86, size: 128, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !205, file: !206, line: 492, baseType: !86, size: 128, offset: 1344)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !206, line: 494, baseType: !61, size: 32, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !205, file: !206, line: 495, baseType: !61, size: 32, offset: 1504)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !205, file: !206, line: 497, baseType: !61, size: 32, offset: 1536)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !205, file: !206, line: 498, baseType: !61, size: 32, offset: 1568)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !168, file: !169, line: 132, baseType: !204, size: 64, offset: 2240)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !168, file: !169, line: 133, baseType: !219, size: 64, offset: 2304)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !206, line: 334, size: 1728, elements: !221)
!221 = !{!222, !223, !226, !227, !228, !230, !231, !232, !235, !236, !237, !238, !239, !240, !241, !261}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !220, file: !206, line: 335, baseType: !86, size: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !220, file: !206, line: 336, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !206, line: 47, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !220, file: !206, line: 338, baseType: !25, size: 16, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !220, file: !206, line: 338, baseType: !25, size: 16, offset: 208)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !220, file: !206, line: 339, baseType: !229, size: 32, offset: 224)
!229 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !220, file: !206, line: 340, baseType: !61, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !220, file: !206, line: 342, baseType: !197, size: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !220, file: !206, line: 343, baseType: !233, size: 96, offset: 320)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 96, elements: !234)
!234 = !{!200}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !220, file: !206, line: 344, baseType: !233, size: 96, offset: 416)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !220, file: !206, line: 347, baseType: !86, size: 128, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !220, file: !206, line: 349, baseType: !61, size: 32, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !220, file: !206, line: 350, baseType: !61, size: 32, offset: 672)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !220, file: !206, line: 351, baseType: !50, size: 64, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !220, file: !206, line: 352, baseType: !50, size: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !220, file: !206, line: 354, baseType: !242, size: 384, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !206, line: 116, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !206, line: 94, size: 384, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !243, file: !206, line: 96, baseType: !61, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !243, file: !206, line: 96, baseType: !61, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !243, file: !206, line: 97, baseType: !61, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !243, file: !206, line: 97, baseType: !61, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !243, file: !206, line: 99, baseType: !25, size: 16, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !243, file: !206, line: 100, baseType: !25, size: 16, offset: 144)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !243, file: !206, line: 102, baseType: !25, size: 16, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !243, file: !206, line: 105, baseType: !25, size: 16, offset: 176)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !243, file: !206, line: 108, baseType: !25, size: 16, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !243, file: !206, line: 109, baseType: !25, size: 16, offset: 208)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !243, file: !206, line: 111, baseType: !25, size: 16, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !243, file: !206, line: 112, baseType: !25, size: 16, offset: 240)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !243, file: !206, line: 114, baseType: !61, size: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !243, file: !206, line: 114, baseType: !61, size: 32, offset: 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !243, file: !206, line: 115, baseType: !61, size: 32, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !243, file: !206, line: 115, baseType: !61, size: 32, offset: 352)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !220, file: !206, line: 355, baseType: !76, size: 512, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !169, line: 134, baseType: !50, size: 64, offset: 2368)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !168, file: !169, line: 136, baseType: !264, size: 64, offset: 2432)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !159, line: 61, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !168, file: !169, line: 138, baseType: !242, size: 384, offset: 2496)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !168, file: !169, line: 139, baseType: !268, size: 64, offset: 2880)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !206, line: 80, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !206, line: 72, size: 192, elements: !271)
!271 = !{!272, !279, !280, !281, !282}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !270, file: !206, line: 73, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !206, line: 59, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !206, line: 56, size: 128, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !275, file: !206, line: 57, baseType: !233, size: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !206, line: 58, baseType: !61, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !270, file: !206, line: 74, baseType: !61, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !270, file: !206, line: 76, baseType: !61, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !270, file: !206, line: 77, baseType: !61, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !206, line: 79, baseType: !61, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !168, file: !169, line: 141, baseType: !86, size: 128, offset: 2944)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !168, file: !169, line: 142, baseType: !86, size: 128, offset: 3072)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !168, file: !169, line: 143, baseType: !86, size: 128, offset: 3200)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !168, file: !169, line: 144, baseType: !86, size: 128, offset: 3328)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !168, file: !169, line: 146, baseType: !61, size: 32, offset: 3456)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !168, file: !169, line: 147, baseType: !61, size: 32, offset: 3488)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !168, file: !169, line: 150, baseType: !290, size: 64, offset: 3520)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !159, line: 179, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !168, file: !169, line: 151, baseType: !294, size: 64, offset: 3584)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !168, file: !169, line: 152, baseType: !61, size: 32, offset: 3648)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !168, file: !169, line: 153, baseType: !61, size: 32, offset: 3680)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !168, file: !169, line: 156, baseType: !233, size: 96, offset: 3712)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !168, file: !169, line: 156, baseType: !233, size: 96, offset: 3808)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !168, file: !169, line: 156, baseType: !233, size: 96, offset: 3904)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !169, line: 157, baseType: !233, size: 96, offset: 4000)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !168, file: !169, line: 158, baseType: !233, size: 96, offset: 4096)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !168, file: !169, line: 159, baseType: !233, size: 96, offset: 4192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !168, file: !169, line: 160, baseType: !233, size: 96, offset: 4288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !168, file: !169, line: 160, baseType: !233, size: 96, offset: 4384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !168, file: !169, line: 161, baseType: !306, size: 128, offset: 4480)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 128, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 4)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !168, file: !169, line: 161, baseType: !306, size: 128, offset: 4608)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !168, file: !169, line: 162, baseType: !233, size: 96, offset: 4736)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !168, file: !169, line: 162, baseType: !233, size: 96, offset: 4832)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !168, file: !169, line: 163, baseType: !197, size: 32, offset: 4928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !168, file: !169, line: 163, baseType: !197, size: 32, offset: 4960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !168, file: !169, line: 164, baseType: !315, size: 512, offset: 4992)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 512, elements: !316)
!316 = !{!308, !308}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !168, file: !169, line: 165, baseType: !315, size: 512, offset: 5504)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !168, file: !169, line: 166, baseType: !315, size: 512, offset: 6016)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !168, file: !169, line: 167, baseType: !315, size: 512, offset: 6528)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !168, file: !169, line: 176, baseType: !315, size: 512, offset: 7040)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !168, file: !169, line: 178, baseType: !229, size: 32, offset: 7552)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !168, file: !169, line: 180, baseType: !25, size: 16, offset: 7584)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !168, file: !169, line: 181, baseType: !25, size: 16, offset: 7600)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !168, file: !169, line: 183, baseType: !25, size: 16, offset: 7616)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !168, file: !169, line: 183, baseType: !25, size: 16, offset: 7632)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !168, file: !169, line: 184, baseType: !25, size: 16, offset: 7648)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !168, file: !169, line: 184, baseType: !25, size: 16, offset: 7664)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !168, file: !169, line: 185, baseType: !25, size: 16, offset: 7680)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !168, file: !169, line: 186, baseType: !25, size: 16, offset: 7696)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !168, file: !169, line: 187, baseType: !25, size: 16, offset: 7712)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !168, file: !169, line: 188, baseType: !21, size: 8, offset: 7728)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !168, file: !169, line: 189, baseType: !21, size: 8, offset: 7736)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !168, file: !169, line: 192, baseType: !61, size: 32, offset: 7744)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !168, file: !169, line: 192, baseType: !61, size: 32, offset: 7776)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !168, file: !169, line: 192, baseType: !61, size: 32, offset: 7808)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !168, file: !169, line: 192, baseType: !61, size: 32, offset: 7840)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !168, file: !169, line: 194, baseType: !61, size: 32, offset: 7872)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !168, file: !169, line: 202, baseType: !197, size: 32, offset: 7904)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !168, file: !169, line: 202, baseType: !197, size: 32, offset: 7936)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !168, file: !169, line: 202, baseType: !197, size: 32, offset: 7968)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !168, file: !169, line: 211, baseType: !197, size: 32, offset: 8000)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !168, file: !169, line: 212, baseType: !197, size: 32, offset: 8032)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !168, file: !169, line: 213, baseType: !197, size: 32, offset: 8064)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !168, file: !169, line: 214, baseType: !197, size: 32, offset: 8096)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !168, file: !169, line: 215, baseType: !197, size: 32, offset: 8128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !168, file: !169, line: 216, baseType: !197, size: 32, offset: 8160)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !168, file: !169, line: 219, baseType: !197, size: 32, offset: 8192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !168, file: !169, line: 220, baseType: !197, size: 32, offset: 8224)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !168, file: !169, line: 221, baseType: !197, size: 32, offset: 8256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !168, file: !169, line: 224, baseType: !351, size: 16, offset: 8288)
!351 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !168, file: !169, line: 224, baseType: !351, size: 16, offset: 8304)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !168, file: !169, line: 226, baseType: !25, size: 16, offset: 8320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !168, file: !169, line: 228, baseType: !21, size: 8, offset: 8336)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !168, file: !169, line: 229, baseType: !21, size: 8, offset: 8344)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !168, file: !169, line: 231, baseType: !25, size: 16, offset: 8352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !168, file: !169, line: 232, baseType: !21, size: 8, offset: 8368)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !168, file: !169, line: 233, baseType: !21, size: 8, offset: 8376)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !168, file: !169, line: 234, baseType: !197, size: 32, offset: 8384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !168, file: !169, line: 235, baseType: !197, size: 32, offset: 8416)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !168, file: !169, line: 237, baseType: !86, size: 128, offset: 8448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !168, file: !169, line: 238, baseType: !86, size: 128, offset: 8576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !168, file: !169, line: 239, baseType: !86, size: 128, offset: 8704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !168, file: !169, line: 240, baseType: !86, size: 128, offset: 8832)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !168, file: !169, line: 242, baseType: !197, size: 32, offset: 8960)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !168, file: !169, line: 244, baseType: !25, size: 16, offset: 8992)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !168, file: !169, line: 245, baseType: !351, size: 16, offset: 9008)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !168, file: !169, line: 246, baseType: !306, size: 128, offset: 9024)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !168, file: !169, line: 248, baseType: !61, size: 32, offset: 9152)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !168, file: !169, line: 249, baseType: !61, size: 32, offset: 9184)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !168, file: !169, line: 251, baseType: !372, size: 64, offset: 9216)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !169, line: 251, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !168, file: !169, line: 253, baseType: !21, size: 8, offset: 9280)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !168, file: !169, line: 254, baseType: !21, size: 8, offset: 9288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !168, file: !169, line: 255, baseType: !25, size: 16, offset: 9296)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !168, file: !169, line: 256, baseType: !233, size: 96, offset: 9312)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !168, file: !169, line: 258, baseType: !86, size: 128, offset: 9408)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !168, file: !169, line: 259, baseType: !86, size: 128, offset: 9536)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !168, file: !169, line: 260, baseType: !86, size: 128, offset: 9664)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !168, file: !169, line: 261, baseType: !86, size: 128, offset: 9792)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !168, file: !169, line: 263, baseType: !383, size: 64, offset: 9920)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !169, line: 52, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !168, file: !169, line: 264, baseType: !386, size: 64, offset: 9984)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !169, line: 53, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !168, file: !169, line: 265, baseType: !389, size: 64, offset: 10048)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !391, line: 43, flags: DIFlagFwdDecl)
!391 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!392 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !168, file: !169, line: 267, baseType: !21, size: 8, offset: 10112)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !168, file: !169, line: 268, baseType: !21, size: 8, offset: 10120)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !168, file: !169, line: 269, baseType: !25, size: 16, offset: 10128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !168, file: !169, line: 270, baseType: !197, size: 32, offset: 10144)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !168, file: !169, line: 272, baseType: !397, size: 64, offset: 10176)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !169, line: 54, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !168, file: !169, line: 275, baseType: !400, size: 64, offset: 10240)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !169, line: 275, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !168, file: !169, line: 277, baseType: !403, size: 64, offset: 10304)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !169, line: 56, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !168, file: !169, line: 277, baseType: !403, size: 64, offset: 10368)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !168, file: !169, line: 278, baseType: !30, size: 64, offset: 10432)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !168, file: !169, line: 279, baseType: !30, size: 64, offset: 10496)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !168, file: !169, line: 280, baseType: !229, size: 32, offset: 10560)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !168, file: !169, line: 281, baseType: !229, size: 32, offset: 10592)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !168, file: !169, line: 283, baseType: !86, size: 128, offset: 10624)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !168, file: !169, line: 284, baseType: !86, size: 128, offset: 10752)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !168, file: !169, line: 285, baseType: !413, size: 64, offset: 10880)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !168, file: !169, line: 287, baseType: !415, size: 64, offset: 10944)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !169, line: 59, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !168, file: !169, line: 288, baseType: !418, size: 64, offset: 11008)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !169, line: 288, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !168, file: !169, line: 290, baseType: !421, size: 64, offset: 11072)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 2)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !168, file: !169, line: 291, baseType: !425, size: 64, offset: 11136)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !427, line: 65, baseType: !428)
!427 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !427, line: 50, size: 320, elements: !429)
!429 = !{!430, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !428, file: !427, line: 51, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !428, file: !427, line: 53, baseType: !61, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !428, file: !427, line: 54, baseType: !61, size: 32, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !428, file: !427, line: 55, baseType: !61, size: 32, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !428, file: !427, line: 55, baseType: !61, size: 32, offset: 160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !428, file: !427, line: 56, baseType: !21, size: 8, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !428, file: !427, line: 56, baseType: !21, size: 8, offset: 200)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !428, file: !427, line: 57, baseType: !21, size: 8, offset: 208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !428, file: !427, line: 57, baseType: !21, size: 8, offset: 216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !428, file: !427, line: 59, baseType: !25, size: 16, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !428, file: !427, line: 59, baseType: !25, size: 16, offset: 240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !428, file: !427, line: 59, baseType: !25, size: 16, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !427, line: 61, baseType: !25, size: 16, offset: 272)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !428, file: !427, line: 63, baseType: !61, size: 32, offset: 288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !168, file: !169, line: 293, baseType: !86, size: 128, offset: 11200)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !168, file: !169, line: 294, baseType: !447, size: 64, offset: 11328)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !169, line: 113, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !169, line: 108, size: 256, elements: !450)
!450 = !{!451, !453, !454, !455, !456}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !449, file: !169, line: 109, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !449, file: !169, line: 109, baseType: !452, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !449, file: !169, line: 110, baseType: !167, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !169, line: 111, baseType: !61, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !449, file: !169, line: 112, baseType: !197, size: 32, offset: 224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !160, file: !159, line: 1221, baseType: !458, size: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !159, line: 52, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !160, file: !159, line: 1223, baseType: !431, size: 64, offset: 1152)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !160, file: !159, line: 1225, baseType: !86, size: 128, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !160, file: !159, line: 1226, baseType: !463, size: 64, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !159, line: 69, size: 320, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !464, file: !159, line: 70, baseType: !463, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !464, file: !159, line: 70, baseType: !463, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !464, file: !159, line: 71, baseType: !229, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !464, file: !159, line: 71, baseType: !229, size: 32, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !464, file: !159, line: 72, baseType: !61, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !464, file: !159, line: 73, baseType: !25, size: 16, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !464, file: !159, line: 73, baseType: !25, size: 16, offset: 240)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !464, file: !159, line: 74, baseType: !167, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !160, file: !159, line: 1227, baseType: !167, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !160, file: !159, line: 1229, baseType: !233, size: 96, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !160, file: !159, line: 1230, baseType: !233, size: 96, offset: 1568)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !160, file: !159, line: 1231, baseType: !233, size: 96, offset: 1664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !160, file: !159, line: 1231, baseType: !233, size: 96, offset: 1760)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !160, file: !159, line: 1233, baseType: !229, size: 32, offset: 1856)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !160, file: !159, line: 1234, baseType: !61, size: 32, offset: 1888)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !160, file: !159, line: 1235, baseType: !229, size: 32, offset: 1920)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !159, line: 1237, baseType: !25, size: 16, offset: 1952)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !160, file: !159, line: 1239, baseType: !21, size: 8, offset: 1968)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !160, file: !159, line: 1240, baseType: !485, size: 8, offset: 1976)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 1)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !160, file: !159, line: 1242, baseType: !489, size: 64, offset: 1984)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !491, line: 328, size: 3456, elements: !492)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !494, !495, !498, !499, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !528, !529, !530, !533, !538, !539, !542, !546, !550, !554, !558, !559, !560, !561}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !490, file: !491, line: 329, baseType: !46, size: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !490, file: !491, line: 330, baseType: !164, size: 64, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !490, file: !491, line: 332, baseType: !496, size: 64, offset: 1024)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !491, line: 332, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !490, file: !491, line: 333, baseType: !76, size: 512, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !490, file: !491, line: 335, baseType: !500, size: 64, offset: 1600)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !502, line: 41, flags: DIFlagFwdDecl)
!502 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !490, file: !491, line: 337, baseType: !264, size: 64, offset: 1664)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !490, file: !491, line: 338, baseType: !421, size: 64, offset: 1728)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !490, file: !491, line: 340, baseType: !86, size: 128, offset: 1792)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !490, file: !491, line: 340, baseType: !86, size: 128, offset: 1920)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !491, line: 342, baseType: !61, size: 32, offset: 2048)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !490, file: !491, line: 342, baseType: !61, size: 32, offset: 2080)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !490, file: !491, line: 343, baseType: !61, size: 32, offset: 2112)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !491, line: 345, baseType: !61, size: 32, offset: 2144)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !490, file: !491, line: 346, baseType: !61, size: 32, offset: 2176)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !490, file: !491, line: 347, baseType: !25, size: 16, offset: 2208)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !490, file: !491, line: 348, baseType: !25, size: 16, offset: 2224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !490, file: !491, line: 349, baseType: !61, size: 32, offset: 2240)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !490, file: !491, line: 351, baseType: !61, size: 32, offset: 2272)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !490, file: !491, line: 353, baseType: !25, size: 16, offset: 2304)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !490, file: !491, line: 354, baseType: !25, size: 16, offset: 2320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !490, file: !491, line: 355, baseType: !61, size: 32, offset: 2336)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !490, file: !491, line: 357, baseType: !520, size: 128, offset: 2368)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !521, line: 95, baseType: !522)
!521 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !521, line: 92, size: 128, elements: !523)
!523 = !{!524, !525, !526, !527}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !522, file: !521, line: 93, baseType: !197, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !522, file: !521, line: 93, baseType: !197, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !522, file: !521, line: 94, baseType: !197, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !522, file: !521, line: 94, baseType: !197, size: 32, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !490, file: !491, line: 363, baseType: !86, size: 128, offset: 2496)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !490, file: !491, line: 363, baseType: !86, size: 128, offset: 2624)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !490, file: !491, line: 368, baseType: !531, size: 64, offset: 2752)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !491, line: 48, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !490, file: !491, line: 372, baseType: !534, size: 32, offset: 2816)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !491, line: 274, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !491, line: 271, size: 32, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !535, file: !491, line: 273, baseType: !229, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !490, file: !491, line: 373, baseType: !61, size: 32, offset: 2848)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !490, file: !491, line: 382, baseType: !540, size: 64, offset: 2880)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !491, line: 46, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !490, file: !491, line: 385, baseType: !543, size: 64, offset: 2944)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !50, !197}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !490, file: !491, line: 386, baseType: !547, size: 64, offset: 3008)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !50, !294}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !490, file: !491, line: 387, baseType: !551, size: 64, offset: 3072)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!61, !50}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !490, file: !491, line: 388, baseType: !555, size: 64, offset: 3136)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !50}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !490, file: !491, line: 389, baseType: !50, size: 64, offset: 3200)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !490, file: !491, line: 389, baseType: !50, size: 64, offset: 3264)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !490, file: !491, line: 389, baseType: !50, size: 64, offset: 3328)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !490, file: !491, line: 389, baseType: !50, size: 64, offset: 3392)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !160, file: !159, line: 1244, baseType: !563, size: 64, offset: 2048)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !565, line: 200, size: 17024, elements: !566)
!565 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!566 = !{!567, !568, !569, !570, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !564, file: !565, line: 201, baseType: !413, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !564, file: !565, line: 202, baseType: !86, size: 128, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !564, file: !565, line: 203, baseType: !86, size: 128, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !564, file: !565, line: 206, baseType: !571, size: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !565, line: 190, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !565, line: 126, size: 2816, elements: !574)
!574 = !{!575, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !670, !671, !672, !673, !1009, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1038}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !573, file: !565, line: 127, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !573, file: !565, line: 127, baseType: !576, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !573, file: !565, line: 128, baseType: !50, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !573, file: !565, line: 129, baseType: !50, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !573, file: !565, line: 130, baseType: !76, size: 512, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !573, file: !565, line: 132, baseType: !61, size: 32, offset: 768)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !573, file: !565, line: 132, baseType: !61, size: 32, offset: 800)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !573, file: !565, line: 133, baseType: !61, size: 32, offset: 832)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !573, file: !565, line: 134, baseType: !61, size: 32, offset: 864)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !573, file: !565, line: 134, baseType: !61, size: 32, offset: 896)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !573, file: !565, line: 134, baseType: !61, size: 32, offset: 928)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !573, file: !565, line: 135, baseType: !61, size: 32, offset: 960)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !573, file: !565, line: 135, baseType: !61, size: 32, offset: 992)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !573, file: !565, line: 136, baseType: !61, size: 32, offset: 1024)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !573, file: !565, line: 136, baseType: !61, size: 32, offset: 1056)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !573, file: !565, line: 137, baseType: !61, size: 32, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !573, file: !565, line: 137, baseType: !61, size: 32, offset: 1120)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !573, file: !565, line: 138, baseType: !197, size: 32, offset: 1152)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !573, file: !565, line: 139, baseType: !197, size: 32, offset: 1184)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !573, file: !565, line: 139, baseType: !197, size: 32, offset: 1216)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !573, file: !565, line: 141, baseType: !25, size: 16, offset: 1248)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !573, file: !565, line: 142, baseType: !25, size: 16, offset: 1264)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !573, file: !565, line: 143, baseType: !61, size: 32, offset: 1280)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !573, file: !565, line: 144, baseType: !61, size: 32, offset: 1312)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !573, file: !565, line: 146, baseType: !601, size: 64, offset: 1344)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !565, line: 114, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !565, line: 99, size: 7232, elements: !604)
!604 = !{!605, !607, !608, !609, !610, !611, !612, !620, !624, !638, !647, !654, !664}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !603, file: !565, line: 100, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !603, file: !565, line: 100, baseType: !606, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !603, file: !565, line: 101, baseType: !61, size: 32, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !603, file: !565, line: 101, baseType: !61, size: 32, offset: 160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !603, file: !565, line: 102, baseType: !61, size: 32, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !603, file: !565, line: 102, baseType: !61, size: 32, offset: 224)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !603, file: !565, line: 103, baseType: !613, size: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !565, line: 59, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !565, line: 56, size: 2112, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !615, file: !565, line: 57, baseType: !142, size: 2048)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !615, file: !565, line: 58, baseType: !61, size: 32, offset: 2048)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !615, file: !565, line: 58, baseType: !61, size: 32, offset: 2080)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !603, file: !565, line: 106, baseType: !621, size: 6144, offset: 320)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 6144, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !603, file: !565, line: 107, baseType: !625, size: 64, offset: 6464)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !565, line: 97, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !565, line: 83, size: 8320, elements: !628)
!628 = !{!629, !630, !631, !634, !635, !636, !637}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !627, file: !565, line: 84, baseType: !621, size: 6144)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !627, file: !565, line: 87, baseType: !142, size: 2048, offset: 6144)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !627, file: !565, line: 88, baseType: !632, size: 64, offset: 8192)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !427, line: 41, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !627, file: !565, line: 90, baseType: !25, size: 16, offset: 8256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !627, file: !565, line: 92, baseType: !25, size: 16, offset: 8272)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !627, file: !565, line: 93, baseType: !25, size: 16, offset: 8288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !627, file: !565, line: 95, baseType: !25, size: 16, offset: 8304)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !603, file: !565, line: 108, baseType: !639, size: 64, offset: 6528)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !565, line: 66, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !565, line: 61, size: 128, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !641, file: !565, line: 62, baseType: !61, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !641, file: !565, line: 63, baseType: !61, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !641, file: !565, line: 64, baseType: !61, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !641, file: !565, line: 65, baseType: !61, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !603, file: !565, line: 109, baseType: !648, size: 64, offset: 6592)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !565, line: 71, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !565, line: 68, size: 64, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !650, file: !565, line: 69, baseType: !61, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !650, file: !565, line: 70, baseType: !61, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !603, file: !565, line: 110, baseType: !655, size: 64, offset: 6656)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !565, line: 81, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !565, line: 73, size: 352, elements: !658)
!658 = !{!659, !660, !661, !662, !663}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !657, file: !565, line: 74, baseType: !233, size: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !657, file: !565, line: 75, baseType: !233, size: 96, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !657, file: !565, line: 76, baseType: !233, size: 96, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !657, file: !565, line: 77, baseType: !61, size: 32, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !657, file: !565, line: 78, baseType: !61, size: 32, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !603, file: !565, line: 113, baseType: !665, size: 512, offset: 6720)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !666, line: 182, baseType: !667)
!666 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !666, line: 180, size: 512, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !667, file: !666, line: 181, baseType: !76, size: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !573, file: !565, line: 148, baseType: !188, size: 64, offset: 1408)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !573, file: !565, line: 151, baseType: !431, size: 64, offset: 1472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !573, file: !565, line: 152, baseType: !167, size: 64, offset: 1536)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !573, file: !565, line: 153, baseType: !674, size: 64, offset: 1600)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !676, line: 64, size: 19136, elements: !677)
!676 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!677 = !{!678, !679, !680, !681, !682, !683, !685, !686, !687, !688, !691, !692, !995, !996, !1004, !1005, !1006, !1007, !1008}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !675, file: !676, line: 65, baseType: !46, size: 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !675, file: !676, line: 66, baseType: !164, size: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !676, line: 68, baseType: !20, size: 8192, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !675, file: !676, line: 70, baseType: !61, size: 32, offset: 9216)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !675, file: !676, line: 71, baseType: !61, size: 32, offset: 9248)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !675, file: !676, line: 72, baseType: !684, size: 64, offset: 9280)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, elements: !422)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !675, file: !676, line: 74, baseType: !197, size: 32, offset: 9344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !675, file: !676, line: 74, baseType: !197, size: 32, offset: 9376)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !675, file: !676, line: 76, baseType: !632, size: 64, offset: 9408)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !675, file: !676, line: 77, baseType: !689, size: 64, offset: 9472)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !676, line: 77, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !675, file: !676, line: 78, baseType: !264, size: 64, offset: 9536)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !675, file: !676, line: 80, baseType: !693, size: 2624, offset: 9600)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !694, line: 340, size: 2624, elements: !695)
!694 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!695 = !{!696, !724, !742, !743, !744, !759, !817, !818, !975, !976, !977, !978, !984}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !693, file: !694, line: 341, baseType: !697, size: 576)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !694, line: 251, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !694, line: 207, size: 576, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !698, file: !694, line: 208, baseType: !61, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !698, file: !694, line: 211, baseType: !25, size: 16, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !698, file: !694, line: 212, baseType: !25, size: 16, offset: 48)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !698, file: !694, line: 213, baseType: !197, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !698, file: !694, line: 214, baseType: !25, size: 16, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !698, file: !694, line: 215, baseType: !25, size: 16, offset: 112)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !698, file: !694, line: 216, baseType: !25, size: 16, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !698, file: !694, line: 217, baseType: !25, size: 16, offset: 144)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !698, file: !694, line: 218, baseType: !25, size: 16, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !698, file: !694, line: 219, baseType: !25, size: 16, offset: 176)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !698, file: !694, line: 220, baseType: !197, size: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !698, file: !694, line: 222, baseType: !25, size: 16, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !698, file: !694, line: 225, baseType: !25, size: 16, offset: 240)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !698, file: !694, line: 228, baseType: !61, size: 32, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !698, file: !694, line: 229, baseType: !61, size: 32, offset: 288)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !698, file: !694, line: 233, baseType: !61, size: 32, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !698, file: !694, line: 236, baseType: !25, size: 16, offset: 352)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !698, file: !694, line: 236, baseType: !25, size: 16, offset: 368)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !698, file: !694, line: 241, baseType: !197, size: 32, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !698, file: !694, line: 244, baseType: !61, size: 32, offset: 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !698, file: !694, line: 244, baseType: !61, size: 32, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !698, file: !694, line: 245, baseType: !197, size: 32, offset: 480)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !698, file: !694, line: 248, baseType: !197, size: 32, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !698, file: !694, line: 250, baseType: !61, size: 32, offset: 544)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !693, file: !694, line: 342, baseType: !725, size: 448, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !694, line: 79, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !694, line: 61, size: 448, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !726, file: !694, line: 62, baseType: !50, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !726, file: !694, line: 64, baseType: !25, size: 16, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !726, file: !694, line: 65, baseType: !25, size: 16, offset: 80)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !726, file: !694, line: 67, baseType: !197, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !726, file: !694, line: 68, baseType: !197, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !726, file: !694, line: 69, baseType: !197, size: 32, offset: 160)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !726, file: !694, line: 70, baseType: !25, size: 16, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !726, file: !694, line: 71, baseType: !25, size: 16, offset: 208)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !726, file: !694, line: 72, baseType: !421, size: 64, offset: 224)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !726, file: !694, line: 75, baseType: !197, size: 32, offset: 288)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !726, file: !694, line: 75, baseType: !197, size: 32, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !726, file: !694, line: 75, baseType: !197, size: 32, offset: 352)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !726, file: !694, line: 78, baseType: !197, size: 32, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !726, file: !694, line: 78, baseType: !197, size: 32, offset: 416)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !693, file: !694, line: 343, baseType: !86, size: 128, offset: 1024)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !693, file: !694, line: 344, baseType: !86, size: 128, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !693, file: !694, line: 345, baseType: !745, size: 192, offset: 1280)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !694, line: 278, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !694, line: 270, size: 192, elements: !747)
!747 = !{!748, !749, !750, !751, !752}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !746, file: !694, line: 271, baseType: !61, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !746, file: !694, line: 273, baseType: !197, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !746, file: !694, line: 275, baseType: !61, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !746, file: !694, line: 276, baseType: !61, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !746, file: !694, line: 277, baseType: !753, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !694, line: 55, size: 576, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !754, file: !694, line: 56, baseType: !61, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !754, file: !694, line: 57, baseType: !197, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !754, file: !694, line: 58, baseType: !315, size: 512, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !693, file: !694, line: 346, baseType: !760, size: 384, offset: 1472)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !694, line: 268, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !694, line: 253, size: 384, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !811, !812, !813, !814, !815, !816}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !761, file: !694, line: 254, baseType: !61, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !761, file: !694, line: 255, baseType: !61, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !761, file: !694, line: 255, baseType: !61, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !761, file: !694, line: 258, baseType: !197, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !761, file: !694, line: 259, baseType: !768, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !694, line: 164, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !694, line: 108, size: 1664, elements: !771)
!771 = !{!772, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !770, file: !694, line: 109, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !770, file: !694, line: 109, baseType: !773, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !694, line: 111, baseType: !76, size: 512, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !770, file: !694, line: 119, baseType: !421, size: 64, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !770, file: !694, line: 119, baseType: !421, size: 64, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !770, file: !694, line: 125, baseType: !421, size: 64, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !770, file: !694, line: 125, baseType: !421, size: 64, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !770, file: !694, line: 127, baseType: !421, size: 64, offset: 896)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !770, file: !694, line: 130, baseType: !61, size: 32, offset: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !770, file: !694, line: 131, baseType: !61, size: 32, offset: 992)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !770, file: !694, line: 132, baseType: !784, size: 64, offset: 1024)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !694, line: 106, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !694, line: 81, size: 512, elements: !787)
!787 = !{!788, !789, !792, !793, !794, !795}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !786, file: !694, line: 82, baseType: !421, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !786, file: !694, line: 97, baseType: !790, size: 256, offset: 64)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 256, elements: !791)
!791 = !{!308, !423}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !786, file: !694, line: 102, baseType: !421, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !786, file: !694, line: 102, baseType: !421, size: 64, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !786, file: !694, line: 104, baseType: !61, size: 32, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !786, file: !694, line: 105, baseType: !61, size: 32, offset: 480)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !770, file: !694, line: 135, baseType: !233, size: 96, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !770, file: !694, line: 136, baseType: !197, size: 32, offset: 1184)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !770, file: !694, line: 139, baseType: !61, size: 32, offset: 1216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !770, file: !694, line: 139, baseType: !61, size: 32, offset: 1248)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !770, file: !694, line: 139, baseType: !61, size: 32, offset: 1280)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !770, file: !694, line: 140, baseType: !233, size: 96, offset: 1312)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !770, file: !694, line: 143, baseType: !25, size: 16, offset: 1408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !770, file: !694, line: 144, baseType: !25, size: 16, offset: 1424)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !770, file: !694, line: 145, baseType: !25, size: 16, offset: 1440)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !770, file: !694, line: 148, baseType: !25, size: 16, offset: 1456)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !770, file: !694, line: 149, baseType: !61, size: 32, offset: 1472)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !770, file: !694, line: 150, baseType: !197, size: 32, offset: 1504)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !770, file: !694, line: 152, baseType: !264, size: 64, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !770, file: !694, line: 163, baseType: !197, size: 32, offset: 1600)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !770, file: !694, line: 163, baseType: !197, size: 32, offset: 1632)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !761, file: !694, line: 261, baseType: !197, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !761, file: !694, line: 261, baseType: !197, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !761, file: !694, line: 261, baseType: !197, size: 32, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !761, file: !694, line: 263, baseType: !61, size: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !761, file: !694, line: 266, baseType: !61, size: 32, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !761, file: !694, line: 267, baseType: !197, size: 32, offset: 352)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !693, file: !694, line: 347, baseType: !768, size: 64, offset: 1856)
