; ModuleID = 'blender/source/blender/editors/mesh/editmesh_bevel.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_bevel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "offset_type_items", scope: !2, file: !3, line: 459, type: !1901, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "MESH_OT_bevel", scope: !3, file: !3, line: 455, type: !4, scopeLine: 456, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1806, retainedNodes: !1900)
!3 = !DIFile(filename: "blender/source/blender/editors/mesh/editmesh_bevel.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !1732, !1736, !1742, !1746, !1747, !1751, !1752, !1753, !1754, !1758, !1759, !1774, !1775, !1779, !1805}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !84, !1725, !1726, !1727, !1730, !1731}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !25, line: 41, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !86, file: !28, line: 107, baseType: !58, size: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !86, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !86, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !86, file: !28, line: 111, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !96)
!96 = !{!97, !98, !99, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !8, line: 491, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !8, line: 491, baseType: !94, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !95, file: !8, line: 493, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !102)
!102 = !{!103, !104, !105, !106, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1691, !1694, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !28, line: 170, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !28, line: 170, baseType: !100, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !101, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !101, file: !28, line: 174, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !109, line: 49, size: 1984, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !147, !148, !149, !150, !151, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !109, line: 50, baseType: !112, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !114)
!114 = !{!115, !116, !117, !119, !138, !142, !143, !144, !145, !146}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !39, line: 118, baseType: !56, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !113, file: !39, line: 119, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !113, file: !39, line: 120, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !122)
!122 = !{!123, !124, !126, !129, !133, !134, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !39, line: 137, baseType: !112, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !121, file: !39, line: 138, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !121, file: !39, line: 139, baseType: !127, size: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !39, line: 140, baseType: !130, size: 8192, offset: 1088)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !121, file: !39, line: 141, baseType: !130, size: 8192, offset: 9280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !39, line: 148, baseType: !120, size: 64, offset: 17472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !121, file: !39, line: 150, baseType: !136, size: 64, offset: 17536)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !39, line: 121, baseType: !139, size: 528, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 66)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !113, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !113, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !108, file: !109, line: 52, baseType: !58, size: 128, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !108, file: !109, line: 53, baseType: !58, size: 128, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !108, file: !109, line: 54, baseType: !58, size: 128, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !108, file: !109, line: 55, baseType: !58, size: 128, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !108, file: !109, line: 57, baseType: !152, size: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !154, line: 1216, size: 39680, elements: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !157, !161, !454, !457, !458, !459, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !485, !556, !984, !1200, !1203, !1491, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1513, !1514, !1515, !1516, !1517, !1525, !1592, !1599, !1600, !1607, !1608, !1609, !1610, !1611, !1612, !1613}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !154, line: 1217, baseType: !112, size: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !153, file: !154, line: 1218, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !160, line: 45, flags: DIFlagFwdDecl)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !153, file: !154, line: 1220, baseType: !162, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !164, line: 115, size: 11392, elements: !165)
!164 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!165 = !{!166, !167, !168, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !185, !197, !211, !212, !256, !257, !260, !261, !277, !278, !279, !280, !281, !282, !283, !287, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !303, !304, !305, !306, !307, !308, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !368, !369, !370, !371, !372, !373, !374, !375, !376, !379, !382, !385, !386, !387, !388, !389, !392, !395, !398, !399, !405, !406, !407, !408, !409, !410, !412, !415, !418, !422, !442, !443}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !164, line: 116, baseType: !112, size: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !163, file: !164, line: 117, baseType: !158, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !163, file: !164, line: 119, baseType: !169, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !164, line: 57, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !164, line: 121, baseType: !48, size: 16, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !163, file: !164, line: 121, baseType: !48, size: 16, offset: 1104)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1120)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1184)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !163, file: !164, line: 123, baseType: !33, size: 512, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !163, file: !164, line: 124, baseType: !162, size: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !163, file: !164, line: 124, baseType: !162, size: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !163, file: !164, line: 128, baseType: !183, size: 64, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !160, line: 46, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !163, file: !164, line: 130, baseType: !186, size: 64, offset: 2112)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !164, line: 97, size: 832, elements: !188)
!188 = !{!189, !195, !196}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !187, file: !164, line: 98, baseType: !190, size: 768)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 768, elements: !192)
!191 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!192 = !{!193, !194}
!193 = !DISubrange(count: 8)
!194 = !DISubrange(count: 3)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !187, file: !164, line: 99, baseType: !22, size: 32, offset: 768)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !187, file: !164, line: 99, baseType: !22, size: 32, offset: 800)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !163, file: !164, line: 131, baseType: !198, size: 64, offset: 2176)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !200, line: 486, size: 1600, elements: !201)
!200 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !199, file: !200, line: 487, baseType: !112, size: 960)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !199, file: !200, line: 489, baseType: !58, size: 128, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !199, file: !200, line: 490, baseType: !58, size: 128, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !199, file: !200, line: 491, baseType: !58, size: 128, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !199, file: !200, line: 492, baseType: !58, size: 128, offset: 1344)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !199, file: !200, line: 494, baseType: !22, size: 32, offset: 1472)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !199, file: !200, line: 495, baseType: !22, size: 32, offset: 1504)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !199, file: !200, line: 497, baseType: !22, size: 32, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !199, file: !200, line: 498, baseType: !22, size: 32, offset: 1568)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !163, file: !164, line: 132, baseType: !198, size: 64, offset: 2240)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !163, file: !164, line: 133, baseType: !213, size: 64, offset: 2304)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !200, line: 334, size: 1728, elements: !215)
!215 = !{!216, !217, !220, !221, !222, !224, !225, !226, !229, !230, !231, !232, !233, !234, !235, !255}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !214, file: !200, line: 335, baseType: !58, size: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !214, file: !200, line: 336, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !200, line: 47, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !214, file: !200, line: 338, baseType: !48, size: 16, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !214, file: !200, line: 338, baseType: !48, size: 16, offset: 208)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !214, file: !200, line: 339, baseType: !223, size: 32, offset: 224)
!223 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !214, file: !200, line: 340, baseType: !22, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !214, file: !200, line: 342, baseType: !191, size: 32, offset: 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !214, file: !200, line: 343, baseType: !227, size: 96, offset: 320)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 96, elements: !228)
!228 = !{!194}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !214, file: !200, line: 344, baseType: !227, size: 96, offset: 416)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !214, file: !200, line: 347, baseType: !58, size: 128, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !214, file: !200, line: 349, baseType: !22, size: 32, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !214, file: !200, line: 350, baseType: !22, size: 32, offset: 672)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !214, file: !200, line: 351, baseType: !56, size: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !214, file: !200, line: 352, baseType: !56, size: 64, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !214, file: !200, line: 354, baseType: !236, size: 384, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !200, line: 116, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !200, line: 94, size: 384, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !237, file: !200, line: 96, baseType: !22, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !237, file: !200, line: 96, baseType: !22, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !237, file: !200, line: 97, baseType: !22, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !237, file: !200, line: 97, baseType: !22, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !237, file: !200, line: 99, baseType: !48, size: 16, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !237, file: !200, line: 100, baseType: !48, size: 16, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !237, file: !200, line: 102, baseType: !48, size: 16, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !237, file: !200, line: 105, baseType: !48, size: 16, offset: 176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !237, file: !200, line: 108, baseType: !48, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !237, file: !200, line: 109, baseType: !48, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !237, file: !200, line: 111, baseType: !48, size: 16, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !237, file: !200, line: 112, baseType: !48, size: 16, offset: 240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !237, file: !200, line: 114, baseType: !22, size: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !237, file: !200, line: 114, baseType: !22, size: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !237, file: !200, line: 115, baseType: !22, size: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !237, file: !200, line: 115, baseType: !22, size: 32, offset: 352)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !214, file: !200, line: 355, baseType: !33, size: 512, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !164, line: 134, baseType: !56, size: 64, offset: 2368)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !163, file: !164, line: 136, baseType: !258, size: 64, offset: 2432)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !164, line: 58, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !163, file: !164, line: 138, baseType: !236, size: 384, offset: 2496)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !163, file: !164, line: 139, baseType: !262, size: 64, offset: 2880)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !200, line: 80, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !200, line: 72, size: 192, elements: !265)
!265 = !{!266, !273, !274, !275, !276}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !264, file: !200, line: 73, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !200, line: 59, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !200, line: 56, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !269, file: !200, line: 57, baseType: !227, size: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !200, line: 58, baseType: !22, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !264, file: !200, line: 74, baseType: !22, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !264, file: !200, line: 76, baseType: !22, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !264, file: !200, line: 77, baseType: !22, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !264, file: !200, line: 79, baseType: !22, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !163, file: !164, line: 141, baseType: !58, size: 128, offset: 2944)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !163, file: !164, line: 142, baseType: !58, size: 128, offset: 3072)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !163, file: !164, line: 143, baseType: !58, size: 128, offset: 3200)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !163, file: !164, line: 144, baseType: !58, size: 128, offset: 3328)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !163, file: !164, line: 146, baseType: !22, size: 32, offset: 3456)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !163, file: !164, line: 147, baseType: !22, size: 32, offset: 3488)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !163, file: !164, line: 150, baseType: !284, size: 64, offset: 3520)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !164, line: 50, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !163, file: !164, line: 151, baseType: !288, size: 64, offset: 3584)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !163, file: !164, line: 152, baseType: !22, size: 32, offset: 3648)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !163, file: !164, line: 153, baseType: !22, size: 32, offset: 3680)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !163, file: !164, line: 156, baseType: !227, size: 96, offset: 3712)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !163, file: !164, line: 156, baseType: !227, size: 96, offset: 3808)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !163, file: !164, line: 156, baseType: !227, size: 96, offset: 3904)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !164, line: 157, baseType: !227, size: 96, offset: 4000)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !163, file: !164, line: 158, baseType: !227, size: 96, offset: 4096)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !163, file: !164, line: 159, baseType: !227, size: 96, offset: 4192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !163, file: !164, line: 160, baseType: !227, size: 96, offset: 4288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !163, file: !164, line: 160, baseType: !227, size: 96, offset: 4384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !163, file: !164, line: 161, baseType: !300, size: 128, offset: 4480)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 128, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 4)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !163, file: !164, line: 161, baseType: !300, size: 128, offset: 4608)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !163, file: !164, line: 162, baseType: !227, size: 96, offset: 4736)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !163, file: !164, line: 162, baseType: !227, size: 96, offset: 4832)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !163, file: !164, line: 163, baseType: !191, size: 32, offset: 4928)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !163, file: !164, line: 163, baseType: !191, size: 32, offset: 4960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !163, file: !164, line: 164, baseType: !309, size: 512, offset: 4992)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 512, elements: !310)
!310 = !{!302, !302}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !163, file: !164, line: 165, baseType: !309, size: 512, offset: 5504)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !163, file: !164, line: 166, baseType: !309, size: 512, offset: 6016)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !163, file: !164, line: 167, baseType: !309, size: 512, offset: 6528)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !163, file: !164, line: 176, baseType: !309, size: 512, offset: 7040)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !163, file: !164, line: 178, baseType: !223, size: 32, offset: 7552)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !163, file: !164, line: 180, baseType: !48, size: 16, offset: 7584)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !163, file: !164, line: 181, baseType: !48, size: 16, offset: 7600)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !163, file: !164, line: 183, baseType: !48, size: 16, offset: 7616)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !163, file: !164, line: 183, baseType: !48, size: 16, offset: 7632)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !163, file: !164, line: 184, baseType: !48, size: 16, offset: 7648)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !163, file: !164, line: 184, baseType: !48, size: 16, offset: 7664)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !163, file: !164, line: 185, baseType: !48, size: 16, offset: 7680)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !163, file: !164, line: 186, baseType: !48, size: 16, offset: 7696)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !163, file: !164, line: 187, baseType: !48, size: 16, offset: 7712)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !163, file: !164, line: 188, baseType: !14, size: 8, offset: 7728)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !163, file: !164, line: 189, baseType: !14, size: 8, offset: 7736)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7744)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7776)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7808)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7840)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !163, file: !164, line: 194, baseType: !22, size: 32, offset: 7872)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !163, file: !164, line: 202, baseType: !191, size: 32, offset: 7904)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !163, file: !164, line: 202, baseType: !191, size: 32, offset: 7936)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !163, file: !164, line: 202, baseType: !191, size: 32, offset: 7968)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !163, file: !164, line: 211, baseType: !191, size: 32, offset: 8000)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !163, file: !164, line: 212, baseType: !191, size: 32, offset: 8032)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !163, file: !164, line: 213, baseType: !191, size: 32, offset: 8064)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !163, file: !164, line: 214, baseType: !191, size: 32, offset: 8096)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !163, file: !164, line: 215, baseType: !191, size: 32, offset: 8128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !163, file: !164, line: 216, baseType: !191, size: 32, offset: 8160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !163, file: !164, line: 219, baseType: !191, size: 32, offset: 8192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !163, file: !164, line: 220, baseType: !191, size: 32, offset: 8224)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !163, file: !164, line: 221, baseType: !191, size: 32, offset: 8256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !163, file: !164, line: 224, baseType: !345, size: 16, offset: 8288)
!345 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !163, file: !164, line: 224, baseType: !345, size: 16, offset: 8304)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !163, file: !164, line: 226, baseType: !48, size: 16, offset: 8320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !163, file: !164, line: 228, baseType: !14, size: 8, offset: 8336)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !163, file: !164, line: 229, baseType: !14, size: 8, offset: 8344)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !163, file: !164, line: 231, baseType: !48, size: 16, offset: 8352)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !163, file: !164, line: 232, baseType: !14, size: 8, offset: 8368)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !163, file: !164, line: 233, baseType: !14, size: 8, offset: 8376)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !163, file: !164, line: 234, baseType: !191, size: 32, offset: 8384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !163, file: !164, line: 235, baseType: !191, size: 32, offset: 8416)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !163, file: !164, line: 237, baseType: !58, size: 128, offset: 8448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !163, file: !164, line: 238, baseType: !58, size: 128, offset: 8576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !163, file: !164, line: 239, baseType: !58, size: 128, offset: 8704)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !163, file: !164, line: 240, baseType: !58, size: 128, offset: 8832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !163, file: !164, line: 242, baseType: !191, size: 32, offset: 8960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !163, file: !164, line: 244, baseType: !48, size: 16, offset: 8992)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !163, file: !164, line: 245, baseType: !345, size: 16, offset: 9008)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !163, file: !164, line: 246, baseType: !300, size: 128, offset: 9024)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !163, file: !164, line: 248, baseType: !22, size: 32, offset: 9152)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !163, file: !164, line: 249, baseType: !22, size: 32, offset: 9184)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !163, file: !164, line: 251, baseType: !366, size: 64, offset: 9216)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !164, line: 251, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !163, file: !164, line: 253, baseType: !14, size: 8, offset: 9280)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !163, file: !164, line: 254, baseType: !14, size: 8, offset: 9288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !163, file: !164, line: 255, baseType: !48, size: 16, offset: 9296)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !163, file: !164, line: 256, baseType: !227, size: 96, offset: 9312)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !163, file: !164, line: 258, baseType: !58, size: 128, offset: 9408)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !163, file: !164, line: 259, baseType: !58, size: 128, offset: 9536)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !163, file: !164, line: 260, baseType: !58, size: 128, offset: 9664)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !163, file: !164, line: 261, baseType: !58, size: 128, offset: 9792)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !163, file: !164, line: 263, baseType: !377, size: 64, offset: 9920)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !164, line: 52, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !163, file: !164, line: 264, baseType: !380, size: 64, offset: 9984)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !164, line: 53, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !163, file: !164, line: 265, baseType: !383, size: 64, offset: 10048)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !200, line: 46, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !163, file: !164, line: 267, baseType: !14, size: 8, offset: 10112)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !163, file: !164, line: 268, baseType: !14, size: 8, offset: 10120)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !163, file: !164, line: 269, baseType: !48, size: 16, offset: 10128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !163, file: !164, line: 270, baseType: !191, size: 32, offset: 10144)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !163, file: !164, line: 272, baseType: !390, size: 64, offset: 10176)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !164, line: 54, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !163, file: !164, line: 275, baseType: !393, size: 64, offset: 10240)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !164, line: 275, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !163, file: !164, line: 277, baseType: !396, size: 64, offset: 10304)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !164, line: 56, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !163, file: !164, line: 277, baseType: !396, size: 64, offset: 10368)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !163, file: !164, line: 278, baseType: !400, size: 64, offset: 10432)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !401, line: 27, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !403, line: 45, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!404 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !163, file: !164, line: 279, baseType: !400, size: 64, offset: 10496)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !164, line: 280, baseType: !223, size: 32, offset: 10560)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !163, file: !164, line: 281, baseType: !223, size: 32, offset: 10592)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !163, file: !164, line: 283, baseType: !58, size: 128, offset: 10624)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !163, file: !164, line: 284, baseType: !58, size: 128, offset: 10752)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !163, file: !164, line: 285, baseType: !411, size: 64, offset: 10880)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !163, file: !164, line: 287, baseType: !413, size: 64, offset: 10944)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !164, line: 59, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !163, file: !164, line: 288, baseType: !416, size: 64, offset: 11008)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !164, line: 288, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !163, file: !164, line: 290, baseType: !419, size: 64, offset: 11072)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 64, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 2)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !163, file: !164, line: 291, baseType: !423, size: 64, offset: 11136)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !425, line: 65, baseType: !426)
!425 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !425, line: 50, size: 320, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !426, file: !425, line: 51, baseType: !152, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !426, file: !425, line: 53, baseType: !22, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !426, file: !425, line: 54, baseType: !22, size: 32, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !426, file: !425, line: 55, baseType: !22, size: 32, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !426, file: !425, line: 55, baseType: !22, size: 32, offset: 160)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !426, file: !425, line: 56, baseType: !14, size: 8, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !426, file: !425, line: 56, baseType: !14, size: 8, offset: 200)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !426, file: !425, line: 57, baseType: !14, size: 8, offset: 208)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !426, file: !425, line: 57, baseType: !14, size: 8, offset: 216)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !426, file: !425, line: 59, baseType: !48, size: 16, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !426, file: !425, line: 59, baseType: !48, size: 16, offset: 240)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !426, file: !425, line: 59, baseType: !48, size: 16, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !426, file: !425, line: 61, baseType: !48, size: 16, offset: 272)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !426, file: !425, line: 63, baseType: !22, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !163, file: !164, line: 293, baseType: !58, size: 128, offset: 11200)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !163, file: !164, line: 294, baseType: !444, size: 64, offset: 11328)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !164, line: 113, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !164, line: 108, size: 256, elements: !447)
!447 = !{!448, !450, !451, !452, !453}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !446, file: !164, line: 109, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !446, file: !164, line: 109, baseType: !449, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !446, file: !164, line: 110, baseType: !162, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !446, file: !164, line: 111, baseType: !22, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !446, file: !164, line: 112, baseType: !191, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !153, file: !154, line: 1221, baseType: !455, size: 64, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !154, line: 52, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !153, file: !154, line: 1223, baseType: !152, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !153, file: !154, line: 1225, baseType: !58, size: 128, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !153, file: !154, line: 1226, baseType: !460, size: 64, offset: 1344)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !154, line: 69, size: 320, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !461, file: !154, line: 70, baseType: !460, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !461, file: !154, line: 70, baseType: !460, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !461, file: !154, line: 71, baseType: !223, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !461, file: !154, line: 71, baseType: !223, size: 32, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !461, file: !154, line: 72, baseType: !22, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !461, file: !154, line: 73, baseType: !48, size: 16, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !461, file: !154, line: 73, baseType: !48, size: 16, offset: 240)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !461, file: !154, line: 74, baseType: !162, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !153, file: !154, line: 1227, baseType: !162, size: 64, offset: 1408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !153, file: !154, line: 1229, baseType: !227, size: 96, offset: 1472)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !153, file: !154, line: 1230, baseType: !227, size: 96, offset: 1568)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !153, file: !154, line: 1231, baseType: !227, size: 96, offset: 1664)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !153, file: !154, line: 1231, baseType: !227, size: 96, offset: 1760)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !153, file: !154, line: 1233, baseType: !223, size: 32, offset: 1856)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !153, file: !154, line: 1234, baseType: !22, size: 32, offset: 1888)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !153, file: !154, line: 1235, baseType: !223, size: 32, offset: 1920)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !154, line: 1237, baseType: !48, size: 16, offset: 1952)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !153, file: !154, line: 1239, baseType: !14, size: 8, offset: 1968)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !153, file: !154, line: 1240, baseType: !482, size: 8, offset: 1976)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 1)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !153, file: !154, line: 1242, baseType: !486, size: 64, offset: 1984)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !488, line: 328, size: 3456, elements: !489)
!488 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!489 = !{!490, !491, !492, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !522, !523, !524, !527, !532, !533, !536, !540, !544, !548, !552, !553, !554, !555}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !487, file: !488, line: 329, baseType: !112, size: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !487, file: !488, line: 330, baseType: !158, size: 64, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !487, file: !488, line: 332, baseType: !493, size: 64, offset: 1024)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !488, line: 332, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !487, file: !488, line: 333, baseType: !33, size: 512, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !487, file: !488, line: 335, baseType: !81, size: 64, offset: 1600)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !487, file: !488, line: 337, baseType: !258, size: 64, offset: 1664)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !487, file: !488, line: 338, baseType: !419, size: 64, offset: 1728)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !487, file: !488, line: 340, baseType: !58, size: 128, offset: 1792)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !487, file: !488, line: 340, baseType: !58, size: 128, offset: 1920)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !487, file: !488, line: 342, baseType: !22, size: 32, offset: 2048)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !487, file: !488, line: 342, baseType: !22, size: 32, offset: 2080)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !487, file: !488, line: 343, baseType: !22, size: 32, offset: 2112)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !487, file: !488, line: 345, baseType: !22, size: 32, offset: 2144)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !487, file: !488, line: 346, baseType: !22, size: 32, offset: 2176)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !487, file: !488, line: 347, baseType: !48, size: 16, offset: 2208)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !487, file: !488, line: 348, baseType: !48, size: 16, offset: 2224)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !487, file: !488, line: 349, baseType: !22, size: 32, offset: 2240)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !487, file: !488, line: 351, baseType: !22, size: 32, offset: 2272)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !487, file: !488, line: 353, baseType: !48, size: 16, offset: 2304)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !487, file: !488, line: 354, baseType: !48, size: 16, offset: 2320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !487, file: !488, line: 355, baseType: !22, size: 32, offset: 2336)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !487, file: !488, line: 357, baseType: !514, size: 128, offset: 2368)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !515, line: 95, baseType: !516)
!515 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !515, line: 92, size: 128, elements: !517)
!517 = !{!518, !519, !520, !521}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !516, file: !515, line: 93, baseType: !191, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !516, file: !515, line: 93, baseType: !191, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !516, file: !515, line: 94, baseType: !191, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !516, file: !515, line: 94, baseType: !191, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !487, file: !488, line: 363, baseType: !58, size: 128, offset: 2496)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !487, file: !488, line: 363, baseType: !58, size: 128, offset: 2624)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !487, file: !488, line: 368, baseType: !525, size: 64, offset: 2752)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !488, line: 48, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !487, file: !488, line: 372, baseType: !528, size: 32, offset: 2816)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !488, line: 274, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !488, line: 271, size: 32, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !529, file: !488, line: 273, baseType: !223, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !487, file: !488, line: 373, baseType: !22, size: 32, offset: 2848)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !487, file: !488, line: 382, baseType: !534, size: 64, offset: 2880)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !488, line: 46, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !487, file: !488, line: 385, baseType: !537, size: 64, offset: 2944)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !56, !191}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !487, file: !488, line: 386, baseType: !541, size: 64, offset: 3008)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !56, !288}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !487, file: !488, line: 387, baseType: !545, size: 64, offset: 3072)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!22, !56}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !487, file: !488, line: 388, baseType: !549, size: 64, offset: 3136)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !56}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !487, file: !488, line: 389, baseType: !56, size: 64, offset: 3200)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !487, file: !488, line: 389, baseType: !56, size: 64, offset: 3264)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !487, file: !488, line: 389, baseType: !56, size: 64, offset: 3328)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !487, file: !488, line: 389, baseType: !56, size: 64, offset: 3392)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !153, file: !154, line: 1244, baseType: !557, size: 64, offset: 2048)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !559, line: 200, size: 17024, elements: !560)
!559 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!560 = !{!561, !562, !563, !564, !977, !978, !979, !980, !981, !982, !983}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !558, file: !559, line: 201, baseType: !411, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !558, file: !559, line: 202, baseType: !58, size: 128, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !558, file: !559, line: 203, baseType: !58, size: 128, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !558, file: !559, line: 206, baseType: !565, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !559, line: 190, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !559, line: 126, size: 2816, elements: !568)
!568 = !{!569, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !667, !668, !669, !670, !948, !952, !953, !954, !955, !956, !957, !958, !959, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !976}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !567, file: !559, line: 127, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !567, file: !559, line: 127, baseType: !570, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !567, file: !559, line: 128, baseType: !56, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !567, file: !559, line: 129, baseType: !56, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !559, line: 130, baseType: !33, size: 512, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !567, file: !559, line: 132, baseType: !22, size: 32, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !567, file: !559, line: 132, baseType: !22, size: 32, offset: 800)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !567, file: !559, line: 133, baseType: !22, size: 32, offset: 832)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !567, file: !559, line: 134, baseType: !22, size: 32, offset: 864)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !567, file: !559, line: 134, baseType: !22, size: 32, offset: 896)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !567, file: !559, line: 134, baseType: !22, size: 32, offset: 928)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !567, file: !559, line: 135, baseType: !22, size: 32, offset: 960)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !567, file: !559, line: 135, baseType: !22, size: 32, offset: 992)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !567, file: !559, line: 136, baseType: !22, size: 32, offset: 1024)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !567, file: !559, line: 136, baseType: !22, size: 32, offset: 1056)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !567, file: !559, line: 137, baseType: !22, size: 32, offset: 1088)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !567, file: !559, line: 137, baseType: !22, size: 32, offset: 1120)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !567, file: !559, line: 138, baseType: !191, size: 32, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !567, file: !559, line: 139, baseType: !191, size: 32, offset: 1184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !567, file: !559, line: 139, baseType: !191, size: 32, offset: 1216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !567, file: !559, line: 141, baseType: !48, size: 16, offset: 1248)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !567, file: !559, line: 142, baseType: !48, size: 16, offset: 1264)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !567, file: !559, line: 143, baseType: !22, size: 32, offset: 1280)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !567, file: !559, line: 144, baseType: !22, size: 32, offset: 1312)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !567, file: !559, line: 146, baseType: !595, size: 64, offset: 1344)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !559, line: 114, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !559, line: 99, size: 7232, elements: !598)
!598 = !{!599, !601, !602, !603, !604, !605, !606, !617, !621, !635, !644, !651, !661}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !597, file: !559, line: 100, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !597, file: !559, line: 100, baseType: !600, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !597, file: !559, line: 101, baseType: !22, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !597, file: !559, line: 101, baseType: !22, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !597, file: !559, line: 102, baseType: !22, size: 32, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !597, file: !559, line: 102, baseType: !22, size: 32, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !597, file: !559, line: 103, baseType: !607, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !559, line: 59, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !559, line: 56, size: 2112, elements: !610)
!610 = !{!611, !615, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !609, file: !559, line: 57, baseType: !612, size: 2048)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !609, file: !559, line: 58, baseType: !22, size: 32, offset: 2048)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !609, file: !559, line: 58, baseType: !22, size: 32, offset: 2080)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !597, file: !559, line: 106, baseType: !618, size: 6144, offset: 320)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 6144, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !597, file: !559, line: 107, baseType: !622, size: 64, offset: 6464)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !559, line: 97, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !559, line: 83, size: 8320, elements: !625)
!625 = !{!626, !627, !628, !631, !632, !633, !634}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !624, file: !559, line: 84, baseType: !618, size: 6144)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !624, file: !559, line: 87, baseType: !612, size: 2048, offset: 6144)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !624, file: !559, line: 88, baseType: !629, size: 64, offset: 8192)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !425, line: 41, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !624, file: !559, line: 90, baseType: !48, size: 16, offset: 8256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !624, file: !559, line: 92, baseType: !48, size: 16, offset: 8272)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !624, file: !559, line: 93, baseType: !48, size: 16, offset: 8288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !624, file: !559, line: 95, baseType: !48, size: 16, offset: 8304)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !597, file: !559, line: 108, baseType: !636, size: 64, offset: 6528)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !559, line: 66, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !559, line: 61, size: 128, elements: !639)
!639 = !{!640, !641, !642, !643}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !638, file: !559, line: 62, baseType: !22, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !638, file: !559, line: 63, baseType: !22, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !638, file: !559, line: 64, baseType: !22, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !638, file: !559, line: 65, baseType: !22, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !597, file: !559, line: 109, baseType: !645, size: 64, offset: 6592)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !559, line: 71, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !559, line: 68, size: 64, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !647, file: !559, line: 69, baseType: !22, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !647, file: !559, line: 70, baseType: !22, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !597, file: !559, line: 110, baseType: !652, size: 64, offset: 6656)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !559, line: 81, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !559, line: 73, size: 352, elements: !655)
!655 = !{!656, !657, !658, !659, !660}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !654, file: !559, line: 74, baseType: !227, size: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !654, file: !559, line: 75, baseType: !227, size: 96, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !654, file: !559, line: 76, baseType: !227, size: 96, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !654, file: !559, line: 77, baseType: !22, size: 32, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !654, file: !559, line: 78, baseType: !22, size: 32, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !597, file: !559, line: 113, baseType: !662, size: 512, offset: 6720)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !663, line: 182, baseType: !664)
!663 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !663, line: 180, size: 512, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !663, line: 181, baseType: !33, size: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !567, file: !559, line: 148, baseType: !183, size: 64, offset: 1408)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !567, file: !559, line: 151, baseType: !152, size: 64, offset: 1472)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !567, file: !559, line: 152, baseType: !162, size: 64, offset: 1536)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !567, file: !559, line: 153, baseType: !671, size: 64, offset: 1600)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !673, line: 64, size: 19136, elements: !674)
!673 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!674 = !{!675, !676, !677, !678, !679, !680, !682, !683, !684, !685, !688, !689, !934, !935, !943, !944, !945, !946, !947}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !672, file: !673, line: 65, baseType: !112, size: 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !672, file: !673, line: 66, baseType: !158, size: 64, offset: 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !673, line: 68, baseType: !130, size: 8192, offset: 1024)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !672, file: !673, line: 70, baseType: !22, size: 32, offset: 9216)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !672, file: !673, line: 71, baseType: !22, size: 32, offset: 9248)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !672, file: !673, line: 72, baseType: !681, size: 64, offset: 9280)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !420)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !672, file: !673, line: 74, baseType: !191, size: 32, offset: 9344)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !672, file: !673, line: 74, baseType: !191, size: 32, offset: 9376)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !672, file: !673, line: 76, baseType: !629, size: 64, offset: 9408)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !672, file: !673, line: 77, baseType: !686, size: 64, offset: 9472)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !673, line: 77, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !672, file: !673, line: 78, baseType: !258, size: 64, offset: 9536)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !672, file: !673, line: 80, baseType: !690, size: 2624, offset: 9600)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !691, line: 340, size: 2624, elements: !692)
!691 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!692 = !{!693, !721, !739, !740, !741, !756, !814, !815, !914, !915, !916, !917, !923}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !690, file: !691, line: 341, baseType: !694, size: 576)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !691, line: 251, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !691, line: 207, size: 576, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !695, file: !691, line: 208, baseType: !22, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !695, file: !691, line: 211, baseType: !48, size: 16, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !695, file: !691, line: 212, baseType: !48, size: 16, offset: 48)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !695, file: !691, line: 213, baseType: !191, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !695, file: !691, line: 214, baseType: !48, size: 16, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !695, file: !691, line: 215, baseType: !48, size: 16, offset: 112)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !695, file: !691, line: 216, baseType: !48, size: 16, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !695, file: !691, line: 217, baseType: !48, size: 16, offset: 144)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !695, file: !691, line: 218, baseType: !48, size: 16, offset: 160)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !695, file: !691, line: 219, baseType: !48, size: 16, offset: 176)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !695, file: !691, line: 220, baseType: !191, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !695, file: !691, line: 222, baseType: !48, size: 16, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !695, file: !691, line: 225, baseType: !48, size: 16, offset: 240)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !695, file: !691, line: 228, baseType: !22, size: 32, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !695, file: !691, line: 229, baseType: !22, size: 32, offset: 288)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !695, file: !691, line: 233, baseType: !22, size: 32, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !695, file: !691, line: 236, baseType: !48, size: 16, offset: 352)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !695, file: !691, line: 236, baseType: !48, size: 16, offset: 368)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !695, file: !691, line: 241, baseType: !191, size: 32, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !695, file: !691, line: 244, baseType: !22, size: 32, offset: 416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !695, file: !691, line: 244, baseType: !22, size: 32, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !695, file: !691, line: 245, baseType: !191, size: 32, offset: 480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !695, file: !691, line: 248, baseType: !191, size: 32, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !695, file: !691, line: 250, baseType: !22, size: 32, offset: 544)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !690, file: !691, line: 342, baseType: !722, size: 448, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !691, line: 79, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !691, line: 61, size: 448, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !723, file: !691, line: 62, baseType: !56, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !723, file: !691, line: 64, baseType: !48, size: 16, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !723, file: !691, line: 65, baseType: !48, size: 16, offset: 80)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !723, file: !691, line: 67, baseType: !191, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !723, file: !691, line: 68, baseType: !191, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !723, file: !691, line: 69, baseType: !191, size: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !723, file: !691, line: 70, baseType: !48, size: 16, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !723, file: !691, line: 71, baseType: !48, size: 16, offset: 208)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !723, file: !691, line: 72, baseType: !419, size: 64, offset: 224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !723, file: !691, line: 75, baseType: !191, size: 32, offset: 288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !723, file: !691, line: 75, baseType: !191, size: 32, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !723, file: !691, line: 75, baseType: !191, size: 32, offset: 352)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !723, file: !691, line: 78, baseType: !191, size: 32, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !723, file: !691, line: 78, baseType: !191, size: 32, offset: 416)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !690, file: !691, line: 343, baseType: !58, size: 128, offset: 1024)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !690, file: !691, line: 344, baseType: !58, size: 128, offset: 1152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !690, file: !691, line: 345, baseType: !742, size: 192, offset: 1280)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !691, line: 278, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !691, line: 270, size: 192, elements: !744)
!744 = !{!745, !746, !747, !748, !749}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !743, file: !691, line: 271, baseType: !22, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !743, file: !691, line: 273, baseType: !191, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !743, file: !691, line: 275, baseType: !22, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !743, file: !691, line: 276, baseType: !22, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !743, file: !691, line: 277, baseType: !750, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !691, line: 55, size: 576, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !751, file: !691, line: 56, baseType: !22, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !751, file: !691, line: 57, baseType: !191, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !751, file: !691, line: 58, baseType: !309, size: 512, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !690, file: !691, line: 346, baseType: !757, size: 384, offset: 1472)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !691, line: 268, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !691, line: 253, size: 384, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !808, !809, !810, !811, !812, !813}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !758, file: !691, line: 254, baseType: !22, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !758, file: !691, line: 255, baseType: !22, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !758, file: !691, line: 255, baseType: !22, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !758, file: !691, line: 258, baseType: !191, size: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !758, file: !691, line: 259, baseType: !765, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !691, line: 164, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !691, line: 108, size: 1664, elements: !768)
!768 = !{!769, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !691, line: 109, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !767, file: !691, line: 109, baseType: !770, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !767, file: !691, line: 111, baseType: !33, size: 512, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !767, file: !691, line: 119, baseType: !419, size: 64, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !767, file: !691, line: 119, baseType: !419, size: 64, offset: 704)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !767, file: !691, line: 125, baseType: !419, size: 64, offset: 768)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !767, file: !691, line: 125, baseType: !419, size: 64, offset: 832)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !767, file: !691, line: 127, baseType: !419, size: 64, offset: 896)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !767, file: !691, line: 130, baseType: !22, size: 32, offset: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !767, file: !691, line: 131, baseType: !22, size: 32, offset: 992)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !767, file: !691, line: 132, baseType: !781, size: 64, offset: 1024)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !691, line: 106, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !691, line: 81, size: 512, elements: !784)
!784 = !{!785, !786, !789, !790, !791, !792}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !783, file: !691, line: 82, baseType: !419, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !783, file: !691, line: 97, baseType: !787, size: 256, offset: 64)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 256, elements: !788)
!788 = !{!302, !421}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !783, file: !691, line: 102, baseType: !419, size: 64, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !783, file: !691, line: 102, baseType: !419, size: 64, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !783, file: !691, line: 104, baseType: !22, size: 32, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !783, file: !691, line: 105, baseType: !22, size: 32, offset: 480)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !767, file: !691, line: 135, baseType: !227, size: 96, offset: 1088)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !767, file: !691, line: 136, baseType: !191, size: 32, offset: 1184)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !767, file: !691, line: 139, baseType: !22, size: 32, offset: 1216)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !767, file: !691, line: 139, baseType: !22, size: 32, offset: 1248)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !767, file: !691, line: 139, baseType: !22, size: 32, offset: 1280)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !767, file: !691, line: 140, baseType: !227, size: 96, offset: 1312)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !767, file: !691, line: 143, baseType: !48, size: 16, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !767, file: !691, line: 144, baseType: !48, size: 16, offset: 1424)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !767, file: !691, line: 145, baseType: !48, size: 16, offset: 1440)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !767, file: !691, line: 148, baseType: !48, size: 16, offset: 1456)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !767, file: !691, line: 149, baseType: !22, size: 32, offset: 1472)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !767, file: !691, line: 150, baseType: !191, size: 32, offset: 1504)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !767, file: !691, line: 152, baseType: !258, size: 64, offset: 1536)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !767, file: !691, line: 163, baseType: !191, size: 32, offset: 1600)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !767, file: !691, line: 163, baseType: !191, size: 32, offset: 1632)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !758, file: !691, line: 261, baseType: !191, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !758, file: !691, line: 261, baseType: !191, size: 32, offset: 224)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !758, file: !691, line: 261, baseType: !191, size: 32, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !758, file: !691, line: 263, baseType: !22, size: 32, offset: 288)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !758, file: !691, line: 266, baseType: !22, size: 32, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !758, file: !691, line: 267, baseType: !191, size: 32, offset: 352)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !690, file: !691, line: 347, baseType: !765, size: 64, offset: 1856)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !690, file: !691, line: 348, baseType: !816, size: 64, offset: 1920)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !691, line: 205, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !691, line: 186, size: 1024, elements: !819)
!819 = !{!820, !822, !823, !824, !826, !827, !828, !836, !837, !838, !912, !913}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !818, file: !691, line: 187, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !818, file: !691, line: 187, baseType: !821, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !818, file: !691, line: 189, baseType: !33, size: 512, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !818, file: !691, line: 191, baseType: !825, size: 64, offset: 640)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
