; ModuleID = 'blender/source/blender/editors/sculpt_paint/paint_mask.c'
source_filename = "blender/source/blender/editors/sculpt_paint/paint_mask.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!127 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!128 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!129 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !131, line: 71, baseType: !7, size: 32, elements: !132)
!131 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!132 = !{!133, !134, !135, !136, !137, !138, !139}
!133 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!134 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!135 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!136 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!137 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!138 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!139 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !131, line: 107, baseType: !7, size: 32, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!142 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!143 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!144 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!145 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!146 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!147 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!148 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!149 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!150 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!151 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!152 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!153 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!154 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!155 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!156 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!157 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!158 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!159 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!160 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!161 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!162 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!163 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!164 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!165 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!166 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!167 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!168 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!169 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!170 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!171 = !{!172, !175, !176, !178, !180, !184, !198}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !174, line: 33, baseType: !7)
!174 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCGElem", file: !182, line: 51, baseType: !183)
!182 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_ccg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !85, line: 33, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !186, line: 54, baseType: !187)
!186 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !186, line: 50, size: 192, elements: !188)
!188 = !{!189, !194, !197}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !187, file: !186, line: 51, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !186, line: 48, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !193, line: 47, flags: DIFlagFwdDecl)
!193 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !187, file: !186, line: 52, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !186, line: 52, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !187, file: !186, line: 53, baseType: !7, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !186, line: 94, size: 192, elements: !200)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !186, line: 94, baseType: !175, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !199, file: !186, line: 94, baseType: !175, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !199, file: !186, line: 94, baseType: !175, size: 64, offset: 128)
!204 = !{!0}
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 1280, elements: !217)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "EnumPropertyItem", file: !131, line: 308, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !131, line: 302, size: 320, elements: !208)
!208 = !{!209, !211, !214, !215, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !207, file: !131, line: 303, baseType: !210, size: 32)
!210 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !207, file: !131, line: 304, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !207, file: !131, line: 305, baseType: !210, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !207, file: !131, line: 306, baseType: !212, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !207, file: !131, line: 307, baseType: !212, size: 64, offset: 256)
!217 = !{!218}
!218 = !DISubrange(count: 4)
!219 = !{i32 7, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!223 = distinct !DISubprogram(name: "PAINT_OT_mask_flood_fill", scope: !3, file: !3, line: 150, type: !224, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !2980)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !228, line: 508, size: 1536, elements: !229)
!228 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!229 = !{!230, !231, !232, !233, !234, !2906, !2910, !2916, !2920, !2921, !2925, !2926, !2927, !2928, !2932, !2933, !2948, !2949, !2953, !2979}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !228, line: 509, baseType: !212, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !227, file: !228, line: 510, baseType: !212, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !227, file: !228, line: 511, baseType: !212, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !227, file: !228, line: 512, baseType: !212, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !227, file: !228, line: 518, baseType: !235, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!210, !238, !241}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !240, line: 37, flags: DIFlagFwdDecl)
!240 = !DIFile(filename: "blender/source/blender/editors/include/BIF_glutil.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !122, line: 328, size: 1344, elements: !243)
!243 = !{!244, !245, !246, !250, !281, !282, !283, !284, !296, !2899, !2900, !2901, !2904, !2905}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !122, line: 329, baseType: !241, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !242, file: !122, line: 329, baseType: !241, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !242, file: !122, line: 332, baseType: !247, size: 512, offset: 128)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 512, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !242, file: !122, line: 333, baseType: !251, size: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !253, line: 75, baseType: !254)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !253, line: 62, size: 1024, elements: !255)
!255 = !{!256, !258, !259, !260, !261, !263, !264, !265, !279, !280}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !253, line: 63, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !254, file: !253, line: 63, baseType: !257, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !253, line: 64, baseType: !177, size: 8, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !254, file: !253, line: 64, baseType: !177, size: 8, offset: 136)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !254, file: !253, line: 65, baseType: !262, size: 16, offset: 144)
!262 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !254, file: !253, line: 66, baseType: !247, size: 512, offset: 160)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !254, file: !253, line: 67, baseType: !210, size: 32, offset: 672)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !254, file: !253, line: 69, baseType: !266, size: 256, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !253, line: 60, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !253, line: 48, size: 256, elements: !268)
!268 = !{!269, !270, !277, !278}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !267, file: !253, line: 49, baseType: !175, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !267, file: !253, line: 58, baseType: !271, size: 128, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !272, line: 71, baseType: !273)
!272 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !272, line: 69, size: 128, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !273, file: !272, line: 70, baseType: !175, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !273, file: !272, line: 70, baseType: !175, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !267, file: !253, line: 59, baseType: !210, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !267, file: !253, line: 59, baseType: !210, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !254, file: !253, line: 70, baseType: !210, size: 32, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !254, file: !253, line: 74, baseType: !210, size: 32, offset: 992)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !122, line: 336, baseType: !226, size: 64, offset: 704)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !242, file: !122, line: 337, baseType: !175, size: 64, offset: 768)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !242, file: !122, line: 338, baseType: !175, size: 64, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !242, file: !122, line: 340, baseType: !285, size: 64, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !131, line: 55, size: 192, elements: !287)
!287 = !{!288, !292, !295}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !286, file: !131, line: 58, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !131, line: 56, size: 64, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !289, file: !131, line: 57, baseType: !175, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !131, line: 60, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !131, line: 41, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !286, file: !131, line: 61, baseType: !175, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !242, file: !122, line: 341, baseType: !297, size: 64, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !122, line: 106, size: 320, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !298, file: !122, line: 107, baseType: !271, size: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !298, file: !122, line: 108, baseType: !210, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !298, file: !122, line: 109, baseType: !210, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !122, line: 110, baseType: !210, size: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !298, file: !122, line: 110, baseType: !210, size: 32, offset: 224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !298, file: !122, line: 111, baseType: !306, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !228, line: 490, size: 768, elements: !308)
!308 = !{!309, !310, !311, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !228, line: 491, baseType: !306, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !228, line: 491, baseType: !306, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !307, file: !228, line: 493, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !122, line: 169, size: 2048, elements: !314)
!314 = !{!315, !316, !317, !318, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2865, !2868, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !122, line: 170, baseType: !312, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !122, line: 170, baseType: !312, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !313, file: !122, line: 172, baseType: !175, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !313, file: !122, line: 174, baseType: !319, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !321, line: 49, size: 1984, elements: !322)
!321 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!322 = !{!323, !359, !360, !361, !362, !363, !2790, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !320, file: !321, line: 50, baseType: !324, size: 960)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !253, line: 130, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !253, line: 117, size: 960, elements: !326)
!326 = !{!327, !328, !329, !331, !350, !354, !355, !356, !357, !358}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !253, line: 118, baseType: !175, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !325, file: !253, line: 118, baseType: !175, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !325, file: !253, line: 119, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !325, file: !253, line: 120, baseType: !332, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !253, line: 136, size: 17600, elements: !334)
!334 = !{!335, !336, !338, !341, !345, !346, !347}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !333, file: !253, line: 137, baseType: !324, size: 960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !333, file: !253, line: 138, baseType: !337, size: 64, offset: 960)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !333, file: !253, line: 139, baseType: !339, size: 64, offset: 1024)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !253, line: 43, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !253, line: 140, baseType: !342, size: 8192, offset: 1088)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 8192, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !333, file: !253, line: 141, baseType: !342, size: 8192, offset: 9280)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !333, file: !253, line: 148, baseType: !332, size: 64, offset: 17472)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !333, file: !253, line: 150, baseType: !348, size: 64, offset: 17536)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !253, line: 45, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !253, line: 121, baseType: !351, size: 528, offset: 256)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 528, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 66)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !253, line: 126, baseType: !262, size: 16, offset: 784)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !325, file: !253, line: 127, baseType: !210, size: 32, offset: 800)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !325, file: !253, line: 128, baseType: !210, size: 32, offset: 832)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !325, file: !253, line: 128, baseType: !210, size: 32, offset: 864)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !325, file: !253, line: 129, baseType: !251, size: 64, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !320, file: !321, line: 52, baseType: !271, size: 128, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !320, file: !321, line: 53, baseType: !271, size: 128, offset: 1088)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !320, file: !321, line: 54, baseType: !271, size: 128, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !320, file: !321, line: 55, baseType: !271, size: 128, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !320, file: !321, line: 57, baseType: !364, size: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !78, line: 1216, size: 39680, elements: !366)
!366 = !{!367, !368, !372, !1367, !1370, !1371, !1372, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1398, !1469, !1815, !2417, !2420, !2666, !2678, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2688, !2689, !2690, !2691, !2692, !2700, !2766, !2773, !2774, !2781, !2782, !2783, !2784, !2785, !2786, !2787}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !365, file: !78, line: 1217, baseType: !324, size: 960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !365, file: !78, line: 1218, baseType: !369, size: 64, offset: 960)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !371, line: 45, flags: DIFlagFwdDecl)
!371 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!372 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !365, file: !78, line: 1220, baseType: !373, size: 64, offset: 1024)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !375, line: 115, size: 11392, elements: !376)
!375 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!376 = !{!377, !378, !379, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !682, !692, !705, !706, !746, !747, !750, !751, !767, !768, !769, !770, !771, !772, !773, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !790, !791, !792, !793, !794, !795, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !855, !856, !857, !858, !859, !860, !861, !862, !863, !866, !869, !872, !873, !874, !875, !876, !879, !882, !1314, !1315, !1321, !1322, !1323, !1324, !1325, !1326, !1328, !1331, !1334, !1336, !1355, !1356}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !374, file: !375, line: 116, baseType: !324, size: 960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !374, file: !375, line: 117, baseType: !369, size: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !374, file: !375, line: 119, baseType: !380, size: 64, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !382, line: 155, size: 1856, elements: !383)
!382 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!383 = !{!384, !387, !399, !408, !414, !415, !416, !418, !438, !439, !443, !631, !632, !633, !635, !638, !641, !642, !643, !644, !645, !649, !650, !651, !653, !654, !657, !658, !661, !664, !665, !666, !667}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !381, file: !382, line: 157, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !117, line: 130, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !381, file: !382, line: 158, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !91, line: 65, size: 160, elements: !390)
!390 = !{!391, !395, !397, !398}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !389, file: !91, line: 66, baseType: !392, size: 96)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 96, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 3)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !389, file: !91, line: 67, baseType: !396, size: 48, offset: 96)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 48, elements: !393)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !389, file: !91, line: 68, baseType: !177, size: 8, offset: 144)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !389, file: !91, line: 68, baseType: !177, size: 8, offset: 152)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !381, file: !382, line: 159, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !91, line: 79, size: 96, elements: !402)
!402 = !{!403, !404, !405, !406, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !401, file: !91, line: 81, baseType: !210, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !401, file: !91, line: 82, baseType: !210, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !401, file: !91, line: 83, baseType: !262, size: 16, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !91, line: 84, baseType: !177, size: 8, offset: 80)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !401, file: !91, line: 84, baseType: !177, size: 8, offset: 88)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !381, file: !382, line: 160, baseType: !409, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !91, line: 88, size: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !410, file: !91, line: 89, baseType: !7, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !410, file: !91, line: 90, baseType: !7, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !381, file: !382, line: 161, baseType: !210, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !381, file: !382, line: 161, baseType: !210, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !381, file: !382, line: 162, baseType: !417, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !381, file: !382, line: 163, baseType: !419, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !421, line: 45, size: 1472, elements: !422)
!421 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !420, file: !421, line: 46, baseType: !419, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !420, file: !421, line: 46, baseType: !419, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !420, file: !421, line: 48, baseType: !179, size: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !420, file: !421, line: 51, baseType: !179, size: 32, offset: 160)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !420, file: !421, line: 53, baseType: !262, size: 16, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !420, file: !421, line: 54, baseType: !262, size: 16, offset: 208)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !420, file: !421, line: 56, baseType: !262, size: 16, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !420, file: !421, line: 57, baseType: !262, size: 16, offset: 240)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !420, file: !421, line: 59, baseType: !210, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !420, file: !421, line: 60, baseType: !210, size: 32, offset: 288)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !420, file: !421, line: 62, baseType: !175, size: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !420, file: !421, line: 63, baseType: !247, size: 512, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !420, file: !421, line: 64, baseType: !247, size: 512, offset: 896)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !420, file: !421, line: 67, baseType: !179, size: 32, offset: 1408)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !420, file: !421, line: 68, baseType: !179, size: 32, offset: 1440)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !381, file: !382, line: 164, baseType: !178, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !381, file: !382, line: 167, baseType: !440, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !45, line: 355, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !381, file: !382, line: 170, baseType: !444, size: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !98, line: 186, size: 8064, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !460, !461, !462, !463, !524, !528, !532, !533, !534, !535, !536, !537, !538, !539, !587, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !445, file: !98, line: 187, baseType: !210, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !445, file: !98, line: 187, baseType: !210, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !445, file: !98, line: 187, baseType: !210, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !445, file: !98, line: 187, baseType: !210, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !445, file: !98, line: 188, baseType: !210, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !445, file: !98, line: 188, baseType: !210, size: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !445, file: !98, line: 188, baseType: !210, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !445, file: !98, line: 193, baseType: !177, size: 8, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !445, file: !98, line: 197, baseType: !177, size: 8, offset: 232)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !445, file: !98, line: 201, baseType: !457, size: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !459, line: 71, flags: DIFlagFwdDecl)
!459 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!460 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !445, file: !98, line: 201, baseType: !457, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !445, file: !98, line: 201, baseType: !457, size: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !445, file: !98, line: 201, baseType: !457, size: 64, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !445, file: !98, line: 208, baseType: !464, size: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !98, line: 103, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !98, line: 90, size: 448, elements: !468)
!468 = !{!469, !478, !483, !484, !485}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !467, file: !98, line: 91, baseType: !470, size: 128)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !98, line: 82, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !98, line: 64, size: 128, elements: !472)
!472 = !{!473, !474, !475, !476, !477}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !471, file: !98, line: 65, baseType: !175, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !471, file: !98, line: 66, baseType: !210, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !471, file: !98, line: 73, baseType: !177, size: 8, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !471, file: !98, line: 74, baseType: !177, size: 8, offset: 104)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !471, file: !98, line: 80, baseType: !177, size: 8, offset: 112)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !467, file: !98, line: 92, baseType: !479, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !98, line: 180, size: 16, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !480, file: !98, line: 181, baseType: !262, size: 16)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !467, file: !98, line: 94, baseType: !392, size: 96, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !467, file: !98, line: 95, baseType: !392, size: 96, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !467, file: !98, line: 102, baseType: !486, size: 64, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !98, line: 110, size: 640, elements: !488)
!488 = !{!489, !490, !491, !493, !494, !517, !523}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !487, file: !98, line: 111, baseType: !470, size: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !487, file: !98, line: 112, baseType: !479, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !487, file: !98, line: 114, baseType: !492, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !487, file: !98, line: 114, baseType: !492, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !487, file: !98, line: 118, baseType: !495, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !98, line: 125, size: 576, elements: !497)
!497 = !{!498, !499, !500, !501, !513, !514, !515, !516}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !496, file: !98, line: 126, baseType: !470, size: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !496, file: !98, line: 129, baseType: !492, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !496, file: !98, line: 130, baseType: !486, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !496, file: !98, line: 131, baseType: !502, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !98, line: 164, size: 448, elements: !504)
!504 = !{!505, !506, !507, !510, !511, !512}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !503, file: !98, line: 165, baseType: !470, size: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !503, file: !98, line: 166, baseType: !479, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !503, file: !98, line: 172, baseType: !508, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !98, line: 140, baseType: !496)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !503, file: !98, line: 174, baseType: !210, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !503, file: !98, line: 175, baseType: !392, size: 96, offset: 288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !503, file: !98, line: 176, baseType: !262, size: 16, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !496, file: !98, line: 135, baseType: !495, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !496, file: !98, line: 135, baseType: !495, size: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !98, line: 139, baseType: !495, size: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !496, file: !98, line: 139, baseType: !495, size: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !487, file: !98, line: 122, baseType: !518, size: 128, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !98, line: 108, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !98, line: 106, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !98, line: 107, baseType: !486, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !519, file: !98, line: 107, baseType: !486, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !487, file: !98, line: 122, baseType: !518, size: 128, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !445, file: !98, line: 209, baseType: !525, size: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !98, line: 123, baseType: !487)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !445, file: !98, line: 210, baseType: !529, size: 64, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !98, line: 178, baseType: !503)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !445, file: !98, line: 213, baseType: !210, size: 32, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !445, file: !98, line: 214, baseType: !210, size: 32, offset: 736)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !445, file: !98, line: 215, baseType: !210, size: 32, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !445, file: !98, line: 218, baseType: !457, size: 64, offset: 832)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !445, file: !98, line: 218, baseType: !457, size: 64, offset: 896)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !445, file: !98, line: 218, baseType: !457, size: 64, offset: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !445, file: !98, line: 220, baseType: !210, size: 32, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !445, file: !98, line: 221, baseType: !540, size: 64, offset: 1088)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !542)
!542 = !{!543, !573, !574, !580, !583, !584, !586}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !541, file: !6, line: 191, baseType: !544, size: 5120)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 5120, elements: !571)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !546)
!546 = !{!547, !548, !550, !560, !561}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !545, file: !6, line: 148, baseType: !212, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !545, file: !6, line: 149, baseType: !549, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !545, file: !6, line: 150, baseType: !551, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !553)
!553 = !{!554, !556, !558}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !552, file: !6, line: 139, baseType: !555, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !552, file: !6, line: 140, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !552, file: !6, line: 141, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !545, file: !6, line: 152, baseType: !210, size: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !545, file: !6, line: 162, baseType: !562, size: 128, offset: 192)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !545, file: !6, line: 155, size: 128, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !570}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !562, file: !6, line: 156, baseType: !210, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !562, file: !6, line: 157, baseType: !179, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !562, file: !6, line: 158, baseType: !175, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !562, file: !6, line: 159, baseType: !392, size: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !562, file: !6, line: 160, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !562, file: !6, line: 161, baseType: !190, size: 64)
!571 = !{!572}
!572 = !DISubrange(count: 16)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !541, file: !6, line: 192, baseType: !544, size: 5120, offset: 5120)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !541, file: !6, line: 193, baseType: !575, size: 64, offset: 10240)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !578, !540}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !98, line: 246, baseType: !445)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !541, file: !6, line: 194, baseType: !581, size: 64, offset: 10304)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !6, line: 194, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !541, file: !6, line: 195, baseType: !210, size: 32, offset: 10368)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !541, file: !6, line: 196, baseType: !585, size: 32, offset: 10400)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !6, line: 197, baseType: !210, size: 32, offset: 10432)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !445, file: !98, line: 223, baseType: !588, size: 1600, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !459, line: 73, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !459, line: 64, size: 1600, elements: !590)
!590 = !{!591, !606, !610, !611, !612, !613, !614}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !589, file: !459, line: 65, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !459, line: 53, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !459, line: 42, size: 832, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !594, file: !459, line: 43, baseType: !210, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !594, file: !459, line: 44, baseType: !210, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !594, file: !459, line: 45, baseType: !210, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !594, file: !459, line: 46, baseType: !210, size: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !594, file: !459, line: 47, baseType: !210, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !594, file: !459, line: 48, baseType: !210, size: 32, offset: 160)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !594, file: !459, line: 49, baseType: !210, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !594, file: !459, line: 50, baseType: !210, size: 32, offset: 224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !594, file: !459, line: 51, baseType: !247, size: 512, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !594, file: !459, line: 52, baseType: !175, size: 64, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !589, file: !459, line: 66, baseType: !607, size: 1312, offset: 64)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 1312, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 41)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !589, file: !459, line: 69, baseType: !210, size: 32, offset: 1376)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !589, file: !459, line: 69, baseType: !210, size: 32, offset: 1408)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !589, file: !459, line: 70, baseType: !210, size: 32, offset: 1440)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !589, file: !459, line: 71, baseType: !457, size: 64, offset: 1472)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !589, file: !459, line: 72, baseType: !615, size: 64, offset: 1536)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !459, line: 59, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !459, line: 57, size: 8192, elements: !618)
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !617, file: !459, line: 58, baseType: !342, size: 8192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !445, file: !98, line: 223, baseType: !588, size: 1600, offset: 2752)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !445, file: !98, line: 223, baseType: !588, size: 1600, offset: 4352)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !445, file: !98, line: 223, baseType: !588, size: 1600, offset: 5952)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !445, file: !98, line: 233, baseType: !262, size: 16, offset: 7552)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !445, file: !98, line: 236, baseType: !210, size: 32, offset: 7584)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !445, file: !98, line: 238, baseType: !210, size: 32, offset: 7616)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !445, file: !98, line: 238, baseType: !210, size: 32, offset: 7648)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !445, file: !98, line: 239, baseType: !271, size: 128, offset: 7680)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !445, file: !98, line: 241, baseType: !530, size: 64, offset: 7808)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !445, file: !98, line: 243, baseType: !271, size: 128, offset: 7872)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !445, file: !98, line: 245, baseType: !175, size: 64, offset: 8000)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !381, file: !382, line: 171, baseType: !210, size: 32, offset: 640)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !381, file: !382, line: 172, baseType: !210, size: 32, offset: 672)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !381, file: !382, line: 173, baseType: !634, size: 8, offset: 704)
!634 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !381, file: !382, line: 175, baseType: !636, size: 64, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !85, line: 44, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !381, file: !382, line: 178, baseType: !639, size: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !85, line: 41, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !381, file: !382, line: 179, baseType: !634, size: 8, offset: 896)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !381, file: !382, line: 182, baseType: !634, size: 8, offset: 904)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !381, file: !382, line: 183, baseType: !417, size: 64, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !381, file: !382, line: 184, baseType: !417, size: 64, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !381, file: !382, line: 185, baseType: !646, size: 64, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 288, elements: !648)
!648 = !{!394, !394}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !381, file: !382, line: 188, baseType: !634, size: 8, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !381, file: !382, line: 191, baseType: !7, size: 32, offset: 1184)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !381, file: !382, line: 191, baseType: !652, size: 64, offset: 1216)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !381, file: !382, line: 191, baseType: !7, size: 32, offset: 1280)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !381, file: !382, line: 192, baseType: !655, size: 64, offset: 1344)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !382, line: 61, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !381, file: !382, line: 195, baseType: !417, size: 64, offset: 1408)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !381, file: !382, line: 197, baseType: !659, size: 64, offset: 1472)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !382, line: 197, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !381, file: !382, line: 198, baseType: !662, size: 64, offset: 1536)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !382, line: 59, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !381, file: !382, line: 201, baseType: !634, size: 8, offset: 1600)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !381, file: !382, line: 202, baseType: !392, size: 96, offset: 1632)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !381, file: !382, line: 204, baseType: !392, size: 96, offset: 1728)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !381, file: !382, line: 205, baseType: !210, size: 32, offset: 1824)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !374, file: !375, line: 121, baseType: !262, size: 16, offset: 1088)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !374, file: !375, line: 121, baseType: !262, size: 16, offset: 1104)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !374, file: !375, line: 122, baseType: !210, size: 32, offset: 1120)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !374, file: !375, line: 122, baseType: !210, size: 32, offset: 1152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !374, file: !375, line: 122, baseType: !210, size: 32, offset: 1184)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !374, file: !375, line: 123, baseType: !247, size: 512, offset: 1216)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !374, file: !375, line: 124, baseType: !373, size: 64, offset: 1728)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !374, file: !375, line: 124, baseType: !373, size: 64, offset: 1792)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !374, file: !375, line: 127, baseType: !373, size: 64, offset: 1856)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !374, file: !375, line: 127, baseType: !373, size: 64, offset: 1920)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !374, file: !375, line: 127, baseType: !373, size: 64, offset: 1984)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !374, file: !375, line: 128, baseType: !680, size: 64, offset: 2048)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !371, line: 46, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !374, file: !375, line: 130, baseType: !683, size: 64, offset: 2112)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !375, line: 97, size: 832, elements: !685)
!685 = !{!686, !690, !691}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !684, file: !375, line: 98, baseType: !687, size: 768)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 768, elements: !688)
!688 = !{!689, !394}
!689 = !DISubrange(count: 8)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !684, file: !375, line: 99, baseType: !210, size: 32, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !684, file: !375, line: 99, baseType: !210, size: 32, offset: 800)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !374, file: !375, line: 131, baseType: !693, size: 64, offset: 2176)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !193, line: 486, size: 1600, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !694, file: !193, line: 487, baseType: !324, size: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !694, file: !193, line: 489, baseType: !271, size: 128, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !694, file: !193, line: 490, baseType: !271, size: 128, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !694, file: !193, line: 491, baseType: !271, size: 128, offset: 1216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !694, file: !193, line: 492, baseType: !271, size: 128, offset: 1344)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !694, file: !193, line: 494, baseType: !210, size: 32, offset: 1472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !694, file: !193, line: 495, baseType: !210, size: 32, offset: 1504)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !694, file: !193, line: 497, baseType: !210, size: 32, offset: 1536)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !694, file: !193, line: 498, baseType: !210, size: 32, offset: 1568)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !374, file: !375, line: 132, baseType: !693, size: 64, offset: 2240)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !374, file: !375, line: 133, baseType: !707, size: 64, offset: 2304)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !193, line: 334, size: 1728, elements: !709)
!709 = !{!710, !711, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !745}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !708, file: !193, line: 335, baseType: !271, size: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !708, file: !193, line: 336, baseType: !712, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !708, file: !193, line: 338, baseType: !262, size: 16, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !708, file: !193, line: 338, baseType: !262, size: 16, offset: 208)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !708, file: !193, line: 339, baseType: !7, size: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !708, file: !193, line: 340, baseType: !210, size: 32, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !708, file: !193, line: 342, baseType: !179, size: 32, offset: 288)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !708, file: !193, line: 343, baseType: !392, size: 96, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !708, file: !193, line: 344, baseType: !392, size: 96, offset: 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !708, file: !193, line: 347, baseType: !271, size: 128, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !708, file: !193, line: 349, baseType: !210, size: 32, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !708, file: !193, line: 350, baseType: !210, size: 32, offset: 672)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !708, file: !193, line: 351, baseType: !175, size: 64, offset: 704)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !708, file: !193, line: 352, baseType: !175, size: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !708, file: !193, line: 354, baseType: !726, size: 384, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !193, line: 116, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !193, line: 94, size: 384, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !727, file: !193, line: 96, baseType: !210, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !727, file: !193, line: 96, baseType: !210, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !727, file: !193, line: 97, baseType: !210, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !727, file: !193, line: 97, baseType: !210, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !727, file: !193, line: 99, baseType: !262, size: 16, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !727, file: !193, line: 100, baseType: !262, size: 16, offset: 144)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !727, file: !193, line: 102, baseType: !262, size: 16, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !727, file: !193, line: 105, baseType: !262, size: 16, offset: 176)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !727, file: !193, line: 108, baseType: !262, size: 16, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !727, file: !193, line: 109, baseType: !262, size: 16, offset: 208)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !727, file: !193, line: 111, baseType: !262, size: 16, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !727, file: !193, line: 112, baseType: !262, size: 16, offset: 240)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !727, file: !193, line: 114, baseType: !210, size: 32, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !727, file: !193, line: 114, baseType: !210, size: 32, offset: 288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !727, file: !193, line: 115, baseType: !210, size: 32, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !727, file: !193, line: 115, baseType: !210, size: 32, offset: 352)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !708, file: !193, line: 355, baseType: !247, size: 512, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !374, file: !375, line: 134, baseType: !175, size: 64, offset: 2368)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !374, file: !375, line: 136, baseType: !748, size: 64, offset: 2432)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !375, line: 58, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !374, file: !375, line: 138, baseType: !726, size: 384, offset: 2496)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !374, file: !375, line: 139, baseType: !752, size: 64, offset: 2880)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !193, line: 80, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !193, line: 72, size: 192, elements: !755)
!755 = !{!756, !763, !764, !765, !766}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !754, file: !193, line: 73, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !193, line: 59, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !193, line: 56, size: 128, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !759, file: !193, line: 57, baseType: !392, size: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !759, file: !193, line: 58, baseType: !210, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !754, file: !193, line: 74, baseType: !210, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !754, file: !193, line: 76, baseType: !210, size: 32, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !754, file: !193, line: 77, baseType: !210, size: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !754, file: !193, line: 79, baseType: !210, size: 32, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !374, file: !375, line: 141, baseType: !271, size: 128, offset: 2944)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !374, file: !375, line: 142, baseType: !271, size: 128, offset: 3072)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !374, file: !375, line: 143, baseType: !271, size: 128, offset: 3200)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !374, file: !375, line: 144, baseType: !271, size: 128, offset: 3328)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !374, file: !375, line: 146, baseType: !210, size: 32, offset: 3456)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !374, file: !375, line: 147, baseType: !210, size: 32, offset: 3488)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !374, file: !375, line: 150, baseType: !774, size: 64, offset: 3520)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !375, line: 50, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !374, file: !375, line: 151, baseType: !176, size: 64, offset: 3584)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !374, file: !375, line: 152, baseType: !210, size: 32, offset: 3648)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !374, file: !375, line: 153, baseType: !210, size: 32, offset: 3680)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !374, file: !375, line: 156, baseType: !392, size: 96, offset: 3712)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !374, file: !375, line: 156, baseType: !392, size: 96, offset: 3808)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !374, file: !375, line: 156, baseType: !392, size: 96, offset: 3904)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !374, file: !375, line: 157, baseType: !392, size: 96, offset: 4000)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !374, file: !375, line: 158, baseType: !392, size: 96, offset: 4096)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !374, file: !375, line: 159, baseType: !392, size: 96, offset: 4192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !374, file: !375, line: 160, baseType: !392, size: 96, offset: 4288)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !374, file: !375, line: 160, baseType: !392, size: 96, offset: 4384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !374, file: !375, line: 161, baseType: !789, size: 128, offset: 4480)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 128, elements: !217)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !374, file: !375, line: 161, baseType: !789, size: 128, offset: 4608)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !374, file: !375, line: 162, baseType: !392, size: 96, offset: 4736)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !374, file: !375, line: 162, baseType: !392, size: 96, offset: 4832)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !374, file: !375, line: 163, baseType: !179, size: 32, offset: 4928)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !374, file: !375, line: 163, baseType: !179, size: 32, offset: 4960)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !374, file: !375, line: 164, baseType: !796, size: 512, offset: 4992)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 512, elements: !797)
!797 = !{!218, !218}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !374, file: !375, line: 165, baseType: !796, size: 512, offset: 5504)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !374, file: !375, line: 166, baseType: !796, size: 512, offset: 6016)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !374, file: !375, line: 167, baseType: !796, size: 512, offset: 6528)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !374, file: !375, line: 176, baseType: !796, size: 512, offset: 7040)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !374, file: !375, line: 178, baseType: !7, size: 32, offset: 7552)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !374, file: !375, line: 180, baseType: !262, size: 16, offset: 7584)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !374, file: !375, line: 181, baseType: !262, size: 16, offset: 7600)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !374, file: !375, line: 183, baseType: !262, size: 16, offset: 7616)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !374, file: !375, line: 183, baseType: !262, size: 16, offset: 7632)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !374, file: !375, line: 184, baseType: !262, size: 16, offset: 7648)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !374, file: !375, line: 184, baseType: !262, size: 16, offset: 7664)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !374, file: !375, line: 185, baseType: !262, size: 16, offset: 7680)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !374, file: !375, line: 186, baseType: !262, size: 16, offset: 7696)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !374, file: !375, line: 187, baseType: !262, size: 16, offset: 7712)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !374, file: !375, line: 188, baseType: !177, size: 8, offset: 7728)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !374, file: !375, line: 189, baseType: !177, size: 8, offset: 7736)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !374, file: !375, line: 192, baseType: !210, size: 32, offset: 7744)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !374, file: !375, line: 192, baseType: !210, size: 32, offset: 7776)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !374, file: !375, line: 192, baseType: !210, size: 32, offset: 7808)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !374, file: !375, line: 192, baseType: !210, size: 32, offset: 7840)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !374, file: !375, line: 194, baseType: !210, size: 32, offset: 7872)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !374, file: !375, line: 202, baseType: !179, size: 32, offset: 7904)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !374, file: !375, line: 202, baseType: !179, size: 32, offset: 7936)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !374, file: !375, line: 202, baseType: !179, size: 32, offset: 7968)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !374, file: !375, line: 211, baseType: !179, size: 32, offset: 8000)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !374, file: !375, line: 212, baseType: !179, size: 32, offset: 8032)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !374, file: !375, line: 213, baseType: !179, size: 32, offset: 8064)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !374, file: !375, line: 214, baseType: !179, size: 32, offset: 8096)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !374, file: !375, line: 215, baseType: !179, size: 32, offset: 8128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !374, file: !375, line: 216, baseType: !179, size: 32, offset: 8160)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !374, file: !375, line: 219, baseType: !179, size: 32, offset: 8192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !374, file: !375, line: 220, baseType: !179, size: 32, offset: 8224)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !374, file: !375, line: 221, baseType: !179, size: 32, offset: 8256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !374, file: !375, line: 224, baseType: !832, size: 16, offset: 8288)
!832 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !374, file: !375, line: 224, baseType: !832, size: 16, offset: 8304)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !374, file: !375, line: 226, baseType: !262, size: 16, offset: 8320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !374, file: !375, line: 228, baseType: !177, size: 8, offset: 8336)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !374, file: !375, line: 229, baseType: !177, size: 8, offset: 8344)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !374, file: !375, line: 231, baseType: !262, size: 16, offset: 8352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !374, file: !375, line: 232, baseType: !177, size: 8, offset: 8368)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !374, file: !375, line: 233, baseType: !177, size: 8, offset: 8376)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !374, file: !375, line: 234, baseType: !179, size: 32, offset: 8384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !374, file: !375, line: 235, baseType: !179, size: 32, offset: 8416)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !374, file: !375, line: 237, baseType: !271, size: 128, offset: 8448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !374, file: !375, line: 238, baseType: !271, size: 128, offset: 8576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !374, file: !375, line: 239, baseType: !271, size: 128, offset: 8704)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !374, file: !375, line: 240, baseType: !271, size: 128, offset: 8832)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !374, file: !375, line: 242, baseType: !179, size: 32, offset: 8960)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !374, file: !375, line: 244, baseType: !262, size: 16, offset: 8992)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !374, file: !375, line: 245, baseType: !832, size: 16, offset: 9008)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !374, file: !375, line: 246, baseType: !789, size: 128, offset: 9024)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !374, file: !375, line: 248, baseType: !210, size: 32, offset: 9152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !374, file: !375, line: 249, baseType: !210, size: 32, offset: 9184)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !374, file: !375, line: 251, baseType: !853, size: 64, offset: 9216)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !375, line: 251, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !374, file: !375, line: 253, baseType: !177, size: 8, offset: 9280)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !374, file: !375, line: 254, baseType: !177, size: 8, offset: 9288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !374, file: !375, line: 255, baseType: !262, size: 16, offset: 9296)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !374, file: !375, line: 256, baseType: !392, size: 96, offset: 9312)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !374, file: !375, line: 258, baseType: !271, size: 128, offset: 9408)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !374, file: !375, line: 259, baseType: !271, size: 128, offset: 9536)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !374, file: !375, line: 260, baseType: !271, size: 128, offset: 9664)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !374, file: !375, line: 261, baseType: !271, size: 128, offset: 9792)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !374, file: !375, line: 263, baseType: !864, size: 64, offset: 9920)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !375, line: 52, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !374, file: !375, line: 264, baseType: !867, size: 64, offset: 9984)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !375, line: 53, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !374, file: !375, line: 265, baseType: !870, size: 64, offset: 10048)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !193, line: 46, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !374, file: !375, line: 267, baseType: !177, size: 8, offset: 10112)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !374, file: !375, line: 268, baseType: !177, size: 8, offset: 10120)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !374, file: !375, line: 269, baseType: !262, size: 16, offset: 10128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !374, file: !375, line: 270, baseType: !179, size: 32, offset: 10144)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !374, file: !375, line: 272, baseType: !877, size: 64, offset: 10176)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !375, line: 54, flags: DIFlagFwdDecl)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !374, file: !375, line: 275, baseType: !880, size: 64, offset: 10240)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !375, line: 275, flags: DIFlagFwdDecl)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !374, file: !375, line: 277, baseType: !883, size: 64, offset: 10304)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !45, line: 178, size: 13504, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !903, !906, !908, !909, !911, !912, !913, !914, !920, !925, !926, !930, !931, !932, !933, !934, !938, !950, !964, !968, !972, !976, !980, !984, !988, !992, !996, !1000, !1004, !1005, !1006, !1007, !1008, !1009, !1013, !1014, !1015, !1016, !1020, !1021, !1022, !1023, !1024, !1029, !1030, !1031, !1032, !1033, !1037, !1038, !1039, !1040, !1041, !1047, !1058, !1063, !1080, !1090, !1095, !1106, !1113, !1120, !1124, !1128, !1132, !1136, !1137, !1138, !1142, !1146, !1147, !1148, !1152, !1153, !1162, !1271, !1275, !1283, !1287, !1291, !1295, !1303, !1313}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !884, file: !45, line: 180, baseType: !588, size: 1600)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !884, file: !45, line: 180, baseType: !588, size: 1600, offset: 1600)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !884, file: !45, line: 180, baseType: !588, size: 1600, offset: 3200)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !884, file: !45, line: 180, baseType: !588, size: 1600, offset: 4800)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !884, file: !45, line: 180, baseType: !588, size: 1600, offset: 6400)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !884, file: !45, line: 181, baseType: !210, size: 32, offset: 8000)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !884, file: !45, line: 181, baseType: !210, size: 32, offset: 8032)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !884, file: !45, line: 181, baseType: !210, size: 32, offset: 8064)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !884, file: !45, line: 181, baseType: !210, size: 32, offset: 8096)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !884, file: !45, line: 181, baseType: !210, size: 32, offset: 8128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !884, file: !45, line: 182, baseType: !210, size: 32, offset: 8160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !884, file: !45, line: 183, baseType: !210, size: 32, offset: 8192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !884, file: !45, line: 184, baseType: !899, size: 64, offset: 8256)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !900, line: 124, baseType: !901)
!900 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !900, line: 124, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !884, file: !45, line: 185, baseType: !904, size: 64, offset: 8320)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !45, line: 97, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !884, file: !45, line: 186, baseType: !907, size: 32, offset: 8384)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !45, line: 132, baseType: !44)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !884, file: !45, line: 187, baseType: !179, size: 32, offset: 8416)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !884, file: !45, line: 188, baseType: !910, size: 32, offset: 8448)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !45, line: 175, baseType: !50)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !884, file: !45, line: 189, baseType: !210, size: 32, offset: 8480)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !884, file: !45, line: 190, baseType: !774, size: 64, offset: 8512)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !884, file: !45, line: 193, baseType: !177, size: 8, offset: 8576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !884, file: !45, line: 196, baseType: !915, size: 64, offset: 8640)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !45, line: 177, baseType: !884)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !884, file: !45, line: 199, baseType: !921, size: 64, offset: 8704)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !918, !924}
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !884, file: !45, line: 202, baseType: !915, size: 64, offset: 8768)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !884, file: !45, line: 207, baseType: !927, size: 64, offset: 8832)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!210, !918}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !884, file: !45, line: 208, baseType: !927, size: 64, offset: 8896)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !884, file: !45, line: 209, baseType: !927, size: 64, offset: 8960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !884, file: !45, line: 210, baseType: !927, size: 64, offset: 9024)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !884, file: !45, line: 211, baseType: !927, size: 64, offset: 9088)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !884, file: !45, line: 218, baseType: !935, size: 64, offset: 9152)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !918, !210, !388}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !884, file: !45, line: 219, baseType: !939, size: 64, offset: 9216)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !918, !210, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !91, line: 48, size: 96, elements: !944)
!944 = !{!945, !946, !947, !948, !949}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !943, file: !91, line: 49, baseType: !7, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !943, file: !91, line: 49, baseType: !7, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !943, file: !91, line: 50, baseType: !177, size: 8, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !943, file: !91, line: 50, baseType: !177, size: 8, offset: 72)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !943, file: !91, line: 51, baseType: !262, size: 16, offset: 80)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !884, file: !45, line: 220, baseType: !951, size: 64, offset: 9280)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !918, !210, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !91, line: 42, size: 160, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !955, file: !91, line: 43, baseType: !7, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !955, file: !91, line: 43, baseType: !7, size: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !955, file: !91, line: 43, baseType: !7, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !955, file: !91, line: 43, baseType: !7, size: 32, offset: 96)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !955, file: !91, line: 44, baseType: !262, size: 16, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !955, file: !91, line: 45, baseType: !177, size: 8, offset: 144)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !955, file: !91, line: 45, baseType: !177, size: 8, offset: 152)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !884, file: !45, line: 227, baseType: !965, size: 64, offset: 9344)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!388, !918}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !884, file: !45, line: 228, baseType: !969, size: 64, offset: 9408)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!942, !918}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !884, file: !45, line: 229, baseType: !973, size: 64, offset: 9472)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!954, !918}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !884, file: !45, line: 230, baseType: !977, size: 64, offset: 9536)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!409, !918}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !884, file: !45, line: 231, baseType: !981, size: 64, offset: 9600)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!400, !918}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !884, file: !45, line: 236, baseType: !985, size: 64, offset: 9664)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !918, !388}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !884, file: !45, line: 237, baseType: !989, size: 64, offset: 9728)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !918, !942}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !884, file: !45, line: 238, baseType: !993, size: 64, offset: 9792)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !918, !954}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !884, file: !45, line: 239, baseType: !997, size: 64, offset: 9856)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !918, !409}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !884, file: !45, line: 240, baseType: !1001, size: 64, offset: 9920)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !918, !400}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !884, file: !45, line: 245, baseType: !965, size: 64, offset: 9984)
