; ModuleID = 'blender/source/blender/modifiers/intern/MOD_weightvgedit.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_weightvgedit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!70 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 1108, baseType: !7, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118}
!111 = !DIEnumerator(name: "MOD_WVG_MAPPING_NONE", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "MOD_WVG_MAPPING_CURVE", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "MOD_WVG_MAPPING_SHARP", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "MOD_WVG_MAPPING_SMOOTH", value: 3, isUnsigned: true)
!115 = !DIEnumerator(name: "MOD_WVG_MAPPING_ROOT", value: 4, isUnsigned: true)
!116 = !DIEnumerator(name: "MOD_WVG_MAPPING_SPHERE", value: 7, isUnsigned: true)
!117 = !DIEnumerator(name: "MOD_WVG_MAPPING_RANDOM", value: 8, isUnsigned: true)
!118 = !DIEnumerator(name: "MOD_WVG_MAPPING_STEP", value: 9, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 1122, baseType: !7, size: 32, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128}
!121 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_INT", value: 1, isUnsigned: true)
!122 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_RED", value: 2, isUnsigned: true)
!123 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_GREEN", value: 3, isUnsigned: true)
!124 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_BLUE", value: 4, isUnsigned: true)
!125 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_HUE", value: 5, isUnsigned: true)
!126 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_SAT", value: 6, isUnsigned: true)
!127 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_VAL", value: 7, isUnsigned: true)
!128 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_ALPHA", value: 8, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 393, baseType: !7, size: 32, elements: !130)
!130 = !{!131, !132, !133, !134}
!131 = !DIEnumerator(name: "MOD_DISP_MAP_LOCAL", value: 0, isUnsigned: true)
!132 = !DIEnumerator(name: "MOD_DISP_MAP_GLOBAL", value: 1, isUnsigned: true)
!133 = !DIEnumerator(name: "MOD_DISP_MAP_OBJECT", value: 2, isUnsigned: true)
!134 = !DIEnumerator(name: "MOD_DISP_MAP_UV", value: 3, isUnsigned: true)
!135 = !{!136, !240, !161, !1240, !1241}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "WeightVGEditModifierData", file: !61, line: 1002, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WeightVGEditModifierData", file: !61, line: 974, size: 2880, elements: !139)
!139 = !{!140, !162, !163, !165, !166, !168, !224, !225, !226, !227, !228, !229, !1236, !1237, !1238, !1239}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !138, file: !61, line: 975, baseType: !141, size: 896)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !143)
!143 = !{!144, !146, !147, !149, !150, !151, !152, !157, !160}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !61, line: 100, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !142, file: !61, line: 100, baseType: !145, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !61, line: 102, baseType: !148, size: 32, offset: 128)
!148 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !142, file: !61, line: 102, baseType: !148, size: 32, offset: 160)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !142, file: !61, line: 103, baseType: !148, size: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !142, file: !61, line: 103, baseType: !148, size: 32, offset: 224)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !61, line: 104, baseType: !153, size: 512, offset: 256)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 512, elements: !155)
!154 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!155 = !{!156}
!156 = !DISubrange(count: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !142, file: !61, line: 107, baseType: !158, size: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !61, line: 107, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !142, file: !61, line: 109, baseType: !161, size: 64, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name", scope: !138, file: !61, line: 977, baseType: !153, size: 512, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "edit_flags", scope: !138, file: !61, line: 979, baseType: !164, size: 16, offset: 1408)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !138, file: !61, line: 980, baseType: !164, size: 16, offset: 1424)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !138, file: !61, line: 981, baseType: !167, size: 32, offset: 1440)
!167 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cmap_curve", scope: !138, file: !61, line: 984, baseType: !169, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !171, line: 72, size: 3072, elements: !172)
!171 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!172 = !{!173, !174, !175, !176, !177, !186, !187, !217, !221, !222, !223}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !170, file: !171, line: 73, baseType: !148, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !170, file: !171, line: 73, baseType: !148, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !170, file: !171, line: 74, baseType: !148, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !170, file: !171, line: 75, baseType: !148, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !170, file: !171, line: 77, baseType: !178, size: 128, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !179, line: 95, baseType: !180)
!179 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !179, line: 92, size: 128, elements: !181)
!181 = !{!182, !183, !184, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !180, file: !179, line: 93, baseType: !167, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !180, file: !179, line: 93, baseType: !167, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !180, file: !179, line: 94, baseType: !167, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !180, file: !179, line: 94, baseType: !167, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !170, file: !171, line: 77, baseType: !178, size: 128, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !170, file: !171, line: 79, baseType: !188, size: 2304, offset: 384)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 2304, elements: !215)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !171, line: 67, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !171, line: 55, size: 576, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !201, !202, !211, !212, !213, !214}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !190, file: !171, line: 56, baseType: !164, size: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !171, line: 56, baseType: !164, size: 16, offset: 16)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !190, file: !171, line: 58, baseType: !167, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !190, file: !171, line: 59, baseType: !167, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !190, file: !171, line: 59, baseType: !167, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !190, file: !171, line: 60, baseType: !198, size: 64, offset: 128)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 2)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !190, file: !171, line: 60, baseType: !198, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !190, file: !171, line: 61, baseType: !203, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !171, line: 47, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !171, line: 44, size: 96, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !205, file: !171, line: 45, baseType: !167, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !205, file: !171, line: 45, baseType: !167, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !171, line: 46, baseType: !164, size: 16, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !205, file: !171, line: 46, baseType: !164, size: 16, offset: 80)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !190, file: !171, line: 62, baseType: !203, size: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !190, file: !171, line: 64, baseType: !203, size: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !190, file: !171, line: 65, baseType: !198, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !190, file: !171, line: 66, baseType: !198, size: 64, offset: 512)
!215 = !{!216}
!216 = !DISubrange(count: 4)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !170, file: !171, line: 80, baseType: !218, size: 96, offset: 2688)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 96, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 3)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !170, file: !171, line: 80, baseType: !218, size: 96, offset: 2784)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !170, file: !171, line: 81, baseType: !218, size: 96, offset: 2880)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !170, file: !171, line: 83, baseType: !218, size: 96, offset: 2976)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "add_threshold", scope: !138, file: !61, line: 987, baseType: !167, size: 32, offset: 1536)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "rem_threshold", scope: !138, file: !61, line: 987, baseType: !167, size: 32, offset: 1568)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mask_constant", scope: !138, file: !61, line: 990, baseType: !167, size: 32, offset: 1600)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mask_defgrp_name", scope: !138, file: !61, line: 991, baseType: !153, size: 512, offset: 1632)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_use_channel", scope: !138, file: !61, line: 994, baseType: !148, size: 32, offset: 2144)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mask_texture", scope: !138, file: !61, line: 995, baseType: !230, size: 64, offset: 2176)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !232, line: 202, size: 3328, elements: !233)
!232 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!233 = !{!234, !300, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !371, !374, !377, !459, !485, !1175, !1176, !1205, !1226, !1234, !1235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !231, file: !232, line: 203, baseType: !235, size: 960)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !236, line: 130, baseType: !237)
!236 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !236, line: 117, size: 960, elements: !238)
!238 = !{!239, !241, !242, !244, !263, !267, !268, !269, !270, !271}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !236, line: 118, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !237, file: !236, line: 118, baseType: !240, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !237, file: !236, line: 119, baseType: !243, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !237, file: !236, line: 120, baseType: !245, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !236, line: 136, size: 17600, elements: !247)
!247 = !{!248, !249, !251, !254, !258, !259, !260}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !246, file: !236, line: 137, baseType: !235, size: 960)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !246, file: !236, line: 138, baseType: !250, size: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !246, file: !236, line: 139, baseType: !252, size: 64, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !236, line: 43, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !236, line: 140, baseType: !255, size: 8192, offset: 1088)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 8192, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 1024)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !246, file: !236, line: 141, baseType: !255, size: 8192, offset: 9280)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !246, file: !236, line: 148, baseType: !245, size: 64, offset: 17472)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !246, file: !236, line: 150, baseType: !261, size: 64, offset: 17536)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !236, line: 45, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !237, file: !236, line: 121, baseType: !264, size: 528, offset: 256)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 528, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 66)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !237, file: !236, line: 126, baseType: !164, size: 16, offset: 784)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !237, file: !236, line: 127, baseType: !148, size: 32, offset: 800)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !237, file: !236, line: 128, baseType: !148, size: 32, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !237, file: !236, line: 128, baseType: !148, size: 32, offset: 864)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !237, file: !236, line: 129, baseType: !272, size: 64, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !236, line: 75, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !236, line: 62, size: 1024, elements: !275)
!275 = !{!276, !278, !279, !280, !281, !282, !283, !284, !298, !299}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !236, line: 63, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !274, file: !236, line: 63, baseType: !277, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !236, line: 64, baseType: !154, size: 8, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !274, file: !236, line: 64, baseType: !154, size: 8, offset: 136)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !274, file: !236, line: 65, baseType: !164, size: 16, offset: 144)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !236, line: 66, baseType: !153, size: 512, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !274, file: !236, line: 67, baseType: !148, size: 32, offset: 672)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !236, line: 69, baseType: !285, size: 256, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !236, line: 60, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !236, line: 48, size: 256, elements: !287)
!287 = !{!288, !289, !296, !297}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !286, file: !236, line: 49, baseType: !240, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !286, file: !236, line: 58, baseType: !290, size: 128, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !291, line: 71, baseType: !292)
!291 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !291, line: 69, size: 128, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !292, file: !291, line: 70, baseType: !240, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !292, file: !291, line: 70, baseType: !240, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !286, file: !236, line: 59, baseType: !148, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !286, file: !236, line: 59, baseType: !148, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !274, file: !236, line: 70, baseType: !148, size: 32, offset: 960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !274, file: !236, line: 74, baseType: !148, size: 32, offset: 992)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !231, file: !232, line: 204, baseType: !301, size: 64, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !303, line: 39, flags: DIFlagFwdDecl)
!303 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !231, file: !232, line: 206, baseType: !167, size: 32, offset: 1024)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !231, file: !232, line: 206, baseType: !167, size: 32, offset: 1056)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !231, file: !232, line: 207, baseType: !167, size: 32, offset: 1088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !231, file: !232, line: 207, baseType: !167, size: 32, offset: 1120)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !231, file: !232, line: 207, baseType: !167, size: 32, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !231, file: !232, line: 207, baseType: !167, size: 32, offset: 1184)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !231, file: !232, line: 207, baseType: !167, size: 32, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !231, file: !232, line: 207, baseType: !167, size: 32, offset: 1248)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !231, file: !232, line: 208, baseType: !167, size: 32, offset: 1280)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !231, file: !232, line: 208, baseType: !167, size: 32, offset: 1312)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !231, file: !232, line: 211, baseType: !167, size: 32, offset: 1344)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !231, file: !232, line: 211, baseType: !167, size: 32, offset: 1376)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !231, file: !232, line: 211, baseType: !167, size: 32, offset: 1408)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !231, file: !232, line: 211, baseType: !167, size: 32, offset: 1440)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !231, file: !232, line: 211, baseType: !167, size: 32, offset: 1472)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !231, file: !232, line: 214, baseType: !167, size: 32, offset: 1504)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !231, file: !232, line: 214, baseType: !167, size: 32, offset: 1536)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !231, file: !232, line: 217, baseType: !167, size: 32, offset: 1568)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !231, file: !232, line: 218, baseType: !167, size: 32, offset: 1600)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !231, file: !232, line: 219, baseType: !167, size: 32, offset: 1632)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !231, file: !232, line: 220, baseType: !167, size: 32, offset: 1664)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !231, file: !232, line: 221, baseType: !167, size: 32, offset: 1696)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !231, file: !232, line: 222, baseType: !164, size: 16, offset: 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !231, file: !232, line: 222, baseType: !164, size: 16, offset: 1744)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !231, file: !232, line: 224, baseType: !164, size: 16, offset: 1760)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !231, file: !232, line: 224, baseType: !164, size: 16, offset: 1776)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !231, file: !232, line: 227, baseType: !164, size: 16, offset: 1792)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !231, file: !232, line: 227, baseType: !164, size: 16, offset: 1808)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !231, file: !232, line: 229, baseType: !164, size: 16, offset: 1824)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !231, file: !232, line: 229, baseType: !164, size: 16, offset: 1840)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !232, line: 230, baseType: !164, size: 16, offset: 1856)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !231, file: !232, line: 230, baseType: !164, size: 16, offset: 1872)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !231, file: !232, line: 232, baseType: !167, size: 32, offset: 1888)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !231, file: !232, line: 232, baseType: !167, size: 32, offset: 1920)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !231, file: !232, line: 232, baseType: !167, size: 32, offset: 1952)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !231, file: !232, line: 232, baseType: !167, size: 32, offset: 1984)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !231, file: !232, line: 233, baseType: !148, size: 32, offset: 2016)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !231, file: !232, line: 234, baseType: !148, size: 32, offset: 2048)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !231, file: !232, line: 235, baseType: !164, size: 16, offset: 2080)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !231, file: !232, line: 235, baseType: !164, size: 16, offset: 2096)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !231, file: !232, line: 236, baseType: !164, size: 16, offset: 2112)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !231, file: !232, line: 239, baseType: !164, size: 16, offset: 2128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !231, file: !232, line: 240, baseType: !148, size: 32, offset: 2144)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !231, file: !232, line: 241, baseType: !148, size: 32, offset: 2176)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !231, file: !232, line: 241, baseType: !148, size: 32, offset: 2208)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !231, file: !232, line: 241, baseType: !148, size: 32, offset: 2240)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !231, file: !232, line: 243, baseType: !167, size: 32, offset: 2272)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !231, file: !232, line: 243, baseType: !167, size: 32, offset: 2304)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !231, file: !232, line: 244, baseType: !167, size: 32, offset: 2336)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !231, file: !232, line: 246, baseType: !354, size: 320, offset: 2368)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !355, line: 50, size: 320, elements: !356)
!355 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !354, file: !355, line: 51, baseType: !158, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !354, file: !355, line: 53, baseType: !148, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !354, file: !355, line: 54, baseType: !148, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !354, file: !355, line: 55, baseType: !148, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !354, file: !355, line: 55, baseType: !148, size: 32, offset: 160)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !354, file: !355, line: 56, baseType: !154, size: 8, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !354, file: !355, line: 56, baseType: !154, size: 8, offset: 200)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !354, file: !355, line: 57, baseType: !154, size: 8, offset: 208)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !354, file: !355, line: 57, baseType: !154, size: 8, offset: 216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !354, file: !355, line: 59, baseType: !164, size: 16, offset: 224)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !354, file: !355, line: 59, baseType: !164, size: 16, offset: 240)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !354, file: !355, line: 59, baseType: !164, size: 16, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !355, line: 61, baseType: !164, size: 16, offset: 272)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !354, file: !355, line: 63, baseType: !148, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !231, file: !232, line: 248, baseType: !372, size: 64, offset: 2688)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !232, line: 248, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !231, file: !232, line: 249, baseType: !375, size: 64, offset: 2752)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !303, line: 41, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !231, file: !232, line: 250, baseType: !378, size: 64, offset: 2816)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !355, line: 77, size: 15424, elements: !380)
!380 = !{!381, !382, !383, !386, !389, !392, !395, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !415, !416, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !441, !442, !443, !448, !449, !453}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !379, file: !355, line: 78, baseType: !235, size: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !379, file: !355, line: 80, baseType: !255, size: 8192, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !379, file: !355, line: 82, baseType: !384, size: 64, offset: 9152)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !355, line: 43, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !379, file: !355, line: 83, baseType: !387, size: 64, offset: 9216)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !236, line: 46, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !379, file: !355, line: 86, baseType: !390, size: 64, offset: 9280)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !355, line: 41, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !379, file: !355, line: 87, baseType: !393, size: 64, offset: 9344)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !355, line: 44, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !379, file: !355, line: 89, baseType: !396, size: 512, offset: 9408)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 512, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !379, file: !355, line: 90, baseType: !164, size: 16, offset: 9920)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !379, file: !355, line: 90, baseType: !164, size: 16, offset: 9936)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !379, file: !355, line: 92, baseType: !164, size: 16, offset: 9952)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !355, line: 92, baseType: !164, size: 16, offset: 9968)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !379, file: !355, line: 93, baseType: !164, size: 16, offset: 9984)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !379, file: !355, line: 93, baseType: !164, size: 16, offset: 10000)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !379, file: !355, line: 94, baseType: !148, size: 32, offset: 10016)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !379, file: !355, line: 97, baseType: !164, size: 16, offset: 10048)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !379, file: !355, line: 97, baseType: !164, size: 16, offset: 10064)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !379, file: !355, line: 98, baseType: !164, size: 16, offset: 10080)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !379, file: !355, line: 98, baseType: !164, size: 16, offset: 10096)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !379, file: !355, line: 99, baseType: !164, size: 16, offset: 10112)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !379, file: !355, line: 99, baseType: !164, size: 16, offset: 10128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !379, file: !355, line: 100, baseType: !7, size: 32, offset: 10144)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !379, file: !355, line: 101, baseType: !414, size: 64, offset: 10176)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !379, file: !355, line: 103, baseType: !261, size: 64, offset: 10240)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !379, file: !355, line: 104, baseType: !417, size: 64, offset: 10304)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !236, line: 159, size: 448, elements: !419)
!419 = !{!420, !422, !423, !425, !426, !428}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !418, file: !236, line: 161, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !199)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !418, file: !236, line: 162, baseType: !421, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !418, file: !236, line: 163, baseType: !424, size: 32, offset: 128)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 32, elements: !199)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !418, file: !236, line: 164, baseType: !424, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !418, file: !236, line: 165, baseType: !427, size: 128, offset: 192)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 128, elements: !199)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !418, file: !236, line: 166, baseType: !429, size: 128, offset: 320)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 128, elements: !199)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !379, file: !355, line: 107, baseType: !167, size: 32, offset: 10368)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !379, file: !355, line: 108, baseType: !148, size: 32, offset: 10400)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !379, file: !355, line: 109, baseType: !164, size: 16, offset: 10432)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !379, file: !355, line: 110, baseType: !164, size: 16, offset: 10448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !379, file: !355, line: 113, baseType: !148, size: 32, offset: 10464)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !379, file: !355, line: 113, baseType: !148, size: 32, offset: 10496)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !379, file: !355, line: 114, baseType: !154, size: 8, offset: 10528)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !379, file: !355, line: 114, baseType: !154, size: 8, offset: 10536)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !379, file: !355, line: 115, baseType: !164, size: 16, offset: 10544)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !379, file: !355, line: 116, baseType: !440, size: 128, offset: 10560)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 128, elements: !215)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !379, file: !355, line: 119, baseType: !167, size: 32, offset: 10688)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !379, file: !355, line: 119, baseType: !167, size: 32, offset: 10720)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !379, file: !355, line: 122, baseType: !444, size: 512, offset: 10752)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !171, line: 182, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !171, line: 180, size: 512, elements: !446)
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !171, line: 181, baseType: !153, size: 512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !379, file: !355, line: 123, baseType: !154, size: 8, offset: 11264)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !379, file: !355, line: 125, baseType: !450, size: 56, offset: 11272)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 56, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 7)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !379, file: !355, line: 126, baseType: !454, size: 4096, offset: 11328)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 4096, elements: !397)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !355, line: 69, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !355, line: 67, size: 512, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !355, line: 68, baseType: !153, size: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !231, file: !232, line: 251, baseType: !460, size: 64, offset: 2880)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !232, line: 113, size: 6208, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !472}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !461, file: !232, line: 114, baseType: !164, size: 16)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !461, file: !232, line: 114, baseType: !164, size: 16, offset: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !461, file: !232, line: 115, baseType: !154, size: 8, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !461, file: !232, line: 115, baseType: !154, size: 8, offset: 40)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !461, file: !232, line: 116, baseType: !154, size: 8, offset: 48)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !461, file: !232, line: 117, baseType: !469, size: 8, offset: 56)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 8, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 1)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !461, file: !232, line: 119, baseType: !473, size: 6144, offset: 64)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 6144, elements: !483)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !232, line: 109, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !232, line: 106, size: 192, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !475, file: !232, line: 107, baseType: !167, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !475, file: !232, line: 107, baseType: !167, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !475, file: !232, line: 107, baseType: !167, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !475, file: !232, line: 107, baseType: !167, size: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !475, file: !232, line: 107, baseType: !167, size: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !475, file: !232, line: 108, baseType: !148, size: 32, offset: 160)
!483 = !{!484}
!484 = !DISubrange(count: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !231, file: !232, line: 252, baseType: !486, size: 64, offset: 2944)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !232, line: 122, size: 1600, elements: !488)
!488 = !{!489, !1152, !1153, !1159, !1160, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !487, file: !232, line: 123, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !492, line: 115, size: 11392, elements: !493)
!492 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!493 = !{!494, !495, !496, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !520, !534, !535, !577, !578, !581, !582, !598, !599, !600, !601, !602, !603, !604, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !685, !686, !687, !688, !689, !690, !691, !692, !693, !696, !699, !702, !703, !704, !705, !706, !709, !712, !1116, !1117, !1123, !1124, !1125, !1126, !1127, !1128, !1130, !1133, !1136, !1137, !1140, !1141}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !491, file: !492, line: 116, baseType: !235, size: 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !491, file: !492, line: 117, baseType: !301, size: 64, offset: 960)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !491, file: !492, line: 119, baseType: !497, size: 64, offset: 1024)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !492, line: 57, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !491, file: !492, line: 121, baseType: !164, size: 16, offset: 1088)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !491, file: !492, line: 121, baseType: !164, size: 16, offset: 1104)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !491, file: !492, line: 122, baseType: !148, size: 32, offset: 1120)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !491, file: !492, line: 122, baseType: !148, size: 32, offset: 1152)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !491, file: !492, line: 122, baseType: !148, size: 32, offset: 1184)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !491, file: !492, line: 123, baseType: !153, size: 512, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !491, file: !492, line: 124, baseType: !490, size: 64, offset: 1728)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !491, file: !492, line: 124, baseType: !490, size: 64, offset: 1792)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !491, file: !492, line: 127, baseType: !490, size: 64, offset: 1856)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !491, file: !492, line: 127, baseType: !490, size: 64, offset: 1920)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !491, file: !492, line: 127, baseType: !490, size: 64, offset: 1984)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !491, file: !492, line: 128, baseType: !375, size: 64, offset: 2048)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !491, file: !492, line: 130, baseType: !512, size: 64, offset: 2112)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !492, line: 97, size: 832, elements: !514)
!514 = !{!515, !518, !519}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !513, file: !492, line: 98, baseType: !516, size: 768)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 768, elements: !517)
!517 = !{!398, !220}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !513, file: !492, line: 99, baseType: !148, size: 32, offset: 768)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !513, file: !492, line: 99, baseType: !148, size: 32, offset: 800)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !491, file: !492, line: 131, baseType: !521, size: 64, offset: 2176)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !523, line: 486, size: 1600, elements: !524)
!523 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !522, file: !523, line: 487, baseType: !235, size: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !522, file: !523, line: 489, baseType: !290, size: 128, offset: 960)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !522, file: !523, line: 490, baseType: !290, size: 128, offset: 1088)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !522, file: !523, line: 491, baseType: !290, size: 128, offset: 1216)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !522, file: !523, line: 492, baseType: !290, size: 128, offset: 1344)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !523, line: 494, baseType: !148, size: 32, offset: 1472)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !522, file: !523, line: 495, baseType: !148, size: 32, offset: 1504)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !522, file: !523, line: 497, baseType: !148, size: 32, offset: 1536)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !522, file: !523, line: 498, baseType: !148, size: 32, offset: 1568)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !491, file: !492, line: 132, baseType: !521, size: 64, offset: 2240)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !491, file: !492, line: 133, baseType: !536, size: 64, offset: 2304)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !523, line: 334, size: 1728, elements: !538)
!538 = !{!539, !540, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !576}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !537, file: !523, line: 335, baseType: !290, size: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !537, file: !523, line: 336, baseType: !541, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !543, line: 48, flags: DIFlagFwdDecl)
!543 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !537, file: !523, line: 338, baseType: !164, size: 16, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !537, file: !523, line: 338, baseType: !164, size: 16, offset: 208)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !537, file: !523, line: 339, baseType: !7, size: 32, offset: 224)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !537, file: !523, line: 340, baseType: !148, size: 32, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !537, file: !523, line: 342, baseType: !167, size: 32, offset: 288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !537, file: !523, line: 343, baseType: !218, size: 96, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !537, file: !523, line: 344, baseType: !218, size: 96, offset: 416)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !537, file: !523, line: 347, baseType: !290, size: 128, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !537, file: !523, line: 349, baseType: !148, size: 32, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !537, file: !523, line: 350, baseType: !148, size: 32, offset: 672)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !537, file: !523, line: 351, baseType: !240, size: 64, offset: 704)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !537, file: !523, line: 352, baseType: !240, size: 64, offset: 768)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !537, file: !523, line: 354, baseType: !557, size: 384, offset: 832)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !523, line: 116, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !523, line: 94, size: 384, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !558, file: !523, line: 96, baseType: !148, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !558, file: !523, line: 96, baseType: !148, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !558, file: !523, line: 97, baseType: !148, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !558, file: !523, line: 97, baseType: !148, size: 32, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !558, file: !523, line: 99, baseType: !164, size: 16, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !558, file: !523, line: 100, baseType: !164, size: 16, offset: 144)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !558, file: !523, line: 102, baseType: !164, size: 16, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !558, file: !523, line: 105, baseType: !164, size: 16, offset: 176)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !558, file: !523, line: 108, baseType: !164, size: 16, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !558, file: !523, line: 109, baseType: !164, size: 16, offset: 208)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !558, file: !523, line: 111, baseType: !164, size: 16, offset: 224)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !558, file: !523, line: 112, baseType: !164, size: 16, offset: 240)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !558, file: !523, line: 114, baseType: !148, size: 32, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !558, file: !523, line: 114, baseType: !148, size: 32, offset: 288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !558, file: !523, line: 115, baseType: !148, size: 32, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !558, file: !523, line: 115, baseType: !148, size: 32, offset: 352)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !537, file: !523, line: 355, baseType: !153, size: 512, offset: 1216)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !491, file: !492, line: 134, baseType: !240, size: 64, offset: 2368)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !491, file: !492, line: 136, baseType: !579, size: 64, offset: 2432)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !492, line: 58, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !491, file: !492, line: 138, baseType: !557, size: 384, offset: 2496)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !491, file: !492, line: 139, baseType: !583, size: 64, offset: 2880)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !523, line: 80, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !523, line: 72, size: 192, elements: !586)
!586 = !{!587, !594, !595, !596, !597}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !585, file: !523, line: 73, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !523, line: 59, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !523, line: 56, size: 128, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !590, file: !523, line: 57, baseType: !218, size: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !523, line: 58, baseType: !148, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !585, file: !523, line: 74, baseType: !148, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !585, file: !523, line: 76, baseType: !148, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !585, file: !523, line: 77, baseType: !148, size: 32, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !585, file: !523, line: 79, baseType: !148, size: 32, offset: 160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !491, file: !492, line: 141, baseType: !290, size: 128, offset: 2944)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !491, file: !492, line: 142, baseType: !290, size: 128, offset: 3072)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !491, file: !492, line: 143, baseType: !290, size: 128, offset: 3200)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !491, file: !492, line: 144, baseType: !290, size: 128, offset: 3328)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !491, file: !492, line: 146, baseType: !148, size: 32, offset: 3456)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !491, file: !492, line: 147, baseType: !148, size: 32, offset: 3488)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !491, file: !492, line: 150, baseType: !605, size: 64, offset: 3520)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !303, line: 53, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !491, file: !492, line: 151, baseType: !161, size: 64, offset: 3584)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !491, file: !492, line: 152, baseType: !148, size: 32, offset: 3648)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !491, file: !492, line: 153, baseType: !148, size: 32, offset: 3680)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !491, file: !492, line: 156, baseType: !218, size: 96, offset: 3712)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !491, file: !492, line: 156, baseType: !218, size: 96, offset: 3808)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !491, file: !492, line: 156, baseType: !218, size: 96, offset: 3904)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !491, file: !492, line: 157, baseType: !218, size: 96, offset: 4000)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !491, file: !492, line: 158, baseType: !218, size: 96, offset: 4096)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !491, file: !492, line: 159, baseType: !218, size: 96, offset: 4192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !491, file: !492, line: 160, baseType: !218, size: 96, offset: 4288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !491, file: !492, line: 160, baseType: !218, size: 96, offset: 4384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !491, file: !492, line: 161, baseType: !440, size: 128, offset: 4480)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !491, file: !492, line: 161, baseType: !440, size: 128, offset: 4608)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !491, file: !492, line: 162, baseType: !218, size: 96, offset: 4736)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !491, file: !492, line: 162, baseType: !218, size: 96, offset: 4832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !491, file: !492, line: 163, baseType: !167, size: 32, offset: 4928)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !491, file: !492, line: 163, baseType: !167, size: 32, offset: 4960)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !491, file: !492, line: 164, baseType: !626, size: 512, offset: 4992)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 512, elements: !627)
!627 = !{!216, !216}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !491, file: !492, line: 165, baseType: !626, size: 512, offset: 5504)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !491, file: !492, line: 166, baseType: !626, size: 512, offset: 6016)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !491, file: !492, line: 167, baseType: !626, size: 512, offset: 6528)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !491, file: !492, line: 176, baseType: !626, size: 512, offset: 7040)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !491, file: !492, line: 178, baseType: !7, size: 32, offset: 7552)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !491, file: !492, line: 180, baseType: !164, size: 16, offset: 7584)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !491, file: !492, line: 181, baseType: !164, size: 16, offset: 7600)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !491, file: !492, line: 183, baseType: !164, size: 16, offset: 7616)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !491, file: !492, line: 183, baseType: !164, size: 16, offset: 7632)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !491, file: !492, line: 184, baseType: !164, size: 16, offset: 7648)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !491, file: !492, line: 184, baseType: !164, size: 16, offset: 7664)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !491, file: !492, line: 185, baseType: !164, size: 16, offset: 7680)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !491, file: !492, line: 186, baseType: !164, size: 16, offset: 7696)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !491, file: !492, line: 187, baseType: !164, size: 16, offset: 7712)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !491, file: !492, line: 188, baseType: !154, size: 8, offset: 7728)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !491, file: !492, line: 189, baseType: !154, size: 8, offset: 7736)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !491, file: !492, line: 192, baseType: !148, size: 32, offset: 7744)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !491, file: !492, line: 192, baseType: !148, size: 32, offset: 7776)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !491, file: !492, line: 192, baseType: !148, size: 32, offset: 7808)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !491, file: !492, line: 192, baseType: !148, size: 32, offset: 7840)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !491, file: !492, line: 194, baseType: !148, size: 32, offset: 7872)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !491, file: !492, line: 202, baseType: !167, size: 32, offset: 7904)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !491, file: !492, line: 202, baseType: !167, size: 32, offset: 7936)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !491, file: !492, line: 202, baseType: !167, size: 32, offset: 7968)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !491, file: !492, line: 211, baseType: !167, size: 32, offset: 8000)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !491, file: !492, line: 212, baseType: !167, size: 32, offset: 8032)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !491, file: !492, line: 213, baseType: !167, size: 32, offset: 8064)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !491, file: !492, line: 214, baseType: !167, size: 32, offset: 8096)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !491, file: !492, line: 215, baseType: !167, size: 32, offset: 8128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !491, file: !492, line: 216, baseType: !167, size: 32, offset: 8160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !491, file: !492, line: 219, baseType: !167, size: 32, offset: 8192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !491, file: !492, line: 220, baseType: !167, size: 32, offset: 8224)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !491, file: !492, line: 221, baseType: !167, size: 32, offset: 8256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !491, file: !492, line: 224, baseType: !662, size: 16, offset: 8288)
!662 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !491, file: !492, line: 224, baseType: !662, size: 16, offset: 8304)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !491, file: !492, line: 226, baseType: !164, size: 16, offset: 8320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !491, file: !492, line: 228, baseType: !154, size: 8, offset: 8336)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !491, file: !492, line: 229, baseType: !154, size: 8, offset: 8344)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !491, file: !492, line: 231, baseType: !164, size: 16, offset: 8352)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !491, file: !492, line: 232, baseType: !154, size: 8, offset: 8368)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !491, file: !492, line: 233, baseType: !154, size: 8, offset: 8376)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !491, file: !492, line: 234, baseType: !167, size: 32, offset: 8384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !491, file: !492, line: 235, baseType: !167, size: 32, offset: 8416)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !491, file: !492, line: 237, baseType: !290, size: 128, offset: 8448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !491, file: !492, line: 238, baseType: !290, size: 128, offset: 8576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !491, file: !492, line: 239, baseType: !290, size: 128, offset: 8704)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !491, file: !492, line: 240, baseType: !290, size: 128, offset: 8832)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !491, file: !492, line: 242, baseType: !167, size: 32, offset: 8960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !491, file: !492, line: 244, baseType: !164, size: 16, offset: 8992)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !491, file: !492, line: 245, baseType: !662, size: 16, offset: 9008)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !491, file: !492, line: 246, baseType: !440, size: 128, offset: 9024)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !491, file: !492, line: 248, baseType: !148, size: 32, offset: 9152)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !491, file: !492, line: 249, baseType: !148, size: 32, offset: 9184)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !491, file: !492, line: 251, baseType: !683, size: 64, offset: 9216)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !492, line: 251, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !491, file: !492, line: 253, baseType: !154, size: 8, offset: 9280)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !491, file: !492, line: 254, baseType: !154, size: 8, offset: 9288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !491, file: !492, line: 255, baseType: !164, size: 16, offset: 9296)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !491, file: !492, line: 256, baseType: !218, size: 96, offset: 9312)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !491, file: !492, line: 258, baseType: !290, size: 128, offset: 9408)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !491, file: !492, line: 259, baseType: !290, size: 128, offset: 9536)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !491, file: !492, line: 260, baseType: !290, size: 128, offset: 9664)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !491, file: !492, line: 261, baseType: !290, size: 128, offset: 9792)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !491, file: !492, line: 263, baseType: !694, size: 64, offset: 9920)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !492, line: 52, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !491, file: !492, line: 264, baseType: !697, size: 64, offset: 9984)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !492, line: 53, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !491, file: !492, line: 265, baseType: !700, size: 64, offset: 10048)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !523, line: 46, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !491, file: !492, line: 267, baseType: !154, size: 8, offset: 10112)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !491, file: !492, line: 268, baseType: !154, size: 8, offset: 10120)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !491, file: !492, line: 269, baseType: !164, size: 16, offset: 10128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !491, file: !492, line: 270, baseType: !167, size: 32, offset: 10144)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !491, file: !492, line: 272, baseType: !707, size: 64, offset: 10176)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !61, line: 732, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !491, file: !492, line: 275, baseType: !710, size: 64, offset: 10240)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !492, line: 275, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !491, file: !492, line: 277, baseType: !713, size: 64, offset: 10304)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !715)
!715 = !{!716, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !767, !770, !772, !773, !775, !776, !777, !778, !784, !789, !790, !794, !795, !796, !797, !798, !811, !823, !837, !841, !845, !849, !858, !870, !874, !878, !882, !886, !890, !891, !892, !893, !894, !895, !899, !900, !901, !902, !906, !907, !908, !909, !910, !915, !916, !917, !918, !919, !923, !924, !925, !926, !927, !934, !945, !950, !956, !966, !971, !982, !989, !996, !1000, !1005, !1009, !1014, !1015, !1016, !1023, !1029, !1030, !1031, !1036, !1037, !1046, !1073, !1077, !1085, !1089, !1093, !1097, !1105, !1115}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !714, file: !28, line: 180, baseType: !717, size: 1600)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !66, line: 73, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !66, line: 64, size: 1600, elements: !719)
!719 = !{!720, !735, !739, !740, !741, !742, !745}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !718, file: !66, line: 65, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !66, line: 53, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !66, line: 42, size: 832, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !723, file: !66, line: 43, baseType: !148, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !723, file: !66, line: 44, baseType: !148, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !723, file: !66, line: 45, baseType: !148, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !723, file: !66, line: 46, baseType: !148, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !723, file: !66, line: 47, baseType: !148, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !723, file: !66, line: 48, baseType: !148, size: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !723, file: !66, line: 49, baseType: !148, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !723, file: !66, line: 50, baseType: !148, size: 32, offset: 224)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !723, file: !66, line: 51, baseType: !153, size: 512, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !723, file: !66, line: 52, baseType: !240, size: 64, offset: 768)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !718, file: !66, line: 66, baseType: !736, size: 1312, offset: 64)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 1312, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 41)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !718, file: !66, line: 69, baseType: !148, size: 32, offset: 1376)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !718, file: !66, line: 69, baseType: !148, size: 32, offset: 1408)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !718, file: !66, line: 70, baseType: !148, size: 32, offset: 1440)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !718, file: !66, line: 71, baseType: !743, size: 64, offset: 1472)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !66, line: 71, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !718, file: !66, line: 72, baseType: !746, size: 64, offset: 1536)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !66, line: 59, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !66, line: 57, size: 8192, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !748, file: !66, line: 58, baseType: !255, size: 8192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !714, file: !28, line: 180, baseType: !717, size: 1600, offset: 1600)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !714, file: !28, line: 180, baseType: !717, size: 1600, offset: 3200)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !714, file: !28, line: 180, baseType: !717, size: 1600, offset: 4800)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !714, file: !28, line: 180, baseType: !717, size: 1600, offset: 6400)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !714, file: !28, line: 181, baseType: !148, size: 32, offset: 8000)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !714, file: !28, line: 181, baseType: !148, size: 32, offset: 8032)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !714, file: !28, line: 181, baseType: !148, size: 32, offset: 8064)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !714, file: !28, line: 181, baseType: !148, size: 32, offset: 8096)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !714, file: !28, line: 181, baseType: !148, size: 32, offset: 8128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !714, file: !28, line: 182, baseType: !148, size: 32, offset: 8160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !714, file: !28, line: 183, baseType: !148, size: 32, offset: 8192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !714, file: !28, line: 184, baseType: !763, size: 64, offset: 8256)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !764, line: 124, baseType: !765)
!764 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !764, line: 124, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !714, file: !28, line: 185, baseType: !768, size: 64, offset: 8320)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !714, file: !28, line: 186, baseType: !771, size: 32, offset: 8384)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !714, file: !28, line: 187, baseType: !167, size: 32, offset: 8416)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !714, file: !28, line: 188, baseType: !774, size: 32, offset: 8448)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !714, file: !28, line: 189, baseType: !148, size: 32, offset: 8480)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !714, file: !28, line: 190, baseType: !605, size: 64, offset: 8512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !714, file: !28, line: 193, baseType: !154, size: 8, offset: 8576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !714, file: !28, line: 196, baseType: !779, size: 64, offset: 8640)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !782}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !714)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !714, file: !28, line: 199, baseType: !785, size: 64, offset: 8704)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !782, !788}
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !714, file: !28, line: 202, baseType: !779, size: 64, offset: 8768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !714, file: !28, line: 207, baseType: !791, size: 64, offset: 8832)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!148, !782}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !714, file: !28, line: 208, baseType: !791, size: 64, offset: 8896)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !714, file: !28, line: 209, baseType: !791, size: 64, offset: 8960)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !714, file: !28, line: 210, baseType: !791, size: 64, offset: 9024)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !714, file: !28, line: 211, baseType: !791, size: 64, offset: 9088)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !714, file: !28, line: 218, baseType: !799, size: 64, offset: 9152)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !782, !148, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !804, line: 65, size: 160, elements: !805)
!804 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!805 = !{!806, !807, !809, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !803, file: !804, line: 66, baseType: !218, size: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !803, file: !804, line: 67, baseType: !808, size: 48, offset: 96)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 48, elements: !219)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !803, file: !804, line: 68, baseType: !154, size: 8, offset: 144)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !803, file: !804, line: 68, baseType: !154, size: 8, offset: 152)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !714, file: !28, line: 219, baseType: !812, size: 64, offset: 9216)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !782, !148, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !804, line: 48, size: 96, elements: !817)
!817 = !{!818, !819, !820, !821, !822}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !816, file: !804, line: 49, baseType: !7, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !816, file: !804, line: 49, baseType: !7, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !816, file: !804, line: 50, baseType: !154, size: 8, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !816, file: !804, line: 50, baseType: !154, size: 8, offset: 72)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !816, file: !804, line: 51, baseType: !164, size: 16, offset: 80)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !714, file: !28, line: 220, baseType: !824, size: 64, offset: 9280)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !782, !148, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !804, line: 42, size: 160, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !828, file: !804, line: 43, baseType: !7, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !828, file: !804, line: 43, baseType: !7, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !828, file: !804, line: 43, baseType: !7, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !828, file: !804, line: 43, baseType: !7, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !828, file: !804, line: 44, baseType: !164, size: 16, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !828, file: !804, line: 45, baseType: !154, size: 8, offset: 144)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !828, file: !804, line: 45, baseType: !154, size: 8, offset: 152)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !714, file: !28, line: 227, baseType: !838, size: 64, offset: 9344)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!802, !782}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !714, file: !28, line: 228, baseType: !842, size: 64, offset: 9408)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!815, !782}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !714, file: !28, line: 229, baseType: !846, size: 64, offset: 9472)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!827, !782}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !714, file: !28, line: 230, baseType: !850, size: 64, offset: 9536)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!853, !782}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !804, line: 88, size: 64, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !854, file: !804, line: 89, baseType: !7, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !854, file: !804, line: 90, baseType: !7, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !714, file: !28, line: 231, baseType: !859, size: 64, offset: 9600)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!862, !782}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !804, line: 79, size: 96, elements: !864)
!864 = !{!865, !866, !867, !868, !869}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !863, file: !804, line: 81, baseType: !148, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !863, file: !804, line: 82, baseType: !148, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !863, file: !804, line: 83, baseType: !164, size: 16, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !863, file: !804, line: 84, baseType: !154, size: 8, offset: 80)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !863, file: !804, line: 84, baseType: !154, size: 8, offset: 88)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !714, file: !28, line: 236, baseType: !871, size: 64, offset: 9664)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !782, !802}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !714, file: !28, line: 237, baseType: !875, size: 64, offset: 9728)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !782, !815}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !714, file: !28, line: 238, baseType: !879, size: 64, offset: 9792)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !782, !827}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !714, file: !28, line: 239, baseType: !883, size: 64, offset: 9856)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !782, !853}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !714, file: !28, line: 240, baseType: !887, size: 64, offset: 9920)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !782, !862}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !714, file: !28, line: 245, baseType: !838, size: 64, offset: 9984)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !714, file: !28, line: 246, baseType: !842, size: 64, offset: 10048)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !714, file: !28, line: 247, baseType: !846, size: 64, offset: 10112)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !714, file: !28, line: 248, baseType: !850, size: 64, offset: 10176)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !714, file: !28, line: 249, baseType: !859, size: 64, offset: 10240)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !714, file: !28, line: 255, baseType: !896, size: 64, offset: 10304)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!240, !782, !148, !148}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !714, file: !28, line: 256, baseType: !896, size: 64, offset: 10368)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !714, file: !28, line: 257, baseType: !896, size: 64, offset: 10432)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !714, file: !28, line: 258, baseType: !896, size: 64, offset: 10496)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !714, file: !28, line: 264, baseType: !903, size: 64, offset: 10560)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!240, !782, !148}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !714, file: !28, line: 265, baseType: !903, size: 64, offset: 10624)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !714, file: !28, line: 266, baseType: !903, size: 64, offset: 10688)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !714, file: !28, line: 267, baseType: !903, size: 64, offset: 10752)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !714, file: !28, line: 268, baseType: !903, size: 64, offset: 10816)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !714, file: !28, line: 272, baseType: !911, size: 64, offset: 10880)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!914, !782}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !714, file: !28, line: 273, baseType: !911, size: 64, offset: 10944)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !714, file: !28, line: 274, baseType: !911, size: 64, offset: 11008)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !714, file: !28, line: 275, baseType: !911, size: 64, offset: 11072)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !714, file: !28, line: 276, baseType: !911, size: 64, offset: 11136)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !714, file: !28, line: 279, baseType: !920, size: 64, offset: 11200)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !782, !148, !914, !148}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !714, file: !28, line: 280, baseType: !920, size: 64, offset: 11264)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !714, file: !28, line: 281, baseType: !920, size: 64, offset: 11328)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !714, file: !28, line: 284, baseType: !791, size: 64, offset: 11392)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !714, file: !28, line: 285, baseType: !791, size: 64, offset: 11456)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !714, file: !28, line: 286, baseType: !928, size: 64, offset: 11520)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!931, !782}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !714, file: !28, line: 287, baseType: !935, size: 64, offset: 11584)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!938, !782}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !941)
!941 = !{!942, !944}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !940, file: !28, line: 118, baseType: !943, size: 128)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 128, elements: !215)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !940, file: !28, line: 119, baseType: !943, size: 128, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !714, file: !28, line: 288, baseType: !946, size: 64, offset: 11648)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!949, !782}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !714, file: !28, line: 289, baseType: !951, size: 64, offset: 11712)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !782, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !714, file: !28, line: 290, baseType: !957, size: 64, offset: 11776)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!960, !782}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !962, file: !28, line: 124, baseType: !164, size: 16)
