; ModuleID = 'blender/source/blender/blenkernel/intern/bmfont.c'
source_filename = "blender/source/blender/blenkernel/intern/bmfont.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.bmGlyph = type { i16, i16, i16, i8, i8, i8, i8, i8, i8 }
%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct.bmFont = type { [4 x i8], i16, i16, i16, i16, [1 x %struct.bmGlyph] }

@.str = private unnamed_addr constant [18 x i8] c"unicode: %d '%c'\0A\00", align 1
@.str.1 = private unnamed_addr constant [22 x i8] c" locx: %4d locy: %4d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !16, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/bmfont.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 123, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15}
!7 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!13 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!14 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!15 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!16 = !{!17, !19, !20, !22, !23}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!24 = !{i32 7, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 4}
!27 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!28 = distinct !DISubprogram(name: "printfGlyph", scope: !1, file: !1, line: 62, type: !29, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !48)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmGlyph", file: !33, line: 48, baseType: !34)
!33 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bmfont_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmGlyph", file: !33, line: 42, size: 96, elements: !35)
!35 = !{!36, !38, !40, !41, !43, !44, !45, !46, !47}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "unicode", scope: !34, file: !33, line: 43, baseType: !37, size: 16)
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !34, file: !33, line: 44, baseType: !39, size: 16, offset: 16)
!39 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !34, file: !33, line: 44, baseType: !39, size: 16, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ofsx", scope: !34, file: !33, line: 45, baseType: !42, size: 8, offset: 48)
!42 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ofsy", scope: !34, file: !33, line: 45, baseType: !42, size: 8, offset: 56)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !34, file: !33, line: 46, baseType: !21, size: 8, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !34, file: !33, line: 46, baseType: !21, size: 8, offset: 72)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "advance", scope: !34, file: !33, line: 47, baseType: !21, size: 8, offset: 80)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !34, file: !33, line: 47, baseType: !21, size: 8, offset: 88)
!48 = !{}
!49 = !DILocalVariable(name: "glyph", arg: 1, scope: !28, file: !1, line: 62, type: !31)
!50 = !DILocation(line: 62, column: 27, scope: !28)
!51 = !DILocation(line: 64, column: 31, scope: !28)
!52 = !DILocation(line: 64, column: 38, scope: !28)
!53 = !DILocation(line: 64, column: 47, scope: !28)
!54 = !DILocation(line: 64, column: 54, scope: !28)
!55 = !DILocation(line: 64, column: 2, scope: !28)
!56 = !DILocation(line: 65, column: 35, scope: !28)
!57 = !DILocation(line: 65, column: 42, scope: !28)
!58 = !DILocation(line: 65, column: 48, scope: !28)
!59 = !DILocation(line: 65, column: 55, scope: !28)
!60 = !DILocation(line: 65, column: 2, scope: !28)
!61 = !DILocation(line: 66, column: 37, scope: !28)
!62 = !DILocation(line: 66, column: 44, scope: !28)
!63 = !DILocation(line: 66, column: 51, scope: !28)
!64 = !DILocation(line: 66, column: 58, scope: !28)
!65 = !DILocation(line: 66, column: 2, scope: !28)
!66 = !DILocation(line: 67, column: 37, scope: !28)
!67 = !DILocation(line: 67, column: 44, scope: !28)
!68 = !DILocation(line: 67, column: 50, scope: !28)
!69 = !DILocation(line: 67, column: 57, scope: !28)
!70 = !DILocation(line: 67, column: 2, scope: !28)
!71 = !DILocation(line: 68, column: 37, scope: !28)
!72 = !DILocation(line: 68, column: 44, scope: !28)
!73 = !DILocation(line: 68, column: 53, scope: !28)
!74 = !DILocation(line: 68, column: 60, scope: !28)
!75 = !DILocation(line: 68, column: 2, scope: !28)
!76 = !DILocation(line: 69, column: 1, scope: !28)
!77 = distinct !DISubprogram(name: "calcAlpha", scope: !1, file: !1, line: 71, type: !78, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !48)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !82, line: 141, baseType: !83)
!82 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !82, line: 70, size: 19840, elements: !84)
!84 = !{!85, !87, !88, !89, !90, !91, !92, !93, !94, !96, !98, !103, !104, !105, !106, !107, !109, !111, !112, !113, !117, !118, !119, !120, !121, !124, !125, !126, !130, !131, !134, !135, !136, !137, !138, !141, !142, !143, !146, !147, !156}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !82, line: 71, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !83, file: !82, line: 71, baseType: !86, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !83, file: !82, line: 74, baseType: !22, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !83, file: !82, line: 74, baseType: !22, size: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !83, file: !82, line: 79, baseType: !21, size: 8, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !83, file: !82, line: 80, baseType: !22, size: 32, offset: 224)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !83, file: !82, line: 83, baseType: !22, size: 32, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !83, file: !82, line: 84, baseType: !22, size: 32, offset: 288)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !83, file: !82, line: 87, baseType: !95, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !83, file: !82, line: 88, baseType: !97, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !83, file: !82, line: 93, baseType: !99, size: 128, offset: 448)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 128, elements: !101)
!100 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!101 = !{!102}
!102 = !DISubrange(count: 2)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !83, file: !82, line: 96, baseType: !22, size: 32, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !83, file: !82, line: 96, baseType: !22, size: 32, offset: 608)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !83, file: !82, line: 97, baseType: !22, size: 32, offset: 640)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !83, file: !82, line: 97, baseType: !22, size: 32, offset: 672)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !83, file: !82, line: 98, baseType: !108, size: 64, offset: 704)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !83, file: !82, line: 101, baseType: !110, size: 64, offset: 768)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !83, file: !82, line: 102, baseType: !97, size: 64, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !83, file: !82, line: 105, baseType: !23, size: 32, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !83, file: !82, line: 108, baseType: !114, size: 1280, offset: 960)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 1280, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !83, file: !82, line: 109, baseType: !22, size: 32, offset: 2240)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !83, file: !82, line: 109, baseType: !22, size: 32, offset: 2272)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !83, file: !82, line: 112, baseType: !22, size: 32, offset: 2304)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !83, file: !82, line: 113, baseType: !22, size: 32, offset: 2336)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !83, file: !82, line: 114, baseType: !122, size: 64, offset: 2368)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !82, line: 50, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !83, file: !82, line: 115, baseType: !19, size: 64, offset: 2432)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !83, file: !82, line: 118, baseType: !22, size: 32, offset: 2496)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !83, file: !82, line: 119, baseType: !127, size: 8192, offset: 2528)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8192, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !83, file: !82, line: 120, baseType: !127, size: 8192, offset: 10720)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !83, file: !82, line: 123, baseType: !132, size: 64, offset: 18944)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !82, line: 123, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !83, file: !82, line: 124, baseType: !22, size: 32, offset: 19008)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !83, file: !82, line: 127, baseType: !20, size: 64, offset: 19072)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !83, file: !82, line: 128, baseType: !5, size: 32, offset: 19136)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !83, file: !82, line: 129, baseType: !5, size: 32, offset: 19168)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !83, file: !82, line: 132, baseType: !139, size: 64, offset: 19200)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !82, line: 132, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !83, file: !82, line: 133, baseType: !139, size: 64, offset: 19264)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !83, file: !82, line: 134, baseType: !95, size: 64, offset: 19328)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !83, file: !82, line: 135, baseType: !144, size: 64, offset: 19392)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !82, line: 135, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !83, file: !82, line: 136, baseType: !22, size: 32, offset: 19456)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !83, file: !82, line: 137, baseType: !148, size: 128, offset: 19488)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !149, line: 89, baseType: !150)
!149 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !149, line: 86, size: 128, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !150, file: !149, line: 87, baseType: !22, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !150, file: !149, line: 87, baseType: !22, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !150, file: !149, line: 88, baseType: !22, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !150, file: !149, line: 88, baseType: !22, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !83, file: !82, line: 140, baseType: !157, size: 192, offset: 19648)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !82, line: 55, size: 192, elements: !158)
!158 = !{!159, !160, !161, !162}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !157, file: !82, line: 56, baseType: !5, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !157, file: !82, line: 57, baseType: !5, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !157, file: !82, line: 58, baseType: !20, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !157, file: !82, line: 59, baseType: !5, size: 32, offset: 128)
!163 = !DILocalVariable(name: "ibuf", arg: 1, scope: !77, file: !1, line: 71, type: !80)
!164 = !DILocation(line: 71, column: 23, scope: !77)
!165 = !DILocalVariable(name: "i", scope: !77, file: !1, line: 73, type: !22)
!166 = !DILocation(line: 73, column: 6, scope: !77)
!167 = !DILocalVariable(name: "rect", scope: !77, file: !1, line: 74, type: !17)
!168 = !DILocation(line: 74, column: 8, scope: !77)
!169 = !DILocation(line: 76, column: 6, scope: !170)
!170 = distinct !DILexicalBlock(scope: !77, file: !1, line: 76, column: 6)
!171 = !DILocation(line: 76, column: 6, scope: !77)
!172 = !DILocation(line: 77, column: 19, scope: !173)
!173 = distinct !DILexicalBlock(scope: !170, file: !1, line: 76, column: 12)
!174 = !DILocation(line: 77, column: 25, scope: !173)
!175 = !DILocation(line: 77, column: 10, scope: !173)
!176 = !DILocation(line: 77, column: 8, scope: !173)
!177 = !DILocation(line: 78, column: 12, scope: !178)
!178 = distinct !DILexicalBlock(scope: !173, file: !1, line: 78, column: 3)
!179 = !DILocation(line: 78, column: 18, scope: !178)
!180 = !DILocation(line: 78, column: 22, scope: !178)
!181 = !DILocation(line: 78, column: 28, scope: !178)
!182 = !DILocation(line: 78, column: 20, scope: !178)
!183 = !DILocation(line: 78, column: 10, scope: !178)
!184 = !DILocation(line: 78, column: 8, scope: !178)
!185 = !DILocation(line: 78, column: 31, scope: !186)
!186 = distinct !DILexicalBlock(scope: !178, file: !1, line: 78, column: 3)
!187 = !DILocation(line: 78, column: 33, scope: !186)
!188 = !DILocation(line: 78, column: 3, scope: !178)
!189 = !DILocation(line: 79, column: 14, scope: !190)
!190 = distinct !DILexicalBlock(scope: !186, file: !1, line: 78, column: 43)
!191 = !DILocation(line: 79, column: 4, scope: !190)
!192 = !DILocation(line: 79, column: 12, scope: !190)
!193 = !DILocation(line: 80, column: 9, scope: !190)
!194 = !DILocation(line: 81, column: 3, scope: !190)
!195 = !DILocation(line: 78, column: 39, scope: !186)
!196 = !DILocation(line: 78, column: 3, scope: !186)
!197 = distinct !{!197, !188, !198}
!198 = !DILocation(line: 81, column: 3, scope: !178)
!199 = !DILocation(line: 82, column: 2, scope: !173)
!200 = !DILocation(line: 83, column: 1, scope: !77)
!201 = distinct !DISubprogram(name: "readBitmapFontVersion0", scope: !1, file: !1, line: 85, type: !202, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !48)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !80, !20, !22}
!204 = !DILocalVariable(name: "ibuf", arg: 1, scope: !201, file: !1, line: 85, type: !80)
!205 = !DILocation(line: 85, column: 36, scope: !201)
!206 = !DILocalVariable(name: "rect", arg: 2, scope: !201, file: !1, line: 85, type: !20)
!207 = !DILocation(line: 85, column: 57, scope: !201)
!208 = !DILocalVariable(name: "step", arg: 3, scope: !201, file: !1, line: 85, type: !22)
!209 = !DILocation(line: 85, column: 67, scope: !201)
!210 = !DILocalVariable(name: "glyphcount", scope: !201, file: !1, line: 87, type: !22)
!211 = !DILocation(line: 87, column: 6, scope: !201)
!212 = !DILocalVariable(name: "bytes", scope: !201, file: !1, line: 87, type: !22)
!213 = !DILocation(line: 87, column: 18, scope: !201)
!214 = !DILocalVariable(name: "i", scope: !201, file: !1, line: 87, type: !22)
!215 = !DILocation(line: 87, column: 25, scope: !201)
!216 = !DILocalVariable(name: "index", scope: !201, file: !1, line: 87, type: !22)
!217 = !DILocation(line: 87, column: 28, scope: !201)
!218 = !DILocalVariable(name: "linelength", scope: !201, file: !1, line: 87, type: !22)
!219 = !DILocation(line: 87, column: 35, scope: !201)
!220 = !DILocalVariable(name: "ysize", scope: !201, file: !1, line: 87, type: !22)
!221 = !DILocation(line: 87, column: 47, scope: !201)
!222 = !DILocalVariable(name: "buffer", scope: !201, file: !1, line: 88, type: !20)
!223 = !DILocation(line: 88, column: 17, scope: !201)
!224 = !DILocalVariable(name: "bmfont", scope: !201, file: !1, line: 89, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmFont", file: !33, line: 56, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmFont", file: !33, line: 50, size: 192, elements: !228)
!228 = !{!229, !233, !234, !235, !236, !237}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !227, file: !33, line: 51, baseType: !230, size: 32)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 4)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !227, file: !33, line: 52, baseType: !39, size: 16, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "glyphcount", scope: !227, file: !33, line: 53, baseType: !39, size: 16, offset: 48)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !227, file: !33, line: 54, baseType: !39, size: 16, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !227, file: !33, line: 54, baseType: !39, size: 16, offset: 80)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs", scope: !227, file: !33, line: 55, baseType: !238, size: 96, offset: 96)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 1)
!241 = !DILocation(line: 89, column: 11, scope: !201)
!242 = !DILocation(line: 91, column: 15, scope: !201)
!243 = !DILocation(line: 91, column: 21, scope: !201)
!244 = !DILocation(line: 91, column: 25, scope: !201)
!245 = !DILocation(line: 91, column: 23, scope: !201)
!246 = !DILocation(line: 91, column: 13, scope: !201)
!247 = !DILocation(line: 93, column: 16, scope: !201)
!248 = !DILocation(line: 93, column: 25, scope: !201)
!249 = !DILocation(line: 93, column: 23, scope: !201)
!250 = !DILocation(line: 93, column: 31, scope: !201)
!251 = !DILocation(line: 93, column: 39, scope: !201)
!252 = !DILocation(line: 93, column: 48, scope: !201)
!253 = !DILocation(line: 93, column: 46, scope: !201)
!254 = !DILocation(line: 93, column: 37, scope: !201)
!255 = !DILocation(line: 93, column: 13, scope: !201)
!256 = !DILocation(line: 94, column: 12, scope: !201)
!257 = !DILocation(line: 94, column: 23, scope: !201)
!258 = !DILocation(line: 94, column: 11, scope: !201)
!259 = !DILocation(line: 94, column: 28, scope: !201)
!260 = !DILocation(line: 94, column: 47, scope: !201)
!261 = !DILocation(line: 94, column: 10, scope: !201)
!262 = !DILocation(line: 94, column: 8, scope: !201)
!263 = !DILocation(line: 96, column: 11, scope: !201)
!264 = !DILocation(line: 96, column: 20, scope: !201)
!265 = !DILocation(line: 96, column: 26, scope: !201)
!266 = !DILocation(line: 96, column: 28, scope: !201)
!267 = !DILocation(line: 96, column: 17, scope: !201)
!268 = !DILocation(line: 96, column: 36, scope: !201)
!269 = !DILocation(line: 96, column: 42, scope: !201)
!270 = !DILocation(line: 96, column: 34, scope: !201)
!271 = !DILocation(line: 96, column: 8, scope: !201)
!272 = !DILocation(line: 98, column: 6, scope: !273)
!273 = distinct !DILexicalBlock(scope: !201, file: !1, line: 98, column: 6)
!274 = !DILocation(line: 98, column: 14, scope: !273)
!275 = !DILocation(line: 98, column: 20, scope: !273)
!276 = !DILocation(line: 98, column: 12, scope: !273)
!277 = !DILocation(line: 98, column: 6, scope: !201)
!278 = !DILocation(line: 103, column: 12, scope: !279)
!279 = distinct !DILexicalBlock(scope: !273, file: !1, line: 98, column: 23)
!280 = !DILocation(line: 103, column: 24, scope: !279)
!281 = !DILocation(line: 103, column: 10, scope: !279)
!282 = !DILocation(line: 105, column: 9, scope: !279)
!283 = !DILocation(line: 106, column: 10, scope: !284)
!284 = distinct !DILexicalBlock(scope: !279, file: !1, line: 106, column: 3)
!285 = !DILocation(line: 106, column: 8, scope: !284)
!286 = !DILocation(line: 106, column: 15, scope: !287)
!287 = distinct !DILexicalBlock(scope: !284, file: !1, line: 106, column: 3)
!288 = !DILocation(line: 106, column: 19, scope: !287)
!289 = !DILocation(line: 106, column: 17, scope: !287)
!290 = !DILocation(line: 106, column: 3, scope: !284)
!291 = !DILocation(line: 107, column: 16, scope: !292)
!292 = distinct !DILexicalBlock(scope: !287, file: !1, line: 106, column: 31)
!293 = !DILocation(line: 107, column: 21, scope: !292)
!294 = !DILocation(line: 107, column: 4, scope: !292)
!295 = !DILocation(line: 107, column: 11, scope: !292)
!296 = !DILocation(line: 107, column: 14, scope: !292)
!297 = !DILocation(line: 108, column: 13, scope: !292)
!298 = !DILocation(line: 108, column: 10, scope: !292)
!299 = !DILocation(line: 109, column: 8, scope: !300)
!300 = distinct !DILexicalBlock(scope: !292, file: !1, line: 109, column: 8)
!301 = !DILocation(line: 109, column: 17, scope: !300)
!302 = !DILocation(line: 109, column: 14, scope: !300)
!303 = !DILocation(line: 109, column: 8, scope: !292)
!304 = !DILocation(line: 111, column: 13, scope: !305)
!305 = distinct !DILexicalBlock(scope: !300, file: !1, line: 109, column: 29)
!306 = !DILocation(line: 111, column: 10, scope: !305)
