; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_sound_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_sound_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !62, globals: !157, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_sound_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47, !56}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 118, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sound_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61}
!59 = !DIEnumerator(name: "SOUND_FLAGS_3D", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "SOUND_FLAGS_CACHING", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "SOUND_FLAGS_MONO", value: 32, isUnsigned: true)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "bSound", file: !57, line: 100, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !57, line: 46, size: 9856, elements: !66)
!66 = !{!67, !138, !139, !140, !141, !142, !145, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !65, file: !57, line: 47, baseType: !68, size: 960)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !69, line: 130, baseType: !70)
!69 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !69, line: 117, size: 960, elements: !71)
!71 = !{!72, !74, !75, !77, !97, !101, !103, !104, !105, !106}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !69, line: 118, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !70, file: !69, line: 118, baseType: !73, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !70, file: !69, line: 119, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !70, file: !69, line: 120, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !69, line: 136, size: 17600, elements: !80)
!80 = !{!81, !82, !84, !87, !92, !93, !94}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !79, file: !69, line: 137, baseType: !68, size: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !79, file: !69, line: 138, baseType: !83, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !79, file: !69, line: 139, baseType: !85, size: 64, offset: 1024)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !69, line: 43, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !69, line: 140, baseType: !88, size: 8192, offset: 1088)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, elements: !90)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !{!91}
!91 = !DISubrange(count: 1024)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !79, file: !69, line: 141, baseType: !88, size: 8192, offset: 9280)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !79, file: !69, line: 148, baseType: !78, size: 64, offset: 17472)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !79, file: !69, line: 150, baseType: !95, size: 64, offset: 17536)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !69, line: 45, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !69, line: 121, baseType: !98, size: 528, offset: 256)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 528, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 66)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !70, file: !69, line: 126, baseType: !102, size: 16, offset: 784)
!102 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !70, file: !69, line: 127, baseType: !48, size: 32, offset: 800)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !70, file: !69, line: 128, baseType: !48, size: 32, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !70, file: !69, line: 128, baseType: !48, size: 32, offset: 864)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !70, file: !69, line: 129, baseType: !107, size: 64, offset: 896)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !69, line: 75, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !69, line: 62, size: 1024, elements: !110)
!110 = !{!111, !113, !114, !115, !116, !117, !121, !122, !136, !137}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !69, line: 63, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !69, line: 63, baseType: !112, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !69, line: 64, baseType: !89, size: 8, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !109, file: !69, line: 64, baseType: !89, size: 8, offset: 136)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !109, file: !69, line: 65, baseType: !102, size: 16, offset: 144)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !69, line: 66, baseType: !118, size: 512, offset: 160)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 512, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !109, file: !69, line: 67, baseType: !48, size: 32, offset: 672)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !69, line: 69, baseType: !123, size: 256, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !69, line: 60, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !69, line: 48, size: 256, elements: !125)
!125 = !{!126, !127, !134, !135}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !124, file: !69, line: 49, baseType: !73, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !124, file: !69, line: 58, baseType: !128, size: 128, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !129, line: 71, baseType: !130)
!129 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !129, line: 69, size: 128, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !130, file: !129, line: 70, baseType: !73, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !130, file: !129, line: 70, baseType: !73, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !124, file: !69, line: 59, baseType: !48, size: 32, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !124, file: !69, line: 59, baseType: !48, size: 32, offset: 224)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !109, file: !69, line: 70, baseType: !48, size: 32, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !109, file: !69, line: 74, baseType: !48, size: 32, offset: 992)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !57, line: 52, baseType: !88, size: 8192, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !65, file: !57, line: 57, baseType: !95, size: 64, offset: 9152)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !65, file: !57, line: 62, baseType: !73, size: 64, offset: 9216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "newpackedfile", scope: !65, file: !57, line: 67, baseType: !95, size: 64, offset: 9280)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !65, file: !57, line: 68, baseType: !143, size: 64, offset: 9344)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !57, line: 42, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !65, file: !57, line: 69, baseType: !146, size: 32, offset: 9408)
!146 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "attenuation", scope: !65, file: !57, line: 70, baseType: !146, size: 32, offset: 9440)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !65, file: !57, line: 71, baseType: !146, size: 32, offset: 9472)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "min_gain", scope: !65, file: !57, line: 72, baseType: !146, size: 32, offset: 9504)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "max_gain", scope: !65, file: !57, line: 73, baseType: !146, size: 32, offset: 9536)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !65, file: !57, line: 74, baseType: !146, size: 32, offset: 9568)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !57, line: 75, baseType: !48, size: 32, offset: 9600)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !65, file: !57, line: 76, baseType: !48, size: 32, offset: 9632)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !65, file: !57, line: 85, baseType: !73, size: 64, offset: 9664)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "waveform", scope: !65, file: !57, line: 90, baseType: !73, size: 64, offset: 9728)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "playback_handle", scope: !65, file: !57, line: 96, baseType: !73, size: 64, offset: 9792)
!157 = !{!158, !0, !1148, !1192, !1194}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "rna_Sound_filepath", scope: !2, file: !3, line: 1081, type: !160, isLocal: false, isDefinition: true)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringPropertyRNA", file: !161, line: 292, baseType: !162)
!161 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StringPropertyRNA", file: !161, line: 278, size: 1856, elements: !163)
!163 = !{!164, !1119, !1124, !1126, !1131, !1136, !1141, !1146, !1147}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !162, file: !161, line: 279, baseType: !165, size: 1344)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !161, line: 157, size: 1344, elements: !167)
!167 = !{!168, !170, !171, !172, !175, !176, !177, !178, !179, !180, !182, !184, !376, !377, !381, !382, !1103, !1104, !1109, !1114, !1115, !1117, !1118}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !161, line: 158, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !166, file: !161, line: 158, baseType: !169, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !166, file: !161, line: 161, baseType: !48, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !166, file: !161, line: 164, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !161, line: 166, baseType: !48, size: 32, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !161, line: 169, baseType: !173, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !166, file: !161, line: 171, baseType: !173, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !166, file: !161, line: 173, baseType: !48, size: 32, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !166, file: !161, line: 175, baseType: !173, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !166, file: !161, line: 178, baseType: !181, size: 32, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !166, file: !161, line: 180, baseType: !183, size: 32, offset: 608)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !166, file: !161, line: 182, baseType: !185, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !161, line: 73, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!48, !189, !322}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !191)
!191 = !{!192, !196, !375}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !190, file: !6, line: 58, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !190, file: !6, line: 56, size: 64, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !6, line: 57, baseType: !73, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !190, file: !6, line: 60, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !161, line: 339, size: 1600, elements: !199)
!199 = !{!200, !210, !211, !212, !213, !214, !215, !216, !217, !218, !220, !221, !222, !223, !228, !234, !357, !362, !368, !374}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !198, file: !161, line: 341, baseType: !201, size: 320)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !161, line: 135, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !161, line: 130, size: 320, elements: !203)
!203 = !{!204, !205, !206, !209}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !161, line: 131, baseType: !73, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !161, line: 131, baseType: !73, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !202, file: !161, line: 133, baseType: !207, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !161, line: 46, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !202, file: !161, line: 134, baseType: !128, size: 128, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !198, file: !161, line: 344, baseType: !173, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !198, file: !161, line: 348, baseType: !73, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !198, file: !161, line: 349, baseType: !73, size: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !198, file: !161, line: 352, baseType: !48, size: 32, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !161, line: 355, baseType: !173, size: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !198, file: !161, line: 357, baseType: !173, size: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !198, file: !161, line: 359, baseType: !173, size: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !198, file: !161, line: 361, baseType: !48, size: 32, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !198, file: !161, line: 364, baseType: !219, size: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !198, file: !161, line: 367, baseType: !219, size: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !198, file: !161, line: 370, baseType: !197, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !198, file: !161, line: 376, baseType: !197, size: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !198, file: !161, line: 379, baseType: !224, size: 64, offset: 1088)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !161, line: 70, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!197, !189}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !198, file: !161, line: 382, baseType: !229, size: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !161, line: 71, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !189}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !198, file: !161, line: 385, baseType: !235, size: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!197, !239, !306, !73, !173, !318, !323, !353}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !241, line: 53, size: 15232, elements: !242)
!241 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !256, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300, !303}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !241, line: 54, baseType: !239, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !240, file: !241, line: 54, baseType: !239, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !241, line: 55, baseType: !88, size: 8192, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !240, file: !241, line: 56, baseType: !102, size: 16, offset: 8320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !240, file: !241, line: 56, baseType: !102, size: 16, offset: 8336)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !240, file: !241, line: 57, baseType: !102, size: 16, offset: 8352)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !240, file: !241, line: 57, baseType: !102, size: 16, offset: 8368)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !240, file: !241, line: 58, baseType: !251, size: 64, offset: 8384)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !252, line: 27, baseType: !253)
!252 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !254, line: 45, baseType: !255)
!254 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!255 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !240, file: !241, line: 59, baseType: !257, size: 128, offset: 8448)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !240, file: !241, line: 60, baseType: !102, size: 16, offset: 8576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !240, file: !241, line: 62, baseType: !78, size: 64, offset: 8640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !240, file: !241, line: 63, baseType: !128, size: 128, offset: 8704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !240, file: !241, line: 64, baseType: !128, size: 128, offset: 8832)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !240, file: !241, line: 65, baseType: !128, size: 128, offset: 8960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !240, file: !241, line: 66, baseType: !128, size: 128, offset: 9088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !240, file: !241, line: 67, baseType: !128, size: 128, offset: 9216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !240, file: !241, line: 68, baseType: !128, size: 128, offset: 9344)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !240, file: !241, line: 69, baseType: !128, size: 128, offset: 9472)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !240, file: !241, line: 70, baseType: !128, size: 128, offset: 9600)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !240, file: !241, line: 71, baseType: !128, size: 128, offset: 9728)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !240, file: !241, line: 72, baseType: !128, size: 128, offset: 9856)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !240, file: !241, line: 73, baseType: !128, size: 128, offset: 9984)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !240, file: !241, line: 74, baseType: !128, size: 128, offset: 10112)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !240, file: !241, line: 75, baseType: !128, size: 128, offset: 10240)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !240, file: !241, line: 76, baseType: !128, size: 128, offset: 10368)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !240, file: !241, line: 77, baseType: !128, size: 128, offset: 10496)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !240, file: !241, line: 78, baseType: !128, size: 128, offset: 10624)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !240, file: !241, line: 79, baseType: !128, size: 128, offset: 10752)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !240, file: !241, line: 80, baseType: !128, size: 128, offset: 10880)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !240, file: !241, line: 81, baseType: !128, size: 128, offset: 11008)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !240, file: !241, line: 82, baseType: !128, size: 128, offset: 11136)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !240, file: !241, line: 83, baseType: !128, size: 128, offset: 11264)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !240, file: !241, line: 84, baseType: !128, size: 128, offset: 11392)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !240, file: !241, line: 85, baseType: !128, size: 128, offset: 11520)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !240, file: !241, line: 86, baseType: !128, size: 128, offset: 11648)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !240, file: !241, line: 87, baseType: !128, size: 128, offset: 11776)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !240, file: !241, line: 88, baseType: !128, size: 128, offset: 11904)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !240, file: !241, line: 89, baseType: !128, size: 128, offset: 12032)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !240, file: !241, line: 90, baseType: !128, size: 128, offset: 12160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !240, file: !241, line: 91, baseType: !128, size: 128, offset: 12288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !240, file: !241, line: 92, baseType: !128, size: 128, offset: 12416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !240, file: !241, line: 93, baseType: !128, size: 128, offset: 12544)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !240, file: !241, line: 94, baseType: !128, size: 128, offset: 12672)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !240, file: !241, line: 95, baseType: !128, size: 128, offset: 12800)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !240, file: !241, line: 96, baseType: !128, size: 128, offset: 12928)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !240, file: !241, line: 98, baseType: !297, size: 2048, offset: 13056)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !240, file: !241, line: 101, baseType: !301, size: 64, offset: 15104)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !241, line: 49, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !240, file: !241, line: 103, baseType: !304, size: 64, offset: 15168)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !241, line: 51, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !308, line: 106, size: 320, elements: !309)
!308 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !307, file: !308, line: 107, baseType: !128, size: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !307, file: !308, line: 108, baseType: !48, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !307, file: !308, line: 109, baseType: !48, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !307, file: !308, line: 110, baseType: !48, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !307, file: !308, line: 110, baseType: !48, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !307, file: !308, line: 111, baseType: !316, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !308, line: 56, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!48, !189, !73, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!48, !327, !189, !329, !343}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !161, line: 137, size: 640, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !352}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !330, file: !161, line: 139, baseType: !201, size: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !330, file: !161, line: 142, baseType: !173, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !161, line: 144, baseType: !48, size: 32, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !330, file: !161, line: 147, baseType: !173, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !330, file: !161, line: 150, baseType: !337, size: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !327, !306, !341, !343}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !190)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !346)
!346 = !{!347, !348, !349, !350, !351}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !6, line: 339, baseType: !73, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !345, file: !6, line: 342, baseType: !329, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !345, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !345, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !345, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !330, file: !161, line: 154, baseType: !219, size: 64, offset: 576)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !73}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !198, file: !161, line: 386, baseType: !358, size: 64, offset: 1280)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !239, !197}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !198, file: !161, line: 387, baseType: !363, size: 64, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!367, !341}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !198, file: !161, line: 390, baseType: !369, size: 64, offset: 1408)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !161, line: 69, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!112, !189, !373}
!373 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !198, file: !161, line: 393, baseType: !128, size: 128, offset: 1472)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !190, file: !6, line: 61, baseType: !73, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !166, file: !161, line: 184, baseType: !7, size: 32, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !166, file: !161, line: 186, baseType: !378, size: 96, offset: 736)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 3)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !166, file: !161, line: 187, baseType: !7, size: 32, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !166, file: !161, line: 190, baseType: !383, size: 64, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !161, line: 64, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !239, !387, !189}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !389, line: 1216, size: 39680, elements: !390)
!389 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!390 = !{!391, !392, !395, !398, !401, !402, !403, !415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !430, !433, !436, !665, !668, !970, !982, !983, !984, !985, !986, !987, !988, !989, !992, !993, !994, !995, !996, !1004, !1071, !1078, !1081, !1088, !1091, !1092, !1093, !1094, !1095, !1100}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !388, file: !389, line: 1217, baseType: !68, size: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !388, file: !389, line: 1218, baseType: !393, size: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !389, line: 58, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !388, file: !389, line: 1220, baseType: !396, size: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !389, line: 50, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !388, file: !389, line: 1221, baseType: !399, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !389, line: 52, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !388, file: !389, line: 1223, baseType: !387, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !388, file: !389, line: 1225, baseType: !128, size: 128, offset: 1216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !388, file: !389, line: 1226, baseType: !404, size: 64, offset: 1344)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !389, line: 69, size: 320, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !405, file: !389, line: 70, baseType: !404, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !405, file: !389, line: 70, baseType: !404, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !405, file: !389, line: 71, baseType: !7, size: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !405, file: !389, line: 71, baseType: !7, size: 32, offset: 160)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !405, file: !389, line: 72, baseType: !48, size: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !405, file: !389, line: 73, baseType: !102, size: 16, offset: 224)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !405, file: !389, line: 73, baseType: !102, size: 16, offset: 240)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !405, file: !389, line: 74, baseType: !396, size: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !388, file: !389, line: 1227, baseType: !396, size: 64, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !388, file: !389, line: 1229, baseType: !417, size: 96, offset: 1472)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 96, elements: !379)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !388, file: !389, line: 1230, baseType: !417, size: 96, offset: 1568)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !388, file: !389, line: 1231, baseType: !417, size: 96, offset: 1664)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !388, file: !389, line: 1231, baseType: !417, size: 96, offset: 1760)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !388, file: !389, line: 1233, baseType: !7, size: 32, offset: 1856)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !388, file: !389, line: 1234, baseType: !48, size: 32, offset: 1888)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !388, file: !389, line: 1235, baseType: !7, size: 32, offset: 1920)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !388, file: !389, line: 1237, baseType: !102, size: 16, offset: 1952)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !388, file: !389, line: 1239, baseType: !89, size: 8, offset: 1968)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !388, file: !389, line: 1240, baseType: !427, size: 8, offset: 1976)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 1)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !388, file: !389, line: 1242, baseType: !431, size: 64, offset: 1984)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !389, line: 57, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !388, file: !389, line: 1244, baseType: !434, size: 64, offset: 2048)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !389, line: 59, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !388, file: !389, line: 1246, baseType: !437, size: 64, offset: 2112)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !389, line: 1067, size: 5184, elements: !439)
!439 = !{!440, !472, !473, !488, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !510, !531, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !582, !583, !584, !585, !586, !587, !588, !589, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !648}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !438, file: !389, line: 1068, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !389, line: 934, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !389, line: 925, size: 576, elements: !444)
!444 = !{!445, !463, !464, !465, !466, !468, !471}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !443, file: !389, line: 926, baseType: !446, size: 320)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !389, line: 830, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !389, line: 813, size: 320, elements: !448)
!448 = !{!449, !452, !455, !456, !460, !461, !462}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !447, file: !389, line: 814, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !389, line: 51, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !447, file: !389, line: 815, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !389, line: 815, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !447, file: !389, line: 818, baseType: !73, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !447, file: !389, line: 819, baseType: !457, size: 32, offset: 192)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 32, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 4)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !447, file: !389, line: 822, baseType: !48, size: 32, offset: 224)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !447, file: !389, line: 826, baseType: !48, size: 32, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !447, file: !389, line: 829, baseType: !48, size: 32, offset: 288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !443, file: !389, line: 928, baseType: !102, size: 16, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !443, file: !389, line: 928, baseType: !102, size: 16, offset: 336)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !443, file: !389, line: 929, baseType: !48, size: 32, offset: 352)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !443, file: !389, line: 930, baseType: !467, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !443, file: !389, line: 931, baseType: !469, size: 64, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !389, line: 931, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !443, file: !389, line: 933, baseType: !73, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !438, file: !389, line: 1069, baseType: !441, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !438, file: !389, line: 1070, baseType: !474, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !389, line: 916, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !389, line: 891, size: 704, elements: !477)
!477 = !{!478, !479, !480, !482, !483, !484, !485, !486, !487}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !476, file: !389, line: 892, baseType: !446, size: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !476, file: !389, line: 896, baseType: !48, size: 32, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !476, file: !389, line: 900, baseType: !481, size: 96, offset: 352)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !379)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !476, file: !389, line: 903, baseType: !146, size: 32, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !476, file: !389, line: 906, baseType: !48, size: 32, offset: 480)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !476, file: !389, line: 909, baseType: !146, size: 32, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !476, file: !389, line: 912, baseType: !146, size: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !476, file: !389, line: 914, baseType: !396, size: 64, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !476, file: !389, line: 915, baseType: !73, size: 64, offset: 640)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !438, file: !389, line: 1071, baseType: !489, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !389, line: 920, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !389, line: 918, size: 320, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !491, file: !389, line: 919, baseType: !446, size: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !438, file: !389, line: 1075, baseType: !146, size: 32, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !438, file: !389, line: 1077, baseType: !146, size: 32, offset: 288)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !438, file: !389, line: 1078, baseType: !146, size: 32, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !438, file: !389, line: 1079, baseType: !102, size: 16, offset: 352)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !438, file: !389, line: 1082, baseType: !102, size: 16, offset: 368)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !438, file: !389, line: 1085, baseType: !89, size: 8, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !438, file: !389, line: 1086, baseType: !89, size: 8, offset: 392)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !438, file: !389, line: 1087, baseType: !89, size: 8, offset: 400)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !438, file: !389, line: 1088, baseType: !89, size: 8, offset: 408)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !438, file: !389, line: 1090, baseType: !146, size: 32, offset: 416)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !438, file: !389, line: 1093, baseType: !102, size: 16, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !438, file: !389, line: 1096, baseType: !89, size: 8, offset: 464)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !438, file: !389, line: 1098, baseType: !507, size: 40, offset: 472)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 40, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 5)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !438, file: !389, line: 1101, baseType: !511, size: 832, offset: 512)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !389, line: 836, size: 832, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !522, !523, !524, !527, !528, !529, !530}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !511, file: !389, line: 837, baseType: !446, size: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !511, file: !389, line: 839, baseType: !102, size: 16, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !511, file: !389, line: 839, baseType: !102, size: 16, offset: 336)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !511, file: !389, line: 842, baseType: !102, size: 16, offset: 352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !511, file: !389, line: 842, baseType: !102, size: 16, offset: 368)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !511, file: !389, line: 843, baseType: !519, size: 32, offset: 384)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 32, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 2)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !511, file: !389, line: 845, baseType: !48, size: 32, offset: 416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !511, file: !389, line: 847, baseType: !73, size: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !511, file: !389, line: 848, baseType: !525, size: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !389, line: 54, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !511, file: !389, line: 849, baseType: !525, size: 64, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !511, file: !389, line: 850, baseType: !525, size: 64, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !511, file: !389, line: 851, baseType: !417, size: 96, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !511, file: !389, line: 852, baseType: !146, size: 32, offset: 800)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !438, file: !389, line: 1104, baseType: !532, size: 1344, offset: 1344)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !389, line: 867, size: 1344, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !551, !552, !553, !554, !555, !556, !557, !558, !559}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !532, file: !389, line: 868, baseType: !102, size: 16)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !532, file: !389, line: 869, baseType: !102, size: 16, offset: 16)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !532, file: !389, line: 870, baseType: !102, size: 16, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !532, file: !389, line: 871, baseType: !102, size: 16, offset: 48)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !532, file: !389, line: 873, baseType: !539, size: 896, offset: 64)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 896, elements: !549)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !389, line: 864, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !389, line: 859, size: 128, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !541, file: !389, line: 860, baseType: !102, size: 16)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !541, file: !389, line: 861, baseType: !102, size: 16, offset: 16)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !541, file: !389, line: 861, baseType: !102, size: 16, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !541, file: !389, line: 861, baseType: !102, size: 16, offset: 48)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !389, line: 862, baseType: !48, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !541, file: !389, line: 863, baseType: !146, size: 32, offset: 96)
!549 = !{!550}
!550 = !DISubrange(count: 7)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !532, file: !389, line: 874, baseType: !73, size: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !532, file: !389, line: 876, baseType: !146, size: 32, offset: 1024)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !532, file: !389, line: 876, baseType: !146, size: 32, offset: 1056)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !532, file: !389, line: 878, baseType: !48, size: 32, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !532, file: !389, line: 879, baseType: !48, size: 32, offset: 1120)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !532, file: !389, line: 881, baseType: !48, size: 32, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !532, file: !389, line: 881, baseType: !48, size: 32, offset: 1184)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !532, file: !389, line: 883, baseType: !387, size: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !532, file: !389, line: 884, baseType: !396, size: 64, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !438, file: !389, line: 1107, baseType: !146, size: 32, offset: 2688)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !438, file: !389, line: 1110, baseType: !146, size: 32, offset: 2720)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !438, file: !389, line: 1113, baseType: !102, size: 16, offset: 2752)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !438, file: !389, line: 1113, baseType: !102, size: 16, offset: 2768)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !438, file: !389, line: 1116, baseType: !89, size: 8, offset: 2784)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !438, file: !389, line: 1117, baseType: !427, size: 8, offset: 2792)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !438, file: !389, line: 1120, baseType: !102, size: 16, offset: 2800)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !438, file: !389, line: 1121, baseType: !146, size: 32, offset: 2816)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !438, file: !389, line: 1122, baseType: !146, size: 32, offset: 2848)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !438, file: !389, line: 1123, baseType: !146, size: 32, offset: 2880)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !438, file: !389, line: 1124, baseType: !146, size: 32, offset: 2912)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !438, file: !389, line: 1125, baseType: !146, size: 32, offset: 2944)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !438, file: !389, line: 1126, baseType: !146, size: 32, offset: 2976)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !438, file: !389, line: 1127, baseType: !146, size: 32, offset: 3008)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !438, file: !389, line: 1128, baseType: !146, size: 32, offset: 3040)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !438, file: !389, line: 1129, baseType: !146, size: 32, offset: 3072)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !438, file: !389, line: 1130, baseType: !146, size: 32, offset: 3104)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !438, file: !389, line: 1131, baseType: !102, size: 16, offset: 3136)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !438, file: !389, line: 1132, baseType: !89, size: 8, offset: 3152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !438, file: !389, line: 1133, baseType: !89, size: 8, offset: 3160)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !438, file: !389, line: 1134, baseType: !581, size: 24, offset: 3168)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 24, elements: !379)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !438, file: !389, line: 1135, baseType: !89, size: 8, offset: 3192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !438, file: !389, line: 1138, baseType: !396, size: 64, offset: 3200)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !438, file: !389, line: 1139, baseType: !89, size: 8, offset: 3264)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !438, file: !389, line: 1140, baseType: !89, size: 8, offset: 3272)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !438, file: !389, line: 1141, baseType: !89, size: 8, offset: 3280)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !438, file: !389, line: 1142, baseType: !89, size: 8, offset: 3288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !438, file: !389, line: 1143, baseType: !89, size: 8, offset: 3296)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !438, file: !389, line: 1144, baseType: !590, size: 64, offset: 3304)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 64, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 8)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !438, file: !389, line: 1145, baseType: !590, size: 64, offset: 3368)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !438, file: !389, line: 1148, baseType: !89, size: 8, offset: 3432)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !438, file: !389, line: 1149, baseType: !89, size: 8, offset: 3440)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !438, file: !389, line: 1152, baseType: !89, size: 8, offset: 3448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !438, file: !389, line: 1152, baseType: !89, size: 8, offset: 3456)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !438, file: !389, line: 1153, baseType: !89, size: 8, offset: 3464)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !438, file: !389, line: 1154, baseType: !102, size: 16, offset: 3472)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !438, file: !389, line: 1154, baseType: !102, size: 16, offset: 3488)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !438, file: !389, line: 1155, baseType: !102, size: 16, offset: 3504)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !438, file: !389, line: 1155, baseType: !102, size: 16, offset: 3520)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !438, file: !389, line: 1156, baseType: !89, size: 8, offset: 3536)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !438, file: !389, line: 1157, baseType: !89, size: 8, offset: 3544)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !438, file: !389, line: 1159, baseType: !89, size: 8, offset: 3552)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !438, file: !389, line: 1160, baseType: !89, size: 8, offset: 3560)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !438, file: !389, line: 1161, baseType: !89, size: 8, offset: 3568)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !438, file: !389, line: 1162, baseType: !89, size: 8, offset: 3576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !438, file: !389, line: 1165, baseType: !48, size: 32, offset: 3584)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !438, file: !389, line: 1166, baseType: !48, size: 32, offset: 3616)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !438, file: !389, line: 1167, baseType: !48, size: 32, offset: 3648)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !438, file: !389, line: 1168, baseType: !48, size: 32, offset: 3680)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !438, file: !389, line: 1171, baseType: !102, size: 16, offset: 3712)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !438, file: !389, line: 1171, baseType: !102, size: 16, offset: 3728)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !438, file: !389, line: 1172, baseType: !48, size: 32, offset: 3744)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !438, file: !389, line: 1173, baseType: !146, size: 32, offset: 3776)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !438, file: !389, line: 1174, baseType: !146, size: 32, offset: 3808)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !438, file: !389, line: 1177, baseType: !619, size: 1024, offset: 3840)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !389, line: 963, size: 1024, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !630, !631, !632, !633, !634, !636, !637, !638, !639, !640, !641, !642, !643, !646, !647}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !389, line: 965, baseType: !48, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !619, file: !389, line: 968, baseType: !146, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !619, file: !389, line: 971, baseType: !146, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !619, file: !389, line: 974, baseType: !146, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !619, file: !389, line: 977, baseType: !417, size: 96, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !619, file: !389, line: 979, baseType: !417, size: 96, offset: 224)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !619, file: !389, line: 982, baseType: !48, size: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !619, file: !389, line: 987, baseType: !629, size: 64, offset: 352)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 64, elements: !520)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !619, file: !389, line: 989, baseType: !146, size: 32, offset: 416)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !619, file: !389, line: 994, baseType: !48, size: 32, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !619, file: !389, line: 995, baseType: !48, size: 32, offset: 480)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !619, file: !389, line: 997, baseType: !89, size: 8, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !619, file: !389, line: 998, baseType: !635, size: 56, offset: 520)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 56, elements: !549)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !619, file: !389, line: 1000, baseType: !146, size: 32, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !619, file: !389, line: 1003, baseType: !629, size: 64, offset: 608)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !619, file: !389, line: 1006, baseType: !48, size: 32, offset: 672)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !619, file: !389, line: 1009, baseType: !146, size: 32, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !619, file: !389, line: 1012, baseType: !629, size: 64, offset: 736)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !619, file: !389, line: 1015, baseType: !629, size: 64, offset: 800)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !619, file: !389, line: 1018, baseType: !48, size: 32, offset: 864)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !619, file: !389, line: 1019, baseType: !644, size: 64, offset: 896)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !389, line: 63, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !619, file: !389, line: 1023, baseType: !146, size: 32, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !619, file: !389, line: 1024, baseType: !48, size: 32, offset: 992)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !438, file: !389, line: 1179, baseType: !649, size: 320, offset: 4864)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !389, line: 1043, size: 320, elements: !650)
!650 = !{!651, !652, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !649, file: !389, line: 1044, baseType: !89, size: 8)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !649, file: !389, line: 1045, baseType: !653, size: 16, offset: 8)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 16, elements: !520)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !649, file: !389, line: 1048, baseType: !89, size: 8, offset: 24)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !649, file: !389, line: 1049, baseType: !146, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !649, file: !389, line: 1049, baseType: !146, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !649, file: !389, line: 1052, baseType: !146, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !649, file: !389, line: 1052, baseType: !146, size: 32, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !649, file: !389, line: 1053, baseType: !89, size: 8, offset: 160)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !649, file: !389, line: 1054, baseType: !581, size: 24, offset: 168)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !649, file: !389, line: 1057, baseType: !146, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !649, file: !389, line: 1057, baseType: !146, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !649, file: !389, line: 1060, baseType: !146, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !649, file: !389, line: 1060, baseType: !146, size: 32, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !388, file: !389, line: 1247, baseType: !666, size: 64, offset: 2176)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !389, line: 60, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !388, file: !389, line: 1251, baseType: !669, size: 31872, offset: 2240)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !389, line: 403, size: 31872, elements: !670)
!670 = !{!671, !755, !775, !784, !804, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !918, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !946, !947, !948, !952, !968, !969}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !669, file: !389, line: 404, baseType: !672, size: 1984)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !389, line: 259, size: 1984, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !691, !750}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !672, file: !389, line: 260, baseType: !89, size: 8)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !672, file: !389, line: 263, baseType: !89, size: 8, offset: 8)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !672, file: !389, line: 266, baseType: !89, size: 8, offset: 16)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !672, file: !389, line: 267, baseType: !89, size: 8, offset: 24)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !672, file: !389, line: 269, baseType: !89, size: 8, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !672, file: !389, line: 270, baseType: !89, size: 8, offset: 40)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !672, file: !389, line: 276, baseType: !89, size: 8, offset: 48)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !672, file: !389, line: 279, baseType: !89, size: 8, offset: 56)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !672, file: !389, line: 280, baseType: !102, size: 16, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !672, file: !389, line: 280, baseType: !102, size: 16, offset: 80)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !672, file: !389, line: 281, baseType: !146, size: 32, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !672, file: !389, line: 284, baseType: !89, size: 8, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !672, file: !389, line: 285, baseType: !89, size: 8, offset: 136)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !672, file: !389, line: 287, baseType: !688, size: 48, offset: 144)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 48, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 6)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !672, file: !389, line: 290, baseType: !692, size: 1280, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !693, line: 174, baseType: !694)
!693 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !693, line: 166, size: 1280, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !749}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !694, file: !693, line: 167, baseType: !48, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !694, file: !693, line: 167, baseType: !48, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !694, file: !693, line: 168, baseType: !118, size: 512, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !694, file: !693, line: 169, baseType: !118, size: 512, offset: 576)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !694, file: !693, line: 170, baseType: !146, size: 32, offset: 1088)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !694, file: !693, line: 171, baseType: !146, size: 32, offset: 1120)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !694, file: !693, line: 172, baseType: !703, size: 64, offset: 1152)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !693, line: 72, size: 3072, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !719, !720, !745, !746, !747, !748}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !704, file: !693, line: 73, baseType: !48, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !704, file: !693, line: 73, baseType: !48, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !704, file: !693, line: 74, baseType: !48, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !704, file: !693, line: 75, baseType: !48, size: 32, offset: 96)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !704, file: !693, line: 77, baseType: !711, size: 128, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !712, line: 95, baseType: !713)
!712 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !712, line: 92, size: 128, elements: !714)
!714 = !{!715, !716, !717, !718}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !713, file: !712, line: 93, baseType: !146, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !713, file: !712, line: 93, baseType: !146, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !713, file: !712, line: 94, baseType: !146, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !713, file: !712, line: 94, baseType: !146, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !704, file: !693, line: 77, baseType: !711, size: 128, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !704, file: !693, line: 79, baseType: !721, size: 2304, offset: 384)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 2304, elements: !458)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !693, line: 67, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !693, line: 55, size: 576, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !741, !742, !743, !744}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !723, file: !693, line: 56, baseType: !102, size: 16)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !723, file: !693, line: 56, baseType: !102, size: 16, offset: 16)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !723, file: !693, line: 58, baseType: !146, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !723, file: !693, line: 59, baseType: !146, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !723, file: !693, line: 59, baseType: !146, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !723, file: !693, line: 60, baseType: !629, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !723, file: !693, line: 60, baseType: !629, size: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !723, file: !693, line: 61, baseType: !733, size: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !693, line: 47, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !693, line: 44, size: 96, elements: !736)
!736 = !{!737, !738, !739, !740}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !735, file: !693, line: 45, baseType: !146, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !735, file: !693, line: 45, baseType: !146, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !735, file: !693, line: 46, baseType: !102, size: 16, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !735, file: !693, line: 46, baseType: !102, size: 16, offset: 80)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !723, file: !693, line: 62, baseType: !733, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !723, file: !693, line: 64, baseType: !733, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !723, file: !693, line: 65, baseType: !629, size: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !723, file: !693, line: 66, baseType: !629, size: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !704, file: !693, line: 80, baseType: !417, size: 96, offset: 2688)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !704, file: !693, line: 80, baseType: !417, size: 96, offset: 2784)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !704, file: !693, line: 81, baseType: !417, size: 96, offset: 2880)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !704, file: !693, line: 83, baseType: !417, size: 96, offset: 2976)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !694, file: !693, line: 173, baseType: !73, size: 64, offset: 1216)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !672, file: !389, line: 291, baseType: !751, size: 512, offset: 1472)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !693, line: 178, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !693, line: 176, size: 512, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !752, file: !693, line: 177, baseType: !118, size: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !669, file: !389, line: 406, baseType: !756, size: 64, offset: 1984)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !389, line: 80, size: 1472, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !757, file: !389, line: 81, baseType: !73, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !757, file: !389, line: 82, baseType: !73, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !757, file: !389, line: 83, baseType: !7, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !757, file: !389, line: 84, baseType: !7, size: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !757, file: !389, line: 86, baseType: !7, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !757, file: !389, line: 87, baseType: !7, size: 32, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !757, file: !389, line: 88, baseType: !7, size: 32, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !757, file: !389, line: 89, baseType: !7, size: 32, offset: 288)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !757, file: !389, line: 90, baseType: !7, size: 32, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !757, file: !389, line: 91, baseType: !7, size: 32, offset: 352)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !757, file: !389, line: 92, baseType: !7, size: 32, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !757, file: !389, line: 93, baseType: !7, size: 32, offset: 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecname", scope: !757, file: !389, line: 95, baseType: !772, size: 1024, offset: 448)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 1024, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecdata", scope: !669, file: !389, line: 407, baseType: !776, size: 64, offset: 2048)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecData", file: !389, line: 98, size: 1216, elements: !778)
!778 = !{!779, !780, !781, !782, !783}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "cdParms", scope: !777, file: !389, line: 100, baseType: !73, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !777, file: !389, line: 101, baseType: !73, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cdSize", scope: !777, file: !389, line: 103, baseType: !7, size: 32, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !777, file: !389, line: 104, baseType: !7, size: 32, offset: 160)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecname", scope: !777, file: !389, line: 106, baseType: !772, size: 1024, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecsettings", scope: !669, file: !389, line: 408, baseType: !785, size: 512, offset: 2112)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecSettings", file: !389, line: 109, size: 512, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "codecType", scope: !785, file: !389, line: 111, baseType: !48, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "codecSpatialQuality", scope: !785, file: !389, line: 112, baseType: !48, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !785, file: !389, line: 115, baseType: !48, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "codecFlags", scope: !785, file: !389, line: 116, baseType: !48, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "colorDepth", scope: !785, file: !389, line: 117, baseType: !48, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "codecTemporalQuality", scope: !785, file: !389, line: 118, baseType: !48, size: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "minSpatialQuality", scope: !785, file: !389, line: 119, baseType: !48, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "minTemporalQuality", scope: !785, file: !389, line: 120, baseType: !48, size: 32, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "keyFrameRate", scope: !785, file: !389, line: 121, baseType: !48, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bitRate", scope: !785, file: !389, line: 122, baseType: !48, size: 32, offset: 288)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "audiocodecType", scope: !785, file: !389, line: 125, baseType: !48, size: 32, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "audioSampleRate", scope: !785, file: !389, line: 126, baseType: !48, size: 32, offset: 352)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitDepth", scope: !785, file: !389, line: 127, baseType: !102, size: 16, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "audioChannels", scope: !785, file: !389, line: 128, baseType: !102, size: 16, offset: 400)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "audioCodecFlags", scope: !785, file: !389, line: 129, baseType: !48, size: 32, offset: 416)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitRate", scope: !785, file: !389, line: 130, baseType: !48, size: 32, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !785, file: !389, line: 131, baseType: !48, size: 32, offset: 480)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ffcodecdata", scope: !669, file: !389, line: 409, baseType: !805, size: 576, offset: 2624)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFMpegCodecData", file: !389, line: 134, size: 576, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !805, file: !389, line: 135, baseType: !48, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !805, file: !389, line: 136, baseType: !48, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !805, file: !389, line: 137, baseType: !48, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "video_bitrate", scope: !805, file: !389, line: 138, baseType: !48, size: 32, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "audio_bitrate", scope: !805, file: !389, line: 139, baseType: !48, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mixrate", scope: !805, file: !389, line: 140, baseType: !48, size: 32, offset: 160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "audio_channels", scope: !805, file: !389, line: 141, baseType: !48, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pad", scope: !805, file: !389, line: 142, baseType: !48, size: 32, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "audio_volume", scope: !805, file: !389, line: 143, baseType: !146, size: 32, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !805, file: !389, line: 144, baseType: !48, size: 32, offset: 288)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !805, file: !389, line: 145, baseType: !48, size: 32, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !805, file: !389, line: 147, baseType: !48, size: 32, offset: 352)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !805, file: !389, line: 148, baseType: !48, size: 32, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !805, file: !389, line: 149, baseType: !48, size: 32, offset: 416)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mux_packet_size", scope: !805, file: !389, line: 150, baseType: !48, size: 32, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mux_rate", scope: !805, file: !389, line: 151, baseType: !48, size: 32, offset: 480)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !805, file: !389, line: 152, baseType: !107, size: 64, offset: 512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !669, file: !389, line: 411, baseType: !48, size: 32, offset: 3200)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !669, file: !389, line: 411, baseType: !48, size: 32, offset: 3232)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !669, file: !389, line: 411, baseType: !48, size: 32, offset: 3264)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "subframe", scope: !669, file: !389, line: 412, baseType: !146, size: 32, offset: 3296)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "psfra", scope: !669, file: !389, line: 413, baseType: !48, size: 32, offset: 3328)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pefra", scope: !669, file: !389, line: 413, baseType: !48, size: 32, offset: 3360)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !669, file: !389, line: 415, baseType: !48, size: 32, offset: 3392)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "framapto", scope: !669, file: !389, line: 415, baseType: !48, size: 32, offset: 3424)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !389, line: 416, baseType: !102, size: 16, offset: 3456)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !669, file: !389, line: 416, baseType: !102, size: 16, offset: 3472)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "framelen", scope: !669, file: !389, line: 418, baseType: !146, size: 32, offset: 3488)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "blurfac", scope: !669, file: !389, line: 418, baseType: !146, size: 32, offset: 3520)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "edgeR", scope: !669, file: !389, line: 421, baseType: !146, size: 32, offset: 3552)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "edgeG", scope: !669, file: !389, line: 421, baseType: !146, size: 32, offset: 3584)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "edgeB", scope: !669, file: !389, line: 421, baseType: !146, size: 32, offset: 3616)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fullscreen", scope: !669, file: !389, line: 425, baseType: !102, size: 16, offset: 3648)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "xplay", scope: !669, file: !389, line: 425, baseType: !102, size: 16, offset: 3664)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "yplay", scope: !669, file: !389, line: 425, baseType: !102, size: 16, offset: 3680)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "freqplay", scope: !669, file: !389, line: 426, baseType: !102, size: 16, offset: 3696)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !669, file: !389, line: 428, baseType: !102, size: 16, offset: 3712)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !669, file: !389, line: 428, baseType: !102, size: 16, offset: 3728)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "frame_step", scope: !669, file: !389, line: 431, baseType: !48, size: 32, offset: 3744)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "stereomode", scope: !669, file: !389, line: 433, baseType: !102, size: 16, offset: 3776)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "dimensionspreset", scope: !669, file: !389, line: 435, baseType: !102, size: 16, offset: 3792)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "filtertype", scope: !669, file: !389, line: 437, baseType: !102, size: 16, offset: 3808)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !669, file: !389, line: 439, baseType: !102, size: 16, offset: 3824)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "maximsize", scope: !669, file: !389, line: 441, baseType: !102, size: 16, offset: 3840)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !669, file: !389, line: 443, baseType: !102, size: 16, offset: 3856)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "xsch", scope: !669, file: !389, line: 449, baseType: !48, size: 32, offset: 3872)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ysch", scope: !669, file: !389, line: 453, baseType: !48, size: 32, offset: 3904)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "xparts", scope: !669, file: !389, line: 458, baseType: !102, size: 16, offset: 3936)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "yparts", scope: !669, file: !389, line: 462, baseType: !102, size: 16, offset: 3952)
