; ModuleID = 'blender/source/blender/blenkernel/intern/unit.c'
source_filename = "blender/source/blender/blenkernel/intern/unit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bUnitCollection = type { %struct.bUnitDef*, i32, i32, i32 }
%struct.bUnitDef = type { i8*, i8*, i8*, i8*, i8*, double, double, i32 }

@buDummyCollection = internal global %struct.bUnitCollection { %struct.bUnitDef* getelementptr inbounds ([2 x %struct.bUnitDef], [2 x %struct.bUnitDef]* @buDummyDef, i32 0, i32 0), i32 0, i32 0, i32 128 }, align 8, !dbg !0
@.str = private unnamed_addr constant [10 x i8] c"(%s)*%.9g\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "buDummyCollection", scope: !2, file: !3, line: 113, type: !40, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !63, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/unit.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 64, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_unit.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "B_UNIT_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "B_UNIT_LENGTH", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "B_UNIT_AREA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "B_UNIT_VOLUME", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "B_UNIT_MASS", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "B_UNIT_ROTATION", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "B_UNIT_TIME", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "B_UNIT_VELOCITY", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "B_UNIT_ACCELERATION", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "B_UNIT_CAMERA", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "B_UNIT_TYPE_TOT", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!35 = !{!36, !37, !38, !61, !62}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "bUnitCollection", file: !3, line: 109, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bUnitCollection", file: !3, line: 104, size: 192, elements: !41)
!41 = !{!42, !58, !59, !60}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !40, file: !3, line: 105, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bUnitDef", file: !3, line: 85, size: 512, elements: !45)
!45 = !{!46, !50, !51, !52, !53, !54, !56, !57}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !3, line: 86, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "name_plural", scope: !44, file: !3, line: 87, baseType: !47, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "name_short", scope: !44, file: !3, line: 88, baseType: !47, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name_alt", scope: !44, file: !3, line: 89, baseType: !47, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "name_display", scope: !44, file: !3, line: 92, baseType: !47, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "scalar", scope: !44, file: !3, line: 94, baseType: !55, size: 64, offset: 320)
!55 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !44, file: !3, line: 95, baseType: !55, size: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !44, file: !3, line: 96, baseType: !37, size: 32, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "base_unit", scope: !40, file: !3, line: 106, baseType: !37, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !3, line: 107, baseType: !37, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !40, file: !3, line: 108, baseType: !37, size: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !{!64, !71, !73, !78, !80, !85, !87, !92, !94, !96, !98, !100, !102, !107, !109, !114, !116, !121, !123, !128, !130, !132, !134, !136, !138, !140, !142, !144, !146, !148, !150, !0, !152}
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "bUnitSystems", scope: !2, file: !3, line: 292, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 2560, elements: !68)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!68 = !{!69, !70}
!69 = !DISubrange(count: 4)
!70 = !DISubrange(count: 10)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "buNaturalRotCollection", scope: !2, file: !3, line: 277, type: !40, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "buNaturalRotDef", scope: !2, file: !3, line: 268, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2560, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 5)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "buNaturalTimeCollection", scope: !2, file: !3, line: 265, type: !40, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "buNaturalTimeDef", scope: !2, file: !3, line: 255, type: !82, isLocal: true, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 3584, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 7)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "buMetricLenCollection", scope: !2, file: !3, line: 134, type: !40, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "buMetricLenDef", scope: !2, file: !3, line: 116, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 4608, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 9)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "buMetricAreaCollection", scope: !2, file: !3, line: 160, type: !40, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "buMetricAreaDef", scope: !2, file: !3, line: 149, type: !89, isLocal: true, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "buMetricVolCollection", scope: !2, file: !3, line: 186, type: !40, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "buMetricVolDef", scope: !2, file: !3, line: 175, type: !89, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "buMetricMassCollection", scope: !2, file: !3, line: 211, type: !40, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "buMetricMassDef", scope: !2, file: !3, line: 201, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 4096, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 8)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
