; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_sepcombHSV.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_sepcombHSV.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 63, type: !40, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_sh_sephsv", scope: !3, file: !3, line: 61, type: !4, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!3 = !DIFile(filename: "blender/source/blender/nodes/shader/nodes/node_shader_sepcombHSV.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, globals: !35, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !23, line: 135, baseType: !24, size: 32, elements: !25)
!23 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!27 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!28 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!29 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!30 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!31 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!32 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!33 = !DIEnumerator(name: "SOCK_INT", value: 6)
!34 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!35 = !{!0, !36, !2245, !2248, !2251, !2253}
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "ntype", scope: !38, file: !3, line: 104, type: !40, isLocal: true, isDefinition: true)
!38 = distinct !DISubprogram(name: "register_node_type_sh_combhsv", scope: !3, file: !3, line: 102, type: !4, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !39)
!39 = !{}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeType", file: !41, line: 221, baseType: !42)
!41 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !41, line: 144, size: 6016, elements: !43)
!43 = !{!44, !46, !47, !49, !54, !55, !56, !60, !61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !2118, !2119, !2120, !2128, !2132, !2136, !2137, !2141, !2145, !2149, !2150, !2151, !2152, !2156, !2157, !2161, !2165, !2169, !2173, !2177, !2181, !2185, !2186, !2196, !2198, !2224, !2244}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !41, line: 145, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !42, file: !41, line: 145, baseType: !45, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !42, file: !41, line: 146, baseType: !48, size: 16, offset: 128)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !42, file: !41, line: 148, baseType: !50, size: 512, offset: 144)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 512, elements: !52)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !{!53}
!53 = !DISubrange(count: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !41, line: 149, baseType: !24, size: 32, offset: 672)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !42, file: !41, line: 151, baseType: !50, size: 512, offset: 704)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !42, file: !41, line: 152, baseType: !57, size: 2048, offset: 1216)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2048, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !42, file: !41, line: 153, baseType: !24, size: 32, offset: 3264)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !42, file: !41, line: 155, baseType: !62, size: 32, offset: 3296)
!62 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !42, file: !41, line: 155, baseType: !62, size: 32, offset: 3328)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !42, file: !41, line: 155, baseType: !62, size: 32, offset: 3360)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !42, file: !41, line: 156, baseType: !62, size: 32, offset: 3392)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !42, file: !41, line: 156, baseType: !62, size: 32, offset: 3424)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !42, file: !41, line: 156, baseType: !62, size: 32, offset: 3456)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !42, file: !41, line: 157, baseType: !48, size: 16, offset: 3488)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !42, file: !41, line: 157, baseType: !48, size: 16, offset: 3504)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !42, file: !41, line: 157, baseType: !48, size: 16, offset: 3520)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !42, file: !41, line: 160, baseType: !72, size: 64, offset: 3584)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !41, line: 109, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !41, line: 98, size: 1408, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !2117}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !41, line: 99, baseType: !24, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !74, file: !41, line: 99, baseType: !24, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !41, line: 100, baseType: !50, size: 512, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !74, file: !41, line: 101, baseType: !62, size: 32, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !74, file: !41, line: 101, baseType: !62, size: 32, offset: 608)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !74, file: !41, line: 101, baseType: !62, size: 32, offset: 640)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !74, file: !41, line: 101, baseType: !62, size: 32, offset: 672)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !74, file: !41, line: 102, baseType: !62, size: 32, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !74, file: !41, line: 102, baseType: !62, size: 32, offset: 736)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !74, file: !41, line: 103, baseType: !24, size: 32, offset: 768)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !74, file: !41, line: 104, baseType: !24, size: 32, offset: 800)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !74, file: !41, line: 107, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !23, line: 87, size: 2816, elements: !90)
!90 = !{!91, !92, !93, !94, !124, !125, !126, !127, !128, !129, !130, !131, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !89, file: !23, line: 88, baseType: !88, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !89, file: !23, line: 88, baseType: !88, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !89, file: !23, line: 88, baseType: !88, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !89, file: !23, line: 90, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !97, line: 75, baseType: !98)
!97 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !97, line: 62, size: 1024, elements: !99)
!99 = !{!100, !102, !103, !104, !105, !106, !107, !108, !122, !123}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !97, line: 63, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !98, file: !97, line: 63, baseType: !101, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !97, line: 64, baseType: !51, size: 8, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !98, file: !97, line: 64, baseType: !51, size: 8, offset: 136)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !98, file: !97, line: 65, baseType: !48, size: 16, offset: 144)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !97, line: 66, baseType: !50, size: 512, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !98, file: !97, line: 67, baseType: !24, size: 32, offset: 672)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !97, line: 69, baseType: !109, size: 256, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !97, line: 60, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !97, line: 48, size: 256, elements: !111)
!111 = !{!112, !113, !120, !121}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !110, file: !97, line: 49, baseType: !45, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !110, file: !97, line: 58, baseType: !114, size: 128, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !115, line: 71, baseType: !116)
!115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !115, line: 69, size: 128, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !116, file: !115, line: 70, baseType: !45, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !116, file: !115, line: 70, baseType: !45, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !110, file: !97, line: 59, baseType: !24, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !110, file: !97, line: 59, baseType: !24, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !98, file: !97, line: 70, baseType: !24, size: 32, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !98, file: !97, line: 74, baseType: !24, size: 32, offset: 992)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !89, file: !23, line: 92, baseType: !50, size: 512, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !23, line: 94, baseType: !50, size: 512, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !89, file: !23, line: 99, baseType: !45, size: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !23, line: 101, baseType: !48, size: 16, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !89, file: !23, line: 101, baseType: !48, size: 16, offset: 1360)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !89, file: !23, line: 102, baseType: !48, size: 16, offset: 1376)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !89, file: !23, line: 103, baseType: !48, size: 16, offset: 1392)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !89, file: !23, line: 104, baseType: !132, size: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !41, line: 114, size: 1600, elements: !134)
!134 = !{!135, !136, !159, !164, !168, !172, !2077, !2081, !2082, !2086, !2087, !2088, !2089}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !133, file: !41, line: 115, baseType: !50, size: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !133, file: !41, line: 117, baseType: !137, size: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140, !143, !145, !145, !157}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !142, line: 60, flags: DIFlagFwdDecl)
!142 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !41, line: 73, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !147, line: 55, size: 192, elements: !148)
!147 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!148 = !{!149, !153, !156}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !146, file: !147, line: 58, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !146, file: !147, line: 56, size: 64, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !147, line: 57, baseType: !45, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !147, line: 60, baseType: !154, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !23, line: 335, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 61, baseType: !45, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !133, file: !41, line: 118, baseType: !160, size: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !140, !145, !145, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !133, file: !41, line: 120, baseType: !165, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !140, !143, !145}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !133, file: !41, line: 121, baseType: !169, size: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !140, !145, !163}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !133, file: !41, line: 122, baseType: !173, size: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !176, !88, !154}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !23, line: 328, size: 3456, elements: !178)
!178 = !{!179, !215, !219, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2051, !2056, !2057, !2060, !2064, !2068, !2072, !2073, !2074, !2075, !2076}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !177, file: !23, line: 329, baseType: !180, size: 960)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !97, line: 130, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !97, line: 117, size: 960, elements: !182)
!182 = !{!183, !184, !185, !187, !206, !210, !211, !212, !213, !214}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !97, line: 118, baseType: !45, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !181, file: !97, line: 118, baseType: !45, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !181, file: !97, line: 119, baseType: !186, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !181, file: !97, line: 120, baseType: !188, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !97, line: 136, size: 17600, elements: !190)
!190 = !{!191, !192, !194, !197, !201, !202, !203}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !189, file: !97, line: 137, baseType: !180, size: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !189, file: !97, line: 138, baseType: !193, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !189, file: !97, line: 139, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !97, line: 43, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !97, line: 140, baseType: !198, size: 8192, offset: 1088)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8192, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !189, file: !97, line: 141, baseType: !198, size: 8192, offset: 9280)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !189, file: !97, line: 148, baseType: !188, size: 64, offset: 17472)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !189, file: !97, line: 150, baseType: !204, size: 64, offset: 17536)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !97, line: 45, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !97, line: 121, baseType: !207, size: 528, offset: 256)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 528, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 66)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !181, file: !97, line: 126, baseType: !48, size: 16, offset: 784)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !181, file: !97, line: 127, baseType: !24, size: 32, offset: 800)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !181, file: !97, line: 128, baseType: !24, size: 32, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !181, file: !97, line: 128, baseType: !24, size: 32, offset: 864)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !181, file: !97, line: 129, baseType: !95, size: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !177, file: !23, line: 330, baseType: !216, size: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !218, line: 48, flags: DIFlagFwdDecl)
!218 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !177, file: !23, line: 332, baseType: !220, size: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !41, line: 283, size: 4096, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228, !232, !300, !1954, !1960, !1966, !1970, !1971, !1972, !1973, !1992, !1993}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !41, line: 284, baseType: !24, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !221, file: !41, line: 285, baseType: !50, size: 512, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !221, file: !41, line: 287, baseType: !50, size: 512, offset: 544)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !221, file: !41, line: 288, baseType: !57, size: 2048, offset: 1056)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !221, file: !41, line: 289, baseType: !24, size: 32, offset: 3104)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !221, file: !41, line: 292, baseType: !229, size: 64, offset: 3136)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !176}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !221, file: !41, line: 293, baseType: !233, size: 64, offset: 3200)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !176, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !23, line: 167, size: 3712, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !292, !293, !294, !295, !296, !297}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !23, line: 168, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !237, file: !23, line: 168, baseType: !236, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !237, file: !23, line: 168, baseType: !236, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !237, file: !23, line: 170, baseType: !95, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !237, file: !23, line: 172, baseType: !244, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !237, file: !23, line: 173, baseType: !50, size: 512, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !237, file: !23, line: 175, baseType: !50, size: 512, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !237, file: !23, line: 176, baseType: !24, size: 32, offset: 1344)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !237, file: !23, line: 177, baseType: !48, size: 16, offset: 1376)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !237, file: !23, line: 177, baseType: !48, size: 16, offset: 1392)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !237, file: !23, line: 178, baseType: !48, size: 16, offset: 1408)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !237, file: !23, line: 178, baseType: !48, size: 16, offset: 1424)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !237, file: !23, line: 179, baseType: !48, size: 16, offset: 1440)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !237, file: !23, line: 179, baseType: !48, size: 16, offset: 1456)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !237, file: !23, line: 180, baseType: !48, size: 16, offset: 1472)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !237, file: !23, line: 181, baseType: !48, size: 16, offset: 1488)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !237, file: !23, line: 182, baseType: !257, size: 96, offset: 1504)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 96, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 3)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !237, file: !23, line: 184, baseType: !114, size: 128, offset: 1600)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !237, file: !23, line: 184, baseType: !114, size: 128, offset: 1728)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !237, file: !23, line: 185, baseType: !236, size: 64, offset: 1856)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !237, file: !23, line: 186, baseType: !186, size: 64, offset: 1920)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !237, file: !23, line: 187, baseType: !45, size: 64, offset: 1984)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !237, file: !23, line: 188, baseType: !236, size: 64, offset: 2048)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !237, file: !23, line: 189, baseType: !114, size: 128, offset: 2112)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !237, file: !23, line: 191, baseType: !62, size: 32, offset: 2240)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !237, file: !23, line: 191, baseType: !62, size: 32, offset: 2272)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !237, file: !23, line: 192, baseType: !62, size: 32, offset: 2304)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !237, file: !23, line: 192, baseType: !62, size: 32, offset: 2336)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !237, file: !23, line: 193, baseType: !62, size: 32, offset: 2368)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !237, file: !23, line: 194, baseType: !62, size: 32, offset: 2400)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !237, file: !23, line: 194, baseType: !62, size: 32, offset: 2432)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !237, file: !23, line: 196, baseType: !24, size: 32, offset: 2464)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !237, file: !23, line: 198, baseType: !50, size: 512, offset: 2496)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !237, file: !23, line: 199, baseType: !48, size: 16, offset: 3008)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !237, file: !23, line: 199, baseType: !48, size: 16, offset: 3024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !237, file: !23, line: 200, baseType: !62, size: 32, offset: 3040)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !237, file: !23, line: 200, baseType: !62, size: 32, offset: 3072)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !237, file: !23, line: 202, baseType: !48, size: 16, offset: 3104)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !237, file: !23, line: 202, baseType: !48, size: 16, offset: 3120)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !237, file: !23, line: 203, baseType: !45, size: 64, offset: 3136)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !237, file: !23, line: 204, baseType: !284, size: 128, offset: 3200)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !285, line: 95, baseType: !286)
!285 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !285, line: 92, size: 128, elements: !287)
!287 = !{!288, !289, !290, !291}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !286, file: !285, line: 93, baseType: !62, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !286, file: !285, line: 93, baseType: !62, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !286, file: !285, line: 94, baseType: !62, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !286, file: !285, line: 94, baseType: !62, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !237, file: !23, line: 205, baseType: !284, size: 128, offset: 3328)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !237, file: !23, line: 206, baseType: !284, size: 128, offset: 3456)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !237, file: !23, line: 215, baseType: !48, size: 16, offset: 3584)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !237, file: !23, line: 215, baseType: !48, size: 16, offset: 3600)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !237, file: !23, line: 216, baseType: !24, size: 32, offset: 3616)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !237, file: !23, line: 217, baseType: !298, size: 64, offset: 3648)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !23, line: 51, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !221, file: !41, line: 294, baseType: !301, size: 64, offset: 3264)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !304, !45, !1950}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !306, line: 1216, size: 39680, elements: !307)
!306 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!307 = !{!308, !309, !310, !1256, !1337, !1338, !1339, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1366, !1578, !1581, !1824, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1846, !1847, !1848, !1849, !1850, !1858, !1924, !1931, !1932, !1939, !1942, !1943, !1944, !1945, !1946, !1947}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !305, file: !306, line: 1217, baseType: !180, size: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !305, file: !306, line: 1218, baseType: !216, size: 64, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !305, file: !306, line: 1220, baseType: !311, size: 64, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !313, line: 115, size: 11392, elements: !314)
!313 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = !{!315, !316, !317, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !334, !344, !358, !359, !400, !401, !404, !405, !421, !422, !423, !424, !425, !426, !427, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1203, !1206, !1207, !1208, !1209, !1210, !1211, !1214, !1217, !1220, !1221, !1227, !1228, !1229, !1230, !1231, !1232, !1234, !1237, !1240, !1241, !1244, !1245}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !312, file: !313, line: 116, baseType: !180, size: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !312, file: !313, line: 117, baseType: !216, size: 64, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !312, file: !313, line: 119, baseType: !318, size: 64, offset: 1024)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !313, line: 57, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !313, line: 121, baseType: !48, size: 16, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !312, file: !313, line: 121, baseType: !48, size: 16, offset: 1104)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !312, file: !313, line: 122, baseType: !24, size: 32, offset: 1120)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !312, file: !313, line: 122, baseType: !24, size: 32, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !312, file: !313, line: 122, baseType: !24, size: 32, offset: 1184)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !312, file: !313, line: 123, baseType: !50, size: 512, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !312, file: !313, line: 124, baseType: !311, size: 64, offset: 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !312, file: !313, line: 124, baseType: !311, size: 64, offset: 1792)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !312, file: !313, line: 127, baseType: !311, size: 64, offset: 1856)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !312, file: !313, line: 127, baseType: !311, size: 64, offset: 1920)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !312, file: !313, line: 127, baseType: !311, size: 64, offset: 1984)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !312, file: !313, line: 128, baseType: !332, size: 64, offset: 2048)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !218, line: 49, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !312, file: !313, line: 130, baseType: !335, size: 64, offset: 2112)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !313, line: 97, size: 832, elements: !337)
!337 = !{!338, !342, !343}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !336, file: !313, line: 98, baseType: !339, size: 768)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 768, elements: !340)
!340 = !{!341, !259}
!341 = !DISubrange(count: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !336, file: !313, line: 99, baseType: !24, size: 32, offset: 768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !336, file: !313, line: 99, baseType: !24, size: 32, offset: 800)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !312, file: !313, line: 131, baseType: !345, size: 64, offset: 2176)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !347, line: 486, size: 1600, elements: !348)
!347 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !346, file: !347, line: 487, baseType: !180, size: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !346, file: !347, line: 489, baseType: !114, size: 128, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !346, file: !347, line: 490, baseType: !114, size: 128, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !346, file: !347, line: 491, baseType: !114, size: 128, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !346, file: !347, line: 492, baseType: !114, size: 128, offset: 1344)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !346, file: !347, line: 494, baseType: !24, size: 32, offset: 1472)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !346, file: !347, line: 495, baseType: !24, size: 32, offset: 1504)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !346, file: !347, line: 497, baseType: !24, size: 32, offset: 1536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !346, file: !347, line: 498, baseType: !24, size: 32, offset: 1568)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !312, file: !313, line: 132, baseType: !345, size: 64, offset: 2240)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !312, file: !313, line: 133, baseType: !360, size: 64, offset: 2304)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !347, line: 334, size: 1728, elements: !362)
!362 = !{!363, !364, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !399}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !361, file: !347, line: 335, baseType: !114, size: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !361, file: !347, line: 336, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !347, line: 47, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !361, file: !347, line: 338, baseType: !48, size: 16, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !361, file: !347, line: 338, baseType: !48, size: 16, offset: 208)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !361, file: !347, line: 339, baseType: !10, size: 32, offset: 224)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !361, file: !347, line: 340, baseType: !24, size: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !361, file: !347, line: 342, baseType: !62, size: 32, offset: 288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !361, file: !347, line: 343, baseType: !257, size: 96, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !361, file: !347, line: 344, baseType: !257, size: 96, offset: 416)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !361, file: !347, line: 347, baseType: !114, size: 128, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !361, file: !347, line: 349, baseType: !24, size: 32, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !361, file: !347, line: 350, baseType: !24, size: 32, offset: 672)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !361, file: !347, line: 351, baseType: !45, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !361, file: !347, line: 352, baseType: !45, size: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !361, file: !347, line: 354, baseType: !380, size: 384, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !347, line: 116, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !347, line: 94, size: 384, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !381, file: !347, line: 96, baseType: !24, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !381, file: !347, line: 96, baseType: !24, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !381, file: !347, line: 97, baseType: !24, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !381, file: !347, line: 97, baseType: !24, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !381, file: !347, line: 99, baseType: !48, size: 16, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !381, file: !347, line: 100, baseType: !48, size: 16, offset: 144)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !381, file: !347, line: 102, baseType: !48, size: 16, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !381, file: !347, line: 105, baseType: !48, size: 16, offset: 176)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !381, file: !347, line: 108, baseType: !48, size: 16, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !381, file: !347, line: 109, baseType: !48, size: 16, offset: 208)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !381, file: !347, line: 111, baseType: !48, size: 16, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !381, file: !347, line: 112, baseType: !48, size: 16, offset: 240)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !381, file: !347, line: 114, baseType: !24, size: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !381, file: !347, line: 114, baseType: !24, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !381, file: !347, line: 115, baseType: !24, size: 32, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !381, file: !347, line: 115, baseType: !24, size: 32, offset: 352)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !361, file: !347, line: 355, baseType: !50, size: 512, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !313, line: 134, baseType: !45, size: 64, offset: 2368)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !312, file: !313, line: 136, baseType: !402, size: 64, offset: 2432)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !306, line: 61, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !312, file: !313, line: 138, baseType: !380, size: 384, offset: 2496)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !312, file: !313, line: 139, baseType: !406, size: 64, offset: 2880)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !347, line: 80, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !347, line: 72, size: 192, elements: !409)
!409 = !{!410, !417, !418, !419, !420}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !408, file: !347, line: 73, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !347, line: 59, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !347, line: 56, size: 128, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !413, file: !347, line: 57, baseType: !257, size: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !413, file: !347, line: 58, baseType: !24, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !408, file: !347, line: 74, baseType: !24, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !408, file: !347, line: 76, baseType: !24, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !408, file: !347, line: 77, baseType: !24, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !408, file: !347, line: 79, baseType: !24, size: 32, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !312, file: !313, line: 141, baseType: !114, size: 128, offset: 2944)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !312, file: !313, line: 142, baseType: !114, size: 128, offset: 3072)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !312, file: !313, line: 143, baseType: !114, size: 128, offset: 3200)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !312, file: !313, line: 144, baseType: !114, size: 128, offset: 3328)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !312, file: !313, line: 146, baseType: !24, size: 32, offset: 3456)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !312, file: !313, line: 147, baseType: !24, size: 32, offset: 3488)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !312, file: !313, line: 150, baseType: !428, size: 64, offset: 3520)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !218, line: 93, size: 7552, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !480, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !549, !550, !551, !552, !553, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1116}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !430, file: !218, line: 94, baseType: !180, size: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !430, file: !218, line: 95, baseType: !216, size: 64, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !430, file: !218, line: 97, baseType: !48, size: 16, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !430, file: !218, line: 97, baseType: !48, size: 16, offset: 1040)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !430, file: !218, line: 99, baseType: !62, size: 32, offset: 1056)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !430, file: !218, line: 99, baseType: !62, size: 32, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !430, file: !218, line: 99, baseType: !62, size: 32, offset: 1120)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !430, file: !218, line: 100, baseType: !62, size: 32, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !430, file: !218, line: 100, baseType: !62, size: 32, offset: 1184)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !430, file: !218, line: 100, baseType: !62, size: 32, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !430, file: !218, line: 101, baseType: !62, size: 32, offset: 1248)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !430, file: !218, line: 101, baseType: !62, size: 32, offset: 1280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !430, file: !218, line: 101, baseType: !62, size: 32, offset: 1312)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !430, file: !218, line: 102, baseType: !62, size: 32, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !430, file: !218, line: 102, baseType: !62, size: 32, offset: 1376)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !430, file: !218, line: 102, baseType: !62, size: 32, offset: 1408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !430, file: !218, line: 103, baseType: !62, size: 32, offset: 1440)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !430, file: !218, line: 103, baseType: !62, size: 32, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !430, file: !218, line: 103, baseType: !62, size: 32, offset: 1504)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !430, file: !218, line: 103, baseType: !62, size: 32, offset: 1536)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !430, file: !218, line: 103, baseType: !62, size: 32, offset: 1568)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !430, file: !218, line: 104, baseType: !62, size: 32, offset: 1600)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !430, file: !218, line: 104, baseType: !62, size: 32, offset: 1632)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !430, file: !218, line: 104, baseType: !62, size: 32, offset: 1664)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !430, file: !218, line: 104, baseType: !62, size: 32, offset: 1696)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !430, file: !218, line: 104, baseType: !62, size: 32, offset: 1728)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !430, file: !218, line: 105, baseType: !62, size: 32, offset: 1760)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !430, file: !218, line: 108, baseType: !460, size: 704, offset: 1792)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !218, line: 53, size: 704, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !460, file: !218, line: 54, baseType: !62, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !460, file: !218, line: 55, baseType: !62, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !460, file: !218, line: 56, baseType: !62, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !460, file: !218, line: 57, baseType: !62, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !460, file: !218, line: 59, baseType: !257, size: 96, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !460, file: !218, line: 60, baseType: !257, size: 96, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !460, file: !218, line: 61, baseType: !257, size: 96, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !460, file: !218, line: 63, baseType: !62, size: 32, offset: 416)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !460, file: !218, line: 64, baseType: !62, size: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !460, file: !218, line: 65, baseType: !62, size: 32, offset: 480)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !460, file: !218, line: 67, baseType: !48, size: 16, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !460, file: !218, line: 68, baseType: !48, size: 16, offset: 528)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !460, file: !218, line: 69, baseType: !48, size: 16, offset: 544)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !460, file: !218, line: 70, baseType: !48, size: 16, offset: 560)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !460, file: !218, line: 72, baseType: !62, size: 32, offset: 576)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !460, file: !218, line: 73, baseType: !62, size: 32, offset: 608)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !460, file: !218, line: 74, baseType: !62, size: 32, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !460, file: !218, line: 75, baseType: !62, size: 32, offset: 672)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !430, file: !218, line: 109, baseType: !481, size: 128, offset: 2496)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !218, line: 79, size: 128, elements: !482)
!482 = !{!483, !484, !485, !486}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !481, file: !218, line: 80, baseType: !24, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !481, file: !218, line: 81, baseType: !24, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !481, file: !218, line: 82, baseType: !24, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !481, file: !218, line: 83, baseType: !24, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !430, file: !218, line: 111, baseType: !62, size: 32, offset: 2624)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !430, file: !218, line: 111, baseType: !62, size: 32, offset: 2656)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !430, file: !218, line: 112, baseType: !62, size: 32, offset: 2688)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !430, file: !218, line: 112, baseType: !62, size: 32, offset: 2720)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !430, file: !218, line: 113, baseType: !62, size: 32, offset: 2752)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !430, file: !218, line: 114, baseType: !62, size: 32, offset: 2784)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !430, file: !218, line: 114, baseType: !62, size: 32, offset: 2816)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !430, file: !218, line: 115, baseType: !48, size: 16, offset: 2848)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !430, file: !218, line: 115, baseType: !48, size: 16, offset: 2864)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !430, file: !218, line: 116, baseType: !48, size: 16, offset: 2880)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !430, file: !218, line: 117, baseType: !51, size: 8, offset: 2896)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !430, file: !218, line: 117, baseType: !51, size: 8, offset: 2904)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !430, file: !218, line: 119, baseType: !62, size: 32, offset: 2912)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !430, file: !218, line: 119, baseType: !62, size: 32, offset: 2944)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !430, file: !218, line: 120, baseType: !48, size: 16, offset: 2976)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !430, file: !218, line: 120, baseType: !48, size: 16, offset: 2992)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !430, file: !218, line: 121, baseType: !62, size: 32, offset: 3008)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !430, file: !218, line: 121, baseType: !62, size: 32, offset: 3040)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !430, file: !218, line: 122, baseType: !62, size: 32, offset: 3072)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !430, file: !218, line: 123, baseType: !62, size: 32, offset: 3104)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !430, file: !218, line: 124, baseType: !48, size: 16, offset: 3136)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !430, file: !218, line: 125, baseType: !48, size: 16, offset: 3152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !430, file: !218, line: 127, baseType: !24, size: 32, offset: 3168)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !430, file: !218, line: 127, baseType: !24, size: 32, offset: 3200)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !430, file: !218, line: 128, baseType: !24, size: 32, offset: 3232)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !430, file: !218, line: 128, baseType: !24, size: 32, offset: 3264)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !430, file: !218, line: 129, baseType: !48, size: 16, offset: 3296)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !430, file: !218, line: 129, baseType: !48, size: 16, offset: 3312)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !430, file: !218, line: 129, baseType: !48, size: 16, offset: 3328)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !430, file: !218, line: 129, baseType: !48, size: 16, offset: 3344)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !430, file: !218, line: 130, baseType: !62, size: 32, offset: 3360)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !430, file: !218, line: 130, baseType: !62, size: 32, offset: 3392)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !430, file: !218, line: 130, baseType: !62, size: 32, offset: 3424)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !430, file: !218, line: 130, baseType: !62, size: 32, offset: 3456)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !430, file: !218, line: 131, baseType: !62, size: 32, offset: 3488)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !430, file: !218, line: 131, baseType: !62, size: 32, offset: 3520)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !430, file: !218, line: 131, baseType: !62, size: 32, offset: 3552)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !430, file: !218, line: 131, baseType: !62, size: 32, offset: 3584)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !430, file: !218, line: 132, baseType: !62, size: 32, offset: 3616)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !430, file: !218, line: 132, baseType: !62, size: 32, offset: 3648)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !430, file: !218, line: 133, baseType: !50, size: 512, offset: 3680)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !430, file: !218, line: 135, baseType: !62, size: 32, offset: 4192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !430, file: !218, line: 136, baseType: !62, size: 32, offset: 4224)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !430, file: !218, line: 137, baseType: !62, size: 32, offset: 4256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !430, file: !218, line: 138, baseType: !24, size: 32, offset: 4288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !430, file: !218, line: 141, baseType: !51, size: 8, offset: 4320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !430, file: !218, line: 141, baseType: !51, size: 8, offset: 4328)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !430, file: !218, line: 141, baseType: !51, size: 8, offset: 4336)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !430, file: !218, line: 141, baseType: !51, size: 8, offset: 4344)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !430, file: !218, line: 142, baseType: !48, size: 16, offset: 4352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !430, file: !218, line: 142, baseType: !48, size: 16, offset: 4368)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !430, file: !218, line: 142, baseType: !48, size: 16, offset: 4384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !430, file: !218, line: 145, baseType: !51, size: 8, offset: 4400)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !430, file: !218, line: 145, baseType: !51, size: 8, offset: 4408)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !430, file: !218, line: 148, baseType: !48, size: 16, offset: 4416)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !430, file: !218, line: 148, baseType: !48, size: 16, offset: 4432)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !430, file: !218, line: 149, baseType: !62, size: 32, offset: 4448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !430, file: !218, line: 149, baseType: !62, size: 32, offset: 4480)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !430, file: !218, line: 152, baseType: !546, size: 128, offset: 4512)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 4)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !430, file: !218, line: 153, baseType: !62, size: 32, offset: 4640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !430, file: !218, line: 154, baseType: !62, size: 32, offset: 4672)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !430, file: !218, line: 157, baseType: !48, size: 16, offset: 4704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !430, file: !218, line: 157, baseType: !48, size: 16, offset: 4720)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !430, file: !218, line: 160, baseType: !554, size: 64, offset: 4736)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !556, line: 113, size: 6208, elements: !557)
!556 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!557 = !{!558, !559, !560, !561, !562, !563, !567}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !555, file: !556, line: 114, baseType: !48, size: 16)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !555, file: !556, line: 114, baseType: !48, size: 16, offset: 16)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !555, file: !556, line: 115, baseType: !51, size: 8, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !555, file: !556, line: 115, baseType: !51, size: 8, offset: 40)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !555, file: !556, line: 116, baseType: !51, size: 8, offset: 48)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !555, file: !556, line: 117, baseType: !564, size: 8, offset: 56)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 1)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !555, file: !556, line: 119, baseType: !568, size: 6144, offset: 64)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 6144, elements: !578)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !556, line: 109, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !556, line: 106, size: 192, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !570, file: !556, line: 107, baseType: !62, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !570, file: !556, line: 107, baseType: !62, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !570, file: !556, line: 107, baseType: !62, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !570, file: !556, line: 107, baseType: !62, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !570, file: !556, line: 107, baseType: !62, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !570, file: !556, line: 108, baseType: !24, size: 32, offset: 160)
!578 = !{!579}
!579 = !DISubrange(count: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !430, file: !218, line: 161, baseType: !554, size: 64, offset: 4800)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !430, file: !218, line: 162, baseType: !51, size: 8, offset: 4864)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !430, file: !218, line: 162, baseType: !51, size: 8, offset: 4872)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !430, file: !218, line: 163, baseType: !51, size: 8, offset: 4880)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !430, file: !218, line: 163, baseType: !51, size: 8, offset: 4888)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !430, file: !218, line: 164, baseType: !48, size: 16, offset: 4896)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !430, file: !218, line: 164, baseType: !48, size: 16, offset: 4912)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !430, file: !218, line: 165, baseType: !62, size: 32, offset: 4928)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !430, file: !218, line: 165, baseType: !62, size: 32, offset: 4960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !430, file: !218, line: 167, baseType: !590, size: 1152, offset: 4992)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 1152, elements: !1074)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !556, line: 57, size: 2496, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !592, file: !556, line: 59, baseType: !48, size: 16)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !592, file: !556, line: 59, baseType: !48, size: 16, offset: 16)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !592, file: !556, line: 59, baseType: !48, size: 16, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !592, file: !556, line: 59, baseType: !48, size: 16, offset: 48)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !592, file: !556, line: 60, baseType: !311, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !592, file: !556, line: 61, baseType: !600, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !556, line: 202, size: 3328, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !672, !673, !674, !818, !819, !914, !915, !984, !1005, !1013, !1014}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !601, file: !556, line: 203, baseType: !180, size: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !601, file: !556, line: 204, baseType: !216, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !601, file: !556, line: 206, baseType: !62, size: 32, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !601, file: !556, line: 206, baseType: !62, size: 32, offset: 1056)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !601, file: !556, line: 207, baseType: !62, size: 32, offset: 1088)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !601, file: !556, line: 207, baseType: !62, size: 32, offset: 1120)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !601, file: !556, line: 207, baseType: !62, size: 32, offset: 1152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !601, file: !556, line: 207, baseType: !62, size: 32, offset: 1184)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !601, file: !556, line: 207, baseType: !62, size: 32, offset: 1216)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !601, file: !556, line: 207, baseType: !62, size: 32, offset: 1248)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !601, file: !556, line: 208, baseType: !62, size: 32, offset: 1280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !601, file: !556, line: 208, baseType: !62, size: 32, offset: 1312)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !601, file: !556, line: 211, baseType: !62, size: 32, offset: 1344)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !601, file: !556, line: 211, baseType: !62, size: 32, offset: 1376)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !601, file: !556, line: 211, baseType: !62, size: 32, offset: 1408)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !601, file: !556, line: 211, baseType: !62, size: 32, offset: 1440)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !601, file: !556, line: 211, baseType: !62, size: 32, offset: 1472)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !601, file: !556, line: 214, baseType: !62, size: 32, offset: 1504)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !601, file: !556, line: 214, baseType: !62, size: 32, offset: 1536)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !601, file: !556, line: 217, baseType: !62, size: 32, offset: 1568)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !601, file: !556, line: 218, baseType: !62, size: 32, offset: 1600)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !601, file: !556, line: 219, baseType: !62, size: 32, offset: 1632)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !601, file: !556, line: 220, baseType: !62, size: 32, offset: 1664)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !601, file: !556, line: 221, baseType: !62, size: 32, offset: 1696)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !601, file: !556, line: 222, baseType: !48, size: 16, offset: 1728)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !601, file: !556, line: 222, baseType: !48, size: 16, offset: 1744)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !601, file: !556, line: 224, baseType: !48, size: 16, offset: 1760)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !601, file: !556, line: 224, baseType: !48, size: 16, offset: 1776)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !601, file: !556, line: 227, baseType: !48, size: 16, offset: 1792)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !601, file: !556, line: 227, baseType: !48, size: 16, offset: 1808)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !601, file: !556, line: 229, baseType: !48, size: 16, offset: 1824)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !556, line: 229, baseType: !48, size: 16, offset: 1840)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !556, line: 230, baseType: !48, size: 16, offset: 1856)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !601, file: !556, line: 230, baseType: !48, size: 16, offset: 1872)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !601, file: !556, line: 232, baseType: !62, size: 32, offset: 1888)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !601, file: !556, line: 232, baseType: !62, size: 32, offset: 1920)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !601, file: !556, line: 232, baseType: !62, size: 32, offset: 1952)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !601, file: !556, line: 232, baseType: !62, size: 32, offset: 1984)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !601, file: !556, line: 233, baseType: !24, size: 32, offset: 2016)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !601, file: !556, line: 234, baseType: !24, size: 32, offset: 2048)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !601, file: !556, line: 235, baseType: !48, size: 16, offset: 2080)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !601, file: !556, line: 235, baseType: !48, size: 16, offset: 2096)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !601, file: !556, line: 236, baseType: !48, size: 16, offset: 2112)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !601, file: !556, line: 239, baseType: !48, size: 16, offset: 2128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !601, file: !556, line: 240, baseType: !24, size: 32, offset: 2144)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !601, file: !556, line: 241, baseType: !24, size: 32, offset: 2176)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !601, file: !556, line: 241, baseType: !24, size: 32, offset: 2208)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !601, file: !556, line: 241, baseType: !24, size: 32, offset: 2240)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !601, file: !556, line: 243, baseType: !62, size: 32, offset: 2272)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !601, file: !556, line: 243, baseType: !62, size: 32, offset: 2304)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !601, file: !556, line: 244, baseType: !62, size: 32, offset: 2336)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !601, file: !556, line: 246, baseType: !655, size: 320, offset: 2368)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !656, line: 50, size: 320, elements: !657)
!656 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !655, file: !656, line: 51, baseType: !304, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !655, file: !656, line: 53, baseType: !24, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !655, file: !656, line: 54, baseType: !24, size: 32, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !655, file: !656, line: 55, baseType: !24, size: 32, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !655, file: !656, line: 55, baseType: !24, size: 32, offset: 160)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !655, file: !656, line: 56, baseType: !51, size: 8, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !655, file: !656, line: 56, baseType: !51, size: 8, offset: 200)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !655, file: !656, line: 57, baseType: !51, size: 8, offset: 208)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !655, file: !656, line: 57, baseType: !51, size: 8, offset: 216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !655, file: !656, line: 59, baseType: !48, size: 16, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !655, file: !656, line: 59, baseType: !48, size: 16, offset: 240)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !655, file: !656, line: 59, baseType: !48, size: 16, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !655, file: !656, line: 61, baseType: !48, size: 16, offset: 272)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !655, file: !656, line: 63, baseType: !24, size: 32, offset: 288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !601, file: !556, line: 248, baseType: !176, size: 64, offset: 2688)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !601, file: !556, line: 249, baseType: !332, size: 64, offset: 2752)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !601, file: !556, line: 250, baseType: !675, size: 64, offset: 2816)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !656, line: 77, size: 15424, elements: !677)
!677 = !{!678, !679, !680, !683, !686, !689, !753, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !772, !773, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !807, !808, !812}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !676, file: !656, line: 78, baseType: !180, size: 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !676, file: !656, line: 80, baseType: !198, size: 8192, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !676, file: !656, line: 82, baseType: !681, size: 64, offset: 9152)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !656, line: 43, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !676, file: !656, line: 83, baseType: !684, size: 64, offset: 9216)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !97, line: 46, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !676, file: !656, line: 86, baseType: !687, size: 64, offset: 9280)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !656, line: 41, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !676, file: !656, line: 87, baseType: !690, size: 64, offset: 9344)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !692, line: 110, size: 1152, elements: !693)
!692 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !{!694, !695, !696, !697, !698, !699, !700, !702, !703, !704, !712, !713, !714, !715, !717, !748, !749, !750, !751}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !691, file: !692, line: 111, baseType: !690, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !691, file: !692, line: 111, baseType: !690, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !691, file: !692, line: 114, baseType: !24, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !691, file: !692, line: 114, baseType: !24, size: 32, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !691, file: !692, line: 115, baseType: !48, size: 16, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !691, file: !692, line: 115, baseType: !48, size: 16, offset: 208)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !691, file: !692, line: 118, baseType: !701, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !691, file: !692, line: 120, baseType: !163, size: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !691, file: !692, line: 122, baseType: !163, size: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !691, file: !692, line: 125, baseType: !705, size: 128, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !285, line: 89, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !285, line: 86, size: 128, elements: !707)
!707 = !{!708, !709, !710, !711}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !706, file: !285, line: 87, baseType: !24, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !706, file: !285, line: 87, baseType: !24, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !706, file: !285, line: 88, baseType: !24, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !706, file: !285, line: 88, baseType: !24, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !691, file: !692, line: 127, baseType: !24, size: 32, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !691, file: !692, line: 127, baseType: !24, size: 32, offset: 608)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !691, file: !692, line: 130, baseType: !114, size: 128, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !691, file: !692, line: 133, baseType: !716, size: 128, offset: 768)
!716 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !705)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !691, file: !692, line: 134, baseType: !718, size: 64, offset: 896)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !692, line: 108, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !692, line: 85, size: 1600, elements: !722)
!722 = !{!723, !725, !726, !730, !731, !732, !733, !734, !735, !736, !737, !740, !741, !742, !743, !744, !745, !746, !747}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !721, file: !692, line: 86, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !721, file: !692, line: 86, baseType: !724, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !721, file: !692, line: 89, baseType: !727, size: 592, offset: 128)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 592, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 74)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !721, file: !692, line: 90, baseType: !10, size: 32, offset: 736)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !721, file: !692, line: 90, baseType: !10, size: 32, offset: 768)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !721, file: !692, line: 90, baseType: !10, size: 32, offset: 800)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !721, file: !692, line: 91, baseType: !24, size: 32, offset: 832)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !721, file: !692, line: 91, baseType: !24, size: 32, offset: 864)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !721, file: !692, line: 91, baseType: !24, size: 32, offset: 896)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !721, file: !692, line: 93, baseType: !429, size: 64, offset: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !721, file: !692, line: 94, baseType: !738, size: 64, offset: 1024)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !218, line: 46, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !721, file: !692, line: 96, baseType: !163, size: 64, offset: 1088)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !721, file: !692, line: 97, baseType: !163, size: 64, offset: 1152)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !721, file: !692, line: 98, baseType: !163, size: 64, offset: 1216)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !721, file: !692, line: 99, baseType: !701, size: 64, offset: 1280)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !721, file: !692, line: 101, baseType: !24, size: 32, offset: 1344)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !721, file: !692, line: 101, baseType: !24, size: 32, offset: 1376)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !721, file: !692, line: 104, baseType: !45, size: 64, offset: 1408)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !721, file: !692, line: 106, baseType: !114, size: 128, offset: 1472)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !691, file: !692, line: 137, baseType: !24, size: 32, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !691, file: !692, line: 140, baseType: !24, size: 32, offset: 992)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !691, file: !692, line: 143, baseType: !24, size: 32, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !691, file: !692, line: 146, baseType: !752, size: 64, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !676, file: !656, line: 89, baseType: !754, size: 512, offset: 9408)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 512, elements: !755)
!755 = !{!341}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !676, file: !656, line: 90, baseType: !48, size: 16, offset: 9920)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !676, file: !656, line: 90, baseType: !48, size: 16, offset: 9936)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !676, file: !656, line: 92, baseType: !48, size: 16, offset: 9952)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !676, file: !656, line: 92, baseType: !48, size: 16, offset: 9968)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !676, file: !656, line: 93, baseType: !48, size: 16, offset: 9984)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !676, file: !656, line: 93, baseType: !48, size: 16, offset: 10000)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !676, file: !656, line: 94, baseType: !24, size: 32, offset: 10016)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !676, file: !656, line: 97, baseType: !48, size: 16, offset: 10048)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !676, file: !656, line: 97, baseType: !48, size: 16, offset: 10064)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !676, file: !656, line: 98, baseType: !48, size: 16, offset: 10080)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !676, file: !656, line: 98, baseType: !48, size: 16, offset: 10096)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !676, file: !656, line: 99, baseType: !48, size: 16, offset: 10112)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !676, file: !656, line: 99, baseType: !48, size: 16, offset: 10128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !676, file: !656, line: 100, baseType: !10, size: 32, offset: 10144)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !676, file: !656, line: 101, baseType: !771, size: 64, offset: 10176)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !676, file: !656, line: 103, baseType: !204, size: 64, offset: 10240)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !676, file: !656, line: 104, baseType: !774, size: 64, offset: 10304)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !97, line: 159, size: 448, elements: !776)
!776 = !{!777, !781, !782, !784, !785, !787}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !775, file: !97, line: 161, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 2)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !775, file: !97, line: 162, baseType: !778, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !775, file: !97, line: 163, baseType: !783, size: 32, offset: 128)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !779)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !775, file: !97, line: 164, baseType: !783, size: 32, offset: 160)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !775, file: !97, line: 165, baseType: !786, size: 128, offset: 192)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 128, elements: !779)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !775, file: !97, line: 166, baseType: !788, size: 128, offset: 320)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 128, elements: !779)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !676, file: !656, line: 107, baseType: !62, size: 32, offset: 10368)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !676, file: !656, line: 108, baseType: !24, size: 32, offset: 10400)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !676, file: !656, line: 109, baseType: !48, size: 16, offset: 10432)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !676, file: !656, line: 110, baseType: !48, size: 16, offset: 10448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !676, file: !656, line: 113, baseType: !24, size: 32, offset: 10464)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !676, file: !656, line: 113, baseType: !24, size: 32, offset: 10496)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !676, file: !656, line: 114, baseType: !51, size: 8, offset: 10528)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !676, file: !656, line: 114, baseType: !51, size: 8, offset: 10536)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !676, file: !656, line: 115, baseType: !48, size: 16, offset: 10544)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !676, file: !656, line: 116, baseType: !546, size: 128, offset: 10560)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !676, file: !656, line: 119, baseType: !62, size: 32, offset: 10688)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !676, file: !656, line: 119, baseType: !62, size: 32, offset: 10720)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !676, file: !656, line: 122, baseType: !802, size: 512, offset: 10752)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !803, line: 182, baseType: !804)
!803 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !803, line: 180, size: 512, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !803, line: 181, baseType: !50, size: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !676, file: !656, line: 123, baseType: !51, size: 8, offset: 11264)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !676, file: !656, line: 125, baseType: !809, size: 56, offset: 11272)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 56, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 7)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !676, file: !656, line: 126, baseType: !813, size: 4096, offset: 11328)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 4096, elements: !755)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !656, line: 69, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !656, line: 67, size: 512, elements: !816)
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !815, file: !656, line: 68, baseType: !50, size: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !601, file: !556, line: 251, baseType: !554, size: 64, offset: 2880)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !601, file: !556, line: 252, baseType: !820, size: 64, offset: 2944)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !556, line: 122, size: 1600, elements: !822)
!822 = !{!823, !824, !825, !896, !899, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !821, file: !556, line: 123, baseType: !311, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !821, file: !556, line: 124, baseType: !675, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !821, file: !556, line: 125, baseType: !826, size: 384, offset: 128)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 384, elements: !894)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
