; ModuleID = 'blender/source/blender/editors/space_view3d/view3d_snap.c'
source_filename = "blender/source/blender/editors/space_view3d/view3d_snap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!106 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!107 = !{!108}
!108 = !DIEnumerator(name: "TRACKING_OBJECT_CAMERA", value: 1, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 380, baseType: !5, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!111 = !DIEnumerator(name: "TRACK_HAS_BUNDLE", value: 2, isUnsigned: true)
!112 = !DIEnumerator(name: "TRACK_DISABLE_RED", value: 4, isUnsigned: true)
!113 = !DIEnumerator(name: "TRACK_DISABLE_GREEN", value: 8, isUnsigned: true)
!114 = !DIEnumerator(name: "TRACK_DISABLE_BLUE", value: 16, isUnsigned: true)
!115 = !DIEnumerator(name: "TRACK_HIDDEN", value: 32, isUnsigned: true)
!116 = !DIEnumerator(name: "TRACK_LOCKED", value: 64, isUnsigned: true)
!117 = !DIEnumerator(name: "TRACK_CUSTOMCOLOR", value: 128, isUnsigned: true)
!118 = !DIEnumerator(name: "TRACK_USE_2D_STAB", value: 256, isUnsigned: true)
!119 = !DIEnumerator(name: "TRACK_PREVIEW_GRAYSCALE", value: 512, isUnsigned: true)
!120 = !DIEnumerator(name: "TRACK_DOPE_SEL", value: 1024, isUnsigned: true)
!121 = !DIEnumerator(name: "TRACK_PREVIEW_ALPHA", value: 2048, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !123, line: 94, baseType: !5, size: 32, elements: !124)
!123 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132}
!125 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!128 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!129 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!130 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!131 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!132 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !123, line: 116, baseType: !5, size: 32, elements: !134)
!134 = !{!135, !136, !137, !138}
!135 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!136 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!137 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!138 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !123, line: 131, baseType: !5, size: 32, elements: !140)
!140 = !{!141, !142, !143, !144}
!141 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!142 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!143 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!144 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !123, line: 123, baseType: !5, size: 32, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152}
!147 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!148 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!149 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!150 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!151 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!152 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 182, baseType: !5, size: 32, elements: !154)
!154 = !{!155, !156, !157, !158, !159}
!155 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!158 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!160 = !{!161, !162, !245, !257}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !48, line: 114, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !48, line: 78, size: 2048, elements: !165)
!165 = !{!166, !237, !240, !241, !242, !244, !290, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !48, line: 79, baseType: !167, size: 960)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !168, line: 130, baseType: !169)
!168 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !168, line: 117, size: 960, elements: !170)
!170 = !{!171, !172, !173, !175, !195, !199, !201, !203, !204, !205}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !169, file: !168, line: 118, baseType: !161, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !169, file: !168, line: 118, baseType: !161, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !169, file: !168, line: 119, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !169, file: !168, line: 120, baseType: !176, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !168, line: 136, size: 17600, elements: !178)
!178 = !{!179, !180, !182, !185, !190, !191, !192}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !177, file: !168, line: 137, baseType: !167, size: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !177, file: !168, line: 138, baseType: !181, size: 64, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !177, file: !168, line: 139, baseType: !183, size: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !168, line: 43, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !168, line: 140, baseType: !186, size: 8192, offset: 1088)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 8192, elements: !188)
!187 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!188 = !{!189}
!189 = !DISubrange(count: 1024)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !177, file: !168, line: 141, baseType: !186, size: 8192, offset: 9280)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !177, file: !168, line: 148, baseType: !176, size: 64, offset: 17472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !177, file: !168, line: 150, baseType: !193, size: 64, offset: 17536)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !168, line: 45, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !168, line: 121, baseType: !196, size: 528, offset: 256)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 528, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 66)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !169, file: !168, line: 126, baseType: !200, size: 16, offset: 784)
!200 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !169, file: !168, line: 127, baseType: !202, size: 32, offset: 800)
!202 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !169, file: !168, line: 128, baseType: !202, size: 32, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !169, file: !168, line: 128, baseType: !202, size: 32, offset: 864)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !169, file: !168, line: 129, baseType: !206, size: 64, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !168, line: 75, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !168, line: 62, size: 1024, elements: !209)
!209 = !{!210, !212, !213, !214, !215, !216, !220, !221, !235, !236}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !168, line: 63, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !208, file: !168, line: 63, baseType: !211, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !168, line: 64, baseType: !187, size: 8, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !208, file: !168, line: 64, baseType: !187, size: 8, offset: 136)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !208, file: !168, line: 65, baseType: !200, size: 16, offset: 144)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !168, line: 66, baseType: !217, size: 512, offset: 160)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 512, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !208, file: !168, line: 67, baseType: !202, size: 32, offset: 672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !168, line: 69, baseType: !222, size: 256, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !168, line: 60, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !168, line: 48, size: 256, elements: !224)
!224 = !{!225, !226, !233, !234}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !223, file: !168, line: 49, baseType: !161, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !223, file: !168, line: 58, baseType: !227, size: 128, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !228, line: 71, baseType: !229)
!228 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !228, line: 69, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !229, file: !228, line: 70, baseType: !161, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !229, file: !228, line: 70, baseType: !161, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !223, file: !168, line: 59, baseType: !202, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !223, file: !168, line: 59, baseType: !202, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !208, file: !168, line: 70, baseType: !202, size: 32, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !208, file: !168, line: 74, baseType: !202, size: 32, offset: 992)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !164, file: !48, line: 80, baseType: !238, size: 64, offset: 960)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !48, line: 37, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !164, file: !48, line: 82, baseType: !227, size: 128, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !164, file: !48, line: 83, baseType: !227, size: 128, offset: 1152)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !164, file: !48, line: 84, baseType: !243, size: 64, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !164, file: !48, line: 92, baseType: !245, size: 64, offset: 1344)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !48, line: 76, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !48, line: 48, size: 2624, elements: !248)
!248 = !{!249, !251, !252, !253, !254, !255, !256, !258, !262, !263, !266, !267, !268, !269, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !48, line: 49, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !247, file: !48, line: 49, baseType: !250, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !247, file: !48, line: 50, baseType: !206, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !247, file: !48, line: 51, baseType: !250, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !247, file: !48, line: 52, baseType: !227, size: 128, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !247, file: !48, line: 53, baseType: !217, size: 512, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !247, file: !48, line: 55, baseType: !257, size: 32, offset: 896)
!257 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !247, file: !48, line: 56, baseType: !259, size: 96, offset: 928)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 96, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 3)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !247, file: !48, line: 57, baseType: !259, size: 96, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !247, file: !48, line: 58, baseType: !264, size: 288, offset: 1120)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 288, elements: !265)
!265 = !{!261, !261}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !48, line: 60, baseType: !202, size: 32, offset: 1408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !247, file: !48, line: 62, baseType: !259, size: 96, offset: 1440)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !247, file: !48, line: 63, baseType: !259, size: 96, offset: 1536)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !247, file: !48, line: 64, baseType: !270, size: 512, offset: 1632)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 512, elements: !271)
!271 = !{!272, !272}
!272 = !DISubrange(count: 4)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !247, file: !48, line: 65, baseType: !257, size: 32, offset: 2144)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !247, file: !48, line: 67, baseType: !257, size: 32, offset: 2176)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !247, file: !48, line: 67, baseType: !257, size: 32, offset: 2208)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !247, file: !48, line: 68, baseType: !257, size: 32, offset: 2240)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !247, file: !48, line: 68, baseType: !257, size: 32, offset: 2272)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !247, file: !48, line: 68, baseType: !257, size: 32, offset: 2304)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !247, file: !48, line: 69, baseType: !257, size: 32, offset: 2336)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !247, file: !48, line: 69, baseType: !257, size: 32, offset: 2368)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !247, file: !48, line: 70, baseType: !257, size: 32, offset: 2400)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !247, file: !48, line: 70, baseType: !257, size: 32, offset: 2432)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !247, file: !48, line: 72, baseType: !259, size: 96, offset: 2464)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !247, file: !48, line: 73, baseType: !202, size: 32, offset: 2560)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !247, file: !48, line: 74, baseType: !200, size: 16, offset: 2592)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !247, file: !48, line: 75, baseType: !287, size: 16, offset: 2608)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 16, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 1)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !164, file: !48, line: 93, baseType: !291, size: 64, offset: 1408)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !48, line: 93, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !164, file: !48, line: 95, baseType: !161, size: 64, offset: 1472)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !48, line: 97, baseType: !202, size: 32, offset: 1536)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !164, file: !48, line: 98, baseType: !202, size: 32, offset: 1568)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !164, file: !48, line: 99, baseType: !202, size: 32, offset: 1600)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !164, file: !48, line: 100, baseType: !202, size: 32, offset: 1632)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !164, file: !48, line: 101, baseType: !200, size: 16, offset: 1664)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !164, file: !48, line: 102, baseType: !200, size: 16, offset: 1680)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !164, file: !48, line: 104, baseType: !5, size: 32, offset: 1696)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !164, file: !48, line: 105, baseType: !5, size: 32, offset: 1728)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !164, file: !48, line: 105, baseType: !5, size: 32, offset: 1760)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !164, file: !48, line: 108, baseType: !200, size: 16, offset: 1792)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !164, file: !48, line: 108, baseType: !200, size: 16, offset: 1808)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !164, file: !48, line: 109, baseType: !200, size: 16, offset: 1824)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !164, file: !48, line: 109, baseType: !200, size: 16, offset: 1840)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !164, file: !48, line: 110, baseType: !202, size: 32, offset: 1856)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !164, file: !48, line: 110, baseType: !202, size: 32, offset: 1888)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !164, file: !48, line: 111, baseType: !202, size: 32, offset: 1920)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !164, file: !48, line: 111, baseType: !202, size: 32, offset: 1952)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !164, file: !48, line: 112, baseType: !202, size: 32, offset: 1984)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !164, file: !48, line: 112, baseType: !202, size: 32, offset: 2016)
!313 = !{i32 7, !"Dwarf Version", i32 4}
!314 = !{i32 2, !"Debug Info Version", i32 3}
!315 = !{i32 1, !"wchar_size", i32 4}
!316 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!317 = distinct !DISubprogram(name: "VIEW3D_OT_snap_selected_to_grid", scope: !1, file: !1, line: 189, type: !318, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2033)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !322, line: 568, baseType: !323)
!322 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !322, line: 508, size: 1536, elements: !324)
!324 = !{!325, !328, !329, !330, !331, !1959, !1963, !1969, !1973, !1974, !1978, !1979, !1980, !1981, !1985, !1986, !2001, !2002, !2006, !2032}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !323, file: !322, line: 509, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !323, file: !322, line: 510, baseType: !326, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !323, file: !322, line: 511, baseType: !326, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !323, file: !322, line: 512, baseType: !326, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !323, file: !322, line: 518, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!202, !335, !338}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !337, line: 44, flags: DIFlagFwdDecl)
!337 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !29, line: 328, size: 1344, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !347, !348, !349, !361, !1952, !1953, !1954, !1957, !1958}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !29, line: 329, baseType: !338, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !339, file: !29, line: 329, baseType: !338, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !339, file: !29, line: 332, baseType: !217, size: 512, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !339, file: !29, line: 333, baseType: !206, size: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !339, file: !29, line: 336, baseType: !346, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !339, file: !29, line: 337, baseType: !161, size: 64, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !339, file: !29, line: 338, baseType: !161, size: 64, offset: 832)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !339, file: !29, line: 340, baseType: !350, size: 64, offset: 896)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !337, line: 55, size: 192, elements: !352)
!352 = !{!353, !357, !360}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !351, file: !337, line: 58, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !351, file: !337, line: 56, size: 64, elements: !355)
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !337, line: 57, baseType: !161, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !351, file: !337, line: 60, baseType: !358, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !337, line: 41, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !351, file: !337, line: 61, baseType: !161, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !339, file: !29, line: 341, baseType: !362, size: 64, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !29, line: 106, size: 320, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !363, file: !29, line: 107, baseType: !227, size: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !363, file: !29, line: 108, baseType: !202, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !363, file: !29, line: 109, baseType: !202, size: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !363, file: !29, line: 110, baseType: !202, size: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !363, file: !29, line: 110, baseType: !202, size: 32, offset: 224)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !363, file: !29, line: 111, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !322, line: 490, size: 768, elements: !373)
!373 = !{!374, !375, !376, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !322, line: 491, baseType: !371, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !372, file: !322, line: 491, baseType: !371, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !372, file: !322, line: 493, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !29, line: 169, size: 2048, elements: !379)
!379 = !{!380, !381, !382, !383, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1918, !1921, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !29, line: 170, baseType: !377, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !378, file: !29, line: 170, baseType: !377, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !378, file: !29, line: 172, baseType: !161, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !378, file: !29, line: 174, baseType: !384, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !386, line: 49, size: 1984, elements: !387)
!386 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!387 = !{!388, !389, !390, !391, !392, !393, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !385, file: !386, line: 50, baseType: !167, size: 960)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !385, file: !386, line: 52, baseType: !227, size: 128, offset: 960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !385, file: !386, line: 53, baseType: !227, size: 128, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !385, file: !386, line: 54, baseType: !227, size: 128, offset: 1216)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !385, file: !386, line: 55, baseType: !227, size: 128, offset: 1344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !385, file: !386, line: 57, baseType: !394, size: 64, offset: 1472)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !396, line: 1216, size: 39680, elements: !397)
!396 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!397 = !{!398, !399, !400, !683, !686, !687, !688, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !712, !783, !1210, !1426, !1429, !1717, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1739, !1740, !1741, !1742, !1743, !1751, !1818, !1825, !1826, !1833, !1834, !1835, !1836, !1837, !1838, !1839}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !395, file: !396, line: 1217, baseType: !167, size: 960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !395, file: !396, line: 1218, baseType: !238, size: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !395, file: !396, line: 1220, baseType: !401, size: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !4, line: 115, size: 11392, elements: !403)
!403 = !{!404, !405, !406, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !424, !434, !447, !448, !489, !490, !493, !494, !510, !511, !512, !513, !514, !515, !516, !520, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !598, !599, !600, !601, !602, !603, !604, !605, !606, !609, !612, !615, !616, !617, !618, !619, !622, !625, !628, !629, !635, !636, !637, !638, !639, !640, !641, !644, !647, !651, !671, !672}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !402, file: !4, line: 116, baseType: !167, size: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !402, file: !4, line: 117, baseType: !238, size: 64, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !402, file: !4, line: 119, baseType: !407, size: 64, offset: 1024)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !4, line: 57, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !402, file: !4, line: 121, baseType: !200, size: 16, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !402, file: !4, line: 121, baseType: !200, size: 16, offset: 1104)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !402, file: !4, line: 122, baseType: !202, size: 32, offset: 1120)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !402, file: !4, line: 122, baseType: !202, size: 32, offset: 1152)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !402, file: !4, line: 122, baseType: !202, size: 32, offset: 1184)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !402, file: !4, line: 123, baseType: !217, size: 512, offset: 1216)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !402, file: !4, line: 124, baseType: !401, size: 64, offset: 1728)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !402, file: !4, line: 124, baseType: !401, size: 64, offset: 1792)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !402, file: !4, line: 127, baseType: !401, size: 64, offset: 1856)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !402, file: !4, line: 127, baseType: !401, size: 64, offset: 1920)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !402, file: !4, line: 127, baseType: !401, size: 64, offset: 1984)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !402, file: !4, line: 128, baseType: !421, size: 64, offset: 2048)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !423, line: 44, flags: DIFlagFwdDecl)
!423 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !402, file: !4, line: 130, baseType: !425, size: 64, offset: 2112)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !4, line: 97, size: 832, elements: !427)
!427 = !{!428, !432, !433}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !426, file: !4, line: 98, baseType: !429, size: 768)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 768, elements: !430)
!430 = !{!431, !261}
!431 = !DISubrange(count: 8)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !426, file: !4, line: 99, baseType: !202, size: 32, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !426, file: !4, line: 99, baseType: !202, size: 32, offset: 800)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !402, file: !4, line: 131, baseType: !435, size: 64, offset: 2176)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !90, line: 486, size: 1600, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !436, file: !90, line: 487, baseType: !167, size: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !436, file: !90, line: 489, baseType: !227, size: 128, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !436, file: !90, line: 490, baseType: !227, size: 128, offset: 1088)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !436, file: !90, line: 491, baseType: !227, size: 128, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !436, file: !90, line: 492, baseType: !227, size: 128, offset: 1344)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !90, line: 494, baseType: !202, size: 32, offset: 1472)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !436, file: !90, line: 495, baseType: !202, size: 32, offset: 1504)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !436, file: !90, line: 497, baseType: !202, size: 32, offset: 1536)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !436, file: !90, line: 498, baseType: !202, size: 32, offset: 1568)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !402, file: !4, line: 132, baseType: !435, size: 64, offset: 2240)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !402, file: !4, line: 133, baseType: !449, size: 64, offset: 2304)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !90, line: 334, size: 1728, elements: !451)
!451 = !{!452, !453, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !488}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !450, file: !90, line: 335, baseType: !227, size: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !450, file: !90, line: 336, baseType: !454, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !423, line: 51, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !450, file: !90, line: 338, baseType: !200, size: 16, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !450, file: !90, line: 338, baseType: !200, size: 16, offset: 208)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !450, file: !90, line: 339, baseType: !5, size: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !450, file: !90, line: 340, baseType: !202, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !450, file: !90, line: 342, baseType: !257, size: 32, offset: 288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !450, file: !90, line: 343, baseType: !259, size: 96, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !450, file: !90, line: 344, baseType: !259, size: 96, offset: 416)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !450, file: !90, line: 347, baseType: !227, size: 128, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !450, file: !90, line: 349, baseType: !202, size: 32, offset: 640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !450, file: !90, line: 350, baseType: !202, size: 32, offset: 672)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !450, file: !90, line: 351, baseType: !161, size: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !450, file: !90, line: 352, baseType: !161, size: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !450, file: !90, line: 354, baseType: !469, size: 384, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !90, line: 116, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !90, line: 94, size: 384, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !470, file: !90, line: 96, baseType: !202, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !470, file: !90, line: 96, baseType: !202, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !470, file: !90, line: 97, baseType: !202, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !470, file: !90, line: 97, baseType: !202, size: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !470, file: !90, line: 99, baseType: !200, size: 16, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !470, file: !90, line: 100, baseType: !200, size: 16, offset: 144)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !470, file: !90, line: 102, baseType: !200, size: 16, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !470, file: !90, line: 105, baseType: !200, size: 16, offset: 176)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !470, file: !90, line: 108, baseType: !200, size: 16, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !470, file: !90, line: 109, baseType: !200, size: 16, offset: 208)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !470, file: !90, line: 111, baseType: !200, size: 16, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !470, file: !90, line: 112, baseType: !200, size: 16, offset: 240)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !470, file: !90, line: 114, baseType: !202, size: 32, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !470, file: !90, line: 114, baseType: !202, size: 32, offset: 288)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !470, file: !90, line: 115, baseType: !202, size: 32, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !470, file: !90, line: 115, baseType: !202, size: 32, offset: 352)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !450, file: !90, line: 355, baseType: !217, size: 512, offset: 1216)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !402, file: !4, line: 134, baseType: !161, size: 64, offset: 2368)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !402, file: !4, line: 136, baseType: !491, size: 64, offset: 2432)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 58, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !402, file: !4, line: 138, baseType: !469, size: 384, offset: 2496)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !402, file: !4, line: 139, baseType: !495, size: 64, offset: 2880)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !90, line: 80, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !90, line: 72, size: 192, elements: !498)
!498 = !{!499, !506, !507, !508, !509}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !497, file: !90, line: 73, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !90, line: 59, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !90, line: 56, size: 128, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !502, file: !90, line: 57, baseType: !259, size: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !502, file: !90, line: 58, baseType: !202, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !497, file: !90, line: 74, baseType: !202, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !497, file: !90, line: 76, baseType: !202, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !497, file: !90, line: 77, baseType: !202, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !497, file: !90, line: 79, baseType: !202, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !402, file: !4, line: 141, baseType: !227, size: 128, offset: 2944)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !402, file: !4, line: 142, baseType: !227, size: 128, offset: 3072)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !402, file: !4, line: 143, baseType: !227, size: 128, offset: 3200)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !402, file: !4, line: 144, baseType: !227, size: 128, offset: 3328)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !402, file: !4, line: 146, baseType: !202, size: 32, offset: 3456)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !402, file: !4, line: 147, baseType: !202, size: 32, offset: 3488)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !402, file: !4, line: 150, baseType: !517, size: 64, offset: 3520)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !423, line: 46, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !402, file: !4, line: 151, baseType: !521, size: 64, offset: 3584)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !402, file: !4, line: 152, baseType: !202, size: 32, offset: 3648)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !402, file: !4, line: 153, baseType: !202, size: 32, offset: 3680)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !402, file: !4, line: 156, baseType: !259, size: 96, offset: 3712)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !402, file: !4, line: 156, baseType: !259, size: 96, offset: 3808)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !402, file: !4, line: 156, baseType: !259, size: 96, offset: 3904)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !402, file: !4, line: 157, baseType: !259, size: 96, offset: 4000)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !402, file: !4, line: 158, baseType: !259, size: 96, offset: 4096)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !402, file: !4, line: 159, baseType: !259, size: 96, offset: 4192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !402, file: !4, line: 160, baseType: !259, size: 96, offset: 4288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !402, file: !4, line: 160, baseType: !259, size: 96, offset: 4384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !402, file: !4, line: 161, baseType: !533, size: 128, offset: 4480)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 128, elements: !534)
!534 = !{!272}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !402, file: !4, line: 161, baseType: !533, size: 128, offset: 4608)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !402, file: !4, line: 162, baseType: !259, size: 96, offset: 4736)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !402, file: !4, line: 162, baseType: !259, size: 96, offset: 4832)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !402, file: !4, line: 163, baseType: !257, size: 32, offset: 4928)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !402, file: !4, line: 163, baseType: !257, size: 32, offset: 4960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !402, file: !4, line: 164, baseType: !270, size: 512, offset: 4992)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !402, file: !4, line: 165, baseType: !270, size: 512, offset: 5504)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !402, file: !4, line: 166, baseType: !270, size: 512, offset: 6016)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !402, file: !4, line: 167, baseType: !270, size: 512, offset: 6528)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !402, file: !4, line: 176, baseType: !270, size: 512, offset: 7040)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !402, file: !4, line: 178, baseType: !5, size: 32, offset: 7552)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !4, line: 180, baseType: !200, size: 16, offset: 7584)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !402, file: !4, line: 181, baseType: !200, size: 16, offset: 7600)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !402, file: !4, line: 183, baseType: !200, size: 16, offset: 7616)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !402, file: !4, line: 183, baseType: !200, size: 16, offset: 7632)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !402, file: !4, line: 184, baseType: !200, size: 16, offset: 7648)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !402, file: !4, line: 184, baseType: !200, size: 16, offset: 7664)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !402, file: !4, line: 185, baseType: !200, size: 16, offset: 7680)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !402, file: !4, line: 186, baseType: !200, size: 16, offset: 7696)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !402, file: !4, line: 187, baseType: !200, size: 16, offset: 7712)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !402, file: !4, line: 188, baseType: !187, size: 8, offset: 7728)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !402, file: !4, line: 189, baseType: !187, size: 8, offset: 7736)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !402, file: !4, line: 192, baseType: !202, size: 32, offset: 7744)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !402, file: !4, line: 192, baseType: !202, size: 32, offset: 7776)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !402, file: !4, line: 192, baseType: !202, size: 32, offset: 7808)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !402, file: !4, line: 192, baseType: !202, size: 32, offset: 7840)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !4, line: 194, baseType: !202, size: 32, offset: 7872)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !402, file: !4, line: 202, baseType: !257, size: 32, offset: 7904)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !402, file: !4, line: 202, baseType: !257, size: 32, offset: 7936)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !402, file: !4, line: 202, baseType: !257, size: 32, offset: 7968)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !402, file: !4, line: 211, baseType: !257, size: 32, offset: 8000)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !402, file: !4, line: 212, baseType: !257, size: 32, offset: 8032)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !402, file: !4, line: 213, baseType: !257, size: 32, offset: 8064)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !402, file: !4, line: 214, baseType: !257, size: 32, offset: 8096)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !402, file: !4, line: 215, baseType: !257, size: 32, offset: 8128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !402, file: !4, line: 216, baseType: !257, size: 32, offset: 8160)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !402, file: !4, line: 219, baseType: !257, size: 32, offset: 8192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !402, file: !4, line: 220, baseType: !257, size: 32, offset: 8224)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !402, file: !4, line: 221, baseType: !257, size: 32, offset: 8256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !402, file: !4, line: 224, baseType: !575, size: 16, offset: 8288)
!575 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !402, file: !4, line: 224, baseType: !575, size: 16, offset: 8304)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !402, file: !4, line: 226, baseType: !200, size: 16, offset: 8320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !402, file: !4, line: 228, baseType: !187, size: 8, offset: 8336)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !402, file: !4, line: 229, baseType: !187, size: 8, offset: 8344)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !402, file: !4, line: 231, baseType: !200, size: 16, offset: 8352)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !402, file: !4, line: 232, baseType: !187, size: 8, offset: 8368)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !402, file: !4, line: 233, baseType: !187, size: 8, offset: 8376)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !402, file: !4, line: 234, baseType: !257, size: 32, offset: 8384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !402, file: !4, line: 235, baseType: !257, size: 32, offset: 8416)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !402, file: !4, line: 237, baseType: !227, size: 128, offset: 8448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !402, file: !4, line: 238, baseType: !227, size: 128, offset: 8576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !402, file: !4, line: 239, baseType: !227, size: 128, offset: 8704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !402, file: !4, line: 240, baseType: !227, size: 128, offset: 8832)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !402, file: !4, line: 242, baseType: !257, size: 32, offset: 8960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !402, file: !4, line: 244, baseType: !200, size: 16, offset: 8992)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !402, file: !4, line: 245, baseType: !575, size: 16, offset: 9008)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !402, file: !4, line: 246, baseType: !533, size: 128, offset: 9024)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !402, file: !4, line: 248, baseType: !202, size: 32, offset: 9152)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !402, file: !4, line: 249, baseType: !202, size: 32, offset: 9184)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !402, file: !4, line: 251, baseType: !596, size: 64, offset: 9216)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !4, line: 251, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !402, file: !4, line: 253, baseType: !187, size: 8, offset: 9280)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !402, file: !4, line: 254, baseType: !187, size: 8, offset: 9288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !402, file: !4, line: 255, baseType: !200, size: 16, offset: 9296)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !402, file: !4, line: 256, baseType: !259, size: 96, offset: 9312)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !402, file: !4, line: 258, baseType: !227, size: 128, offset: 9408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !402, file: !4, line: 259, baseType: !227, size: 128, offset: 9536)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !402, file: !4, line: 260, baseType: !227, size: 128, offset: 9664)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !402, file: !4, line: 261, baseType: !227, size: 128, offset: 9792)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !402, file: !4, line: 263, baseType: !607, size: 64, offset: 9920)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !4, line: 52, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !402, file: !4, line: 264, baseType: !610, size: 64, offset: 9984)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !4, line: 53, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !402, file: !4, line: 265, baseType: !613, size: 64, offset: 10048)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !90, line: 46, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !402, file: !4, line: 267, baseType: !187, size: 8, offset: 10112)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !402, file: !4, line: 268, baseType: !187, size: 8, offset: 10120)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !402, file: !4, line: 269, baseType: !200, size: 16, offset: 10128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !402, file: !4, line: 270, baseType: !257, size: 32, offset: 10144)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !402, file: !4, line: 272, baseType: !620, size: 64, offset: 10176)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !4, line: 54, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !402, file: !4, line: 275, baseType: !623, size: 64, offset: 10240)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !4, line: 275, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !402, file: !4, line: 277, baseType: !626, size: 64, offset: 10304)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 56, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !402, file: !4, line: 277, baseType: !626, size: 64, offset: 10368)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !402, file: !4, line: 278, baseType: !630, size: 64, offset: 10432)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !631, line: 27, baseType: !632)
!631 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !633, line: 45, baseType: !634)
!633 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!634 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !402, file: !4, line: 279, baseType: !630, size: 64, offset: 10496)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !402, file: !4, line: 280, baseType: !5, size: 32, offset: 10560)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !402, file: !4, line: 281, baseType: !5, size: 32, offset: 10592)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !402, file: !4, line: 283, baseType: !227, size: 128, offset: 10624)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !402, file: !4, line: 284, baseType: !227, size: 128, offset: 10752)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !402, file: !4, line: 285, baseType: !243, size: 64, offset: 10880)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !402, file: !4, line: 287, baseType: !642, size: 64, offset: 10944)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !4, line: 59, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !402, file: !4, line: 288, baseType: !645, size: 64, offset: 11008)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !4, line: 288, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !402, file: !4, line: 290, baseType: !648, size: 64, offset: 11072)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 64, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 2)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !402, file: !4, line: 291, baseType: !652, size: 64, offset: 11136)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !654, line: 65, baseType: !655)
!654 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !654, line: 50, size: 320, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !655, file: !654, line: 51, baseType: !394, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !655, file: !654, line: 53, baseType: !202, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !655, file: !654, line: 54, baseType: !202, size: 32, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !655, file: !654, line: 55, baseType: !202, size: 32, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !655, file: !654, line: 55, baseType: !202, size: 32, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !655, file: !654, line: 56, baseType: !187, size: 8, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !655, file: !654, line: 56, baseType: !187, size: 8, offset: 200)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !655, file: !654, line: 57, baseType: !187, size: 8, offset: 208)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !655, file: !654, line: 57, baseType: !187, size: 8, offset: 216)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !655, file: !654, line: 59, baseType: !200, size: 16, offset: 224)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !655, file: !654, line: 59, baseType: !200, size: 16, offset: 240)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !655, file: !654, line: 59, baseType: !200, size: 16, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !655, file: !654, line: 61, baseType: !200, size: 16, offset: 272)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !655, file: !654, line: 63, baseType: !202, size: 32, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !402, file: !4, line: 293, baseType: !227, size: 128, offset: 11200)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !402, file: !4, line: 294, baseType: !673, size: 64, offset: 11328)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !4, line: 113, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !4, line: 108, size: 256, elements: !676)
!676 = !{!677, !679, !680, !681, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !4, line: 109, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !675, file: !4, line: 109, baseType: !678, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !675, file: !4, line: 110, baseType: !401, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !675, file: !4, line: 111, baseType: !202, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !675, file: !4, line: 112, baseType: !257, size: 32, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !395, file: !396, line: 1221, baseType: !684, size: 64, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !396, line: 52, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !395, file: !396, line: 1223, baseType: !394, size: 64, offset: 1152)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !395, file: !396, line: 1225, baseType: !227, size: 128, offset: 1216)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !395, file: !396, line: 1226, baseType: !689, size: 64, offset: 1344)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !396, line: 69, size: 320, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !690, file: !396, line: 70, baseType: !689, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !690, file: !396, line: 70, baseType: !689, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !690, file: !396, line: 71, baseType: !5, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !690, file: !396, line: 71, baseType: !5, size: 32, offset: 160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !690, file: !396, line: 72, baseType: !202, size: 32, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !690, file: !396, line: 73, baseType: !200, size: 16, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !690, file: !396, line: 73, baseType: !200, size: 16, offset: 240)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !690, file: !396, line: 74, baseType: !401, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !395, file: !396, line: 1227, baseType: !401, size: 64, offset: 1408)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !395, file: !396, line: 1229, baseType: !259, size: 96, offset: 1472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !395, file: !396, line: 1230, baseType: !259, size: 96, offset: 1568)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !395, file: !396, line: 1231, baseType: !259, size: 96, offset: 1664)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !395, file: !396, line: 1231, baseType: !259, size: 96, offset: 1760)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !395, file: !396, line: 1233, baseType: !5, size: 32, offset: 1856)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !395, file: !396, line: 1234, baseType: !202, size: 32, offset: 1888)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !395, file: !396, line: 1235, baseType: !5, size: 32, offset: 1920)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !395, file: !396, line: 1237, baseType: !200, size: 16, offset: 1952)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !395, file: !396, line: 1239, baseType: !187, size: 8, offset: 1968)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !395, file: !396, line: 1240, baseType: !711, size: 8, offset: 1976)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 8, elements: !288)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !395, file: !396, line: 1242, baseType: !713, size: 64, offset: 1984)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !715, line: 328, size: 3456, elements: !716)
!715 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!716 = !{!717, !718, !719, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !749, !750, !751, !754, !759, !760, !763, !767, !771, !775, !779, !780, !781, !782}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !714, file: !715, line: 329, baseType: !167, size: 960)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !714, file: !715, line: 330, baseType: !238, size: 64, offset: 960)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !714, file: !715, line: 332, baseType: !720, size: 64, offset: 1024)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !715, line: 332, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !714, file: !715, line: 333, baseType: !217, size: 512, offset: 1088)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !714, file: !715, line: 335, baseType: !358, size: 64, offset: 1600)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !714, file: !715, line: 337, baseType: !491, size: 64, offset: 1664)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !714, file: !715, line: 338, baseType: !648, size: 64, offset: 1728)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !714, file: !715, line: 340, baseType: !227, size: 128, offset: 1792)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !714, file: !715, line: 340, baseType: !227, size: 128, offset: 1920)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !714, file: !715, line: 342, baseType: !202, size: 32, offset: 2048)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !714, file: !715, line: 342, baseType: !202, size: 32, offset: 2080)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !714, file: !715, line: 343, baseType: !202, size: 32, offset: 2112)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !714, file: !715, line: 345, baseType: !202, size: 32, offset: 2144)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !714, file: !715, line: 346, baseType: !202, size: 32, offset: 2176)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !714, file: !715, line: 347, baseType: !200, size: 16, offset: 2208)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !714, file: !715, line: 348, baseType: !200, size: 16, offset: 2224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !714, file: !715, line: 349, baseType: !202, size: 32, offset: 2240)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !714, file: !715, line: 351, baseType: !202, size: 32, offset: 2272)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !714, file: !715, line: 353, baseType: !200, size: 16, offset: 2304)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !714, file: !715, line: 354, baseType: !200, size: 16, offset: 2320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !714, file: !715, line: 355, baseType: !202, size: 32, offset: 2336)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !714, file: !715, line: 357, baseType: !741, size: 128, offset: 2368)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !742, line: 95, baseType: !743)
!742 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !742, line: 92, size: 128, elements: !744)
!744 = !{!745, !746, !747, !748}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !743, file: !742, line: 93, baseType: !257, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !743, file: !742, line: 93, baseType: !257, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !743, file: !742, line: 94, baseType: !257, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !743, file: !742, line: 94, baseType: !257, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !714, file: !715, line: 363, baseType: !227, size: 128, offset: 2496)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !714, file: !715, line: 363, baseType: !227, size: 128, offset: 2624)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !714, file: !715, line: 368, baseType: !752, size: 64, offset: 2752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !715, line: 48, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !714, file: !715, line: 372, baseType: !755, size: 32, offset: 2816)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !715, line: 274, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !715, line: 271, size: 32, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !756, file: !715, line: 273, baseType: !5, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !714, file: !715, line: 373, baseType: !202, size: 32, offset: 2848)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !714, file: !715, line: 382, baseType: !761, size: 64, offset: 2880)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !715, line: 46, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !714, file: !715, line: 385, baseType: !764, size: 64, offset: 2944)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !161, !257}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !714, file: !715, line: 386, baseType: !768, size: 64, offset: 3008)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !161, !521}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !714, file: !715, line: 387, baseType: !772, size: 64, offset: 3072)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!202, !161}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !714, file: !715, line: 388, baseType: !776, size: 64, offset: 3136)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !161}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !714, file: !715, line: 389, baseType: !161, size: 64, offset: 3200)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !714, file: !715, line: 389, baseType: !161, size: 64, offset: 3264)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !714, file: !715, line: 389, baseType: !161, size: 64, offset: 3328)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !714, file: !715, line: 389, baseType: !161, size: 64, offset: 3392)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !395, file: !396, line: 1244, baseType: !784, size: 64, offset: 2048)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !786, line: 200, size: 17024, elements: !787)
!786 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!787 = !{!788, !789, !790, !791, !1203, !1204, !1205, !1206, !1207, !1208, !1209}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !785, file: !786, line: 201, baseType: !243, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !785, file: !786, line: 202, baseType: !227, size: 128, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !785, file: !786, line: 203, baseType: !227, size: 128, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !785, file: !786, line: 206, baseType: !792, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !786, line: 190, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !786, line: 126, size: 2816, elements: !795)
!795 = !{!796, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !894, !895, !896, !897, !1174, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1202}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !794, file: !786, line: 127, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !794, file: !786, line: 127, baseType: !797, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !794, file: !786, line: 128, baseType: !161, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !794, file: !786, line: 129, baseType: !161, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !794, file: !786, line: 130, baseType: !217, size: 512, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !794, file: !786, line: 132, baseType: !202, size: 32, offset: 768)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !794, file: !786, line: 132, baseType: !202, size: 32, offset: 800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !794, file: !786, line: 133, baseType: !202, size: 32, offset: 832)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !794, file: !786, line: 134, baseType: !202, size: 32, offset: 864)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !794, file: !786, line: 134, baseType: !202, size: 32, offset: 896)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !794, file: !786, line: 134, baseType: !202, size: 32, offset: 928)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !794, file: !786, line: 135, baseType: !202, size: 32, offset: 960)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !794, file: !786, line: 135, baseType: !202, size: 32, offset: 992)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !794, file: !786, line: 136, baseType: !202, size: 32, offset: 1024)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !794, file: !786, line: 136, baseType: !202, size: 32, offset: 1056)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !794, file: !786, line: 137, baseType: !202, size: 32, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !794, file: !786, line: 137, baseType: !202, size: 32, offset: 1120)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !794, file: !786, line: 138, baseType: !257, size: 32, offset: 1152)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !794, file: !786, line: 139, baseType: !257, size: 32, offset: 1184)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !794, file: !786, line: 139, baseType: !257, size: 32, offset: 1216)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !794, file: !786, line: 141, baseType: !200, size: 16, offset: 1248)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !794, file: !786, line: 142, baseType: !200, size: 16, offset: 1264)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !794, file: !786, line: 143, baseType: !202, size: 32, offset: 1280)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !794, file: !786, line: 144, baseType: !202, size: 32, offset: 1312)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !794, file: !786, line: 146, baseType: !822, size: 64, offset: 1344)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !786, line: 114, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !786, line: 99, size: 7232, elements: !825)
!825 = !{!826, !828, !829, !830, !831, !832, !833, !844, !848, !862, !871, !878, !888}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !824, file: !786, line: 100, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !824, file: !786, line: 100, baseType: !827, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !824, file: !786, line: 101, baseType: !202, size: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !824, file: !786, line: 101, baseType: !202, size: 32, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !824, file: !786, line: 102, baseType: !202, size: 32, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !824, file: !786, line: 102, baseType: !202, size: 32, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !824, file: !786, line: 103, baseType: !834, size: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !786, line: 59, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !786, line: 56, size: 2112, elements: !837)
!837 = !{!838, !842, !843}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !836, file: !786, line: 57, baseType: !839, size: 2048)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 2048, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !836, file: !786, line: 58, baseType: !202, size: 32, offset: 2048)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !836, file: !786, line: 58, baseType: !202, size: 32, offset: 2080)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !824, file: !786, line: 106, baseType: !845, size: 6144, offset: 320)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 6144, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 768)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !824, file: !786, line: 107, baseType: !849, size: 64, offset: 6464)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !786, line: 97, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !786, line: 83, size: 8320, elements: !852)
!852 = !{!853, !854, !855, !858, !859, !860, !861}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !851, file: !786, line: 84, baseType: !845, size: 6144)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !851, file: !786, line: 87, baseType: !839, size: 2048, offset: 6144)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !851, file: !786, line: 88, baseType: !856, size: 64, offset: 8192)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !654, line: 41, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !851, file: !786, line: 90, baseType: !200, size: 16, offset: 8256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !851, file: !786, line: 92, baseType: !200, size: 16, offset: 8272)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !851, file: !786, line: 93, baseType: !200, size: 16, offset: 8288)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !851, file: !786, line: 95, baseType: !200, size: 16, offset: 8304)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !824, file: !786, line: 108, baseType: !863, size: 64, offset: 6528)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !786, line: 66, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !786, line: 61, size: 128, elements: !866)
!866 = !{!867, !868, !869, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !865, file: !786, line: 62, baseType: !202, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !865, file: !786, line: 63, baseType: !202, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !865, file: !786, line: 64, baseType: !202, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !865, file: !786, line: 65, baseType: !202, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !824, file: !786, line: 109, baseType: !872, size: 64, offset: 6592)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !786, line: 71, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !786, line: 68, size: 64, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !874, file: !786, line: 69, baseType: !202, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !874, file: !786, line: 70, baseType: !202, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !824, file: !786, line: 110, baseType: !879, size: 64, offset: 6656)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !786, line: 81, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !786, line: 73, size: 352, elements: !882)
!882 = !{!883, !884, !885, !886, !887}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !881, file: !786, line: 74, baseType: !259, size: 96)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !881, file: !786, line: 75, baseType: !259, size: 96, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !881, file: !786, line: 76, baseType: !259, size: 96, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !881, file: !786, line: 77, baseType: !202, size: 32, offset: 288)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !881, file: !786, line: 78, baseType: !202, size: 32, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !824, file: !786, line: 113, baseType: !889, size: 512, offset: 6720)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !890, line: 182, baseType: !891)
!890 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !890, line: 180, size: 512, elements: !892)
!892 = !{!893}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !891, file: !890, line: 181, baseType: !217, size: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !794, file: !786, line: 148, baseType: !421, size: 64, offset: 1408)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !794, file: !786, line: 151, baseType: !394, size: 64, offset: 1472)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !794, file: !786, line: 152, baseType: !401, size: 64, offset: 1536)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !794, file: !786, line: 153, baseType: !898, size: 64, offset: 1600)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !900, line: 64, size: 19136, elements: !901)
!900 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!901 = !{!902, !903, !904, !905, !906, !907, !909, !910, !911, !912, !915, !916, !1160, !1161, !1169, !1170, !1171, !1172, !1173}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !899, file: !900, line: 65, baseType: !167, size: 960)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !899, file: !900, line: 66, baseType: !238, size: 64, offset: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !899, file: !900, line: 68, baseType: !186, size: 8192, offset: 1024)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !899, file: !900, line: 70, baseType: !202, size: 32, offset: 9216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !899, file: !900, line: 71, baseType: !202, size: 32, offset: 9248)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !899, file: !900, line: 72, baseType: !908, size: 64, offset: 9280)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !649)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !899, file: !900, line: 74, baseType: !257, size: 32, offset: 9344)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !899, file: !900, line: 74, baseType: !257, size: 32, offset: 9376)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !899, file: !900, line: 76, baseType: !856, size: 64, offset: 9408)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !899, file: !900, line: 77, baseType: !913, size: 64, offset: 9472)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !900, line: 77, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !899, file: !900, line: 78, baseType: !491, size: 64, offset: 9536)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !899, file: !900, line: 80, baseType: !917, size: 2624, offset: 9600)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !106, line: 340, size: 2624, elements: !918)
!918 = !{!919, !947, !965, !966, !967, !982, !1040, !1041, !1140, !1141, !1142, !1143, !1149}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !917, file: !106, line: 341, baseType: !920, size: 576)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !106, line: 251, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !106, line: 207, size: 576, elements: !922)
!922 = !{!923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !921, file: !106, line: 208, baseType: !202, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !921, file: !106, line: 211, baseType: !200, size: 16, offset: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !921, file: !106, line: 212, baseType: !200, size: 16, offset: 48)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !921, file: !106, line: 213, baseType: !257, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !921, file: !106, line: 214, baseType: !200, size: 16, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !921, file: !106, line: 215, baseType: !200, size: 16, offset: 112)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !921, file: !106, line: 216, baseType: !200, size: 16, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !921, file: !106, line: 217, baseType: !200, size: 16, offset: 144)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !921, file: !106, line: 218, baseType: !200, size: 16, offset: 160)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !921, file: !106, line: 219, baseType: !200, size: 16, offset: 176)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !921, file: !106, line: 220, baseType: !257, size: 32, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !921, file: !106, line: 222, baseType: !200, size: 16, offset: 224)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !921, file: !106, line: 225, baseType: !200, size: 16, offset: 240)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !921, file: !106, line: 228, baseType: !202, size: 32, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !921, file: !106, line: 229, baseType: !202, size: 32, offset: 288)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !921, file: !106, line: 233, baseType: !202, size: 32, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !921, file: !106, line: 236, baseType: !200, size: 16, offset: 352)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !921, file: !106, line: 236, baseType: !200, size: 16, offset: 368)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !921, file: !106, line: 241, baseType: !257, size: 32, offset: 384)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !921, file: !106, line: 244, baseType: !202, size: 32, offset: 416)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !921, file: !106, line: 244, baseType: !202, size: 32, offset: 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !921, file: !106, line: 245, baseType: !257, size: 32, offset: 480)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !921, file: !106, line: 248, baseType: !257, size: 32, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !921, file: !106, line: 250, baseType: !202, size: 32, offset: 544)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !917, file: !106, line: 342, baseType: !948, size: 448, offset: 576)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !106, line: 79, baseType: !949)
