; ModuleID = 'blender/source/blender/modifiers/intern/MOD_meshcache_mdd.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_meshcache_mdd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.MDDHead = type { i32, i32 }

@.str = private unnamed_addr constant [19 x i8] c"Header seek failed\00", align 1
@.str.1 = private unnamed_addr constant [21 x i8] c"Failed to seek frame\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.3 = private unnamed_addr constant [27 x i8] c"Unknown error opening file\00", align 1
@.str.4 = private unnamed_addr constant [15 x i8] c"Missing header\00", align 1
@.str.5 = private unnamed_addr constant [22 x i8] c"Vertex count mismatch\00", align 1
@.str.6 = private unnamed_addr constant [20 x i8] c"Invalid frame total\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local zeroext i8 @MOD_meshcache_read_mdd_index(%struct._IO_FILE* %fp, [3 x float]* %vertexCos, i32 %verts_tot, i32 %index, float %factor, i8** %err_str) #0 !dbg !14 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/modifiers/intern/MOD_meshcache_mdd.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !6, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !{i32 7, !"Dwarf Version", i32 4}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = !{i32 1, !"wchar_size", i32 4}
!13 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!14 = distinct !DISubprogram(name: "MOD_meshcache_read_mdd_index", scope: !1, file: !1, line: 144, type: !15, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !18, !79, !83, !83, !84, !85}
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 7, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !22, line: 49, size: 1728, elements: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!23 = !{!24, !25, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !41, !43, !44, !45, !49, !51, !53, !57, !60, !62, !65, !68, !69, !70, !74, !75}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !21, file: !22, line: 51, baseType: !7, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !21, file: !22, line: 54, baseType: !26, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !21, file: !22, line: 55, baseType: !26, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !21, file: !22, line: 56, baseType: !26, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !21, file: !22, line: 57, baseType: !26, size: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !21, file: !22, line: 58, baseType: !26, size: 64, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !21, file: !22, line: 59, baseType: !26, size: 64, offset: 384)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !21, file: !22, line: 60, baseType: !26, size: 64, offset: 448)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !21, file: !22, line: 61, baseType: !26, size: 64, offset: 512)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !21, file: !22, line: 64, baseType: !26, size: 64, offset: 576)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !21, file: !22, line: 65, baseType: !26, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !21, file: !22, line: 66, baseType: !26, size: 64, offset: 704)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !21, file: !22, line: 68, baseType: !39, size: 64, offset: 768)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !22, line: 36, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !21, file: !22, line: 70, baseType: !42, size: 64, offset: 832)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !21, file: !22, line: 72, baseType: !7, size: 32, offset: 896)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !21, file: !22, line: 73, baseType: !7, size: 32, offset: 928)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !21, file: !22, line: 74, baseType: !46, size: 64, offset: 960)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 152, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!48 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !21, file: !22, line: 77, baseType: !50, size: 16, offset: 1024)
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !21, file: !22, line: 78, baseType: !52, size: 8, offset: 1040)
!52 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !21, file: !22, line: 79, baseType: !54, size: 8, offset: 1048)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 1)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !21, file: !22, line: 81, baseType: !58, size: 64, offset: 1088)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !22, line: 43, baseType: null)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !21, file: !22, line: 89, baseType: !61, size: 64, offset: 1152)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !47, line: 153, baseType: !48)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !21, file: !22, line: 91, baseType: !63, size: 64, offset: 1216)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !22, line: 37, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !21, file: !22, line: 92, baseType: !66, size: 64, offset: 1280)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !22, line: 38, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !21, file: !22, line: 93, baseType: !42, size: 64, offset: 1344)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !21, file: !22, line: 94, baseType: !4, size: 64, offset: 1408)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !21, file: !22, line: 95, baseType: !71, size: 64, offset: 1472)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 46, baseType: !73)
!72 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !21, file: !22, line: 96, baseType: !7, size: 32, offset: 1536)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !21, file: !22, line: 98, baseType: !76, size: 160, offset: 1568)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 20)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!88 = !DILocalVariable(name: "fp", arg: 1, scope: !14, file: !1, line: 144, type: !18)
!89 = !DILocation(line: 144, column: 41, scope: !14)
!90 = !DILocalVariable(name: "vertexCos", arg: 2, scope: !14, file: !1, line: 145, type: !79)
!91 = !DILocation(line: 145, column: 43, scope: !14)
!92 = !DILocalVariable(name: "verts_tot", arg: 3, scope: !14, file: !1, line: 145, type: !83)
!93 = !DILocation(line: 145, column: 68, scope: !14)
!94 = !DILocalVariable(name: "index", arg: 4, scope: !14, file: !1, line: 146, type: !83)
!95 = !DILocation(line: 146, column: 45, scope: !14)
!96 = !DILocalVariable(name: "factor", arg: 5, scope: !14, file: !1, line: 146, type: !84)
!97 = !DILocation(line: 146, column: 64, scope: !14)
!98 = !DILocalVariable(name: "err_str", arg: 6, scope: !14, file: !1, line: 147, type: !85)
!99 = !DILocation(line: 147, column: 48, scope: !14)
!100 = !DILocalVariable(name: "mdd_head", scope: !14, file: !1, line: 149, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDDHead", file: !1, line: 46, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDDHead", file: !1, line: 43, size: 64, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "frame_tot", scope: !102, file: !1, line: 44, baseType: !7, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "verts_tot", scope: !102, file: !1, line: 45, baseType: !7, size: 32, offset: 32)
!106 = !DILocation(line: 149, column: 10, scope: !14)
!107 = !DILocation(line: 151, column: 30, scope: !108)
!108 = distinct !DILexicalBlock(scope: !14, file: !1, line: 151, column: 6)
!109 = !DILocation(line: 151, column: 34, scope: !108)
!110 = !DILocation(line: 151, column: 56, scope: !108)
!111 = !DILocation(line: 151, column: 6, scope: !108)
!112 = !DILocation(line: 151, column: 65, scope: !108)
!113 = !DILocation(line: 151, column: 6, scope: !14)
!114 = !DILocation(line: 152, column: 3, scope: !115)
!115 = distinct !DILexicalBlock(scope: !108, file: !1, line: 151, column: 75)
!116 = !DILocation(line: 155, column: 12, scope: !117)
!117 = distinct !DILexicalBlock(scope: !14, file: !1, line: 155, column: 6)
!118 = !DILocation(line: 155, column: 25, scope: !117)
!119 = !DILocation(line: 155, column: 16, scope: !117)
!120 = !DILocation(line: 155, column: 35, scope: !117)
!121 = !DILocation(line: 155, column: 6, scope: !117)
!122 = !DILocation(line: 155, column: 60, scope: !117)
!123 = !DILocation(line: 155, column: 6, scope: !14)
!124 = !DILocation(line: 156, column: 4, scope: !125)
!125 = distinct !DILexicalBlock(scope: !117, file: !1, line: 155, column: 66)
!126 = !DILocation(line: 156, column: 12, scope: !125)
!127 = !DILocation(line: 157, column: 3, scope: !125)
!128 = !DILocation(line: 160, column: 12, scope: !129)
!129 = distinct !DILexicalBlock(scope: !14, file: !1, line: 160, column: 6)
!130 = !DILocation(line: 160, column: 16, scope: !129)
!131 = !DILocation(line: 160, column: 33, scope: !129)
!132 = !DILocation(line: 160, column: 22, scope: !129)
!133 = !DILocation(line: 160, column: 43, scope: !129)
!134 = !DILocation(line: 160, column: 59, scope: !129)
!135 = !DILocation(line: 160, column: 6, scope: !129)
!136 = !DILocation(line: 160, column: 74, scope: !129)
!137 = !DILocation(line: 160, column: 6, scope: !14)
!138 = !DILocation(line: 161, column: 4, scope: !139)
!139 = distinct !DILexicalBlock(scope: !129, file: !1, line: 160, column: 80)
!140 = !DILocation(line: 161, column: 12, scope: !139)
!141 = !DILocation(line: 162, column: 3, scope: !139)
!142 = !DILocation(line: 165, column: 6, scope: !143)
!143 = distinct !DILexicalBlock(scope: !14, file: !1, line: 165, column: 6)
!144 = !DILocation(line: 165, column: 13, scope: !143)
!145 = !DILocation(line: 165, column: 6, scope: !14)
!146 = !DILocalVariable(name: "vco", scope: !147, file: !1, line: 167, type: !148)
!147 = distinct !DILexicalBlock(scope: !143, file: !1, line: 165, column: 22)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!149 = !DILocation(line: 167, column: 10, scope: !147)
!150 = !DILocation(line: 167, column: 17, scope: !147)
!151 = !DILocation(line: 167, column: 16, scope: !147)
!152 = !DILocalVariable(name: "i", scope: !147, file: !1, line: 168, type: !9)
!153 = !DILocation(line: 168, column: 16, scope: !147)
!154 = !DILocation(line: 169, column: 21, scope: !155)
!155 = distinct !DILexicalBlock(scope: !147, file: !1, line: 169, column: 3)
!156 = !DILocation(line: 169, column: 10, scope: !155)
!157 = !DILocation(line: 169, column: 8, scope: !155)
!158 = !DILocation(line: 169, column: 32, scope: !159)
!159 = distinct !DILexicalBlock(scope: !155, file: !1, line: 169, column: 3)
!160 = !DILocation(line: 169, column: 34, scope: !159)
!161 = !DILocation(line: 169, column: 3, scope: !155)
!162 = !DILocation(line: 170, column: 10, scope: !163)
!163 = distinct !DILexicalBlock(scope: !159, file: !1, line: 169, column: 56)
!164 = !DILocation(line: 170, column: 37, scope: !163)
!165 = !DILocation(line: 170, column: 4, scope: !163)
!166 = !DILocation(line: 173, column: 28, scope: !163)
!167 = !DILocation(line: 173, column: 32, scope: !163)
!168 = !DILocation(line: 173, column: 4, scope: !163)
!169 = !DILocation(line: 174, column: 28, scope: !163)
!170 = !DILocation(line: 174, column: 32, scope: !163)
