; ModuleID = 'blender/source/blender/blenkernel/intern/bpath.c'
source_filename = "blender/source/blender/blenkernel/intern/bpath.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }

!54 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!55 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!56 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!57 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!58 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!59 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!60 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!61 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!62 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!63 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!64 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!65 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!66 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!67 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!68 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 359, baseType: !5, size: 32, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "MOD_SMOKE_TYPE_DOMAIN", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "MOD_SMOKE_TYPE_FLOW", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "MOD_SMOKE_TYPE_COLL", value: 4, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 404, baseType: !5, size: 32, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!77 = !DIEnumerator(name: "SEQ_TYPE_IMAGE", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "SEQ_TYPE_META", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "SEQ_TYPE_SCENE", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "SEQ_TYPE_MOVIE", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "SEQ_TYPE_SOUND_RAM", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "SEQ_TYPE_SOUND_HD", value: 5, isUnsigned: true)
!83 = !DIEnumerator(name: "SEQ_TYPE_MOVIECLIP", value: 6, isUnsigned: true)
!84 = !DIEnumerator(name: "SEQ_TYPE_MASK", value: 7, isUnsigned: true)
!85 = !DIEnumerator(name: "SEQ_TYPE_EFFECT", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "SEQ_TYPE_CROSS", value: 8, isUnsigned: true)
!87 = !DIEnumerator(name: "SEQ_TYPE_ADD", value: 9, isUnsigned: true)
!88 = !DIEnumerator(name: "SEQ_TYPE_SUB", value: 10, isUnsigned: true)
!89 = !DIEnumerator(name: "SEQ_TYPE_ALPHAOVER", value: 11, isUnsigned: true)
!90 = !DIEnumerator(name: "SEQ_TYPE_ALPHAUNDER", value: 12, isUnsigned: true)
!91 = !DIEnumerator(name: "SEQ_TYPE_GAMCROSS", value: 13, isUnsigned: true)
!92 = !DIEnumerator(name: "SEQ_TYPE_MUL", value: 14, isUnsigned: true)
!93 = !DIEnumerator(name: "SEQ_TYPE_OVERDROP", value: 15, isUnsigned: true)
!94 = !DIEnumerator(name: "SEQ_TYPE_WIPE", value: 25, isUnsigned: true)
!95 = !DIEnumerator(name: "SEQ_TYPE_GLOW", value: 26, isUnsigned: true)
!96 = !DIEnumerator(name: "SEQ_TYPE_TRANSFORM", value: 27, isUnsigned: true)
!97 = !DIEnumerator(name: "SEQ_TYPE_COLOR", value: 28, isUnsigned: true)
!98 = !DIEnumerator(name: "SEQ_TYPE_SPEED", value: 29, isUnsigned: true)
!99 = !DIEnumerator(name: "SEQ_TYPE_MULTICAM", value: 30, isUnsigned: true)
!100 = !DIEnumerator(name: "SEQ_TYPE_ADJUSTMENT", value: 31, isUnsigned: true)
!101 = !DIEnumerator(name: "SEQ_TYPE_GAUSSIAN_BLUR", value: 40, isUnsigned: true)
!102 = !DIEnumerator(name: "SEQ_TYPE_EFFECT_MAX", value: 40, isUnsigned: true)
!103 = !{!104, !105, !107, !109, !266, !3050, !3052, !3054, !3522, !3524, !3561, !3583, !3585, !3587, !3599, !3601, !3610, !3612, !3614, !3616, !3618, !3620, !3622, !3623, !3636, !3645, !736}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !111, line: 127, baseType: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !111, line: 77, size: 15424, elements: !113)
!113 = !{!114, !183, !184, !187, !190, !193, !196, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !216, !217, !233, !235, !236, !237, !238, !239, !240, !241, !242, !243, !247, !248, !249, !255, !256, !260}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !111, line: 78, baseType: !115, size: 960)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !116, line: 130, baseType: !117)
!116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !116, line: 117, size: 960, elements: !118)
!118 = !{!119, !120, !121, !123, !142, !146, !147, !149, !150, !151}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !116, line: 118, baseType: !104, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !117, file: !116, line: 118, baseType: !104, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !117, file: !116, line: 119, baseType: !122, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !117, file: !116, line: 120, baseType: !124, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !116, line: 136, size: 17600, elements: !126)
!126 = !{!127, !128, !130, !133, !137, !138, !139}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !116, line: 137, baseType: !115, size: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !125, file: !116, line: 138, baseType: !129, size: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !125, file: !116, line: 139, baseType: !131, size: 64, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !116, line: 43, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !116, line: 140, baseType: !134, size: 8192, offset: 1088)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8192, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1024)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !125, file: !116, line: 141, baseType: !134, size: 8192, offset: 9280)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !125, file: !116, line: 148, baseType: !124, size: 64, offset: 17472)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !125, file: !116, line: 150, baseType: !140, size: 64, offset: 17536)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !116, line: 45, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !116, line: 121, baseType: !143, size: 528, offset: 256)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 528, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 66)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !117, file: !116, line: 126, baseType: !108, size: 16, offset: 784)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !117, file: !116, line: 127, baseType: !148, size: 32, offset: 800)
!148 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !117, file: !116, line: 128, baseType: !148, size: 32, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !117, file: !116, line: 128, baseType: !148, size: 32, offset: 864)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !117, file: !116, line: 129, baseType: !152, size: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !116, line: 75, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !116, line: 62, size: 1024, elements: !155)
!155 = !{!156, !158, !159, !160, !161, !162, !166, !167, !181, !182}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !116, line: 63, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !116, line: 63, baseType: !157, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !154, file: !116, line: 64, baseType: !106, size: 8, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !154, file: !116, line: 64, baseType: !106, size: 8, offset: 136)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !116, line: 65, baseType: !108, size: 16, offset: 144)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !116, line: 66, baseType: !163, size: 512, offset: 160)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 512, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !154, file: !116, line: 67, baseType: !148, size: 32, offset: 672)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !116, line: 69, baseType: !168, size: 256, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !116, line: 60, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !116, line: 48, size: 256, elements: !170)
!170 = !{!171, !172, !179, !180}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !169, file: !116, line: 49, baseType: !104, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !169, file: !116, line: 58, baseType: !173, size: 128, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !174, line: 71, baseType: !175)
!174 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !174, line: 69, size: 128, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !175, file: !174, line: 70, baseType: !104, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !175, file: !174, line: 70, baseType: !104, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !169, file: !116, line: 59, baseType: !148, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !169, file: !116, line: 59, baseType: !148, size: 32, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !154, file: !116, line: 70, baseType: !148, size: 32, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !154, file: !116, line: 74, baseType: !148, size: 32, offset: 992)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !111, line: 80, baseType: !134, size: 8192, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !112, file: !111, line: 82, baseType: !185, size: 64, offset: 9152)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !111, line: 43, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !112, file: !111, line: 83, baseType: !188, size: 64, offset: 9216)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !116, line: 46, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !112, file: !111, line: 86, baseType: !191, size: 64, offset: 9280)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !111, line: 41, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !112, file: !111, line: 87, baseType: !194, size: 64, offset: 9344)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !111, line: 44, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !112, file: !111, line: 89, baseType: !197, size: 512, offset: 9408)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 512, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 8)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !112, file: !111, line: 90, baseType: !108, size: 16, offset: 9920)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !112, file: !111, line: 90, baseType: !108, size: 16, offset: 9936)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !112, file: !111, line: 92, baseType: !108, size: 16, offset: 9952)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !112, file: !111, line: 92, baseType: !108, size: 16, offset: 9968)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !112, file: !111, line: 93, baseType: !108, size: 16, offset: 9984)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !111, line: 93, baseType: !108, size: 16, offset: 10000)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !112, file: !111, line: 94, baseType: !148, size: 32, offset: 10016)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !112, file: !111, line: 97, baseType: !108, size: 16, offset: 10048)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !112, file: !111, line: 97, baseType: !108, size: 16, offset: 10064)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !112, file: !111, line: 98, baseType: !108, size: 16, offset: 10080)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !112, file: !111, line: 98, baseType: !108, size: 16, offset: 10096)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !112, file: !111, line: 99, baseType: !108, size: 16, offset: 10112)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !112, file: !111, line: 99, baseType: !108, size: 16, offset: 10128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !112, file: !111, line: 100, baseType: !5, size: 32, offset: 10144)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !112, file: !111, line: 101, baseType: !215, size: 64, offset: 10176)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !112, file: !111, line: 103, baseType: !140, size: 64, offset: 10240)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !112, file: !111, line: 104, baseType: !218, size: 64, offset: 10304)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !116, line: 159, size: 448, elements: !220)
!220 = !{!221, !225, !226, !228, !229, !231}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !219, file: !116, line: 161, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 2)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !219, file: !116, line: 162, baseType: !222, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !219, file: !116, line: 163, baseType: !227, size: 32, offset: 128)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 32, elements: !223)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !219, file: !116, line: 164, baseType: !227, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !219, file: !116, line: 165, baseType: !230, size: 128, offset: 192)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 128, elements: !223)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !219, file: !116, line: 166, baseType: !232, size: 128, offset: 320)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !223)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !112, file: !111, line: 107, baseType: !234, size: 32, offset: 10368)
!234 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !112, file: !111, line: 108, baseType: !148, size: 32, offset: 10400)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !112, file: !111, line: 109, baseType: !108, size: 16, offset: 10432)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !112, file: !111, line: 110, baseType: !108, size: 16, offset: 10448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !112, file: !111, line: 113, baseType: !148, size: 32, offset: 10464)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !112, file: !111, line: 113, baseType: !148, size: 32, offset: 10496)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !112, file: !111, line: 114, baseType: !106, size: 8, offset: 10528)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !112, file: !111, line: 114, baseType: !106, size: 8, offset: 10536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !112, file: !111, line: 115, baseType: !108, size: 16, offset: 10544)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !112, file: !111, line: 116, baseType: !244, size: 128, offset: 10560)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 128, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 4)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !112, file: !111, line: 119, baseType: !234, size: 32, offset: 10688)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !112, file: !111, line: 119, baseType: !234, size: 32, offset: 10720)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !112, file: !111, line: 122, baseType: !250, size: 512, offset: 10752)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !251, line: 182, baseType: !252)
!251 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !251, line: 180, size: 512, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !251, line: 181, baseType: !163, size: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !112, file: !111, line: 123, baseType: !106, size: 8, offset: 11264)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !112, file: !111, line: 125, baseType: !257, size: 56, offset: 11272)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 56, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 7)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !112, file: !111, line: 126, baseType: !261, size: 4096, offset: 11328)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 4096, elements: !198)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !111, line: 69, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !111, line: 67, size: 512, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !111, line: 68, baseType: !163, size: 512)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "Brush", file: !268, line: 138, baseType: !269)
!268 = !DIFile(filename: "blender/source/blender/makesdna/DNA_brush_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !268, line: 54, size: 16448, elements: !270)
!270 = !{!271, !272, !281, !331, !2962, !2963, !2964, !2965, !2968, !2969, !3003, !3004, !3005, !3006, !3007, !3008, !3009, !3010, !3011, !3012, !3013, !3014, !3015, !3016, !3017, !3018, !3019, !3020, !3021, !3022, !3023, !3024, !3025, !3026, !3027, !3028, !3029, !3030, !3031, !3032, !3033, !3034, !3035, !3036, !3037, !3038, !3039, !3040, !3041, !3042, !3043, !3044, !3045, !3046, !3047, !3048, !3049}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !269, file: !268, line: 55, baseType: !115, size: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !269, file: !268, line: 57, baseType: !273, size: 192, offset: 960)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BrushClone", file: !268, line: 48, size: 192, elements: !274)
!274 = !{!275, !277, !279, !280}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !273, file: !268, line: 49, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !273, file: !268, line: 50, baseType: !278, size: 64, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 64, elements: !223)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !273, file: !268, line: 51, baseType: !234, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !273, file: !268, line: 51, baseType: !234, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !269, file: !268, line: 58, baseType: !282, size: 64, offset: 1152)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !251, line: 72, size: 3072, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !298, !299, !324, !328, !329, !330}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !251, line: 73, baseType: !148, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !283, file: !251, line: 73, baseType: !148, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !283, file: !251, line: 74, baseType: !148, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !283, file: !251, line: 75, baseType: !148, size: 32, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !283, file: !251, line: 77, baseType: !290, size: 128, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !291, line: 95, baseType: !292)
!291 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !291, line: 92, size: 128, elements: !293)
!293 = !{!294, !295, !296, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !292, file: !291, line: 93, baseType: !234, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !292, file: !291, line: 93, baseType: !234, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !292, file: !291, line: 94, baseType: !234, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !292, file: !291, line: 94, baseType: !234, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !283, file: !251, line: 77, baseType: !290, size: 128, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !283, file: !251, line: 79, baseType: !300, size: 2304, offset: 384)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 2304, elements: !245)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !251, line: 67, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !251, line: 55, size: 576, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !320, !321, !322, !323}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !302, file: !251, line: 56, baseType: !108, size: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !302, file: !251, line: 56, baseType: !108, size: 16, offset: 16)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !302, file: !251, line: 58, baseType: !234, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !302, file: !251, line: 59, baseType: !234, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !302, file: !251, line: 59, baseType: !234, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !302, file: !251, line: 60, baseType: !278, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !302, file: !251, line: 60, baseType: !278, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !302, file: !251, line: 61, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !251, line: 47, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !251, line: 44, size: 96, elements: !315)
!315 = !{!316, !317, !318, !319}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !314, file: !251, line: 45, baseType: !234, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !314, file: !251, line: 45, baseType: !234, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !314, file: !251, line: 46, baseType: !108, size: 16, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !314, file: !251, line: 46, baseType: !108, size: 16, offset: 80)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !302, file: !251, line: 62, baseType: !312, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !302, file: !251, line: 64, baseType: !312, size: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !302, file: !251, line: 65, baseType: !278, size: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !302, file: !251, line: 66, baseType: !278, size: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !283, file: !251, line: 80, baseType: !325, size: 96, offset: 2688)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 96, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 3)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !283, file: !251, line: 80, baseType: !325, size: 96, offset: 2784)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !283, file: !251, line: 81, baseType: !325, size: 96, offset: 2880)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !283, file: !251, line: 83, baseType: !325, size: 96, offset: 2976)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !269, file: !268, line: 59, baseType: !332, size: 2496, offset: 1216)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !333, line: 57, size: 2496, elements: !334)
!333 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!334 = !{!335, !336, !337, !338, !339, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2959, !2960, !2961}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !332, file: !333, line: 59, baseType: !108, size: 16)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !332, file: !333, line: 59, baseType: !108, size: 16, offset: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !332, file: !333, line: 59, baseType: !108, size: 16, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !332, file: !333, line: 59, baseType: !108, size: 16, offset: 48)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !332, file: !333, line: 60, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !342, line: 115, size: 11392, elements: !343)
!342 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!343 = !{!344, !345, !348, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !365, !374, !388, !389, !431, !432, !436, !437, !453, !454, !455, !456, !457, !458, !459, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2540, !2653, !2654, !2655, !2656, !2657, !2658, !2866, !2869, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2883, !2886, !2887, !2890, !2891}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !341, file: !342, line: 116, baseType: !115, size: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !341, file: !342, line: 117, baseType: !346, size: 64, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !333, line: 45, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !341, file: !342, line: 119, baseType: !349, size: 64, offset: 1024)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !342, line: 57, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !341, file: !342, line: 121, baseType: !108, size: 16, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !341, file: !342, line: 121, baseType: !108, size: 16, offset: 1104)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !341, file: !342, line: 122, baseType: !148, size: 32, offset: 1120)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !341, file: !342, line: 122, baseType: !148, size: 32, offset: 1152)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !341, file: !342, line: 122, baseType: !148, size: 32, offset: 1184)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !341, file: !342, line: 123, baseType: !163, size: 512, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !341, file: !342, line: 124, baseType: !340, size: 64, offset: 1728)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !341, file: !342, line: 124, baseType: !340, size: 64, offset: 1792)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !341, file: !342, line: 127, baseType: !340, size: 64, offset: 1856)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !341, file: !342, line: 127, baseType: !340, size: 64, offset: 1920)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !341, file: !342, line: 127, baseType: !340, size: 64, offset: 1984)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !341, file: !342, line: 128, baseType: !363, size: 64, offset: 2048)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !333, line: 46, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !341, file: !342, line: 130, baseType: !366, size: 64, offset: 2112)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !342, line: 97, size: 832, elements: !368)
!368 = !{!369, !372, !373}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !367, file: !342, line: 98, baseType: !370, size: 768)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 768, elements: !371)
!371 = !{!199, !327}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !342, line: 99, baseType: !148, size: 32, offset: 768)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !367, file: !342, line: 99, baseType: !148, size: 32, offset: 800)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !341, file: !342, line: 131, baseType: !375, size: 64, offset: 2176)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !377, line: 486, size: 1600, elements: !378)
!377 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !376, file: !377, line: 487, baseType: !115, size: 960)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !376, file: !377, line: 489, baseType: !173, size: 128, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !376, file: !377, line: 490, baseType: !173, size: 128, offset: 1088)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !376, file: !377, line: 491, baseType: !173, size: 128, offset: 1216)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !376, file: !377, line: 492, baseType: !173, size: 128, offset: 1344)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !377, line: 494, baseType: !148, size: 32, offset: 1472)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !376, file: !377, line: 495, baseType: !148, size: 32, offset: 1504)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !376, file: !377, line: 497, baseType: !148, size: 32, offset: 1536)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !376, file: !377, line: 498, baseType: !148, size: 32, offset: 1568)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !341, file: !342, line: 132, baseType: !375, size: 64, offset: 2240)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !341, file: !342, line: 133, baseType: !390, size: 64, offset: 2304)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !377, line: 334, size: 1728, elements: !392)
!392 = !{!393, !394, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !430}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !391, file: !377, line: 335, baseType: !173, size: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !391, file: !377, line: 336, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !397, line: 51, flags: DIFlagFwdDecl)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !377, line: 338, baseType: !108, size: 16, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !391, file: !377, line: 338, baseType: !108, size: 16, offset: 208)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !391, file: !377, line: 339, baseType: !5, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !391, file: !377, line: 340, baseType: !148, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !391, file: !377, line: 342, baseType: !234, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !391, file: !377, line: 343, baseType: !325, size: 96, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !391, file: !377, line: 344, baseType: !325, size: 96, offset: 416)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !391, file: !377, line: 347, baseType: !173, size: 128, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !391, file: !377, line: 349, baseType: !148, size: 32, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !391, file: !377, line: 350, baseType: !148, size: 32, offset: 672)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !391, file: !377, line: 351, baseType: !104, size: 64, offset: 704)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !391, file: !377, line: 352, baseType: !104, size: 64, offset: 768)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !391, file: !377, line: 354, baseType: !411, size: 384, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !377, line: 116, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !377, line: 94, size: 384, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !412, file: !377, line: 96, baseType: !148, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !412, file: !377, line: 96, baseType: !148, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !412, file: !377, line: 97, baseType: !148, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !412, file: !377, line: 97, baseType: !148, size: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !412, file: !377, line: 99, baseType: !108, size: 16, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !412, file: !377, line: 100, baseType: !108, size: 16, offset: 144)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !412, file: !377, line: 102, baseType: !108, size: 16, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !412, file: !377, line: 105, baseType: !108, size: 16, offset: 176)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !412, file: !377, line: 108, baseType: !108, size: 16, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !412, file: !377, line: 109, baseType: !108, size: 16, offset: 208)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !412, file: !377, line: 111, baseType: !108, size: 16, offset: 224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !412, file: !377, line: 112, baseType: !108, size: 16, offset: 240)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !412, file: !377, line: 114, baseType: !148, size: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !412, file: !377, line: 114, baseType: !148, size: 32, offset: 288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !412, file: !377, line: 115, baseType: !148, size: 32, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !412, file: !377, line: 115, baseType: !148, size: 32, offset: 352)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !391, file: !377, line: 355, baseType: !163, size: 512, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !342, line: 134, baseType: !104, size: 64, offset: 2368)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !341, file: !342, line: 136, baseType: !433, size: 64, offset: 2432)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !435, line: 45, flags: DIFlagFwdDecl)
!435 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!436 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !341, file: !342, line: 138, baseType: !411, size: 384, offset: 2496)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !341, file: !342, line: 139, baseType: !438, size: 64, offset: 2880)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !377, line: 80, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !377, line: 72, size: 192, elements: !441)
!441 = !{!442, !449, !450, !451, !452}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !440, file: !377, line: 73, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !377, line: 59, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !377, line: 56, size: 128, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !445, file: !377, line: 57, baseType: !325, size: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !377, line: 58, baseType: !148, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !440, file: !377, line: 74, baseType: !148, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !440, file: !377, line: 76, baseType: !148, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !440, file: !377, line: 77, baseType: !148, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !440, file: !377, line: 79, baseType: !148, size: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !341, file: !342, line: 141, baseType: !173, size: 128, offset: 2944)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !341, file: !342, line: 142, baseType: !173, size: 128, offset: 3072)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !341, file: !342, line: 143, baseType: !173, size: 128, offset: 3200)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !341, file: !342, line: 144, baseType: !173, size: 128, offset: 3328)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !341, file: !342, line: 146, baseType: !148, size: 32, offset: 3456)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !341, file: !342, line: 147, baseType: !148, size: 32, offset: 3488)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !341, file: !342, line: 150, baseType: !460, size: 64, offset: 3520)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !463, line: 93, size: 7552, elements: !464)
!463 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !513, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !623, !2177, !2178, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2219}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !462, file: !463, line: 94, baseType: !115, size: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !462, file: !463, line: 95, baseType: !346, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !462, file: !463, line: 97, baseType: !108, size: 16, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !462, file: !463, line: 97, baseType: !108, size: 16, offset: 1040)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !462, file: !463, line: 99, baseType: !234, size: 32, offset: 1056)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !462, file: !463, line: 99, baseType: !234, size: 32, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !462, file: !463, line: 99, baseType: !234, size: 32, offset: 1120)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !462, file: !463, line: 100, baseType: !234, size: 32, offset: 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !462, file: !463, line: 100, baseType: !234, size: 32, offset: 1184)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !462, file: !463, line: 100, baseType: !234, size: 32, offset: 1216)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !462, file: !463, line: 101, baseType: !234, size: 32, offset: 1248)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !462, file: !463, line: 101, baseType: !234, size: 32, offset: 1280)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !462, file: !463, line: 101, baseType: !234, size: 32, offset: 1312)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !462, file: !463, line: 102, baseType: !234, size: 32, offset: 1344)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !462, file: !463, line: 102, baseType: !234, size: 32, offset: 1376)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !462, file: !463, line: 102, baseType: !234, size: 32, offset: 1408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !462, file: !463, line: 103, baseType: !234, size: 32, offset: 1440)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !462, file: !463, line: 103, baseType: !234, size: 32, offset: 1472)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !462, file: !463, line: 103, baseType: !234, size: 32, offset: 1504)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !462, file: !463, line: 103, baseType: !234, size: 32, offset: 1536)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !462, file: !463, line: 103, baseType: !234, size: 32, offset: 1568)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !462, file: !463, line: 104, baseType: !234, size: 32, offset: 1600)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !462, file: !463, line: 104, baseType: !234, size: 32, offset: 1632)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !462, file: !463, line: 104, baseType: !234, size: 32, offset: 1664)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !462, file: !463, line: 104, baseType: !234, size: 32, offset: 1696)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !462, file: !463, line: 104, baseType: !234, size: 32, offset: 1728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !462, file: !463, line: 105, baseType: !234, size: 32, offset: 1760)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !462, file: !463, line: 108, baseType: !493, size: 704, offset: 1792)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !463, line: 53, size: 704, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !493, file: !463, line: 54, baseType: !234, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !493, file: !463, line: 55, baseType: !234, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !493, file: !463, line: 56, baseType: !234, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !493, file: !463, line: 57, baseType: !234, size: 32, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !493, file: !463, line: 59, baseType: !325, size: 96, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !493, file: !463, line: 60, baseType: !325, size: 96, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !493, file: !463, line: 61, baseType: !325, size: 96, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !493, file: !463, line: 63, baseType: !234, size: 32, offset: 416)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !493, file: !463, line: 64, baseType: !234, size: 32, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !493, file: !463, line: 65, baseType: !234, size: 32, offset: 480)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !493, file: !463, line: 67, baseType: !108, size: 16, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !493, file: !463, line: 68, baseType: !108, size: 16, offset: 528)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !493, file: !463, line: 69, baseType: !108, size: 16, offset: 544)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !493, file: !463, line: 70, baseType: !108, size: 16, offset: 560)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !493, file: !463, line: 72, baseType: !234, size: 32, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !493, file: !463, line: 73, baseType: !234, size: 32, offset: 608)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !493, file: !463, line: 74, baseType: !234, size: 32, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !493, file: !463, line: 75, baseType: !234, size: 32, offset: 672)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !462, file: !463, line: 109, baseType: !514, size: 128, offset: 2496)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !463, line: 79, size: 128, elements: !515)
!515 = !{!516, !517, !518, !519}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !463, line: 80, baseType: !148, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !514, file: !463, line: 81, baseType: !148, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !514, file: !463, line: 82, baseType: !148, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !514, file: !463, line: 83, baseType: !148, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !462, file: !463, line: 111, baseType: !234, size: 32, offset: 2624)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !462, file: !463, line: 111, baseType: !234, size: 32, offset: 2656)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !462, file: !463, line: 112, baseType: !234, size: 32, offset: 2688)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !462, file: !463, line: 112, baseType: !234, size: 32, offset: 2720)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !462, file: !463, line: 113, baseType: !234, size: 32, offset: 2752)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !462, file: !463, line: 114, baseType: !234, size: 32, offset: 2784)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !462, file: !463, line: 114, baseType: !234, size: 32, offset: 2816)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !462, file: !463, line: 115, baseType: !108, size: 16, offset: 2848)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !462, file: !463, line: 115, baseType: !108, size: 16, offset: 2864)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !462, file: !463, line: 116, baseType: !108, size: 16, offset: 2880)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !462, file: !463, line: 117, baseType: !106, size: 8, offset: 2896)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !462, file: !463, line: 117, baseType: !106, size: 8, offset: 2904)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !462, file: !463, line: 119, baseType: !234, size: 32, offset: 2912)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !462, file: !463, line: 119, baseType: !234, size: 32, offset: 2944)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !462, file: !463, line: 120, baseType: !108, size: 16, offset: 2976)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !462, file: !463, line: 120, baseType: !108, size: 16, offset: 2992)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !462, file: !463, line: 121, baseType: !234, size: 32, offset: 3008)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !462, file: !463, line: 121, baseType: !234, size: 32, offset: 3040)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !462, file: !463, line: 122, baseType: !234, size: 32, offset: 3072)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !462, file: !463, line: 123, baseType: !234, size: 32, offset: 3104)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !462, file: !463, line: 124, baseType: !108, size: 16, offset: 3136)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !462, file: !463, line: 125, baseType: !108, size: 16, offset: 3152)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !462, file: !463, line: 127, baseType: !148, size: 32, offset: 3168)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !462, file: !463, line: 127, baseType: !148, size: 32, offset: 3200)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !462, file: !463, line: 128, baseType: !148, size: 32, offset: 3232)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !462, file: !463, line: 128, baseType: !148, size: 32, offset: 3264)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !462, file: !463, line: 129, baseType: !108, size: 16, offset: 3296)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !462, file: !463, line: 129, baseType: !108, size: 16, offset: 3312)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !462, file: !463, line: 129, baseType: !108, size: 16, offset: 3328)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !462, file: !463, line: 129, baseType: !108, size: 16, offset: 3344)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !462, file: !463, line: 130, baseType: !234, size: 32, offset: 3360)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !462, file: !463, line: 130, baseType: !234, size: 32, offset: 3392)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !462, file: !463, line: 130, baseType: !234, size: 32, offset: 3424)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !462, file: !463, line: 130, baseType: !234, size: 32, offset: 3456)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !462, file: !463, line: 131, baseType: !234, size: 32, offset: 3488)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !462, file: !463, line: 131, baseType: !234, size: 32, offset: 3520)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !462, file: !463, line: 131, baseType: !234, size: 32, offset: 3552)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !462, file: !463, line: 131, baseType: !234, size: 32, offset: 3584)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !462, file: !463, line: 132, baseType: !234, size: 32, offset: 3616)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !462, file: !463, line: 132, baseType: !234, size: 32, offset: 3648)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !462, file: !463, line: 133, baseType: !163, size: 512, offset: 3680)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !462, file: !463, line: 135, baseType: !234, size: 32, offset: 4192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !462, file: !463, line: 136, baseType: !234, size: 32, offset: 4224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !462, file: !463, line: 137, baseType: !234, size: 32, offset: 4256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !462, file: !463, line: 138, baseType: !148, size: 32, offset: 4288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !462, file: !463, line: 141, baseType: !106, size: 8, offset: 4320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !462, file: !463, line: 141, baseType: !106, size: 8, offset: 4328)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !462, file: !463, line: 141, baseType: !106, size: 8, offset: 4336)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !462, file: !463, line: 141, baseType: !106, size: 8, offset: 4344)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !462, file: !463, line: 142, baseType: !108, size: 16, offset: 4352)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !462, file: !463, line: 142, baseType: !108, size: 16, offset: 4368)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !462, file: !463, line: 142, baseType: !108, size: 16, offset: 4384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !462, file: !463, line: 145, baseType: !106, size: 8, offset: 4400)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !462, file: !463, line: 145, baseType: !106, size: 8, offset: 4408)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !462, file: !463, line: 148, baseType: !108, size: 16, offset: 4416)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !462, file: !463, line: 148, baseType: !108, size: 16, offset: 4432)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !462, file: !463, line: 149, baseType: !234, size: 32, offset: 4448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !462, file: !463, line: 149, baseType: !234, size: 32, offset: 4480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !462, file: !463, line: 152, baseType: !244, size: 128, offset: 4512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !462, file: !463, line: 153, baseType: !234, size: 32, offset: 4640)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !462, file: !463, line: 154, baseType: !234, size: 32, offset: 4672)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !462, file: !463, line: 157, baseType: !108, size: 16, offset: 4704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !462, file: !463, line: 157, baseType: !108, size: 16, offset: 4720)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !462, file: !463, line: 160, baseType: !584, size: 64, offset: 4736)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !333, line: 113, size: 6208, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !596}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !585, file: !333, line: 114, baseType: !108, size: 16)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !585, file: !333, line: 114, baseType: !108, size: 16, offset: 16)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !585, file: !333, line: 115, baseType: !106, size: 8, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !585, file: !333, line: 115, baseType: !106, size: 8, offset: 40)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !585, file: !333, line: 116, baseType: !106, size: 8, offset: 48)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !585, file: !333, line: 117, baseType: !593, size: 8, offset: 56)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 1)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !333, line: 119, baseType: !597, size: 6144, offset: 64)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 6144, elements: !607)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !333, line: 109, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !333, line: 106, size: 192, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !599, file: !333, line: 107, baseType: !234, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !599, file: !333, line: 107, baseType: !234, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !599, file: !333, line: 107, baseType: !234, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !599, file: !333, line: 107, baseType: !234, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !599, file: !333, line: 107, baseType: !234, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !599, file: !333, line: 108, baseType: !148, size: 32, offset: 160)
!607 = !{!608}
!608 = !DISubrange(count: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !462, file: !463, line: 161, baseType: !584, size: 64, offset: 4800)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !462, file: !463, line: 162, baseType: !106, size: 8, offset: 4864)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !462, file: !463, line: 162, baseType: !106, size: 8, offset: 4872)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !462, file: !463, line: 163, baseType: !106, size: 8, offset: 4880)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !462, file: !463, line: 163, baseType: !106, size: 8, offset: 4888)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !462, file: !463, line: 164, baseType: !108, size: 16, offset: 4896)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !462, file: !463, line: 164, baseType: !108, size: 16, offset: 4912)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !462, file: !463, line: 165, baseType: !234, size: 32, offset: 4928)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !462, file: !463, line: 165, baseType: !234, size: 32, offset: 4960)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !462, file: !463, line: 167, baseType: !619, size: 1152, offset: 4992)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 1152, elements: !621)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!621 = !{!622}
!622 = !DISubrange(count: 18)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !462, file: !463, line: 168, baseType: !624, size: 64, offset: 6144)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !626, line: 328, size: 3456, elements: !627)
!626 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!627 = !{!628, !629, !630, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2155, !2156, !2157, !2160, !2164, !2168, !2172, !2173, !2174, !2175, !2176}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !625, file: !626, line: 329, baseType: !115, size: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !625, file: !626, line: 330, baseType: !346, size: 64, offset: 960)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !625, file: !626, line: 332, baseType: !631, size: 64, offset: 1024)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !633, line: 283, size: 4096, elements: !634)
!633 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!634 = !{!635, !636, !637, !638, !642, !643, !647, !987, !2103, !2107, !2113, !2117, !2118, !2119, !2120, !2124, !2125}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !632, file: !633, line: 284, baseType: !148, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !632, file: !633, line: 285, baseType: !163, size: 512, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !632, file: !633, line: 287, baseType: !163, size: 512, offset: 544)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !632, file: !633, line: 288, baseType: !639, size: 2048, offset: 1056)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 2048, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !632, file: !633, line: 289, baseType: !148, size: 32, offset: 3104)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !632, file: !633, line: 292, baseType: !644, size: 64, offset: 3136)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !624}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !632, file: !633, line: 293, baseType: !648, size: 64, offset: 3200)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !624, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !626, line: 167, size: 3712, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !626, line: 168, baseType: !651, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !652, file: !626, line: 168, baseType: !651, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !652, file: !626, line: 168, baseType: !651, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !652, file: !626, line: 170, baseType: !152, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !652, file: !626, line: 172, baseType: !659, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !633, line: 144, size: 6016, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !839, !840, !841, !855, !859, !863, !864, !870, !874, !878, !879, !880, !881, !885, !886, !890, !894, !898, !902, !906, !910, !914, !915, !922, !924, !933, !942}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !633, line: 145, baseType: !104, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !660, file: !633, line: 145, baseType: !104, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !660, file: !633, line: 146, baseType: !108, size: 16, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !660, file: !633, line: 148, baseType: !163, size: 512, offset: 144)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !660, file: !633, line: 149, baseType: !148, size: 32, offset: 672)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !660, file: !633, line: 151, baseType: !163, size: 512, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !660, file: !633, line: 152, baseType: !639, size: 2048, offset: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !660, file: !633, line: 153, baseType: !148, size: 32, offset: 3264)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !660, file: !633, line: 155, baseType: !234, size: 32, offset: 3296)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !660, file: !633, line: 155, baseType: !234, size: 32, offset: 3328)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !660, file: !633, line: 155, baseType: !234, size: 32, offset: 3360)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !660, file: !633, line: 156, baseType: !234, size: 32, offset: 3392)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !660, file: !633, line: 156, baseType: !234, size: 32, offset: 3424)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !660, file: !633, line: 156, baseType: !234, size: 32, offset: 3456)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !660, file: !633, line: 157, baseType: !108, size: 16, offset: 3488)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !660, file: !633, line: 157, baseType: !108, size: 16, offset: 3504)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !660, file: !633, line: 157, baseType: !108, size: 16, offset: 3520)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !660, file: !633, line: 160, baseType: !680, size: 64, offset: 3584)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !633, line: 109, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !633, line: 98, size: 1408, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !838}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !682, file: !633, line: 99, baseType: !148, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !682, file: !633, line: 99, baseType: !148, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !682, file: !633, line: 100, baseType: !163, size: 512, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !682, file: !633, line: 101, baseType: !234, size: 32, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !682, file: !633, line: 101, baseType: !234, size: 32, offset: 608)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !682, file: !633, line: 101, baseType: !234, size: 32, offset: 640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !682, file: !633, line: 101, baseType: !234, size: 32, offset: 672)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !682, file: !633, line: 102, baseType: !234, size: 32, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !682, file: !633, line: 102, baseType: !234, size: 32, offset: 736)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !682, file: !633, line: 103, baseType: !148, size: 32, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !633, line: 104, baseType: !148, size: 32, offset: 800)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !682, file: !633, line: 107, baseType: !696, size: 64, offset: 832)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !626, line: 87, size: 2816, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !823}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !626, line: 88, baseType: !696, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !697, file: !626, line: 88, baseType: !696, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !697, file: !626, line: 88, baseType: !696, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !697, file: !626, line: 90, baseType: !152, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !697, file: !626, line: 92, baseType: !163, size: 512, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !626, line: 94, baseType: !163, size: 512, offset: 768)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !697, file: !626, line: 99, baseType: !104, size: 64, offset: 1280)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !697, file: !626, line: 101, baseType: !108, size: 16, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !697, file: !626, line: 101, baseType: !108, size: 16, offset: 1360)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !697, file: !626, line: 102, baseType: !108, size: 16, offset: 1376)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !697, file: !626, line: 103, baseType: !108, size: 16, offset: 1392)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !697, file: !626, line: 104, baseType: !711, size: 64, offset: 1408)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !633, line: 114, size: 1600, elements: !713)
!713 = !{!714, !715, !738, !743, !747, !751, !755, !759, !760, !764, !793, !794, !795}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !712, file: !633, line: 115, baseType: !163, size: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !712, file: !633, line: 117, baseType: !716, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !719, !722, !724, !724, !736}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !721, line: 46, flags: DIFlagFwdDecl)
!721 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_library.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !633, line: 73, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !726, line: 55, size: 192, elements: !727)
!726 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!727 = !{!728, !732, !735}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !725, file: !726, line: 58, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !725, file: !726, line: 56, size: 64, elements: !730)
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !729, file: !726, line: 57, baseType: !104, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !725, file: !726, line: 60, baseType: !733, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !626, line: 335, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !725, file: !726, line: 61, baseType: !104, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !712, file: !633, line: 118, baseType: !739, size: 64, offset: 576)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !719, !724, !724, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !712, file: !633, line: 120, baseType: !744, size: 64, offset: 640)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !719, !722, !724}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !712, file: !633, line: 121, baseType: !748, size: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !719, !724, !742}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !712, file: !633, line: 122, baseType: !752, size: 64, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !624, !696, !733}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !712, file: !633, line: 123, baseType: !756, size: 64, offset: 832)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !624, !696, !651, !696, !736}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !712, file: !633, line: 124, baseType: !756, size: 64, offset: 896)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !712, file: !633, line: 125, baseType: !761, size: 64, offset: 960)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !624, !696, !651, !696}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !712, file: !633, line: 128, baseType: !765, size: 256, offset: 1024)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !726, line: 436, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !726, line: 430, size: 256, elements: !767)
!767 = !{!768, !769, !772, !788}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !766, file: !726, line: 431, baseType: !104, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !766, file: !726, line: 432, baseType: !770, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !726, line: 417, baseType: !734)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !766, file: !726, line: 433, baseType: !773, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !726, line: 408, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!148, !719, !724, !777, !779}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !726, line: 38, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !726, line: 348, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !726, line: 337, size: 256, elements: !782)
!782 = !{!783, !784, !785, !786, !787}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !781, file: !726, line: 339, baseType: !104, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !781, file: !726, line: 342, baseType: !777, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !781, file: !726, line: 345, baseType: !148, size: 32, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !781, file: !726, line: 347, baseType: !148, size: 32, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !781, file: !726, line: 347, baseType: !148, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !766, file: !726, line: 434, baseType: !789, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !726, line: 409, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !104}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !712, file: !633, line: 129, baseType: !765, size: 256, offset: 1280)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !712, file: !633, line: 132, baseType: !148, size: 32, offset: 1536)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !712, file: !633, line: 132, baseType: !148, size: 32, offset: 1568)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !697, file: !626, line: 105, baseType: !163, size: 512, offset: 1472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !697, file: !626, line: 107, baseType: !234, size: 32, offset: 1984)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !697, file: !626, line: 107, baseType: !234, size: 32, offset: 2016)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !697, file: !626, line: 109, baseType: !104, size: 64, offset: 2048)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !697, file: !626, line: 112, baseType: !108, size: 16, offset: 2112)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !697, file: !626, line: 114, baseType: !108, size: 16, offset: 2128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !697, file: !626, line: 115, baseType: !148, size: 32, offset: 2144)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !697, file: !626, line: 117, baseType: !104, size: 64, offset: 2176)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !697, file: !626, line: 122, baseType: !148, size: 32, offset: 2240)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !697, file: !626, line: 124, baseType: !148, size: 32, offset: 2272)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !697, file: !626, line: 126, baseType: !696, size: 64, offset: 2304)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !697, file: !626, line: 128, baseType: !808, size: 64, offset: 2368)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !626, line: 298, size: 448, elements: !810)
!810 = !{!811, !812, !813, !816, !817, !820, !821, !822}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !809, file: !626, line: 299, baseType: !808, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !809, file: !626, line: 299, baseType: !808, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !809, file: !626, line: 301, baseType: !814, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !626, line: 218, baseType: !652)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !809, file: !626, line: 301, baseType: !814, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !809, file: !626, line: 302, baseType: !818, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !626, line: 132, baseType: !697)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !809, file: !626, line: 302, baseType: !818, size: 64, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !809, file: !626, line: 304, baseType: !148, size: 32, offset: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !809, file: !626, line: 305, baseType: !148, size: 32, offset: 416)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !697, file: !626, line: 131, baseType: !824, size: 384, offset: 2432)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !626, line: 73, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !626, line: 62, size: 384, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !825, file: !626, line: 63, baseType: !244, size: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !825, file: !626, line: 64, baseType: !234, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !825, file: !626, line: 64, baseType: !234, size: 32, offset: 160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !825, file: !626, line: 65, baseType: !104, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !825, file: !626, line: 66, baseType: !108, size: 16, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !825, file: !626, line: 67, baseType: !108, size: 16, offset: 272)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !825, file: !626, line: 68, baseType: !108, size: 16, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !825, file: !626, line: 69, baseType: !108, size: 16, offset: 304)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !825, file: !626, line: 70, baseType: !108, size: 16, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !825, file: !626, line: 71, baseType: !108, size: 16, offset: 336)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !825, file: !626, line: 72, baseType: !227, size: 32, offset: 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !682, file: !633, line: 108, baseType: !163, size: 512, offset: 896)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !660, file: !633, line: 160, baseType: !680, size: 64, offset: 3648)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !660, file: !633, line: 162, baseType: !163, size: 512, offset: 3712)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !660, file: !633, line: 165, baseType: !842, size: 64, offset: 4224)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !845, !847, !849, !624, !651, !851}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !633, line: 81, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !626, line: 43, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !626, line: 274, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !626, line: 271, size: 32, elements: !853)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !852, file: !626, line: 273, baseType: !5, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !660, file: !633, line: 168, baseType: !856, size: 64, offset: 4288)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !845, !624, !651}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !660, file: !633, line: 171, baseType: !860, size: 64, offset: 4352)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !722, !719, !724}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !660, file: !633, line: 173, baseType: !860, size: 64, offset: 4416)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !660, file: !633, line: 176, baseType: !865, size: 64, offset: 4480)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !849, !868, !651, !148, !148}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !251, line: 136, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !660, file: !633, line: 179, baseType: !871, size: 64, offset: 4544)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !624, !651, !105, !148}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !660, file: !633, line: 181, baseType: !875, size: 64, offset: 4608)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!148, !651, !148, !148}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !660, file: !633, line: 183, baseType: !875, size: 64, offset: 4672)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !660, file: !633, line: 185, baseType: !875, size: 64, offset: 4736)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !660, file: !633, line: 188, baseType: !648, size: 64, offset: 4800)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !660, file: !633, line: 190, baseType: !882, size: 64, offset: 4864)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !624, !651, !122}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !660, file: !633, line: 193, baseType: !648, size: 64, offset: 4928)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !660, file: !633, line: 195, baseType: !887, size: 64, offset: 4992)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !651}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !660, file: !633, line: 197, baseType: !891, size: 64, offset: 5056)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !624, !651, !651}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !660, file: !633, line: 200, baseType: !895, size: 64, offset: 5120)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !845, !724}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !660, file: !633, line: 201, baseType: !899, size: 64, offset: 5184)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !724}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !660, file: !633, line: 202, baseType: !903, size: 64, offset: 5248)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{null, !724, !651}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !660, file: !633, line: 205, baseType: !907, size: 64, offset: 5312)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!148, !659, !624}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !660, file: !633, line: 207, baseType: !911, size: 64, offset: 5376)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!148, !651, !624}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !660, file: !633, line: 210, baseType: !648, size: 64, offset: 5440)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !660, file: !633, line: 213, baseType: !916, size: 64, offset: 5504)
