; ModuleID = 'blender/source/blender/editors/space_graph/graph_buttons.c'
source_filename = "blender/source/blender/editors/space_graph/graph_buttons.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!977 = !DIEnumerator(name: "DRIVER_FLAG_RECOMPILE", value: 8, isUnsigned: true)
!978 = !DIEnumerator(name: "DRIVER_FLAG_RENAMEVAR", value: 16, isUnsigned: true)
!979 = !DIEnumerator(name: "DRIVER_FLAG_SHOWDEBUG", value: 32, isUnsigned: true)
!980 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriverVar_Types", file: !864, line: 341, baseType: !5, size: 32, elements: !981)
!981 = !{!982, !983, !984, !985, !986}
!982 = !DIEnumerator(name: "DVAR_TYPE_SINGLE_PROP", value: 0, isUnsigned: true)
!983 = !DIEnumerator(name: "DVAR_TYPE_ROT_DIFF", value: 1, isUnsigned: true)
!984 = !DIEnumerator(name: "DVAR_TYPE_LOC_DIFF", value: 2, isUnsigned: true)
!985 = !DIEnumerator(name: "DVAR_TYPE_TRANSFORM_CHAN", value: 3, isUnsigned: true)
!986 = !DIEnumerator(name: "MAX_DVAR_TYPES", value: 4, isUnsigned: true)
!987 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriverTarget_TransformChannels", file: !864, line: 301, baseType: !5, size: 32, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!989 = !DIEnumerator(name: "DTAR_TRANSCHAN_LOCX", value: 0, isUnsigned: true)
!990 = !DIEnumerator(name: "DTAR_TRANSCHAN_LOCY", value: 1, isUnsigned: true)
!991 = !DIEnumerator(name: "DTAR_TRANSCHAN_LOCZ", value: 2, isUnsigned: true)
!992 = !DIEnumerator(name: "DTAR_TRANSCHAN_ROTX", value: 3, isUnsigned: true)
!993 = !DIEnumerator(name: "DTAR_TRANSCHAN_ROTY", value: 4, isUnsigned: true)
!994 = !DIEnumerator(name: "DTAR_TRANSCHAN_ROTZ", value: 5, isUnsigned: true)
!995 = !DIEnumerator(name: "DTAR_TRANSCHAN_SCALEX", value: 6, isUnsigned: true)
!996 = !DIEnumerator(name: "DTAR_TRANSCHAN_SCALEY", value: 7, isUnsigned: true)
!997 = !DIEnumerator(name: "DTAR_TRANSCHAN_SCALEZ", value: 8, isUnsigned: true)
!998 = !DIEnumerator(name: "MAX_DTAR_TRANSCHAN_TYPES", value: 9, isUnsigned: true)
!999 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDriverTarget_Flag", file: !864, line: 282, baseType: !5, size: 32, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1004, !1005}
!1001 = !DIEnumerator(name: "DTAR_FLAG_STRUCT_REF", value: 1, isUnsigned: true)
!1002 = !DIEnumerator(name: "DTAR_FLAG_ID_OB_ONLY", value: 2, isUnsigned: true)
!1003 = !DIEnumerator(name: "DTAR_FLAG_LOCALSPACE", value: 4, isUnsigned: true)
!1004 = !DIEnumerator(name: "DTAR_FLAG_LOCAL_CONSTS", value: 8, isUnsigned: true)
!1005 = !DIEnumerator(name: "DTAR_FLAG_INVALID", value: 16, isUnsigned: true)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eGraphEdit_Mode", file: !1007, line: 375, baseType: !5, size: 32, elements: !1008)
!1007 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1008 = !{!1009, !1010}
!1009 = !DIEnumerator(name: "SIPO_MODE_ANIMATION", value: 0, isUnsigned: true)
!1010 = !DIEnumerator(name: "SIPO_MODE_DRIVERS", value: 1, isUnsigned: true)
!1011 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1012, line: 141, baseType: !5, size: 32, elements: !1013)
!1012 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1014 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!1015 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!1016 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!1017 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!1018 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!1019 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!1020 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!1021 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!1022 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!1023 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!1024 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!1025 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!1026 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1027, line: 351, baseType: !5, size: 32, elements: !1028)
!1027 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034}
!1029 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!1030 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!1031 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!1032 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!1033 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!1034 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!1035 = !{!1036, !1037, !1100, !1094, !1147, !1083, !1289, !1316, !1140, !2770}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !864, line: 463, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !864, line: 433, size: 896, elements: !1040)
!1040 = !{!1041, !1043, !1044, !1082, !1098, !1099, !1123, !1134, !1135, !1136, !1137, !1138, !1139, !1141, !1142, !1145, !1146}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1039, file: !864, line: 434, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1039, file: !864, line: 434, baseType: !1042, size: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !1039, file: !864, line: 437, baseType: !1045, size: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !1047, line: 450, baseType: !1048)
!1047 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !1047, line: 440, size: 960, elements: !1049)
!1049 = !{!1050, !1052, !1053, !1060, !1062, !1063, !1068}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1048, file: !1047, line: 441, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1048, file: !1047, line: 441, baseType: !1051, size: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1048, file: !1047, line: 443, baseType: !1054, size: 128, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1055, line: 71, baseType: !1056)
!1055 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1055, line: 69, size: 128, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1056, file: !1055, line: 70, baseType: !1036, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1056, file: !1055, line: 70, baseType: !1036, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1048, file: !1047, line: 445, baseType: !1061, size: 32, offset: 256)
!1061 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !1048, file: !1047, line: 446, baseType: !1061, size: 32, offset: 288)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1048, file: !1047, line: 447, baseType: !1064, size: 512, offset: 320)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 512, elements: !1066)
!1065 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1066 = !{!1067}
!1067 = !DISubrange(count: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !1048, file: !1047, line: 449, baseType: !1069, size: 128, offset: 832)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !1070, line: 347, baseType: !1071)
!1070 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !1070, line: 340, size: 128, elements: !1072)
!1072 = !{!1073, !1077, !1078, !1079, !1081}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !1071, file: !1070, line: 341, baseType: !1074, size: 32)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 32, elements: !1075)
!1075 = !{!1076}
!1076 = !DISubrange(count: 4)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !1071, file: !1070, line: 342, baseType: !1074, size: 32, offset: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1071, file: !1070, line: 343, baseType: !1074, size: 32, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1071, file: !1070, line: 345, baseType: !1080, size: 16, offset: 96)
!1080 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1071, file: !1070, line: 346, baseType: !1080, size: 16, offset: 112)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !1039, file: !864, line: 440, baseType: !1083, size: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !864, line: 386, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !864, line: 371, size: 2368, elements: !1086)
!1086 = !{!1087, !1088, !1092, !1093, !1095, !1096, !1097}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !1085, file: !864, line: 372, baseType: !1054, size: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !1085, file: !864, line: 377, baseType: !1089, size: 2048, offset: 128)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 2048, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !1085, file: !864, line: 378, baseType: !1036, size: 64, offset: 2176)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !1085, file: !864, line: 380, baseType: !1094, size: 32, offset: 2240)
!1094 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1085, file: !864, line: 381, baseType: !1094, size: 32, offset: 2272)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1085, file: !864, line: 384, baseType: !1061, size: 32, offset: 2304)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1085, file: !864, line: 385, baseType: !1061, size: 32, offset: 2336)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1039, file: !864, line: 442, baseType: !1054, size: 128, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !1039, file: !864, line: 445, baseType: !1100, size: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !896, line: 133, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !896, line: 117, size: 576, elements: !1103)
!1103 = !{!1104, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1102, file: !896, line: 118, baseType: !1105, size: 288)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 288, elements: !1106)
!1106 = !{!1107, !1107}
!1107 = !DISubrange(count: 3)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !1102, file: !896, line: 119, baseType: !1094, size: 32, offset: 288)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1102, file: !896, line: 119, baseType: !1094, size: 32, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !1102, file: !896, line: 119, baseType: !1094, size: 32, offset: 352)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1102, file: !896, line: 121, baseType: !1065, size: 8, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !1102, file: !896, line: 123, baseType: !1065, size: 8, offset: 392)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !1102, file: !896, line: 123, baseType: !1065, size: 8, offset: 400)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !1102, file: !896, line: 124, baseType: !1065, size: 8, offset: 408)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !1102, file: !896, line: 124, baseType: !1065, size: 8, offset: 416)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !1102, file: !896, line: 124, baseType: !1065, size: 8, offset: 424)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !1102, file: !896, line: 126, baseType: !1065, size: 8, offset: 432)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !1102, file: !896, line: 128, baseType: !1065, size: 8, offset: 440)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !1102, file: !896, line: 129, baseType: !1094, size: 32, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !1102, file: !896, line: 130, baseType: !1094, size: 32, offset: 480)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !1102, file: !896, line: 130, baseType: !1094, size: 32, offset: 512)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1102, file: !896, line: 132, baseType: !1074, size: 32, offset: 544)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !1039, file: !864, line: 446, baseType: !1124, size: 64, offset: 448)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !864, line: 430, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !864, line: 426, size: 128, elements: !1127)
!1127 = !{!1128, !1132, !1133}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1126, file: !864, line: 427, baseType: !1129, size: 64)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 64, elements: !1130)
!1130 = !{!1131}
!1131 = !DISubrange(count: 2)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1126, file: !864, line: 428, baseType: !1061, size: 32, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1126, file: !864, line: 429, baseType: !1061, size: 32, offset: 96)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !1039, file: !864, line: 447, baseType: !5, size: 32, offset: 512)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !1039, file: !864, line: 450, baseType: !1094, size: 32, offset: 544)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1039, file: !864, line: 451, baseType: !1080, size: 16, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1039, file: !864, line: 452, baseType: !1080, size: 16, offset: 592)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !1039, file: !864, line: 455, baseType: !1061, size: 32, offset: 608)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !1039, file: !864, line: 456, baseType: !1140, size: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1039, file: !864, line: 459, baseType: !1061, size: 32, offset: 704)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1039, file: !864, line: 460, baseType: !1143, size: 96, offset: 736)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 96, elements: !1144)
!1144 = !{!1107}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !1039, file: !864, line: 462, baseType: !1094, size: 32, offset: 832)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1039, file: !864, line: 462, baseType: !1094, size: 32, offset: 864)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimListElem", file: !1149, line: 125, baseType: !1150)
!1149 = !DIFile(filename: "blender/source/blender/editors/include/ED_anim_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimListElem", file: !1149, line: 110, size: 512, elements: !1151)
!1151 = !{!1152, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1221}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1150, file: !1149, line: 111, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1150, file: !1149, line: 111, baseType: !1153, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1150, file: !1149, line: 113, baseType: !1036, size: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1150, file: !1149, line: 114, baseType: !1061, size: 32, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1150, file: !1149, line: 115, baseType: !1061, size: 32, offset: 224)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1150, file: !1149, line: 116, baseType: !1061, size: 32, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1150, file: !1149, line: 118, baseType: !1080, size: 16, offset: 288)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !1150, file: !1149, line: 119, baseType: !1080, size: 16, offset: 304)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "key_data", scope: !1150, file: !1149, line: 120, baseType: !1036, size: 64, offset: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1150, file: !1149, line: 123, baseType: !1163, size: 64, offset: 384)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1165, line: 117, size: 960, elements: !1166)
!1165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1166 = !{!1167, !1168, !1169, !1170, !1190, !1194, !1195, !1196, !1197, !1198}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1164, file: !1165, line: 118, baseType: !1036, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1164, file: !1165, line: 118, baseType: !1036, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1164, file: !1165, line: 119, baseType: !1163, size: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1164, file: !1165, line: 120, baseType: !1171, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1165, line: 136, size: 17600, elements: !1173)
!1173 = !{!1174, !1176, !1178, !1181, !1185, !1186, !1187}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1172, file: !1165, line: 137, baseType: !1175, size: 960)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1165, line: 130, baseType: !1164)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1172, file: !1165, line: 138, baseType: !1177, size: 64, offset: 960)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1172, file: !1165, line: 139, baseType: !1179, size: 64, offset: 1024)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1165, line: 43, flags: DIFlagFwdDecl)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1172, file: !1165, line: 140, baseType: !1182, size: 8192, offset: 1088)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 8192, elements: !1183)
!1183 = !{!1184}
!1184 = !DISubrange(count: 1024)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1172, file: !1165, line: 141, baseType: !1182, size: 8192, offset: 9280)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1172, file: !1165, line: 148, baseType: !1171, size: 64, offset: 17472)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1172, file: !1165, line: 150, baseType: !1188, size: 64, offset: 17536)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1165, line: 45, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1164, file: !1165, line: 121, baseType: !1191, size: 528, offset: 256)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 528, elements: !1192)
!1192 = !{!1193}
!1193 = !DISubrange(count: 66)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1164, file: !1165, line: 126, baseType: !1080, size: 16, offset: 784)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1164, file: !1165, line: 127, baseType: !1061, size: 32, offset: 800)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1164, file: !1165, line: 128, baseType: !1061, size: 32, offset: 832)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1164, file: !1165, line: 128, baseType: !1061, size: 32, offset: 864)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1164, file: !1165, line: 129, baseType: !1199, size: 64, offset: 896)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1165, line: 75, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1165, line: 62, size: 1024, elements: !1202)
!1202 = !{!1203, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1219, !1220}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1201, file: !1165, line: 63, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1201, file: !1165, line: 63, baseType: !1204, size: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1201, file: !1165, line: 64, baseType: !1065, size: 8, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1201, file: !1165, line: 64, baseType: !1065, size: 8, offset: 136)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1201, file: !1165, line: 65, baseType: !1080, size: 16, offset: 144)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1201, file: !1165, line: 66, baseType: !1064, size: 512, offset: 160)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1201, file: !1165, line: 67, baseType: !1061, size: 32, offset: 672)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1201, file: !1165, line: 69, baseType: !1212, size: 256, offset: 704)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1165, line: 60, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1165, line: 48, size: 256, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1213, file: !1165, line: 49, baseType: !1036, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1213, file: !1165, line: 58, baseType: !1054, size: 128, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1213, file: !1165, line: 59, baseType: !1061, size: 32, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1213, file: !1165, line: 59, baseType: !1061, size: 32, offset: 224)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1201, file: !1165, line: 70, baseType: !1061, size: 32, offset: 960)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1201, file: !1165, line: 74, baseType: !1061, size: 32, offset: 992)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1150, file: !1149, line: 124, baseType: !1222, size: 64, offset: 448)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !864, line: 838, size: 768, elements: !1224)
!1224 = !{!1225, !1239, !1240, !1250, !1251, !1282, !1283, !1284, !1285, !1286, !1287, !1288}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1223, file: !864, line: 840, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !1047, line: 499, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1047, line: 486, size: 1600, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1228, file: !1047, line: 487, baseType: !1175, size: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1228, file: !1047, line: 489, baseType: !1054, size: 128, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1228, file: !1047, line: 490, baseType: !1054, size: 128, offset: 1088)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1228, file: !1047, line: 491, baseType: !1054, size: 128, offset: 1216)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1228, file: !1047, line: 492, baseType: !1054, size: 128, offset: 1344)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1228, file: !1047, line: 494, baseType: !1061, size: 32, offset: 1472)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1228, file: !1047, line: 495, baseType: !1061, size: 32, offset: 1504)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1228, file: !1047, line: 497, baseType: !1061, size: 32, offset: 1536)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1228, file: !1047, line: 498, baseType: !1061, size: 32, offset: 1568)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1223, file: !864, line: 844, baseType: !1226, size: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1223, file: !864, line: 848, baseType: !1241, size: 64, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !864, line: 549, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !864, line: 544, size: 320, elements: !1244)
!1244 = !{!1245, !1247, !1248, !1249}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1243, file: !864, line: 545, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1243, file: !864, line: 545, baseType: !1246, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1243, file: !864, line: 547, baseType: !1226, size: 64, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1243, file: !864, line: 548, baseType: !1054, size: 128, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1223, file: !864, line: 851, baseType: !1054, size: 128, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1223, file: !864, line: 853, baseType: !1252, size: 64, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !864, line: 594, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !864, line: 561, size: 1664, elements: !1255)
!1255 = !{!1256, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1254, file: !864, line: 562, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1254, file: !864, line: 562, baseType: !1257, size: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1254, file: !864, line: 564, baseType: !1054, size: 128, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1254, file: !864, line: 565, baseType: !1226, size: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1254, file: !864, line: 566, baseType: !1241, size: 64, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1254, file: !864, line: 568, baseType: !1054, size: 128, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1254, file: !864, line: 569, baseType: !1054, size: 128, offset: 512)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1254, file: !864, line: 571, baseType: !1064, size: 512, offset: 640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1254, file: !864, line: 573, baseType: !1094, size: 32, offset: 1152)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1254, file: !864, line: 574, baseType: !1094, size: 32, offset: 1184)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1254, file: !864, line: 576, baseType: !1094, size: 32, offset: 1216)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1254, file: !864, line: 576, baseType: !1094, size: 32, offset: 1248)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1254, file: !864, line: 577, baseType: !1094, size: 32, offset: 1280)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1254, file: !864, line: 577, baseType: !1094, size: 32, offset: 1312)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1254, file: !864, line: 579, baseType: !1094, size: 32, offset: 1344)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1254, file: !864, line: 580, baseType: !1094, size: 32, offset: 1376)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1254, file: !864, line: 582, baseType: !1094, size: 32, offset: 1408)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1254, file: !864, line: 582, baseType: !1094, size: 32, offset: 1440)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1254, file: !864, line: 583, baseType: !1080, size: 16, offset: 1472)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1254, file: !864, line: 585, baseType: !1080, size: 16, offset: 1488)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1254, file: !864, line: 586, baseType: !1080, size: 16, offset: 1504)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1254, file: !864, line: 588, baseType: !1080, size: 16, offset: 1520)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1254, file: !864, line: 590, baseType: !1036, size: 64, offset: 1536)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1254, file: !864, line: 592, baseType: !1061, size: 32, offset: 1600)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1254, file: !864, line: 593, baseType: !1061, size: 32, offset: 1632)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !1223, file: !864, line: 858, baseType: !1054, size: 128, offset: 384)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !1223, file: !864, line: 859, baseType: !1054, size: 128, offset: 512)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1223, file: !864, line: 862, baseType: !1061, size: 32, offset: 640)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1223, file: !864, line: 863, baseType: !1061, size: 32, offset: 672)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !1223, file: !864, line: 866, baseType: !1080, size: 16, offset: 704)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !1223, file: !864, line: 867, baseType: !1080, size: 16, offset: 720)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !1223, file: !864, line: 868, baseType: !1094, size: 32, offset: 736)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "DriverVar", file: !864, line: 338, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DriverVar", file: !864, line: 328, size: 4288, elements: !1292)
!1292 = !{!1293, !1295, !1296, !1297, !1313, !1314, !1315}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1291, file: !864, line: 329, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1291, file: !864, line: 329, baseType: !1294, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1291, file: !864, line: 331, baseType: !1064, size: 512, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !1291, file: !864, line: 333, baseType: !1298, size: 3584, offset: 640)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1299, size: 3584, elements: !1311)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "DriverTarget", file: !864, line: 279, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DriverTarget", file: !864, line: 269, size: 448, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1308, !1309, !1310}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1300, file: !864, line: 270, baseType: !1177, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !1300, file: !864, line: 272, baseType: !1140, size: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pchan_name", scope: !1300, file: !864, line: 274, baseType: !1305, size: 256, offset: 128)
!1305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 256, elements: !1306)
!1306 = !{!1307}
!1307 = !DISubrange(count: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "transChan", scope: !1300, file: !864, line: 275, baseType: !1080, size: 16, offset: 384)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1300, file: !864, line: 277, baseType: !1080, size: 16, offset: 400)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "idtype", scope: !1300, file: !864, line: 278, baseType: !1061, size: 32, offset: 416)
!1311 = !{!1312}
!1312 = !DISubrange(count: 8)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "num_targets", scope: !1291, file: !864, line: 334, baseType: !1080, size: 16, offset: 4224)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1291, file: !864, line: 336, baseType: !1080, size: 16, offset: 4240)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !1291, file: !864, line: 337, baseType: !1094, size: 32, offset: 4256)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !1318, line: 295, baseType: !1319)
!1318 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1318, line: 115, size: 11392, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1334, !1335, !1336, !1337, !1338, !1342, !1351, !1353, !1354, !1395, !1396, !1399, !1400, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1439, !1440, !1441, !1442, !1443, !1444, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1515, !1518, !1521, !1522, !1523, !1524, !1525, !1528, !1550, !1553, !1554, !1560, !1561, !1562, !1563, !1564, !1565, !1567, !1570, !1573, !1574, !2758, !2759}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1319, file: !1318, line: 116, baseType: !1175, size: 960)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1319, file: !1318, line: 117, baseType: !1222, size: 64, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1319, file: !1318, line: 119, baseType: !1324, size: 64, offset: 1024)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !1318, line: 57, flags: DIFlagFwdDecl)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1319, file: !1318, line: 121, baseType: !1080, size: 16, offset: 1088)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1319, file: !1318, line: 121, baseType: !1080, size: 16, offset: 1104)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1319, file: !1318, line: 122, baseType: !1061, size: 32, offset: 1120)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1319, file: !1318, line: 122, baseType: !1061, size: 32, offset: 1152)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1319, file: !1318, line: 122, baseType: !1061, size: 32, offset: 1184)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1319, file: !1318, line: 123, baseType: !1064, size: 512, offset: 1216)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1319, file: !1318, line: 124, baseType: !1333, size: 64, offset: 1728)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1319, file: !1318, line: 124, baseType: !1333, size: 64, offset: 1792)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1319, file: !1318, line: 127, baseType: !1333, size: 64, offset: 1856)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1319, file: !1318, line: 127, baseType: !1333, size: 64, offset: 1920)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1319, file: !1318, line: 127, baseType: !1333, size: 64, offset: 1984)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1319, file: !1318, line: 128, baseType: !1339, size: 64, offset: 2048)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1341, line: 46, flags: DIFlagFwdDecl)
!1341 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1319, file: !1318, line: 130, baseType: !1343, size: 64, offset: 2112)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !1318, line: 97, size: 832, elements: !1345)
!1345 = !{!1346, !1349, !1350}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1344, file: !1318, line: 98, baseType: !1347, size: 768)
!1347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 768, elements: !1348)
!1348 = !{!1312, !1107}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1344, file: !1318, line: 99, baseType: !1061, size: 32, offset: 768)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1344, file: !1318, line: 99, baseType: !1061, size: 32, offset: 800)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1319, file: !1318, line: 131, baseType: !1352, size: 64, offset: 2176)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1319, file: !1318, line: 132, baseType: !1352, size: 64, offset: 2240)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1319, file: !1318, line: 133, baseType: !1355, size: 64, offset: 2304)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1047, line: 334, size: 1728, elements: !1357)
!1357 = !{!1358, !1359, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1394}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1356, file: !1047, line: 335, baseType: !1054, size: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1356, file: !1047, line: 336, baseType: !1360, size: 64, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1047, line: 47, flags: DIFlagFwdDecl)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1356, file: !1047, line: 338, baseType: !1080, size: 16, offset: 192)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1356, file: !1047, line: 338, baseType: !1080, size: 16, offset: 208)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1356, file: !1047, line: 339, baseType: !5, size: 32, offset: 224)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1356, file: !1047, line: 340, baseType: !1061, size: 32, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1356, file: !1047, line: 342, baseType: !1094, size: 32, offset: 288)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1356, file: !1047, line: 343, baseType: !1143, size: 96, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1356, file: !1047, line: 344, baseType: !1143, size: 96, offset: 416)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1356, file: !1047, line: 347, baseType: !1054, size: 128, offset: 512)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1356, file: !1047, line: 349, baseType: !1061, size: 32, offset: 640)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1356, file: !1047, line: 350, baseType: !1061, size: 32, offset: 672)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1356, file: !1047, line: 351, baseType: !1036, size: 64, offset: 704)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1356, file: !1047, line: 352, baseType: !1036, size: 64, offset: 768)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1356, file: !1047, line: 354, baseType: !1375, size: 384, offset: 832)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1047, line: 116, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1047, line: 94, size: 384, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1376, file: !1047, line: 96, baseType: !1061, size: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1376, file: !1047, line: 96, baseType: !1061, size: 32, offset: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1376, file: !1047, line: 97, baseType: !1061, size: 32, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1376, file: !1047, line: 97, baseType: !1061, size: 32, offset: 96)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1376, file: !1047, line: 99, baseType: !1080, size: 16, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1376, file: !1047, line: 100, baseType: !1080, size: 16, offset: 144)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1376, file: !1047, line: 102, baseType: !1080, size: 16, offset: 160)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1376, file: !1047, line: 105, baseType: !1080, size: 16, offset: 176)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1376, file: !1047, line: 108, baseType: !1080, size: 16, offset: 192)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1376, file: !1047, line: 109, baseType: !1080, size: 16, offset: 208)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1376, file: !1047, line: 111, baseType: !1080, size: 16, offset: 224)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1376, file: !1047, line: 112, baseType: !1080, size: 16, offset: 240)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1376, file: !1047, line: 114, baseType: !1061, size: 32, offset: 256)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1376, file: !1047, line: 114, baseType: !1061, size: 32, offset: 288)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1376, file: !1047, line: 115, baseType: !1061, size: 32, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1376, file: !1047, line: 115, baseType: !1061, size: 32, offset: 352)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1356, file: !1047, line: 355, baseType: !1064, size: 512, offset: 1216)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1319, file: !1318, line: 134, baseType: !1036, size: 64, offset: 2368)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1319, file: !1318, line: 136, baseType: !1397, size: 64, offset: 2432)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1318, line: 58, flags: DIFlagFwdDecl)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1319, file: !1318, line: 138, baseType: !1375, size: 384, offset: 2496)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1319, file: !1318, line: 139, baseType: !1401, size: 64, offset: 2880)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1047, line: 80, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1047, line: 72, size: 192, elements: !1404)
!1404 = !{!1405, !1412, !1413, !1414, !1415}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1403, file: !1047, line: 73, baseType: !1406, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1047, line: 59, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1047, line: 56, size: 128, elements: !1409)
!1409 = !{!1410, !1411}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1408, file: !1047, line: 57, baseType: !1143, size: 96)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1408, file: !1047, line: 58, baseType: !1061, size: 32, offset: 96)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1403, file: !1047, line: 74, baseType: !1061, size: 32, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1403, file: !1047, line: 76, baseType: !1061, size: 32, offset: 96)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1403, file: !1047, line: 77, baseType: !1061, size: 32, offset: 128)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1403, file: !1047, line: 79, baseType: !1061, size: 32, offset: 160)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1319, file: !1318, line: 141, baseType: !1054, size: 128, offset: 2944)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1319, file: !1318, line: 142, baseType: !1054, size: 128, offset: 3072)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1319, file: !1318, line: 143, baseType: !1054, size: 128, offset: 3200)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1319, file: !1318, line: 144, baseType: !1054, size: 128, offset: 3328)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1319, file: !1318, line: 146, baseType: !1061, size: 32, offset: 3456)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1319, file: !1318, line: 147, baseType: !1061, size: 32, offset: 3488)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1319, file: !1318, line: 150, baseType: !1423, size: 64, offset: 3520)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !896, line: 46, flags: DIFlagFwdDecl)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1319, file: !1318, line: 151, baseType: !1140, size: 64, offset: 3584)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1319, file: !1318, line: 152, baseType: !1061, size: 32, offset: 3648)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1319, file: !1318, line: 153, baseType: !1061, size: 32, offset: 3680)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1319, file: !1318, line: 156, baseType: !1143, size: 96, offset: 3712)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1319, file: !1318, line: 156, baseType: !1143, size: 96, offset: 3808)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1319, file: !1318, line: 156, baseType: !1143, size: 96, offset: 3904)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1319, file: !1318, line: 157, baseType: !1143, size: 96, offset: 4000)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1319, file: !1318, line: 158, baseType: !1143, size: 96, offset: 4096)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1319, file: !1318, line: 159, baseType: !1143, size: 96, offset: 4192)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1319, file: !1318, line: 160, baseType: !1143, size: 96, offset: 4288)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1319, file: !1318, line: 160, baseType: !1143, size: 96, offset: 4384)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1319, file: !1318, line: 161, baseType: !1438, size: 128, offset: 4480)
!1438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 128, elements: !1075)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1319, file: !1318, line: 161, baseType: !1438, size: 128, offset: 4608)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1319, file: !1318, line: 162, baseType: !1143, size: 96, offset: 4736)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1319, file: !1318, line: 162, baseType: !1143, size: 96, offset: 4832)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1319, file: !1318, line: 163, baseType: !1094, size: 32, offset: 4928)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1319, file: !1318, line: 163, baseType: !1094, size: 32, offset: 4960)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1319, file: !1318, line: 164, baseType: !1445, size: 512, offset: 4992)
!1445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 512, elements: !1446)
!1446 = !{!1076, !1076}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1319, file: !1318, line: 165, baseType: !1445, size: 512, offset: 5504)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1319, file: !1318, line: 166, baseType: !1445, size: 512, offset: 6016)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1319, file: !1318, line: 167, baseType: !1445, size: 512, offset: 6528)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1319, file: !1318, line: 176, baseType: !1445, size: 512, offset: 7040)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1319, file: !1318, line: 178, baseType: !5, size: 32, offset: 7552)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1319, file: !1318, line: 180, baseType: !1080, size: 16, offset: 7584)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1319, file: !1318, line: 181, baseType: !1080, size: 16, offset: 7600)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1319, file: !1318, line: 183, baseType: !1080, size: 16, offset: 7616)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1319, file: !1318, line: 183, baseType: !1080, size: 16, offset: 7632)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1319, file: !1318, line: 184, baseType: !1080, size: 16, offset: 7648)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1319, file: !1318, line: 184, baseType: !1080, size: 16, offset: 7664)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1319, file: !1318, line: 185, baseType: !1080, size: 16, offset: 7680)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1319, file: !1318, line: 186, baseType: !1080, size: 16, offset: 7696)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1319, file: !1318, line: 187, baseType: !1080, size: 16, offset: 7712)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1319, file: !1318, line: 188, baseType: !1065, size: 8, offset: 7728)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1319, file: !1318, line: 189, baseType: !1065, size: 8, offset: 7736)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1319, file: !1318, line: 192, baseType: !1061, size: 32, offset: 7744)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1319, file: !1318, line: 192, baseType: !1061, size: 32, offset: 7776)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1319, file: !1318, line: 192, baseType: !1061, size: 32, offset: 7808)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1319, file: !1318, line: 192, baseType: !1061, size: 32, offset: 7840)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1319, file: !1318, line: 194, baseType: !1061, size: 32, offset: 7872)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1319, file: !1318, line: 202, baseType: !1094, size: 32, offset: 7904)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1319, file: !1318, line: 202, baseType: !1094, size: 32, offset: 7936)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1319, file: !1318, line: 202, baseType: !1094, size: 32, offset: 7968)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1319, file: !1318, line: 211, baseType: !1094, size: 32, offset: 8000)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1319, file: !1318, line: 212, baseType: !1094, size: 32, offset: 8032)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1319, file: !1318, line: 213, baseType: !1094, size: 32, offset: 8064)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1319, file: !1318, line: 214, baseType: !1094, size: 32, offset: 8096)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1319, file: !1318, line: 215, baseType: !1094, size: 32, offset: 8128)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1319, file: !1318, line: 216, baseType: !1094, size: 32, offset: 8160)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1319, file: !1318, line: 219, baseType: !1094, size: 32, offset: 8192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1319, file: !1318, line: 220, baseType: !1094, size: 32, offset: 8224)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1319, file: !1318, line: 221, baseType: !1094, size: 32, offset: 8256)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1319, file: !1318, line: 224, baseType: !1481, size: 16, offset: 8288)
!1481 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1319, file: !1318, line: 224, baseType: !1481, size: 16, offset: 8304)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1319, file: !1318, line: 226, baseType: !1080, size: 16, offset: 8320)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1319, file: !1318, line: 228, baseType: !1065, size: 8, offset: 8336)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1319, file: !1318, line: 229, baseType: !1065, size: 8, offset: 8344)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1319, file: !1318, line: 231, baseType: !1080, size: 16, offset: 8352)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1319, file: !1318, line: 232, baseType: !1065, size: 8, offset: 8368)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1319, file: !1318, line: 233, baseType: !1065, size: 8, offset: 8376)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1319, file: !1318, line: 234, baseType: !1094, size: 32, offset: 8384)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1319, file: !1318, line: 235, baseType: !1094, size: 32, offset: 8416)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1319, file: !1318, line: 237, baseType: !1054, size: 128, offset: 8448)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1319, file: !1318, line: 238, baseType: !1054, size: 128, offset: 8576)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1319, file: !1318, line: 239, baseType: !1054, size: 128, offset: 8704)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1319, file: !1318, line: 240, baseType: !1054, size: 128, offset: 8832)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1319, file: !1318, line: 242, baseType: !1094, size: 32, offset: 8960)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1319, file: !1318, line: 244, baseType: !1080, size: 16, offset: 8992)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1319, file: !1318, line: 245, baseType: !1481, size: 16, offset: 9008)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1319, file: !1318, line: 246, baseType: !1438, size: 128, offset: 9024)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1319, file: !1318, line: 248, baseType: !1061, size: 32, offset: 9152)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1319, file: !1318, line: 249, baseType: !1061, size: 32, offset: 9184)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1319, file: !1318, line: 251, baseType: !1502, size: 64, offset: 9216)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !1318, line: 251, flags: DIFlagFwdDecl)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1319, file: !1318, line: 253, baseType: !1065, size: 8, offset: 9280)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1319, file: !1318, line: 254, baseType: !1065, size: 8, offset: 9288)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1319, file: !1318, line: 255, baseType: !1080, size: 16, offset: 9296)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1319, file: !1318, line: 256, baseType: !1143, size: 96, offset: 9312)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1319, file: !1318, line: 258, baseType: !1054, size: 128, offset: 9408)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1319, file: !1318, line: 259, baseType: !1054, size: 128, offset: 9536)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1319, file: !1318, line: 260, baseType: !1054, size: 128, offset: 9664)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1319, file: !1318, line: 261, baseType: !1054, size: 128, offset: 9792)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1319, file: !1318, line: 263, baseType: !1513, size: 64, offset: 9920)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64)
!1514 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !1318, line: 52, flags: DIFlagFwdDecl)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1319, file: !1318, line: 264, baseType: !1516, size: 64, offset: 9984)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64)
!1517 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !1318, line: 53, flags: DIFlagFwdDecl)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1319, file: !1318, line: 265, baseType: !1519, size: 64, offset: 10048)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64)
!1520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1047, line: 46, flags: DIFlagFwdDecl)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1319, file: !1318, line: 267, baseType: !1065, size: 8, offset: 10112)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1319, file: !1318, line: 268, baseType: !1065, size: 8, offset: 10120)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1319, file: !1318, line: 269, baseType: !1080, size: 16, offset: 10128)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1319, file: !1318, line: 270, baseType: !1094, size: 32, offset: 10144)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1319, file: !1318, line: 272, baseType: !1526, size: 64, offset: 10176)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64)
!1527 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !1318, line: 54, flags: DIFlagFwdDecl)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1319, file: !1318, line: 275, baseType: !1529, size: 64, offset: 10240)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !1531, line: 49, size: 448, elements: !1532)
!1531 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1532 = !{!1533, !1534, !1535, !1536}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !1530, file: !1531, line: 50, baseType: !1054, size: 128)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !1530, file: !1531, line: 51, baseType: !1054, size: 128, offset: 128)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !1530, file: !1531, line: 52, baseType: !1054, size: 128, offset: 256)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1530, file: !1531, line: 53, baseType: !1537, size: 64, offset: 384)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !896, line: 65, size: 128, elements: !1539)
!1539 = !{!1540, !1548, !1549}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1538, file: !896, line: 66, baseType: !1541, size: 64)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !896, line: 56, size: 320, elements: !1543)
!1543 = !{!1544, !1545, !1546, !1547}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1542, file: !896, line: 57, baseType: !1438, size: 128)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1542, file: !896, line: 58, baseType: !1438, size: 128, offset: 128)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !1542, file: !896, line: 59, baseType: !1094, size: 32, offset: 256)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1542, file: !896, line: 59, baseType: !1094, size: 32, offset: 288)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1538, file: !896, line: 67, baseType: !1061, size: 32, offset: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !1538, file: !896, line: 68, baseType: !1094, size: 32, offset: 96)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1319, file: !1318, line: 277, baseType: !1551, size: 64, offset: 10304)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64)
!1552 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !1318, line: 56, flags: DIFlagFwdDecl)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1319, file: !1318, line: 277, baseType: !1551, size: 64, offset: 10368)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1319, file: !1318, line: 278, baseType: !1555, size: 64, offset: 10432)
!1555 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1556, line: 27, baseType: !1557)
!1556 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1558, line: 45, baseType: !1559)
!1558 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1559 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1319, file: !1318, line: 279, baseType: !1555, size: 64, offset: 10496)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1319, file: !1318, line: 280, baseType: !5, size: 32, offset: 10560)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1319, file: !1318, line: 281, baseType: !5, size: 32, offset: 10592)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1319, file: !1318, line: 283, baseType: !1054, size: 128, offset: 10624)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1319, file: !1318, line: 284, baseType: !1054, size: 128, offset: 10752)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1319, file: !1318, line: 285, baseType: !1566, size: 64, offset: 10880)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1319, file: !1318, line: 287, baseType: !1568, size: 64, offset: 10944)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64)
!1569 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !1318, line: 59, flags: DIFlagFwdDecl)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1319, file: !1318, line: 288, baseType: !1571, size: 64, offset: 11008)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
!1572 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !1318, line: 288, flags: DIFlagFwdDecl)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1319, file: !1318, line: 290, baseType: !1129, size: 64, offset: 11072)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1319, file: !1318, line: 291, baseType: !1575, size: 64, offset: 11136)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64)
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1577, line: 65, baseType: !1578)
!1577 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1577, line: 50, size: 320, elements: !1579)
!1579 = !{!1580, !2745, !2746, !2747, !2748, !2749, !2750, !2751, !2752, !2753, !2754, !2755, !2756, !2757}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1578, file: !1577, line: 51, baseType: !1581, size: 64)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1583, line: 1216, size: 39680, elements: !1584)
!1583 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1584 = !{!1585, !1586, !1587, !1588, !1591, !1592, !1593, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1619, !1693, !2117, !2332, !2335, !2620, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2642, !2643, !2644, !2645, !2646, !2654, !2721, !2728, !2729, !2736, !2737, !2738, !2739, !2740, !2741, !2742}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1582, file: !1583, line: 1217, baseType: !1175, size: 960)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1582, file: !1583, line: 1218, baseType: !1222, size: 64, offset: 960)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1582, file: !1583, line: 1220, baseType: !1333, size: 64, offset: 1024)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1582, file: !1583, line: 1221, baseType: !1589, size: 64, offset: 1088)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64)
!1590 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1583, line: 52, flags: DIFlagFwdDecl)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1582, file: !1583, line: 1223, baseType: !1581, size: 64, offset: 1152)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1582, file: !1583, line: 1225, baseType: !1054, size: 128, offset: 1216)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1582, file: !1583, line: 1226, baseType: !1594, size: 64, offset: 1344)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1583, line: 69, size: 320, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1595, file: !1583, line: 70, baseType: !1594, size: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1595, file: !1583, line: 70, baseType: !1594, size: 64, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1595, file: !1583, line: 71, baseType: !5, size: 32, offset: 128)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1595, file: !1583, line: 71, baseType: !5, size: 32, offset: 160)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1595, file: !1583, line: 72, baseType: !1061, size: 32, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1595, file: !1583, line: 73, baseType: !1080, size: 16, offset: 224)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1595, file: !1583, line: 73, baseType: !1080, size: 16, offset: 240)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1595, file: !1583, line: 74, baseType: !1333, size: 64, offset: 256)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1582, file: !1583, line: 1227, baseType: !1333, size: 64, offset: 1408)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1582, file: !1583, line: 1229, baseType: !1143, size: 96, offset: 1472)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1582, file: !1583, line: 1230, baseType: !1143, size: 96, offset: 1568)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1582, file: !1583, line: 1231, baseType: !1143, size: 96, offset: 1664)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1582, file: !1583, line: 1231, baseType: !1143, size: 96, offset: 1760)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1582, file: !1583, line: 1233, baseType: !5, size: 32, offset: 1856)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1582, file: !1583, line: 1234, baseType: !1061, size: 32, offset: 1888)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1582, file: !1583, line: 1235, baseType: !5, size: 32, offset: 1920)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1582, file: !1583, line: 1237, baseType: !1080, size: 16, offset: 1952)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1582, file: !1583, line: 1239, baseType: !1065, size: 8, offset: 1968)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1582, file: !1583, line: 1240, baseType: !1616, size: 8, offset: 1976)
!1616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 8, elements: !1617)
!1617 = !{!1618}
!1618 = !DISubrange(count: 1)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1582, file: !1583, line: 1242, baseType: !1620, size: 64, offset: 1984)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1622, line: 328, size: 3456, elements: !1623)
!1622 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1623 = !{!1624, !1625, !1626, !1629, !1630, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1659, !1660, !1661, !1664, !1669, !1670, !1673, !1677, !1681, !1685, !1689, !1690, !1691, !1692}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1621, file: !1622, line: 329, baseType: !1175, size: 960)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1621, file: !1622, line: 330, baseType: !1222, size: 64, offset: 960)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1621, file: !1622, line: 332, baseType: !1627, size: 64, offset: 1024)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64)
!1628 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1622, line: 332, flags: DIFlagFwdDecl)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1621, file: !1622, line: 333, baseType: !1064, size: 512, offset: 1088)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1621, file: !1622, line: 335, baseType: !1631, size: 64, offset: 1600)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64)
!1632 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1633, line: 41, flags: DIFlagFwdDecl)
!1633 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1621, file: !1622, line: 337, baseType: !1397, size: 64, offset: 1664)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1621, file: !1622, line: 338, baseType: !1129, size: 64, offset: 1728)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1621, file: !1622, line: 340, baseType: !1054, size: 128, offset: 1792)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1621, file: !1622, line: 340, baseType: !1054, size: 128, offset: 1920)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1621, file: !1622, line: 342, baseType: !1061, size: 32, offset: 2048)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1621, file: !1622, line: 342, baseType: !1061, size: 32, offset: 2080)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1621, file: !1622, line: 343, baseType: !1061, size: 32, offset: 2112)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1621, file: !1622, line: 345, baseType: !1061, size: 32, offset: 2144)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1621, file: !1622, line: 346, baseType: !1061, size: 32, offset: 2176)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1621, file: !1622, line: 347, baseType: !1080, size: 16, offset: 2208)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1621, file: !1622, line: 348, baseType: !1080, size: 16, offset: 2224)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1621, file: !1622, line: 349, baseType: !1061, size: 32, offset: 2240)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1621, file: !1622, line: 351, baseType: !1061, size: 32, offset: 2272)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1621, file: !1622, line: 353, baseType: !1080, size: 16, offset: 2304)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1621, file: !1622, line: 354, baseType: !1080, size: 16, offset: 2320)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1621, file: !1622, line: 355, baseType: !1061, size: 32, offset: 2336)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1621, file: !1622, line: 357, baseType: !1651, size: 128, offset: 2368)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1652, line: 95, baseType: !1653)
!1652 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1652, line: 92, size: 128, elements: !1654)
!1654 = !{!1655, !1656, !1657, !1658}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1653, file: !1652, line: 93, baseType: !1094, size: 32)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1653, file: !1652, line: 93, baseType: !1094, size: 32, offset: 32)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1653, file: !1652, line: 94, baseType: !1094, size: 32, offset: 64)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1653, file: !1652, line: 94, baseType: !1094, size: 32, offset: 96)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1621, file: !1622, line: 363, baseType: !1054, size: 128, offset: 2496)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1621, file: !1622, line: 363, baseType: !1054, size: 128, offset: 2624)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1621, file: !1622, line: 368, baseType: !1662, size: 64, offset: 2752)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64)
!1663 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1622, line: 48, flags: DIFlagFwdDecl)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1621, file: !1622, line: 372, baseType: !1665, size: 32, offset: 2816)
!1665 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1622, line: 274, baseType: !1666)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1622, line: 271, size: 32, elements: !1667)
!1667 = !{!1668}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1666, file: !1622, line: 273, baseType: !5, size: 32)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1621, file: !1622, line: 373, baseType: !1061, size: 32, offset: 2848)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1621, file: !1622, line: 382, baseType: !1671, size: 64, offset: 2880)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64)
!1672 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1622, line: 46, flags: DIFlagFwdDecl)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1621, file: !1622, line: 385, baseType: !1674, size: 64, offset: 2944)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{null, !1036, !1094}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1621, file: !1622, line: 386, baseType: !1678, size: 64, offset: 3008)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{null, !1036, !1140}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1621, file: !1622, line: 387, baseType: !1682, size: 64, offset: 3072)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!1061, !1036}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1621, file: !1622, line: 388, baseType: !1686, size: 64, offset: 3136)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{null, !1036}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1621, file: !1622, line: 389, baseType: !1036, size: 64, offset: 3200)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1621, file: !1622, line: 389, baseType: !1036, size: 64, offset: 3264)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1621, file: !1622, line: 389, baseType: !1036, size: 64, offset: 3328)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1621, file: !1622, line: 389, baseType: !1036, size: 64, offset: 3392)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1582, file: !1583, line: 1244, baseType: !1694, size: 64, offset: 2048)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1696, line: 200, size: 17024, elements: !1697)
!1696 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1697 = !{!1698, !1699, !1700, !1701, !2110, !2111, !2112, !2113, !2114, !2115, !2116}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1695, file: !1696, line: 201, baseType: !1566, size: 64)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1695, file: !1696, line: 202, baseType: !1054, size: 128, offset: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1695, file: !1696, line: 203, baseType: !1054, size: 128, offset: 192)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1695, file: !1696, line: 206, baseType: !1702, size: 64, offset: 320)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64)
!1703 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1696, line: 190, baseType: !1704)
!1704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1696, line: 126, size: 2816, elements: !1705)
!1705 = !{!1706, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1801, !1802, !1803, !1804, !2081, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2109}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1704, file: !1696, line: 127, baseType: !1707, size: 64)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1704, file: !1696, line: 127, baseType: !1707, size: 64, offset: 64)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1704, file: !1696, line: 128, baseType: !1036, size: 64, offset: 128)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1704, file: !1696, line: 129, baseType: !1036, size: 64, offset: 192)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1704, file: !1696, line: 130, baseType: !1064, size: 512, offset: 256)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1704, file: !1696, line: 132, baseType: !1061, size: 32, offset: 768)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1704, file: !1696, line: 132, baseType: !1061, size: 32, offset: 800)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1704, file: !1696, line: 133, baseType: !1061, size: 32, offset: 832)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1704, file: !1696, line: 134, baseType: !1061, size: 32, offset: 864)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1704, file: !1696, line: 134, baseType: !1061, size: 32, offset: 896)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1704, file: !1696, line: 134, baseType: !1061, size: 32, offset: 928)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1704, file: !1696, line: 135, baseType: !1061, size: 32, offset: 960)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1704, file: !1696, line: 135, baseType: !1061, size: 32, offset: 992)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1704, file: !1696, line: 136, baseType: !1061, size: 32, offset: 1024)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1704, file: !1696, line: 136, baseType: !1061, size: 32, offset: 1056)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1704, file: !1696, line: 137, baseType: !1061, size: 32, offset: 1088)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1704, file: !1696, line: 137, baseType: !1061, size: 32, offset: 1120)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1704, file: !1696, line: 138, baseType: !1094, size: 32, offset: 1152)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1704, file: !1696, line: 139, baseType: !1094, size: 32, offset: 1184)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1704, file: !1696, line: 139, baseType: !1094, size: 32, offset: 1216)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1704, file: !1696, line: 141, baseType: !1080, size: 16, offset: 1248)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1704, file: !1696, line: 142, baseType: !1080, size: 16, offset: 1264)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1704, file: !1696, line: 143, baseType: !1061, size: 32, offset: 1280)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1704, file: !1696, line: 144, baseType: !1061, size: 32, offset: 1312)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1704, file: !1696, line: 146, baseType: !1732, size: 64, offset: 1344)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64)
!1733 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1696, line: 114, baseType: !1734)
!1734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1696, line: 99, size: 7232, elements: !1735)
!1735 = !{!1736, !1738, !1739, !1740, !1741, !1742, !1743, !1751, !1755, !1769, !1778, !1785, !1795}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1734, file: !1696, line: 100, baseType: !1737, size: 64)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1734, size: 64)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1734, file: !1696, line: 100, baseType: !1737, size: 64, offset: 64)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1734, file: !1696, line: 101, baseType: !1061, size: 32, offset: 128)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1734, file: !1696, line: 101, baseType: !1061, size: 32, offset: 160)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1734, file: !1696, line: 102, baseType: !1061, size: 32, offset: 192)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1734, file: !1696, line: 102, baseType: !1061, size: 32, offset: 224)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1734, file: !1696, line: 103, baseType: !1744, size: 64, offset: 256)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64)
!1745 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1696, line: 59, baseType: !1746)
!1746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1696, line: 56, size: 2112, elements: !1747)
!1747 = !{!1748, !1749, !1750}
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1746, file: !1696, line: 57, baseType: !1089, size: 2048)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1746, file: !1696, line: 58, baseType: !1061, size: 32, offset: 2048)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1746, file: !1696, line: 58, baseType: !1061, size: 32, offset: 2080)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1734, file: !1696, line: 106, baseType: !1752, size: 6144, offset: 320)
!1752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 6144, elements: !1753)
!1753 = !{!1754}
!1754 = !DISubrange(count: 768)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1734, file: !1696, line: 107, baseType: !1756, size: 64, offset: 6464)
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1757, size: 64)
!1757 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1696, line: 97, baseType: !1758)
!1758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1696, line: 83, size: 8320, elements: !1759)
!1759 = !{!1760, !1761, !1762, !1765, !1766, !1767, !1768}
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1758, file: !1696, line: 84, baseType: !1752, size: 6144)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1758, file: !1696, line: 87, baseType: !1089, size: 2048, offset: 6144)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1758, file: !1696, line: 88, baseType: !1763, size: 64, offset: 8192)
!1763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1764, size: 64)
!1764 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1577, line: 41, flags: DIFlagFwdDecl)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1758, file: !1696, line: 90, baseType: !1080, size: 16, offset: 8256)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1758, file: !1696, line: 92, baseType: !1080, size: 16, offset: 8272)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1758, file: !1696, line: 93, baseType: !1080, size: 16, offset: 8288)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1758, file: !1696, line: 95, baseType: !1080, size: 16, offset: 8304)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1734, file: !1696, line: 108, baseType: !1770, size: 64, offset: 6528)
!1770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1771, size: 64)
!1771 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1696, line: 66, baseType: !1772)
!1772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1696, line: 61, size: 128, elements: !1773)
!1773 = !{!1774, !1775, !1776, !1777}
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1772, file: !1696, line: 62, baseType: !1061, size: 32)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1772, file: !1696, line: 63, baseType: !1061, size: 32, offset: 32)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1772, file: !1696, line: 64, baseType: !1061, size: 32, offset: 64)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1772, file: !1696, line: 65, baseType: !1061, size: 32, offset: 96)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1734, file: !1696, line: 109, baseType: !1779, size: 64, offset: 6592)
!1779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1780, size: 64)
!1780 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1696, line: 71, baseType: !1781)
!1781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1696, line: 68, size: 64, elements: !1782)
!1782 = !{!1783, !1784}
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1781, file: !1696, line: 69, baseType: !1061, size: 32)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1781, file: !1696, line: 70, baseType: !1061, size: 32, offset: 32)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1734, file: !1696, line: 110, baseType: !1786, size: 64, offset: 6656)
!1786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1787, size: 64)
!1787 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1696, line: 81, baseType: !1788)
!1788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1696, line: 73, size: 352, elements: !1789)
!1789 = !{!1790, !1791, !1792, !1793, !1794}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1788, file: !1696, line: 74, baseType: !1143, size: 96)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1788, file: !1696, line: 75, baseType: !1143, size: 96, offset: 96)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1788, file: !1696, line: 76, baseType: !1143, size: 96, offset: 192)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1788, file: !1696, line: 77, baseType: !1061, size: 32, offset: 288)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1788, file: !1696, line: 78, baseType: !1061, size: 32, offset: 320)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1734, file: !1696, line: 113, baseType: !1796, size: 512, offset: 6720)
!1796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1797, line: 182, baseType: !1798)
!1797 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1797, line: 180, size: 512, elements: !1799)
!1799 = !{!1800}
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1798, file: !1797, line: 181, baseType: !1064, size: 512)
