; ModuleID = 'blender/source/blender/editors/uvedit/uvedit_ops.c'
source_filename = "blender/source/blender/editors/uvedit/uvedit_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "target_items", scope: !2, file: !3, line: 3219, type: !3580, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "UV_OT_snap_cursor", scope: !3, file: !3, line: 3217, type: !4, scopeLine: 3218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2745, retainedNodes: !3566)
!3 = !DIFile(filename: "blender/source/blender/editors/uvedit/uvedit_ops.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !2696, !2700, !2706, !2710, !2711, !2715, !2716, !2717, !2718, !2722, !2723, !2738, !2739, !2743, !2744}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !85, !2691, !2692, !2693, !2694, !2695}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !84}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !83, line: 335, flags: DIFlagFwdDecl)
!83 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !87, file: !28, line: 107, baseType: !58, size: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !87, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !87, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !87, file: !28, line: 111, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !97)
!97 = !{!98, !99, !100, !2682, !2683, !2684, !2685, !2686, !2687, !2688, !2689, !2690}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !8, line: 491, baseType: !95, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !96, file: !8, line: 491, baseType: !95, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !96, file: !8, line: 493, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !103)
!103 = !{!104, !105, !106, !107, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2612, !2613, !2614, !2615, !2616, !2657, !2660, !2674, !2675, !2676, !2677, !2678, !2679, !2680, !2681}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !28, line: 170, baseType: !101, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !102, file: !28, line: 170, baseType: !101, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !102, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !102, file: !28, line: 174, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !110, line: 49, size: 1984, elements: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !148, !149, !150, !151, !152, !2582, !2583, !2584, !2585, !2586, !2587, !2588, !2589, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2597, !2598}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !110, line: 50, baseType: !113, size: 960)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !115)
!115 = !{!116, !117, !118, !120, !139, !143, !144, !145, !146, !147}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !39, line: 118, baseType: !56, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !114, file: !39, line: 119, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !114, file: !39, line: 120, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !123)
!123 = !{!124, !125, !127, !130, !134, !135, !136}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !122, file: !39, line: 137, baseType: !113, size: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !122, file: !39, line: 138, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !122, file: !39, line: 139, baseType: !128, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !39, line: 140, baseType: !131, size: 8192, offset: 1088)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !122, file: !39, line: 141, baseType: !131, size: 8192, offset: 9280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !122, file: !39, line: 148, baseType: !121, size: 64, offset: 17472)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !122, file: !39, line: 150, baseType: !137, size: 64, offset: 17536)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !39, line: 121, baseType: !140, size: 528, offset: 256)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 66)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !114, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !114, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !109, file: !110, line: 52, baseType: !58, size: 128, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !109, file: !110, line: 53, baseType: !58, size: 128, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !109, file: !110, line: 54, baseType: !58, size: 128, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !109, file: !110, line: 55, baseType: !58, size: 128, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !109, file: !110, line: 57, baseType: !153, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !155, line: 1216, size: 39680, elements: !156)
!155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !{!157, !158, !162, !1540, !1621, !1622, !1623, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1991, !2215, !2218, !2458, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2480, !2481, !2482, !2483, !2484, !2492, !2558, !2565, !2566, !2573, !2574, !2575, !2576, !2577, !2578, !2579}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !155, line: 1217, baseType: !113, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !154, file: !155, line: 1218, baseType: !159, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !161, line: 45, flags: DIFlagFwdDecl)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !154, file: !155, line: 1220, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !165, line: 115, size: 11392, elements: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168, !169, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !186, !198, !212, !213, !257, !258, !261, !262, !278, !279, !280, !281, !282, !283, !284, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1487, !1490, !1491, !1492, !1493, !1494, !1495, !1498, !1501, !1504, !1505, !1511, !1512, !1513, !1514, !1515, !1516, !1518, !1521, !1524, !1525, !1528, !1529}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 116, baseType: !113, size: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !164, file: !165, line: 117, baseType: !159, size: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !164, file: !165, line: 119, baseType: !170, size: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !165, line: 57, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 121, baseType: !48, size: 16, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !164, file: !165, line: 121, baseType: !48, size: 16, offset: 1104)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1120)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1184)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !164, file: !165, line: 123, baseType: !33, size: 512, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !164, file: !165, line: 128, baseType: !184, size: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !161, line: 46, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !164, file: !165, line: 130, baseType: !187, size: 64, offset: 2112)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !165, line: 97, size: 832, elements: !189)
!189 = !{!190, !196, !197}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !188, file: !165, line: 98, baseType: !191, size: 768)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 768, elements: !193)
!192 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!193 = !{!194, !195}
!194 = !DISubrange(count: 8)
!195 = !DISubrange(count: 3)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !188, file: !165, line: 99, baseType: !22, size: 32, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !188, file: !165, line: 99, baseType: !22, size: 32, offset: 800)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !164, file: !165, line: 131, baseType: !199, size: 64, offset: 2176)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !201, line: 486, size: 1600, elements: !202)
!201 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !200, file: !201, line: 487, baseType: !113, size: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !200, file: !201, line: 489, baseType: !58, size: 128, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !200, file: !201, line: 490, baseType: !58, size: 128, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !200, file: !201, line: 491, baseType: !58, size: 128, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !200, file: !201, line: 492, baseType: !58, size: 128, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !201, line: 494, baseType: !22, size: 32, offset: 1472)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !200, file: !201, line: 495, baseType: !22, size: 32, offset: 1504)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !200, file: !201, line: 497, baseType: !22, size: 32, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !200, file: !201, line: 498, baseType: !22, size: 32, offset: 1568)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !164, file: !165, line: 132, baseType: !199, size: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !164, file: !165, line: 133, baseType: !214, size: 64, offset: 2304)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !201, line: 334, size: 1728, elements: !216)
!216 = !{!217, !218, !221, !222, !223, !225, !226, !227, !230, !231, !232, !233, !234, !235, !236, !256}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !215, file: !201, line: 335, baseType: !58, size: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !215, file: !201, line: 336, baseType: !219, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !201, line: 47, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !201, line: 338, baseType: !48, size: 16, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !215, file: !201, line: 338, baseType: !48, size: 16, offset: 208)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !215, file: !201, line: 339, baseType: !224, size: 32, offset: 224)
!224 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !215, file: !201, line: 340, baseType: !22, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !215, file: !201, line: 342, baseType: !192, size: 32, offset: 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !215, file: !201, line: 343, baseType: !228, size: 96, offset: 320)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 96, elements: !229)
!229 = !{!195}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !215, file: !201, line: 344, baseType: !228, size: 96, offset: 416)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !215, file: !201, line: 347, baseType: !58, size: 128, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !215, file: !201, line: 349, baseType: !22, size: 32, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !215, file: !201, line: 350, baseType: !22, size: 32, offset: 672)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !215, file: !201, line: 351, baseType: !56, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !215, file: !201, line: 352, baseType: !56, size: 64, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !215, file: !201, line: 354, baseType: !237, size: 384, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !201, line: 116, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !201, line: 94, size: 384, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !238, file: !201, line: 96, baseType: !22, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !238, file: !201, line: 96, baseType: !22, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !238, file: !201, line: 97, baseType: !22, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !238, file: !201, line: 97, baseType: !22, size: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !238, file: !201, line: 99, baseType: !48, size: 16, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !238, file: !201, line: 100, baseType: !48, size: 16, offset: 144)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !238, file: !201, line: 102, baseType: !48, size: 16, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !238, file: !201, line: 105, baseType: !48, size: 16, offset: 176)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !238, file: !201, line: 108, baseType: !48, size: 16, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !238, file: !201, line: 109, baseType: !48, size: 16, offset: 208)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !238, file: !201, line: 111, baseType: !48, size: 16, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !238, file: !201, line: 112, baseType: !48, size: 16, offset: 240)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !238, file: !201, line: 114, baseType: !22, size: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !238, file: !201, line: 114, baseType: !22, size: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !238, file: !201, line: 115, baseType: !22, size: 32, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !238, file: !201, line: 115, baseType: !22, size: 32, offset: 352)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !215, file: !201, line: 355, baseType: !33, size: 512, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !165, line: 134, baseType: !56, size: 64, offset: 2368)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !164, file: !165, line: 136, baseType: !259, size: 64, offset: 2432)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !165, line: 58, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !164, file: !165, line: 138, baseType: !237, size: 384, offset: 2496)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !164, file: !165, line: 139, baseType: !263, size: 64, offset: 2880)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !201, line: 80, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !201, line: 72, size: 192, elements: !266)
!266 = !{!267, !274, !275, !276, !277}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !265, file: !201, line: 73, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !201, line: 59, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !201, line: 56, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !270, file: !201, line: 57, baseType: !228, size: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !201, line: 58, baseType: !22, size: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !265, file: !201, line: 74, baseType: !22, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !265, file: !201, line: 76, baseType: !22, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !265, file: !201, line: 77, baseType: !22, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !265, file: !201, line: 79, baseType: !22, size: 32, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !164, file: !165, line: 141, baseType: !58, size: 128, offset: 2944)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !164, file: !165, line: 142, baseType: !58, size: 128, offset: 3072)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !164, file: !165, line: 143, baseType: !58, size: 128, offset: 3200)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !164, file: !165, line: 144, baseType: !58, size: 128, offset: 3328)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !164, file: !165, line: 146, baseType: !22, size: 32, offset: 3456)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !164, file: !165, line: 147, baseType: !22, size: 32, offset: 3488)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !164, file: !165, line: 150, baseType: !285, size: 64, offset: 3520)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !288, line: 93, size: 7552, elements: !289)
!288 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !338, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !407, !408, !409, !410, !411, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !1358, !1359, !1360, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1400}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !287, file: !288, line: 94, baseType: !113, size: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !287, file: !288, line: 95, baseType: !159, size: 64, offset: 960)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !287, file: !288, line: 97, baseType: !48, size: 16, offset: 1024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !287, file: !288, line: 97, baseType: !48, size: 16, offset: 1040)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !287, file: !288, line: 99, baseType: !192, size: 32, offset: 1056)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !287, file: !288, line: 99, baseType: !192, size: 32, offset: 1088)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !287, file: !288, line: 99, baseType: !192, size: 32, offset: 1120)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !287, file: !288, line: 100, baseType: !192, size: 32, offset: 1152)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !287, file: !288, line: 100, baseType: !192, size: 32, offset: 1184)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !287, file: !288, line: 100, baseType: !192, size: 32, offset: 1216)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !287, file: !288, line: 101, baseType: !192, size: 32, offset: 1248)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !287, file: !288, line: 101, baseType: !192, size: 32, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !287, file: !288, line: 101, baseType: !192, size: 32, offset: 1312)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !287, file: !288, line: 102, baseType: !192, size: 32, offset: 1344)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !287, file: !288, line: 102, baseType: !192, size: 32, offset: 1376)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !287, file: !288, line: 102, baseType: !192, size: 32, offset: 1408)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !287, file: !288, line: 103, baseType: !192, size: 32, offset: 1440)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !287, file: !288, line: 103, baseType: !192, size: 32, offset: 1472)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !287, file: !288, line: 103, baseType: !192, size: 32, offset: 1504)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !287, file: !288, line: 103, baseType: !192, size: 32, offset: 1536)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !287, file: !288, line: 103, baseType: !192, size: 32, offset: 1568)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !287, file: !288, line: 104, baseType: !192, size: 32, offset: 1600)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !287, file: !288, line: 104, baseType: !192, size: 32, offset: 1632)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !287, file: !288, line: 104, baseType: !192, size: 32, offset: 1664)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !287, file: !288, line: 104, baseType: !192, size: 32, offset: 1696)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !287, file: !288, line: 104, baseType: !192, size: 32, offset: 1728)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !287, file: !288, line: 105, baseType: !192, size: 32, offset: 1760)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !287, file: !288, line: 108, baseType: !318, size: 704, offset: 1792)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !288, line: 53, size: 704, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !318, file: !288, line: 54, baseType: !192, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !318, file: !288, line: 55, baseType: !192, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !318, file: !288, line: 56, baseType: !192, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !318, file: !288, line: 57, baseType: !192, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !318, file: !288, line: 59, baseType: !228, size: 96, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !318, file: !288, line: 60, baseType: !228, size: 96, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !318, file: !288, line: 61, baseType: !228, size: 96, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !318, file: !288, line: 63, baseType: !192, size: 32, offset: 416)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !318, file: !288, line: 64, baseType: !192, size: 32, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !318, file: !288, line: 65, baseType: !192, size: 32, offset: 480)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !318, file: !288, line: 67, baseType: !48, size: 16, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !318, file: !288, line: 68, baseType: !48, size: 16, offset: 528)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !318, file: !288, line: 69, baseType: !48, size: 16, offset: 544)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !318, file: !288, line: 70, baseType: !48, size: 16, offset: 560)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !318, file: !288, line: 72, baseType: !192, size: 32, offset: 576)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !318, file: !288, line: 73, baseType: !192, size: 32, offset: 608)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !318, file: !288, line: 74, baseType: !192, size: 32, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !318, file: !288, line: 75, baseType: !192, size: 32, offset: 672)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !287, file: !288, line: 109, baseType: !339, size: 128, offset: 2496)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !288, line: 79, size: 128, elements: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !339, file: !288, line: 80, baseType: !22, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !339, file: !288, line: 81, baseType: !22, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !339, file: !288, line: 82, baseType: !22, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !339, file: !288, line: 83, baseType: !22, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !287, file: !288, line: 111, baseType: !192, size: 32, offset: 2624)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !287, file: !288, line: 111, baseType: !192, size: 32, offset: 2656)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !287, file: !288, line: 112, baseType: !192, size: 32, offset: 2688)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !287, file: !288, line: 112, baseType: !192, size: 32, offset: 2720)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !287, file: !288, line: 113, baseType: !192, size: 32, offset: 2752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !287, file: !288, line: 114, baseType: !192, size: 32, offset: 2784)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !287, file: !288, line: 114, baseType: !192, size: 32, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !287, file: !288, line: 115, baseType: !48, size: 16, offset: 2848)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !287, file: !288, line: 115, baseType: !48, size: 16, offset: 2864)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !287, file: !288, line: 116, baseType: !48, size: 16, offset: 2880)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !287, file: !288, line: 117, baseType: !14, size: 8, offset: 2896)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !287, file: !288, line: 117, baseType: !14, size: 8, offset: 2904)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !287, file: !288, line: 119, baseType: !192, size: 32, offset: 2912)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !287, file: !288, line: 119, baseType: !192, size: 32, offset: 2944)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !287, file: !288, line: 120, baseType: !48, size: 16, offset: 2976)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !287, file: !288, line: 120, baseType: !48, size: 16, offset: 2992)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !287, file: !288, line: 121, baseType: !192, size: 32, offset: 3008)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !287, file: !288, line: 121, baseType: !192, size: 32, offset: 3040)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !287, file: !288, line: 122, baseType: !192, size: 32, offset: 3072)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !287, file: !288, line: 123, baseType: !192, size: 32, offset: 3104)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !287, file: !288, line: 124, baseType: !48, size: 16, offset: 3136)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !287, file: !288, line: 125, baseType: !48, size: 16, offset: 3152)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !287, file: !288, line: 127, baseType: !22, size: 32, offset: 3168)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !287, file: !288, line: 127, baseType: !22, size: 32, offset: 3200)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !287, file: !288, line: 128, baseType: !22, size: 32, offset: 3232)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !287, file: !288, line: 128, baseType: !22, size: 32, offset: 3264)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !287, file: !288, line: 129, baseType: !48, size: 16, offset: 3296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !287, file: !288, line: 129, baseType: !48, size: 16, offset: 3312)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !287, file: !288, line: 129, baseType: !48, size: 16, offset: 3328)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !287, file: !288, line: 129, baseType: !48, size: 16, offset: 3344)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !287, file: !288, line: 130, baseType: !192, size: 32, offset: 3360)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !287, file: !288, line: 130, baseType: !192, size: 32, offset: 3392)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !287, file: !288, line: 130, baseType: !192, size: 32, offset: 3424)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !287, file: !288, line: 130, baseType: !192, size: 32, offset: 3456)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !287, file: !288, line: 131, baseType: !192, size: 32, offset: 3488)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !287, file: !288, line: 131, baseType: !192, size: 32, offset: 3520)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !287, file: !288, line: 131, baseType: !192, size: 32, offset: 3552)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !287, file: !288, line: 131, baseType: !192, size: 32, offset: 3584)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !287, file: !288, line: 132, baseType: !192, size: 32, offset: 3616)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !287, file: !288, line: 132, baseType: !192, size: 32, offset: 3648)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !287, file: !288, line: 133, baseType: !33, size: 512, offset: 3680)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !287, file: !288, line: 135, baseType: !192, size: 32, offset: 4192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !287, file: !288, line: 136, baseType: !192, size: 32, offset: 4224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !287, file: !288, line: 137, baseType: !192, size: 32, offset: 4256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !287, file: !288, line: 138, baseType: !22, size: 32, offset: 4288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !287, file: !288, line: 141, baseType: !14, size: 8, offset: 4320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !287, file: !288, line: 141, baseType: !14, size: 8, offset: 4328)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !287, file: !288, line: 141, baseType: !14, size: 8, offset: 4336)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !287, file: !288, line: 141, baseType: !14, size: 8, offset: 4344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !287, file: !288, line: 142, baseType: !48, size: 16, offset: 4352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !287, file: !288, line: 142, baseType: !48, size: 16, offset: 4368)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !287, file: !288, line: 142, baseType: !48, size: 16, offset: 4384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !287, file: !288, line: 145, baseType: !14, size: 8, offset: 4400)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !287, file: !288, line: 145, baseType: !14, size: 8, offset: 4408)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !287, file: !288, line: 148, baseType: !48, size: 16, offset: 4416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !287, file: !288, line: 148, baseType: !48, size: 16, offset: 4432)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !287, file: !288, line: 149, baseType: !192, size: 32, offset: 4448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !287, file: !288, line: 149, baseType: !192, size: 32, offset: 4480)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !287, file: !288, line: 152, baseType: !404, size: 128, offset: 4512)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 4)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !287, file: !288, line: 153, baseType: !192, size: 32, offset: 4640)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !287, file: !288, line: 154, baseType: !192, size: 32, offset: 4672)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !287, file: !288, line: 157, baseType: !48, size: 16, offset: 4704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !287, file: !288, line: 157, baseType: !48, size: 16, offset: 4720)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !287, file: !288, line: 160, baseType: !412, size: 64, offset: 4736)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !161, line: 113, size: 6208, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !424}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !413, file: !161, line: 114, baseType: !48, size: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !413, file: !161, line: 114, baseType: !48, size: 16, offset: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !413, file: !161, line: 115, baseType: !14, size: 8, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !413, file: !161, line: 115, baseType: !14, size: 8, offset: 40)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !413, file: !161, line: 116, baseType: !14, size: 8, offset: 48)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !413, file: !161, line: 117, baseType: !421, size: 8, offset: 56)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 1)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !413, file: !161, line: 119, baseType: !425, size: 6144, offset: 64)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 6144, elements: !435)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !161, line: 109, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !161, line: 106, size: 192, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !427, file: !161, line: 107, baseType: !192, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !427, file: !161, line: 107, baseType: !192, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !427, file: !161, line: 107, baseType: !192, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !427, file: !161, line: 107, baseType: !192, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !427, file: !161, line: 107, baseType: !192, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !427, file: !161, line: 108, baseType: !22, size: 32, offset: 160)
!435 = !{!436}
!436 = !DISubrange(count: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !287, file: !288, line: 161, baseType: !412, size: 64, offset: 4800)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !287, file: !288, line: 162, baseType: !14, size: 8, offset: 4864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !287, file: !288, line: 162, baseType: !14, size: 8, offset: 4872)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !287, file: !288, line: 163, baseType: !14, size: 8, offset: 4880)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !287, file: !288, line: 163, baseType: !14, size: 8, offset: 4888)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !287, file: !288, line: 164, baseType: !48, size: 16, offset: 4896)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !287, file: !288, line: 164, baseType: !48, size: 16, offset: 4912)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !287, file: !288, line: 165, baseType: !192, size: 32, offset: 4928)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !287, file: !288, line: 165, baseType: !192, size: 32, offset: 4960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !287, file: !288, line: 167, baseType: !447, size: 1152, offset: 4992)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 1152, elements: !1356)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !161, line: 57, size: 2496, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !449, file: !161, line: 59, baseType: !48, size: 16)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !449, file: !161, line: 59, baseType: !48, size: 16, offset: 16)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !449, file: !161, line: 59, baseType: !48, size: 16, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !449, file: !161, line: 59, baseType: !48, size: 16, offset: 48)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !449, file: !161, line: 60, baseType: !163, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !449, file: !161, line: 61, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !161, line: 202, size: 3328, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !529, !1089, !1090, !1168, !1169, !1197, !1198, !1266, !1287, !1295, !1296}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !458, file: !161, line: 203, baseType: !113, size: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !458, file: !161, line: 204, baseType: !159, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !458, file: !161, line: 206, baseType: !192, size: 32, offset: 1024)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !458, file: !161, line: 206, baseType: !192, size: 32, offset: 1056)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !458, file: !161, line: 207, baseType: !192, size: 32, offset: 1088)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !458, file: !161, line: 207, baseType: !192, size: 32, offset: 1120)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !458, file: !161, line: 207, baseType: !192, size: 32, offset: 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !458, file: !161, line: 207, baseType: !192, size: 32, offset: 1184)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !458, file: !161, line: 207, baseType: !192, size: 32, offset: 1216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !458, file: !161, line: 207, baseType: !192, size: 32, offset: 1248)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !458, file: !161, line: 208, baseType: !192, size: 32, offset: 1280)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !458, file: !161, line: 208, baseType: !192, size: 32, offset: 1312)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !458, file: !161, line: 211, baseType: !192, size: 32, offset: 1344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !458, file: !161, line: 211, baseType: !192, size: 32, offset: 1376)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !458, file: !161, line: 211, baseType: !192, size: 32, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !458, file: !161, line: 211, baseType: !192, size: 32, offset: 1440)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !458, file: !161, line: 211, baseType: !192, size: 32, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !458, file: !161, line: 214, baseType: !192, size: 32, offset: 1504)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !458, file: !161, line: 214, baseType: !192, size: 32, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !458, file: !161, line: 217, baseType: !192, size: 32, offset: 1568)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !458, file: !161, line: 218, baseType: !192, size: 32, offset: 1600)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !458, file: !161, line: 219, baseType: !192, size: 32, offset: 1632)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !458, file: !161, line: 220, baseType: !192, size: 32, offset: 1664)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !458, file: !161, line: 221, baseType: !192, size: 32, offset: 1696)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !458, file: !161, line: 222, baseType: !48, size: 16, offset: 1728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !458, file: !161, line: 222, baseType: !48, size: 16, offset: 1744)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !458, file: !161, line: 224, baseType: !48, size: 16, offset: 1760)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !458, file: !161, line: 224, baseType: !48, size: 16, offset: 1776)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !458, file: !161, line: 227, baseType: !48, size: 16, offset: 1792)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !458, file: !161, line: 227, baseType: !48, size: 16, offset: 1808)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !458, file: !161, line: 229, baseType: !48, size: 16, offset: 1824)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !161, line: 229, baseType: !48, size: 16, offset: 1840)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !458, file: !161, line: 230, baseType: !48, size: 16, offset: 1856)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !458, file: !161, line: 230, baseType: !48, size: 16, offset: 1872)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !458, file: !161, line: 232, baseType: !192, size: 32, offset: 1888)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !458, file: !161, line: 232, baseType: !192, size: 32, offset: 1920)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !458, file: !161, line: 232, baseType: !192, size: 32, offset: 1952)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !458, file: !161, line: 232, baseType: !192, size: 32, offset: 1984)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !458, file: !161, line: 233, baseType: !22, size: 32, offset: 2016)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !458, file: !161, line: 234, baseType: !22, size: 32, offset: 2048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !458, file: !161, line: 235, baseType: !48, size: 16, offset: 2080)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !458, file: !161, line: 235, baseType: !48, size: 16, offset: 2096)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !458, file: !161, line: 236, baseType: !48, size: 16, offset: 2112)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !458, file: !161, line: 239, baseType: !48, size: 16, offset: 2128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !458, file: !161, line: 240, baseType: !22, size: 32, offset: 2144)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !458, file: !161, line: 241, baseType: !22, size: 32, offset: 2176)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !458, file: !161, line: 241, baseType: !22, size: 32, offset: 2208)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !458, file: !161, line: 241, baseType: !22, size: 32, offset: 2240)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !458, file: !161, line: 243, baseType: !192, size: 32, offset: 2272)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !458, file: !161, line: 243, baseType: !192, size: 32, offset: 2304)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !458, file: !161, line: 244, baseType: !192, size: 32, offset: 2336)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !458, file: !161, line: 246, baseType: !512, size: 320, offset: 2368)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !513, line: 50, size: 320, elements: !514)
!513 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !512, file: !513, line: 51, baseType: !153, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !512, file: !513, line: 53, baseType: !22, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !512, file: !513, line: 54, baseType: !22, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !512, file: !513, line: 55, baseType: !22, size: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !512, file: !513, line: 55, baseType: !22, size: 32, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !512, file: !513, line: 56, baseType: !14, size: 8, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !512, file: !513, line: 56, baseType: !14, size: 8, offset: 200)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !512, file: !513, line: 57, baseType: !14, size: 8, offset: 208)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !512, file: !513, line: 57, baseType: !14, size: 8, offset: 216)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !512, file: !513, line: 59, baseType: !48, size: 16, offset: 224)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !512, file: !513, line: 59, baseType: !48, size: 16, offset: 240)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !512, file: !513, line: 59, baseType: !48, size: 16, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !513, line: 61, baseType: !48, size: 16, offset: 272)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !512, file: !513, line: 63, baseType: !22, size: 32, offset: 288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !458, file: !161, line: 248, baseType: !530, size: 64, offset: 2688)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !83, line: 328, size: 3456, elements: !532)
!532 = !{!533, !534, !535, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1067, !1068, !1069, !1072, !1076, !1080, !1084, !1085, !1086, !1087, !1088}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !531, file: !83, line: 329, baseType: !113, size: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !531, file: !83, line: 330, baseType: !159, size: 64, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !531, file: !83, line: 332, baseType: !536, size: 64, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !538, line: 283, size: 4096, elements: !539)
!538 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!539 = !{!540, !541, !542, !543, !547, !548, !552, !1007, !1015, !1019, !1025, !1029, !1030, !1031, !1032, !1036, !1037}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !538, line: 284, baseType: !22, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !537, file: !538, line: 285, baseType: !33, size: 512, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !537, file: !538, line: 287, baseType: !33, size: 512, offset: 544)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !537, file: !538, line: 288, baseType: !544, size: 2048, offset: 1056)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !537, file: !538, line: 289, baseType: !22, size: 32, offset: 3104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !537, file: !538, line: 292, baseType: !549, size: 64, offset: 3136)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !530}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !537, file: !538, line: 293, baseType: !553, size: 64, offset: 3200)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !530, !556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !83, line: 167, size: 3712, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !557, file: !83, line: 168, baseType: !556, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !557, file: !83, line: 168, baseType: !556, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !557, file: !83, line: 168, baseType: !556, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !557, file: !83, line: 170, baseType: !37, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !557, file: !83, line: 172, baseType: !564, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !538, line: 144, size: 6016, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !730, !731, !732, !874, !878, !882, !883, !890, !894, !898, !899, !900, !901, !905, !906, !910, !914, !918, !922, !926, !930, !934, !935, !942, !944, !953, !962}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !538, line: 145, baseType: !56, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !565, file: !538, line: 145, baseType: !56, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !565, file: !538, line: 146, baseType: !48, size: 16, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !565, file: !538, line: 148, baseType: !33, size: 512, offset: 144)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !565, file: !538, line: 149, baseType: !22, size: 32, offset: 672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !565, file: !538, line: 151, baseType: !33, size: 512, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !565, file: !538, line: 152, baseType: !544, size: 2048, offset: 1216)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !565, file: !538, line: 153, baseType: !22, size: 32, offset: 3264)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !565, file: !538, line: 155, baseType: !192, size: 32, offset: 3296)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !565, file: !538, line: 155, baseType: !192, size: 32, offset: 3328)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !565, file: !538, line: 155, baseType: !192, size: 32, offset: 3360)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !565, file: !538, line: 156, baseType: !192, size: 32, offset: 3392)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !565, file: !538, line: 156, baseType: !192, size: 32, offset: 3424)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !565, file: !538, line: 156, baseType: !192, size: 32, offset: 3456)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !565, file: !538, line: 157, baseType: !48, size: 16, offset: 3488)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !565, file: !538, line: 157, baseType: !48, size: 16, offset: 3504)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !565, file: !538, line: 157, baseType: !48, size: 16, offset: 3520)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !565, file: !538, line: 160, baseType: !585, size: 64, offset: 3584)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !538, line: 109, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !538, line: 98, size: 1408, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !729}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !538, line: 99, baseType: !22, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !587, file: !538, line: 99, baseType: !22, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !587, file: !538, line: 100, baseType: !33, size: 512, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !587, file: !538, line: 101, baseType: !192, size: 32, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !587, file: !538, line: 101, baseType: !192, size: 32, offset: 608)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !587, file: !538, line: 101, baseType: !192, size: 32, offset: 640)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !587, file: !538, line: 101, baseType: !192, size: 32, offset: 672)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !587, file: !538, line: 102, baseType: !192, size: 32, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !587, file: !538, line: 102, baseType: !192, size: 32, offset: 736)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !587, file: !538, line: 103, baseType: !22, size: 32, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !587, file: !538, line: 104, baseType: !22, size: 32, offset: 800)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !587, file: !538, line: 107, baseType: !601, size: 64, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !83, line: 87, size: 2816, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !711}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !602, file: !83, line: 88, baseType: !601, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !602, file: !83, line: 88, baseType: !601, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !602, file: !83, line: 88, baseType: !601, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !602, file: !83, line: 90, baseType: !37, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !602, file: !83, line: 92, baseType: !33, size: 512, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !83, line: 94, baseType: !33, size: 512, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !602, file: !83, line: 99, baseType: !56, size: 64, offset: 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !602, file: !83, line: 101, baseType: !48, size: 16, offset: 1344)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !602, file: !83, line: 101, baseType: !48, size: 16, offset: 1360)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !602, file: !83, line: 102, baseType: !48, size: 16, offset: 1376)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !602, file: !83, line: 103, baseType: !48, size: 16, offset: 1392)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !602, file: !83, line: 104, baseType: !616, size: 64, offset: 1408)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !538, line: 114, size: 1600, elements: !618)
!618 = !{!619, !620, !626, !631, !635, !639, !643, !647, !648, !652, !681, !682, !683}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !617, file: !538, line: 115, baseType: !33, size: 512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !617, file: !538, line: 117, baseType: !621, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !23, !624, !73, !73, !12}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !538, line: 73, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !617, file: !538, line: 118, baseType: !627, size: 64, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !23, !73, !73, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !617, file: !538, line: 120, baseType: !632, size: 64, offset: 640)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !23, !624, !73}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !617, file: !538, line: 121, baseType: !636, size: 64, offset: 704)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !23, !73, !630}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !617, file: !538, line: 122, baseType: !640, size: 64, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !530, !601, !81}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !617, file: !538, line: 123, baseType: !644, size: 64, offset: 832)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !530, !601, !556, !601, !12}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !617, file: !538, line: 124, baseType: !644, size: 64, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !617, file: !538, line: 125, baseType: !649, size: 64, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !530, !601, !556, !601}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !617, file: !538, line: 128, baseType: !653, size: 256, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !25, line: 436, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !25, line: 430, size: 256, elements: !655)
!655 = !{!656, !657, !660, !676}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !654, file: !25, line: 431, baseType: !56, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !654, file: !25, line: 432, baseType: !658, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !25, line: 417, baseType: !82)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !654, file: !25, line: 433, baseType: !661, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !25, line: 408, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!22, !23, !73, !665, !667}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !25, line: 38, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !25, line: 348, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !25, line: 337, size: 256, elements: !670)
!670 = !{!671, !672, !673, !674, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !669, file: !25, line: 339, baseType: !56, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !669, file: !25, line: 342, baseType: !665, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !669, file: !25, line: 345, baseType: !22, size: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !669, file: !25, line: 347, baseType: !22, size: 32, offset: 160)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !669, file: !25, line: 347, baseType: !22, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !654, file: !25, line: 434, baseType: !677, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !25, line: 409, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !56}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !617, file: !538, line: 129, baseType: !653, size: 256, offset: 1280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !617, file: !538, line: 132, baseType: !22, size: 32, offset: 1536)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !617, file: !538, line: 132, baseType: !22, size: 32, offset: 1568)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !602, file: !83, line: 105, baseType: !33, size: 512, offset: 1472)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !602, file: !83, line: 107, baseType: !192, size: 32, offset: 1984)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !602, file: !83, line: 107, baseType: !192, size: 32, offset: 2016)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !602, file: !83, line: 109, baseType: !56, size: 64, offset: 2048)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !602, file: !83, line: 112, baseType: !48, size: 16, offset: 2112)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !602, file: !83, line: 114, baseType: !48, size: 16, offset: 2128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !602, file: !83, line: 115, baseType: !22, size: 32, offset: 2144)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !602, file: !83, line: 117, baseType: !56, size: 64, offset: 2176)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !602, file: !83, line: 122, baseType: !22, size: 32, offset: 2240)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !602, file: !83, line: 124, baseType: !22, size: 32, offset: 2272)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !602, file: !83, line: 126, baseType: !601, size: 64, offset: 2304)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !602, file: !83, line: 128, baseType: !696, size: 64, offset: 2368)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !83, line: 298, size: 448, elements: !698)
!698 = !{!699, !700, !701, !704, !705, !708, !709, !710}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !83, line: 299, baseType: !696, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !697, file: !83, line: 299, baseType: !696, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !697, file: !83, line: 301, baseType: !702, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !83, line: 218, baseType: !557)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !697, file: !83, line: 301, baseType: !702, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !697, file: !83, line: 302, baseType: !706, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !83, line: 132, baseType: !602)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !697, file: !83, line: 302, baseType: !706, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !697, file: !83, line: 304, baseType: !22, size: 32, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !697, file: !83, line: 305, baseType: !22, size: 32, offset: 416)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !602, file: !83, line: 131, baseType: !712, size: 384, offset: 2432)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !83, line: 73, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !83, line: 62, size: 384, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !713, file: !83, line: 63, baseType: !404, size: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !713, file: !83, line: 64, baseType: !192, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !713, file: !83, line: 64, baseType: !192, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !713, file: !83, line: 65, baseType: !56, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !713, file: !83, line: 66, baseType: !48, size: 16, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !713, file: !83, line: 67, baseType: !48, size: 16, offset: 272)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !713, file: !83, line: 68, baseType: !48, size: 16, offset: 288)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !713, file: !83, line: 69, baseType: !48, size: 16, offset: 304)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !713, file: !83, line: 70, baseType: !48, size: 16, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !713, file: !83, line: 71, baseType: !48, size: 16, offset: 336)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !713, file: !83, line: 72, baseType: !726, size: 32, offset: 352)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 2)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !587, file: !538, line: 108, baseType: !33, size: 512, offset: 896)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !565, file: !538, line: 160, baseType: !585, size: 64, offset: 3648)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !565, file: !538, line: 162, baseType: !33, size: 512, offset: 3712)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !565, file: !538, line: 165, baseType: !733, size: 64, offset: 4224)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !736, !738, !824, !530, !556, !870}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !110, line: 230, size: 3072, elements: !740)
!740 = !{!741, !742, !743, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !813, !814, !815, !816, !817, !818, !819, !820, !821, !823}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !739, file: !110, line: 231, baseType: !738, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !739, file: !110, line: 231, baseType: !738, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !739, file: !110, line: 233, baseType: !744, size: 1280, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !745, line: 71, baseType: !746)
!745 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !745, line: 40, size: 1280, elements: !747)
!747 = !{!748, !757, !758, !766, !767, !768, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !791}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !746, file: !745, line: 41, baseType: !749, size: 128)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !750, line: 95, baseType: !751)
!750 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !750, line: 92, size: 128, elements: !752)
!752 = !{!753, !754, !755, !756}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !751, file: !750, line: 93, baseType: !192, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !751, file: !750, line: 93, baseType: !192, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !751, file: !750, line: 94, baseType: !192, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !751, file: !750, line: 94, baseType: !192, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !746, file: !745, line: 41, baseType: !749, size: 128, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !746, file: !745, line: 42, baseType: !759, size: 128, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !750, line: 89, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !750, line: 86, size: 128, elements: !761)
!761 = !{!762, !763, !764, !765}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !760, file: !750, line: 87, baseType: !22, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !760, file: !750, line: 87, baseType: !22, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !760, file: !750, line: 88, baseType: !22, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !760, file: !750, line: 88, baseType: !22, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !746, file: !745, line: 42, baseType: !759, size: 128, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !746, file: !745, line: 43, baseType: !759, size: 128, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !746, file: !745, line: 45, baseType: !769, size: 64, offset: 640)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 64, elements: !727)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !746, file: !745, line: 45, baseType: !769, size: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !746, file: !745, line: 46, baseType: !192, size: 32, offset: 768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !746, file: !745, line: 46, baseType: !192, size: 32, offset: 800)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !746, file: !745, line: 48, baseType: !48, size: 16, offset: 832)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !746, file: !745, line: 49, baseType: !48, size: 16, offset: 848)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !746, file: !745, line: 51, baseType: !48, size: 16, offset: 864)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !746, file: !745, line: 52, baseType: !48, size: 16, offset: 880)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !746, file: !745, line: 53, baseType: !48, size: 16, offset: 896)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !746, file: !745, line: 55, baseType: !48, size: 16, offset: 912)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !746, file: !745, line: 56, baseType: !48, size: 16, offset: 928)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !746, file: !745, line: 58, baseType: !48, size: 16, offset: 944)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !746, file: !745, line: 58, baseType: !48, size: 16, offset: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !746, file: !745, line: 59, baseType: !48, size: 16, offset: 976)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !746, file: !745, line: 59, baseType: !48, size: 16, offset: 992)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !746, file: !745, line: 61, baseType: !48, size: 16, offset: 1008)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !746, file: !745, line: 63, baseType: !630, size: 64, offset: 1024)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !746, file: !745, line: 64, baseType: !22, size: 32, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !746, file: !745, line: 65, baseType: !22, size: 32, offset: 1120)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !746, file: !745, line: 68, baseType: !789, size: 64, offset: 1152)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !745, line: 68, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !746, file: !745, line: 69, baseType: !95, size: 64, offset: 1216)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !739, file: !110, line: 234, baseType: !759, size: 128, offset: 1408)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !739, file: !110, line: 235, baseType: !759, size: 128, offset: 1536)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !739, file: !110, line: 236, baseType: !48, size: 16, offset: 1664)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !739, file: !110, line: 236, baseType: !48, size: 16, offset: 1680)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !739, file: !110, line: 238, baseType: !48, size: 16, offset: 1696)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !739, file: !110, line: 239, baseType: !48, size: 16, offset: 1712)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !739, file: !110, line: 240, baseType: !48, size: 16, offset: 1728)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !739, file: !110, line: 241, baseType: !48, size: 16, offset: 1744)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !739, file: !110, line: 243, baseType: !192, size: 32, offset: 1760)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !739, file: !110, line: 244, baseType: !48, size: 16, offset: 1792)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !739, file: !110, line: 244, baseType: !48, size: 16, offset: 1808)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !739, file: !110, line: 246, baseType: !48, size: 16, offset: 1824)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !739, file: !110, line: 247, baseType: !48, size: 16, offset: 1840)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !739, file: !110, line: 248, baseType: !48, size: 16, offset: 1856)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !739, file: !110, line: 249, baseType: !48, size: 16, offset: 1872)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !739, file: !110, line: 250, baseType: !48, size: 16, offset: 1888)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !739, file: !110, line: 251, baseType: !48, size: 16, offset: 1904)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !739, file: !110, line: 253, baseType: !810, size: 64, offset: 1920)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !812, line: 33, flags: DIFlagFwdDecl)
!812 = !DIFile(filename: "blender/source/blender/editors/include/ED_uvedit.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!813 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !739, file: !110, line: 255, baseType: !58, size: 128, offset: 1984)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !739, file: !110, line: 256, baseType: !58, size: 128, offset: 2112)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !739, file: !110, line: 257, baseType: !58, size: 128, offset: 2240)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !739, file: !110, line: 258, baseType: !58, size: 128, offset: 2368)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !739, file: !110, line: 259, baseType: !58, size: 128, offset: 2496)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !739, file: !110, line: 260, baseType: !58, size: 128, offset: 2624)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !739, file: !110, line: 261, baseType: !58, size: 128, offset: 2752)
