; ModuleID = 'blender/source/blender/blenkernel/intern/editmesh_bvh.c'
source_filename = "blender/source/blender/blenkernel/intern/editmesh_bvh.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMBVHTree = type { %struct.BVHTree*, [3 x %struct.BMLoop*]*, i32, %struct.BMesh*, [3 x float]*, i8, i32 }
%struct.BVHTree = type opaque
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BMFace = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMLoop*, i32, [3 x float], i16 }

!8 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!12 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!14 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !4, line: 116, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 67, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_editmesh_bvh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "BMBVH_RETURN_ORIG", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BMBVH_RESPECT_SELECT", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BMBVH_RESPECT_HIDDEN", value: 4, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62, !63}
!57 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!64 = !{!65, !67, !68, !135}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 192, elements: !99)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !74)
!74 = !{!75, !86, !119, !120, !131, !132, !133, !134}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !73, file: !43, line: 126, baseType: !76, size: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !78)
!78 = !{!79, !80, !82, !84, !85}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !43, line: 65, baseType: !67, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !77, file: !43, line: 66, baseType: !81, size: 32, offset: 64)
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !77, file: !43, line: 73, baseType: !83, size: 8, offset: 96)
!83 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !77, file: !43, line: 74, baseType: !83, size: 8, offset: 104)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !77, file: !43, line: 80, baseType: !83, size: 8, offset: 112)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !73, file: !43, line: 129, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !89)
!89 = !{!90, !91, !97, !101, !102}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !88, file: !43, line: 91, baseType: !76, size: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !88, file: !43, line: 92, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !93, file: !43, line: 181, baseType: !96, size: 16)
!96 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !88, file: !43, line: 94, baseType: !98, size: 96, offset: 192)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 96, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 3)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !88, file: !43, line: 95, baseType: !98, size: 96, offset: 288)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !88, file: !43, line: 102, baseType: !103, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !112, !118}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !104, file: !43, line: 111, baseType: !76, size: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !104, file: !43, line: 112, baseType: !92, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !104, file: !43, line: 114, baseType: !87, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !104, file: !43, line: 114, baseType: !87, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !104, file: !43, line: 118, baseType: !111, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !104, file: !43, line: 122, baseType: !113, size: 128, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !43, line: 107, baseType: !103, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !43, line: 107, baseType: !103, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !104, file: !43, line: 122, baseType: !113, size: 128, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !73, file: !43, line: 130, baseType: !103, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !73, file: !43, line: 131, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !123)
!123 = !{!124, !125, !126, !128, !129, !130}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !122, file: !43, line: 165, baseType: !76, size: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !122, file: !43, line: 166, baseType: !92, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !122, file: !43, line: 172, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !122, file: !43, line: 174, baseType: !81, size: 32, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !122, file: !43, line: 175, baseType: !98, size: 96, offset: 288)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !122, file: !43, line: 176, baseType: !96, size: 16, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !73, file: !43, line: 135, baseType: !111, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !73, file: !43, line: 135, baseType: !111, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !73, file: !43, line: 139, baseType: !111, size: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !73, file: !43, line: 139, baseType: !111, size: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 96, elements: !99)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!138 = !{i32 7, !"Dwarf Version", i32 4}
!139 = !{i32 2, !"Debug Info Version", i32 3}
!140 = !{i32 1, !"wchar_size", i32 4}
!141 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!142 = distinct !DISubprogram(name: "BKE_bmbvh_new_from_editmesh", scope: !1, file: !1, line: 56, type: !143, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !351)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !310, !81, !135, !350}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMBVHTree", file: !50, line: 44, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMBVHTree", file: !1, line: 42, size: 384, elements: !148)
!148 = !{!149, !154, !157, !158, !306, !307, !309}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !147, file: !1, line: 43, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTree", file: !152, line: 43, baseType: !153)
!152 = !DIFile(filename: "blender/source/blender/blenlib/BLI_kdopbvh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTree", file: !152, line: 42, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !147, file: !1, line: 45, baseType: !155, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 192, elements: !99)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "looptris_tot", scope: !147, file: !1, line: 46, baseType: !81, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !147, file: !1, line: 48, baseType: !159, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !176, !177, !178, !179, !183, !187, !191, !192, !193, !194, !195, !196, !197, !198, !250, !289, !290, !291, !292, !293, !294, !295, !296, !303, !304, !305}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !161, file: !43, line: 187, baseType: !81, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !161, file: !43, line: 187, baseType: !81, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !161, file: !43, line: 187, baseType: !81, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !161, file: !43, line: 187, baseType: !81, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !161, file: !43, line: 188, baseType: !81, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !161, file: !43, line: 188, baseType: !81, size: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !161, file: !43, line: 188, baseType: !81, size: 32, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !161, file: !43, line: 193, baseType: !83, size: 8, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !161, file: !43, line: 197, baseType: !83, size: 8, offset: 232)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !161, file: !43, line: 201, baseType: !173, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !175, line: 71, flags: DIFlagFwdDecl)
!175 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !161, file: !43, line: 201, baseType: !173, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !161, file: !43, line: 201, baseType: !173, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !161, file: !43, line: 201, baseType: !173, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !161, file: !43, line: 208, baseType: !180, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !88)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !161, file: !43, line: 209, baseType: !184, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !104)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !161, file: !43, line: 210, baseType: !188, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !122)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !161, file: !43, line: 213, baseType: !81, size: 32, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !161, file: !43, line: 214, baseType: !81, size: 32, offset: 736)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !161, file: !43, line: 215, baseType: !81, size: 32, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !161, file: !43, line: 218, baseType: !173, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !161, file: !43, line: 218, baseType: !173, size: 64, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !161, file: !43, line: 218, baseType: !173, size: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !161, file: !43, line: 220, baseType: !81, size: 32, offset: 1024)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !161, file: !43, line: 221, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !201)
!201 = !{!202, !238, !239, !243, !246, !247, !249}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !200, file: !4, line: 191, baseType: !203, size: 5120)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 5120, elements: !236)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !205)
!205 = !{!206, !209, !211, !221, !222}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !204, file: !4, line: 148, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !204, file: !4, line: 149, baseType: !210, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !204, file: !4, line: 150, baseType: !212, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !214)
!214 = !{!215, !217, !219}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !213, file: !4, line: 139, baseType: !216, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !213, file: !4, line: 140, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !213, file: !4, line: 141, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !204, file: !4, line: 152, baseType: !81, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !204, file: !4, line: 162, baseType: !223, size: 128, offset: 192)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !4, line: 155, size: 128, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !231}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !223, file: !4, line: 156, baseType: !81, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !223, file: !4, line: 157, baseType: !66, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !223, file: !4, line: 158, baseType: !67, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !223, file: !4, line: 159, baseType: !98, size: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !223, file: !4, line: 160, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !223, file: !4, line: 161, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !234, line: 48, baseType: !235)
!234 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !234, line: 48, flags: DIFlagFwdDecl)
!236 = !{!237}
!237 = !DISubrange(count: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !200, file: !4, line: 192, baseType: !203, size: 5120, offset: 5120)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !200, file: !4, line: 193, baseType: !240, size: 64, offset: 10240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !159, !199}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !200, file: !4, line: 194, baseType: !244, size: 64, offset: 10304)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !4, line: 195, baseType: !81, size: 32, offset: 10368)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !200, file: !4, line: 196, baseType: !248, size: 32, offset: 10400)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !4, line: 197, baseType: !81, size: 32, offset: 10432)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !161, file: !43, line: 223, baseType: !251, size: 1600, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !175, line: 73, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !175, line: 64, size: 1600, elements: !253)
!253 = !{!254, !272, !276, !277, !278, !279, !280}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !252, file: !175, line: 65, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !175, line: 53, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !175, line: 42, size: 832, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !271}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !175, line: 43, baseType: !81, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !257, file: !175, line: 44, baseType: !81, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !257, file: !175, line: 45, baseType: !81, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !257, file: !175, line: 46, baseType: !81, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !257, file: !175, line: 47, baseType: !81, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !257, file: !175, line: 48, baseType: !81, size: 32, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !257, file: !175, line: 49, baseType: !81, size: 32, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !257, file: !175, line: 50, baseType: !81, size: 32, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !257, file: !175, line: 51, baseType: !268, size: 512, offset: 256)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 512, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !175, line: 52, baseType: !67, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !252, file: !175, line: 66, baseType: !273, size: 1312, offset: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 1312, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 41)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !252, file: !175, line: 69, baseType: !81, size: 32, offset: 1376)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !252, file: !175, line: 69, baseType: !81, size: 32, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !252, file: !175, line: 70, baseType: !81, size: 32, offset: 1440)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !252, file: !175, line: 71, baseType: !173, size: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !252, file: !175, line: 72, baseType: !281, size: 64, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !175, line: 59, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !175, line: 57, size: 8192, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !283, file: !175, line: 58, baseType: !286, size: 8192)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 8192, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !161, file: !43, line: 223, baseType: !251, size: 1600, offset: 2752)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !161, file: !43, line: 223, baseType: !251, size: 1600, offset: 4352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !161, file: !43, line: 223, baseType: !251, size: 1600, offset: 5952)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !161, file: !43, line: 233, baseType: !96, size: 16, offset: 7552)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !161, file: !43, line: 236, baseType: !81, size: 32, offset: 7584)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !161, file: !43, line: 238, baseType: !81, size: 32, offset: 7616)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !161, file: !43, line: 238, baseType: !81, size: 32, offset: 7648)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !161, file: !43, line: 239, baseType: !297, size: 128, offset: 7680)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !298, line: 71, baseType: !299)
!298 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !298, line: 69, size: 128, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !299, file: !298, line: 70, baseType: !67, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !299, file: !298, line: 70, baseType: !67, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !161, file: !43, line: 241, baseType: !189, size: 64, offset: 7808)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !161, file: !43, line: 243, baseType: !297, size: 128, offset: 7872)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !161, file: !43, line: 245, baseType: !67, size: 64, offset: 8000)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cos_cage", scope: !147, file: !1, line: 50, baseType: !135, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cos_cage_free", scope: !147, file: !1, line: 51, baseType: !308, size: 8, offset: 320)
!308 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !147, file: !1, line: 53, baseType: !81, size: 32, offset: 352)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEditMesh", file: !312, line: 83, baseType: !313)
!312 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_editmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !312, line: 54, size: 896, elements: !314)
!314 = !{!315, !317, !319, !320, !323, !324, !327, !328, !336, !341, !342, !343, !344, !345, !346, !349}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !313, file: !312, line: 55, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "emcopy", scope: !313, file: !312, line: 58, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "emcopyusers", scope: !313, file: !312, line: 59, baseType: !81, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !313, file: !312, line: 63, baseType: !321, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 192, elements: !99)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tottri", scope: !313, file: !312, line: 64, baseType: !81, size: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !313, file: !312, line: 67, baseType: !325, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !312, line: 38, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "derivedCage", scope: !313, file: !312, line: 67, baseType: !325, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !313, file: !312, line: 68, baseType: !329, size: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataMask", file: !330, line: 48, baseType: !331)
!330 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !332, line: 27, baseType: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !334, line: 45, baseType: !335)
!334 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!335 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColor", scope: !313, file: !312, line: 69, baseType: !337, size: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 32, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 4)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColorLen", scope: !313, file: !312, line: 70, baseType: !81, size: 32, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColor", scope: !313, file: !312, line: 71, baseType: !337, size: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColorLen", scope: !313, file: !312, line: 72, baseType: !81, size: 32, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !313, file: !312, line: 75, baseType: !96, size: 16, offset: 736)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !313, file: !312, line: 76, baseType: !96, size: 16, offset: 752)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !313, file: !312, line: 79, baseType: !347, size: 64, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !312, line: 79, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_cdlayer", scope: !313, file: !312, line: 82, baseType: !81, size: 32, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!351 = !{}
!352 = !DILocalVariable(name: "em", arg: 1, scope: !142, file: !1, line: 57, type: !310)
!353 = !DILocation(line: 57, column: 21, scope: !142)
!354 = !DILocalVariable(name: "flag", arg: 2, scope: !142, file: !1, line: 57, type: !81)
!355 = !DILocation(line: 57, column: 29, scope: !142)
!356 = !DILocalVariable(name: "cos_cage", arg: 3, scope: !142, file: !1, line: 58, type: !135)
!357 = !DILocation(line: 58, column: 23, scope: !142)
!358 = !DILocalVariable(name: "cos_cage_free", arg: 4, scope: !142, file: !1, line: 58, type: !350)
!359 = !DILocation(line: 58, column: 48, scope: !142)
!360 = !DILocation(line: 60, column: 23, scope: !142)
!361 = !DILocation(line: 60, column: 27, scope: !142)
!362 = !DILocation(line: 60, column: 31, scope: !142)
!363 = !DILocation(line: 60, column: 35, scope: !142)
!364 = !DILocation(line: 60, column: 45, scope: !142)
!365 = !DILocation(line: 60, column: 49, scope: !142)
!366 = !DILocation(line: 60, column: 57, scope: !142)
!367 = !DILocation(line: 60, column: 63, scope: !142)
!368 = !DILocation(line: 60, column: 73, scope: !142)
!369 = !DILocation(line: 60, column: 9, scope: !142)
!370 = !DILocation(line: 60, column: 2, scope: !142)
!371 = distinct !DISubprogram(name: "BKE_bmbvh_new", scope: !1, file: !1, line: 166, type: !372, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !351)
!372 = !DISubroutineType(types: !373)
!373 = !{!145, !159, !155, !81, !81, !135, !350}
!374 = !DILocalVariable(name: "bm", arg: 1, scope: !371, file: !1, line: 167, type: !159)
!375 = !DILocation(line: 167, column: 16, scope: !371)
!376 = !DILocalVariable(name: "looptris", arg: 2, scope: !371, file: !1, line: 167, type: !155)
!377 = !DILocation(line: 167, column: 30, scope: !371)
!378 = !DILocalVariable(name: "looptris_tot", arg: 3, scope: !371, file: !1, line: 167, type: !81)
!379 = !DILocation(line: 167, column: 48, scope: !371)
!380 = !DILocalVariable(name: "flag", arg: 4, scope: !371, file: !1, line: 167, type: !81)
!381 = !DILocation(line: 167, column: 66, scope: !371)
!382 = !DILocalVariable(name: "cos_cage", arg: 5, scope: !371, file: !1, line: 168, type: !135)
!383 = !DILocation(line: 168, column: 23, scope: !371)
!384 = !DILocalVariable(name: "cos_cage_free", arg: 6, scope: !371, file: !1, line: 168, type: !350)
!385 = !DILocation(line: 168, column: 48, scope: !371)
!386 = !DILocalVariable(name: "test_fn", scope: !371, file: !1, line: 170, type: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!308, !189, !67}
!390 = !DILocation(line: 170, column: 9, scope: !371)
!391 = !DILocation(line: 172, column: 6, scope: !392)
!392 = distinct !DILexicalBlock(scope: !371, file: !1, line: 172, column: 6)
!393 = !DILocation(line: 172, column: 11, scope: !392)
!394 = !DILocation(line: 172, column: 6, scope: !371)
!395 = !DILocation(line: 173, column: 11, scope: !396)
!396 = distinct !DILexicalBlock(scope: !392, file: !1, line: 172, column: 35)
!397 = !DILocation(line: 174, column: 2, scope: !396)
!398 = !DILocation(line: 175, column: 11, scope: !399)
!399 = distinct !DILexicalBlock(scope: !392, file: !1, line: 175, column: 11)
!400 = !DILocation(line: 175, column: 16, scope: !399)
!401 = !DILocation(line: 175, column: 11, scope: !392)
!402 = !DILocation(line: 176, column: 11, scope: !403)
!403 = distinct !DILexicalBlock(scope: !399, file: !1, line: 175, column: 40)
!404 = !DILocation(line: 177, column: 2, scope: !403)
!405 = !DILocation(line: 179, column: 11, scope: !406)
!406 = distinct !DILexicalBlock(scope: !399, file: !1, line: 178, column: 7)
!407 = !DILocation(line: 182, column: 7, scope: !371)
!408 = !DILocation(line: 184, column: 26, scope: !371)
!409 = !DILocation(line: 184, column: 30, scope: !371)
!410 = !DILocation(line: 184, column: 40, scope: !371)
!411 = !DILocation(line: 184, column: 54, scope: !371)
!412 = !DILocation(line: 184, column: 60, scope: !371)
!413 = !DILocation(line: 184, column: 70, scope: !371)
!414 = !DILocation(line: 184, column: 85, scope: !371)
!415 = !DILocation(line: 184, column: 9, scope: !371)
!416 = !DILocation(line: 184, column: 2, scope: !371)
!417 = distinct !DISubprogram(name: "BKE_bmbvh_new_ex", scope: !1, file: !1, line: 63, type: !418, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !351)
!418 = !DISubroutineType(types: !419)
!419 = !{!145, !159, !155, !81, !81, !135, !350, !387, !67}
!420 = !DILocalVariable(name: "bm", arg: 1, scope: !417, file: !1, line: 64, type: !159)
!421 = !DILocation(line: 64, column: 16, scope: !417)
!422 = !DILocalVariable(name: "looptris", arg: 2, scope: !417, file: !1, line: 64, type: !155)
!423 = !DILocation(line: 64, column: 30, scope: !417)
!424 = !DILocalVariable(name: "looptris_tot", arg: 3, scope: !417, file: !1, line: 64, type: !81)
!425 = !DILocation(line: 64, column: 48, scope: !417)
!426 = !DILocalVariable(name: "flag", arg: 4, scope: !417, file: !1, line: 64, type: !81)
!427 = !DILocation(line: 64, column: 66, scope: !417)
!428 = !DILocalVariable(name: "cos_cage", arg: 5, scope: !417, file: !1, line: 65, type: !135)
!429 = !DILocation(line: 65, column: 23, scope: !417)
!430 = !DILocalVariable(name: "cos_cage_free", arg: 6, scope: !417, file: !1, line: 65, type: !350)
!431 = !DILocation(line: 65, column: 48, scope: !417)
!432 = !DILocalVariable(name: "test_fn", arg: 7, scope: !417, file: !1, line: 66, type: !387)
!433 = !DILocation(line: 66, column: 16, scope: !417)
!434 = !DILocalVariable(name: "user_data", arg: 8, scope: !417, file: !1, line: 66, type: !67)
!435 = !DILocation(line: 66, column: 59, scope: !417)
!436 = !DILocalVariable(name: "epsilon", scope: !417, file: !1, line: 69, type: !137)
!437 = !DILocation(line: 69, column: 14, scope: !417)
!438 = !DILocalVariable(name: "bmtree", scope: !417, file: !1, line: 71, type: !145)
!439 = !DILocation(line: 71, column: 13, scope: !417)
!440 = !DILocation(line: 71, column: 22, scope: !417)
!441 = !DILocalVariable(name: "cos", scope: !417, file: !1, line: 72, type: !442)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 288, elements: !443)
!443 = !{!100, !100}
!444 = !DILocation(line: 72, column: 8, scope: !417)
!445 = !DILocalVariable(name: "i", scope: !417, file: !1, line: 73, type: !81)
!446 = !DILocation(line: 73, column: 6, scope: !417)
!447 = !DILocalVariable(name: "tottri", scope: !417, file: !1, line: 74, type: !81)
!448 = !DILocation(line: 74, column: 6, scope: !417)
!449 = !DILocalVariable(name: "f_test", scope: !417, file: !1, line: 77, type: !189)
!450 = !DILocation(line: 77, column: 10, scope: !417)
!451 = !DILocalVariable(name: "f_test_prev", scope: !417, file: !1, line: 77, type: !189)
!452 = !DILocation(line: 77, column: 19, scope: !417)
!453 = !DILocalVariable(name: "test_fn_ret", scope: !417, file: !1, line: 78, type: !308)
!454 = !DILocation(line: 78, column: 7, scope: !417)
!455 = !DILocation(line: 83, column: 6, scope: !456)
!456 = distinct !DILexicalBlock(scope: !417, file: !1, line: 83, column: 6)
!457 = !DILocation(line: 83, column: 6, scope: !417)
!458 = !DILocation(line: 84, column: 29, scope: !459)
!459 = distinct !DILexicalBlock(scope: !456, file: !1, line: 83, column: 16)
!460 = !DILocation(line: 84, column: 3, scope: !459)
!461 = !DILocation(line: 85, column: 2, scope: !459)
!462 = !DILocation(line: 87, column: 21, scope: !417)
!463 = !DILocation(line: 87, column: 2, scope: !417)
!464 = !DILocation(line: 87, column: 10, scope: !417)
!465 = !DILocation(line: 87, column: 19, scope: !417)
!466 = !DILocation(line: 88, column: 25, scope: !417)
!467 = !DILocation(line: 88, column: 2, scope: !417)
!468 = !DILocation(line: 88, column: 10, scope: !417)
!469 = !DILocation(line: 88, column: 23, scope: !417)
!470 = !DILocation(line: 89, column: 15, scope: !417)
!471 = !DILocation(line: 89, column: 2, scope: !417)
!472 = !DILocation(line: 89, column: 10, scope: !417)
!473 = !DILocation(line: 89, column: 13, scope: !417)
!474 = !DILocation(line: 90, column: 21, scope: !417)
!475 = !DILocation(line: 90, column: 2, scope: !417)
!476 = !DILocation(line: 90, column: 10, scope: !417)
!477 = !DILocation(line: 90, column: 19, scope: !417)
!478 = !DILocation(line: 91, column: 26, scope: !417)
!479 = !DILocation(line: 91, column: 2, scope: !417)
!480 = !DILocation(line: 91, column: 10, scope: !417)
!481 = !DILocation(line: 91, column: 24, scope: !417)
!482 = !DILocation(line: 92, column: 17, scope: !417)
!483 = !DILocation(line: 92, column: 2, scope: !417)
!484 = !DILocation(line: 92, column: 10, scope: !417)
!485 = !DILocation(line: 92, column: 15, scope: !417)
!486 = !DILocation(line: 94, column: 6, scope: !487)
!487 = distinct !DILexicalBlock(scope: !417, file: !1, line: 94, column: 6)
!488 = !DILocation(line: 94, column: 6, scope: !417)
!489 = !DILocation(line: 98, column: 15, scope: !490)
!490 = distinct !DILexicalBlock(scope: !487, file: !1, line: 94, column: 15)
!491 = !DILocation(line: 99, column: 15, scope: !490)
!492 = !DILocation(line: 101, column: 10, scope: !490)
!493 = !DILocation(line: 102, column: 10, scope: !494)
!494 = distinct !DILexicalBlock(scope: !490, file: !1, line: 102, column: 3)
!495 = !DILocation(line: 102, column: 8, scope: !494)
!496 = !DILocation(line: 102, column: 15, scope: !497)
!497 = distinct !DILexicalBlock(scope: !494, file: !1, line: 102, column: 3)
!498 = !DILocation(line: 102, column: 19, scope: !497)
!499 = !DILocation(line: 102, column: 17, scope: !497)
!500 = !DILocation(line: 102, column: 3, scope: !494)
!501 = !DILocation(line: 103, column: 13, scope: !502)
!502 = distinct !DILexicalBlock(scope: !497, file: !1, line: 102, column: 38)
!503 = !DILocation(line: 103, column: 22, scope: !502)
!504 = !DILocation(line: 103, column: 29, scope: !502)
!505 = !DILocation(line: 103, column: 11, scope: !502)
!506 = !DILocation(line: 104, column: 8, scope: !507)
!507 = distinct !DILexicalBlock(scope: !502, file: !1, line: 104, column: 8)
!508 = !DILocation(line: 104, column: 18, scope: !507)
!509 = !DILocation(line: 104, column: 15, scope: !507)
!510 = !DILocation(line: 104, column: 8, scope: !502)
!511 = !DILocation(line: 105, column: 19, scope: !512)
!512 = distinct !DILexicalBlock(scope: !507, file: !1, line: 104, column: 31)
!513 = !DILocation(line: 105, column: 27, scope: !512)
!514 = !DILocation(line: 105, column: 35, scope: !512)
!515 = !DILocation(line: 105, column: 17, scope: !512)
!516 = !DILocation(line: 106, column: 19, scope: !512)
!517 = !DILocation(line: 106, column: 17, scope: !512)
!518 = !DILocation(line: 107, column: 4, scope: !512)
!519 = !DILocation(line: 109, column: 8, scope: !520)
!520 = distinct !DILexicalBlock(scope: !502, file: !1, line: 109, column: 8)
!521 = !DILocation(line: 109, column: 8, scope: !502)
!522 = !DILocation(line: 110, column: 11, scope: !523)
!523 = distinct !DILexicalBlock(scope: !520, file: !1, line: 109, column: 21)
!524 = !DILocation(line: 111, column: 4, scope: !523)
!525 = !DILocation(line: 112, column: 3, scope: !502)
!526 = !DILocation(line: 102, column: 34, scope: !497)
!527 = !DILocation(line: 102, column: 3, scope: !497)
!528 = distinct !{!528, !500, !529}
!529 = !DILocation(line: 112, column: 3, scope: !494)
!530 = !DILocation(line: 113, column: 2, scope: !490)
!531 = !DILocation(line: 115, column: 12, scope: !532)
!532 = distinct !DILexicalBlock(scope: !487, file: !1, line: 114, column: 7)
!533 = !DILocation(line: 115, column: 10, scope: !532)
!534 = !DILocation(line: 118, column: 33, scope: !417)
!535 = !DILocation(line: 118, column: 17, scope: !417)
!536 = !DILocation(line: 118, column: 2, scope: !417)
!537 = !DILocation(line: 118, column: 10, scope: !417)
!538 = !DILocation(line: 118, column: 15, scope: !417)
!539 = !DILocation(line: 120, column: 14, scope: !417)
!540 = !DILocation(line: 121, column: 14, scope: !417)
!541 = !DILocation(line: 123, column: 9, scope: !542)
!542 = distinct !DILexicalBlock(scope: !417, file: !1, line: 123, column: 2)
!543 = !DILocation(line: 123, column: 7, scope: !542)
!544 = !DILocation(line: 123, column: 14, scope: !545)
!545 = distinct !DILexicalBlock(scope: !542, file: !1, line: 123, column: 2)
!546 = !DILocation(line: 123, column: 18, scope: !545)
!547 = !DILocation(line: 123, column: 16, scope: !545)
!548 = !DILocation(line: 123, column: 2, scope: !542)
!549 = !DILocation(line: 124, column: 7, scope: !550)
!550 = distinct !DILexicalBlock(scope: !551, file: !1, line: 124, column: 7)
!551 = distinct !DILexicalBlock(scope: !545, file: !1, line: 123, column: 37)
!552 = !DILocation(line: 124, column: 7, scope: !551)
!553 = !DILocation(line: 126, column: 13, scope: !554)
!554 = distinct !DILexicalBlock(scope: !550, file: !1, line: 124, column: 16)
!555 = !DILocation(line: 126, column: 22, scope: !554)
!556 = !DILocation(line: 126, column: 29, scope: !554)
!557 = !DILocation(line: 126, column: 11, scope: !554)
!558 = !DILocation(line: 127, column: 8, scope: !559)
!559 = distinct !DILexicalBlock(scope: !554, file: !1, line: 127, column: 8)
!560 = !DILocation(line: 127, column: 18, scope: !559)
!561 = !DILocation(line: 127, column: 15, scope: !559)
!562 = !DILocation(line: 127, column: 8, scope: !554)
!563 = !DILocation(line: 128, column: 19, scope: !564)
!564 = distinct !DILexicalBlock(scope: !559, file: !1, line: 127, column: 31)
!565 = !DILocation(line: 128, column: 27, scope: !564)
!566 = !DILocation(line: 128, column: 35, scope: !564)
!567 = !DILocation(line: 128, column: 17, scope: !564)
!568 = !DILocation(line: 129, column: 19, scope: !564)
!569 = !DILocation(line: 129, column: 17, scope: !564)
!570 = !DILocation(line: 130, column: 4, scope: !564)
!571 = !DILocation(line: 132, column: 9, scope: !572)
!572 = distinct !DILexicalBlock(scope: !554, file: !1, line: 132, column: 8)
!573 = !DILocation(line: 132, column: 8, scope: !554)
!574 = !DILocation(line: 133, column: 5, scope: !575)
!575 = distinct !DILexicalBlock(scope: !572, file: !1, line: 132, column: 22)
!576 = !DILocation(line: 135, column: 3, scope: !554)
!577 = !DILocation(line: 137, column: 7, scope: !578)
!578 = distinct !DILexicalBlock(scope: !551, file: !1, line: 137, column: 7)
!579 = !DILocation(line: 137, column: 7, scope: !551)
!580 = !DILocation(line: 138, column: 15, scope: !581)
!581 = distinct !DILexicalBlock(scope: !578, file: !1, line: 137, column: 17)
!582 = !DILocation(line: 138, column: 23, scope: !581)
!583 = !DILocation(line: 138, column: 32, scope: !581)
!584 = !DILocation(line: 138, column: 4, scope: !581)
!585 = !DILocation(line: 139, column: 15, scope: !581)
!586 = !DILocation(line: 139, column: 23, scope: !581)
!587 = !DILocation(line: 139, column: 32, scope: !581)
!588 = !DILocation(line: 139, column: 4, scope: !581)
!589 = !DILocation(line: 140, column: 15, scope: !581)
!590 = !DILocation(line: 140, column: 23, scope: !581)
!591 = !DILocation(line: 140, column: 32, scope: !581)
!592 = !DILocation(line: 140, column: 4, scope: !581)
!593 = !DILocation(line: 141, column: 3, scope: !581)
!594 = !DILocation(line: 143, column: 15, scope: !595)
!595 = distinct !DILexicalBlock(scope: !578, file: !1, line: 142, column: 8)
!596 = !DILocation(line: 143, column: 23, scope: !595)
!597 = !DILocation(line: 143, column: 32, scope: !595)
!598 = !DILocation(line: 143, column: 39, scope: !595)
!599 = !DILocation(line: 143, column: 42, scope: !595)
!600 = !DILocation(line: 143, column: 4, scope: !595)
!601 = !DILocation(line: 144, column: 15, scope: !595)
!602 = !DILocation(line: 144, column: 23, scope: !595)
!603 = !DILocation(line: 144, column: 32, scope: !595)
!604 = !DILocation(line: 144, column: 39, scope: !595)
!605 = !DILocation(line: 144, column: 42, scope: !595)
!606 = !DILocation(line: 144, column: 4, scope: !595)
!607 = !DILocation(line: 145, column: 15, scope: !595)
!608 = !DILocation(line: 145, column: 23, scope: !595)
!609 = !DILocation(line: 145, column: 32, scope: !595)
!610 = !DILocation(line: 145, column: 39, scope: !595)
!611 = !DILocation(line: 145, column: 42, scope: !595)
!612 = !DILocation(line: 145, column: 4, scope: !595)
!613 = !DILocation(line: 148, column: 22, scope: !551)
!614 = !DILocation(line: 148, column: 30, scope: !551)
!615 = !DILocation(line: 148, column: 36, scope: !551)
!616 = !DILocation(line: 148, column: 48, scope: !551)
!617 = !DILocation(line: 148, column: 39, scope: !551)
!618 = !DILocation(line: 148, column: 3, scope: !551)
!619 = !DILocation(line: 149, column: 2, scope: !551)
!620 = !DILocation(line: 123, column: 33, scope: !545)
!621 = !DILocation(line: 123, column: 2, scope: !545)
!622 = distinct !{!622, !548, !623}
!623 = !DILocation(line: 149, column: 2, scope: !542)
!624 = !DILocation(line: 151, column: 22, scope: !417)
!625 = !DILocation(line: 151, column: 30, scope: !417)
!626 = !DILocation(line: 151, column: 2, scope: !417)
!627 = !DILocation(line: 153, column: 9, scope: !417)
!628 = !DILocation(line: 153, column: 2, scope: !417)
!629 = distinct !DISubprogram(name: "copy_v3_v3", scope: !630, file: !630, line: 64, type: !631, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!630 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!631 = !DISubroutineType(types: !632)
!632 = !{null, !65, !633}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!634 = !DILocalVariable(name: "r", arg: 1, scope: !629, file: !630, line: 64, type: !65)
!635 = !DILocation(line: 64, column: 31, scope: !629)
!636 = !DILocalVariable(name: "a", arg: 2, scope: !629, file: !630, line: 64, type: !633)
!637 = !DILocation(line: 64, column: 49, scope: !629)
!638 = !DILocation(line: 66, column: 9, scope: !629)
!639 = !DILocation(line: 66, column: 2, scope: !629)
!640 = !DILocation(line: 66, column: 7, scope: !629)
!641 = !DILocation(line: 67, column: 9, scope: !629)
!642 = !DILocation(line: 67, column: 2, scope: !629)
!643 = !DILocation(line: 67, column: 7, scope: !629)
!644 = !DILocation(line: 68, column: 9, scope: !629)
!645 = !DILocation(line: 68, column: 2, scope: !629)
!646 = !DILocation(line: 68, column: 7, scope: !629)
!647 = !DILocation(line: 69, column: 1, scope: !629)
!648 = distinct !DISubprogram(name: "_bm_elem_index_get", scope: !649, file: !649, line: 119, type: !650, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!649 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!650 = !DISubroutineType(types: !651)
!651 = !{!81, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!654 = !DILocalVariable(name: "head", arg: 1, scope: !648, file: !649, line: 119, type: !652)
!655 = !DILocation(line: 119, column: 51, scope: !648)
!656 = !DILocation(line: 121, column: 9, scope: !648)
!657 = !DILocation(line: 121, column: 15, scope: !648)
!658 = !DILocation(line: 121, column: 2, scope: !648)
!659 = distinct !DISubprogram(name: "bm_face_is_select", scope: !1, file: !1, line: 156, type: !388, scopeLine: 157, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!660 = !DILocalVariable(name: "f", arg: 1, scope: !659, file: !1, line: 156, type: !189)
!661 = !DILocation(line: 156, column: 39, scope: !659)
!662 = !DILocalVariable(name: "UNUSED_user_data", arg: 2, scope: !659, file: !1, line: 156, type: !67)
!663 = !DILocation(line: 156, column: 48, scope: !659)
!664 = !DILocation(line: 158, column: 10, scope: !659)
!665 = !DILocation(line: 158, column: 47, scope: !659)
!666 = !DILocation(line: 158, column: 9, scope: !659)
!667 = !DILocation(line: 158, column: 2, scope: !659)
!668 = distinct !DISubprogram(name: "bm_face_is_not_hidden", scope: !1, file: !1, line: 161, type: !388, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!669 = !DILocalVariable(name: "f", arg: 1, scope: !668, file: !1, line: 161, type: !189)
!670 = !DILocation(line: 161, column: 43, scope: !668)
!671 = !DILocalVariable(name: "UNUSED_user_data", arg: 2, scope: !668, file: !1, line: 161, type: !67)
!672 = !DILocation(line: 161, column: 52, scope: !668)
!673 = !DILocation(line: 163, column: 10, scope: !668)
!674 = !DILocation(line: 163, column: 47, scope: !668)
!675 = !DILocation(line: 163, column: 9, scope: !668)
!676 = !DILocation(line: 163, column: 2, scope: !668)
!677 = distinct !DISubprogram(name: "BKE_bmbvh_free", scope: !1, file: !1, line: 188, type: !678, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !351)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !145}
!680 = !DILocalVariable(name: "bmtree", arg: 1, scope: !677, file: !1, line: 188, type: !145)
!681 = !DILocation(line: 188, column: 32, scope: !677)
!682 = !DILocation(line: 190, column: 19, scope: !677)
!683 = !DILocation(line: 190, column: 27, scope: !677)
!684 = !DILocation(line: 190, column: 2, scope: !677)
!685 = !DILocation(line: 192, column: 6, scope: !686)
!686 = distinct !DILexicalBlock(scope: !677, file: !1, line: 192, column: 6)
!687 = !DILocation(line: 192, column: 14, scope: !686)
!688 = !DILocation(line: 192, column: 23, scope: !686)
!689 = !DILocation(line: 192, column: 26, scope: !686)
!690 = !DILocation(line: 192, column: 34, scope: !686)
!691 = !DILocation(line: 192, column: 6, scope: !677)
!692 = !DILocation(line: 193, column: 3, scope: !693)
!693 = distinct !DILexicalBlock(scope: !686, file: !1, line: 192, column: 49)
!694 = !DILocation(line: 193, column: 21, scope: !693)
!695 = !DILocation(line: 193, column: 29, scope: !693)
!696 = !DILocation(line: 193, column: 13, scope: !693)
!697 = !DILocation(line: 194, column: 2, scope: !693)
!698 = !DILocation(line: 196, column: 2, scope: !677)
!699 = !DILocation(line: 196, column: 12, scope: !677)
!700 = !DILocation(line: 197, column: 1, scope: !677)
!701 = distinct !DISubprogram(name: "BKE_bmbvh_tree_get", scope: !1, file: !1, line: 199, type: !702, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !351)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !145}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!705 = !DILocalVariable(name: "bmtree", arg: 1, scope: !701, file: !1, line: 199, type: !145)
!706 = !DILocation(line: 199, column: 40, scope: !701)
!707 = !DILocation(line: 201, column: 9, scope: !701)
!708 = !DILocation(line: 201, column: 17, scope: !701)
!709 = !DILocation(line: 201, column: 2, scope: !701)
!710 = distinct !DISubprogram(name: "BKE_bmbvh_ray_cast", scope: !1, file: !1, line: 270, type: !711, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !351)
!711 = !DISubroutineType(types: !712)
!712 = !{!121, !145, !633, !633, !137, !65, !65, !65}
!713 = !DILocalVariable(name: "bmtree", arg: 1, scope: !710, file: !1, line: 270, type: !145)
!714 = !DILocation(line: 270, column: 39, scope: !710)
!715 = !DILocalVariable(name: "co", arg: 2, scope: !710, file: !1, line: 270, type: !633)
!716 = !DILocation(line: 270, column: 59, scope: !710)
!717 = !DILocalVariable(name: "dir", arg: 3, scope: !710, file: !1, line: 270, type: !633)
!718 = !DILocation(line: 270, column: 78, scope: !710)
!719 = !DILocalVariable(name: "radius", arg: 4, scope: !710, file: !1, line: 270, type: !137)
!720 = !DILocation(line: 270, column: 98, scope: !710)
!721 = !DILocalVariable(name: "r_dist", arg: 5, scope: !710, file: !1, line: 271, type: !65)
!722 = !DILocation(line: 271, column: 35, scope: !710)
!723 = !DILocalVariable(name: "r_hitout", arg: 6, scope: !710, file: !1, line: 271, type: !65)
!724 = !DILocation(line: 271, column: 49, scope: !710)
!725 = !DILocalVariable(name: "r_cagehit", arg: 7, scope: !710, file: !1, line: 271, type: !65)
!726 = !DILocation(line: 271, column: 68, scope: !710)
!727 = !DILocalVariable(name: "hit", scope: !710, file: !1, line: 273, type: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeRayHit", file: !152, line: 73, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeRayHit", file: !152, line: 67, size: 288, elements: !730)
!730 = !{!731, !732, !733, !734, !735}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !729, file: !152, line: 68, baseType: !81, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !729, file: !152, line: 69, baseType: !98, size: 96, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !729, file: !152, line: 70, baseType: !98, size: 96, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !729, file: !152, line: 71, baseType: !66, size: 32, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !729, file: !152, line: 72, baseType: !81, size: 32, offset: 256)
!736 = !DILocation(line: 273, column: 16, scope: !710)
!737 = !DILocalVariable(name: "bmcb_data", scope: !710, file: !1, line: 274, type: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RayCastUserData", file: !1, line: 233, size: 192, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !738, file: !1, line: 235, baseType: !68, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "cos_cage", scope: !738, file: !1, line: 236, baseType: !135, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !738, file: !1, line: 239, baseType: !743, size: 64, offset: 128)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 2)
!746 = !DILocation(line: 274, column: 25, scope: !710)
!747 = !DILocalVariable(name: "dist", scope: !710, file: !1, line: 275, type: !137)
!748 = !DILocation(line: 275, column: 14, scope: !710)
!749 = !DILocation(line: 275, column: 21, scope: !710)
!750 = !DILocation(line: 275, column: 31, scope: !710)
!751 = !DILocation(line: 275, column: 30, scope: !710)
!752 = !DILocation(line: 277, column: 6, scope: !753)
!753 = distinct !DILexicalBlock(scope: !710, file: !1, line: 277, column: 6)
!754 = !DILocation(line: 277, column: 14, scope: !753)
!755 = !DILocation(line: 277, column: 6, scope: !710)
!756 = !DILocation(line: 277, column: 24, scope: !753)
!757 = !DILocation(line: 279, column: 13, scope: !710)
!758 = !DILocation(line: 279, column: 6, scope: !710)
!759 = !DILocation(line: 279, column: 11, scope: !710)
!760 = !DILocation(line: 280, column: 6, scope: !710)
!761 = !DILocation(line: 280, column: 12, scope: !710)
!762 = !DILocation(line: 283, column: 45, scope: !710)
!763 = !DILocation(line: 283, column: 53, scope: !710)
!764 = !DILocation(line: 283, column: 12, scope: !710)
!765 = !DILocation(line: 283, column: 21, scope: !710)
!766 = !DILocation(line: 284, column: 43, scope: !710)
!767 = !DILocation(line: 284, column: 51, scope: !710)
!768 = !DILocation(line: 284, column: 12, scope: !710)
!769 = !DILocation(line: 284, column: 21, scope: !710)
!770 = !DILocation(line: 286, column: 23, scope: !710)
!771 = !DILocation(line: 286, column: 31, scope: !710)
!772 = !DILocation(line: 286, column: 37, scope: !710)
!773 = !DILocation(line: 286, column: 41, scope: !710)
!774 = !DILocation(line: 286, column: 46, scope: !710)
!775 = !DILocation(line: 286, column: 79, scope: !710)
!776 = !DILocation(line: 286, column: 2, scope: !710)
!777 = !DILocation(line: 287, column: 10, scope: !778)
!778 = distinct !DILexicalBlock(scope: !710, file: !1, line: 287, column: 6)
!779 = !DILocation(line: 287, column: 16, scope: !778)
!780 = !DILocation(line: 287, column: 22, scope: !778)
!781 = !DILocation(line: 287, column: 29, scope: !778)
!782 = !DILocation(line: 287, column: 37, scope: !778)
!783 = !DILocation(line: 287, column: 34, scope: !778)
!784 = !DILocation(line: 287, column: 6, scope: !710)
!785 = !DILocation(line: 288, column: 7, scope: !786)
!786 = distinct !DILexicalBlock(scope: !787, file: !1, line: 288, column: 7)
!787 = distinct !DILexicalBlock(scope: !778, file: !1, line: 287, column: 43)
!788 = !DILocation(line: 288, column: 7, scope: !787)
!789 = !DILocation(line: 289, column: 8, scope: !790)
!790 = distinct !DILexicalBlock(scope: !791, file: !1, line: 289, column: 8)
!791 = distinct !DILexicalBlock(scope: !786, file: !1, line: 288, column: 17)
!792 = !DILocation(line: 289, column: 16, scope: !790)
!793 = !DILocation(line: 289, column: 21, scope: !790)
!794 = !DILocation(line: 289, column: 8, scope: !791)
!795 = !DILocalVariable(name: "ltri", scope: !796, file: !1, line: 290, type: !797)
!796 = distinct !DILexicalBlock(scope: !790, file: !1, line: 289, column: 42)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!798 = !DILocation(line: 290, column: 14, scope: !796)
!799 = !DILocation(line: 290, column: 21, scope: !796)
!800 = !DILocation(line: 290, column: 29, scope: !796)
!801 = !DILocation(line: 290, column: 42, scope: !796)
!802 = !DILocation(line: 291, column: 25, scope: !796)
!803 = !DILocation(line: 291, column: 35, scope: !796)
!804 = !DILocation(line: 291, column: 44, scope: !796)
!805 = !DILocation(line: 291, column: 47, scope: !796)
!806 = !DILocation(line: 291, column: 51, scope: !796)
!807 = !DILocation(line: 291, column: 60, scope: !796)
!808 = !DILocation(line: 291, column: 63, scope: !796)
!809 = !DILocation(line: 291, column: 67, scope: !796)
!810 = !DILocation(line: 291, column: 76, scope: !796)
!811 = !DILocation(line: 291, column: 79, scope: !796)
!812 = !DILocation(line: 291, column: 93, scope: !796)
!813 = !DILocation(line: 291, column: 83, scope: !796)
!814 = !DILocation(line: 291, column: 5, scope: !796)
!815 = !DILocation(line: 292, column: 4, scope: !796)
!816 = !DILocation(line: 294, column: 16, scope: !817)
!817 = distinct !DILexicalBlock(scope: !790, file: !1, line: 293, column: 9)
!818 = !DILocation(line: 294, column: 30, scope: !817)
!819 = !DILocation(line: 294, column: 26, scope: !817)
!820 = !DILocation(line: 294, column: 5, scope: !817)
!821 = !DILocation(line: 297, column: 8, scope: !822)
!822 = distinct !DILexicalBlock(scope: !791, file: !1, line: 297, column: 8)
!823 = !DILocation(line: 297, column: 8, scope: !791)
!824 = !DILocation(line: 298, column: 16, scope: !825)
!825 = distinct !DILexicalBlock(scope: !822, file: !1, line: 297, column: 19)
!826 = !DILocation(line: 298, column: 31, scope: !825)
!827 = !DILocation(line: 298, column: 27, scope: !825)
!828 = !DILocation(line: 298, column: 5, scope: !825)
!829 = !DILocation(line: 299, column: 4, scope: !825)
!830 = !DILocation(line: 300, column: 3, scope: !791)
!831 = !DILocation(line: 302, column: 7, scope: !832)
!832 = distinct !DILexicalBlock(scope: !787, file: !1, line: 302, column: 7)
!833 = !DILocation(line: 302, column: 7, scope: !787)
!834 = !DILocation(line: 303, column: 18, scope: !835)
!835 = distinct !DILexicalBlock(scope: !832, file: !1, line: 302, column: 15)
!836 = !DILocation(line: 303, column: 5, scope: !835)
!837 = !DILocation(line: 303, column: 12, scope: !835)
!838 = !DILocation(line: 304, column: 3, scope: !835)
!839 = !DILocation(line: 306, column: 10, scope: !787)
!840 = !DILocation(line: 306, column: 18, scope: !787)
!841 = !DILocation(line: 306, column: 31, scope: !787)
!842 = !DILocation(line: 306, column: 42, scope: !787)
!843 = !DILocation(line: 306, column: 3, scope: !787)
!844 = !DILocation(line: 309, column: 2, scope: !710)
!845 = !DILocation(line: 310, column: 1, scope: !710)
!846 = distinct !DISubprogram(name: "bmbvh_ray_cast_cb", scope: !1, file: !1, line: 242, type: !847, scopeLine: 243, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !67, !81, !849, !857}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeRay", file: !152, line: 65, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeRay", file: !152, line: 61, size: 224, elements: !853)
!853 = !{!854, !855, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !852, file: !152, line: 62, baseType: !98, size: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !852, file: !152, line: 63, baseType: !98, size: 96, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !852, file: !152, line: 64, baseType: !66, size: 32, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!858 = !DILocalVariable(name: "userdata", arg: 1, scope: !846, file: !1, line: 242, type: !67)
!859 = !DILocation(line: 242, column: 37, scope: !846)
!860 = !DILocalVariable(name: "index", arg: 2, scope: !846, file: !1, line: 242, type: !81)
!861 = !DILocation(line: 242, column: 51, scope: !846)
!862 = !DILocalVariable(name: "ray", arg: 3, scope: !846, file: !1, line: 242, type: !849)
!863 = !DILocation(line: 242, column: 76, scope: !846)
!864 = !DILocalVariable(name: "hit", arg: 4, scope: !846, file: !1, line: 242, type: !857)
!865 = !DILocation(line: 242, column: 96, scope: !846)
!866 = !DILocalVariable(name: "bmcb_data", scope: !846, file: !1, line: 244, type: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!868 = !DILocation(line: 244, column: 26, scope: !846)
!869 = !DILocation(line: 244, column: 38, scope: !846)
!870 = !DILocalVariable(name: "ltri", scope: !846, file: !1, line: 245, type: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!872 = !DILocation(line: 245, column: 17, scope: !846)
!873 = !DILocation(line: 245, column: 24, scope: !846)
!874 = !DILocation(line: 245, column: 35, scope: !846)
!875 = !DILocation(line: 245, column: 44, scope: !846)
!876 = !DILocalVariable(name: "dist", scope: !846, file: !1, line: 246, type: !66)
!877 = !DILocation(line: 246, column: 8, scope: !846)
!878 = !DILocalVariable(name: "uv", scope: !846, file: !1, line: 246, type: !743)
!879 = !DILocation(line: 246, column: 14, scope: !846)
!880 = !DILocalVariable(name: "tri_cos", scope: !846, file: !1, line: 247, type: !881)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 192, elements: !99)
!882 = !DILocation(line: 247, column: 15, scope: !846)
!883 = !DILocalVariable(name: "isect", scope: !846, file: !1, line: 248, type: !308)
!884 = !DILocation(line: 248, column: 7, scope: !846)
!885 = !DILocation(line: 250, column: 22, scope: !846)
!886 = !DILocation(line: 250, column: 31, scope: !846)
!887 = !DILocation(line: 250, column: 37, scope: !846)
!888 = !DILocation(line: 250, column: 48, scope: !846)
!889 = !DILocation(line: 250, column: 2, scope: !846)
!890 = !DILocation(line: 252, column: 11, scope: !846)
!891 = !DILocation(line: 252, column: 16, scope: !846)
!892 = !DILocation(line: 252, column: 23, scope: !846)
!893 = !DILocation(line: 253, column: 36, scope: !846)
!894 = !DILocation(line: 253, column: 41, scope: !846)
!895 = !DILocation(line: 253, column: 49, scope: !846)
!896 = !DILocation(line: 253, column: 54, scope: !846)
!897 = !DILocation(line: 254, column: 36, scope: !846)
!898 = !DILocation(line: 254, column: 48, scope: !846)
!899 = !DILocation(line: 254, column: 60, scope: !846)
!900 = !DILocation(line: 254, column: 79, scope: !846)
!901 = !DILocation(line: 254, column: 83, scope: !846)
!902 = !DILocation(line: 254, column: 88, scope: !846)
!903 = !DILocation(line: 253, column: 11, scope: !846)
!904 = !DILocation(line: 255, column: 28, scope: !846)
!905 = !DILocation(line: 255, column: 33, scope: !846)
!906 = !DILocation(line: 255, column: 41, scope: !846)
!907 = !DILocation(line: 255, column: 46, scope: !846)
!908 = !DILocation(line: 256, column: 28, scope: !846)
!909 = !DILocation(line: 256, column: 40, scope: !846)
!910 = !DILocation(line: 256, column: 52, scope: !846)
!911 = !DILocation(line: 256, column: 71, scope: !846)
!912 = !DILocation(line: 255, column: 11, scope: !846)
!913 = !DILocation(line: 252, column: 10, scope: !846)
!914 = !DILocation(line: 252, column: 8, scope: !846)
!915 = !DILocation(line: 258, column: 6, scope: !916)
!916 = distinct !DILexicalBlock(scope: !846, file: !1, line: 258, column: 6)
!917 = !DILocation(line: 258, column: 12, scope: !916)
!918 = !DILocation(line: 258, column: 15, scope: !916)
!919 = !DILocation(line: 258, column: 22, scope: !916)
!920 = !DILocation(line: 258, column: 27, scope: !916)
!921 = !DILocation(line: 258, column: 20, scope: !916)
!922 = !DILocation(line: 258, column: 6, scope: !846)
!923 = !DILocation(line: 259, column: 15, scope: !924)
!924 = distinct !DILexicalBlock(scope: !916, file: !1, line: 258, column: 33)
!925 = !DILocation(line: 259, column: 3, scope: !924)
!926 = !DILocation(line: 259, column: 8, scope: !924)
!927 = !DILocation(line: 259, column: 13, scope: !924)
!928 = !DILocation(line: 260, column: 16, scope: !924)
!929 = !DILocation(line: 260, column: 3, scope: !924)
!930 = !DILocation(line: 260, column: 8, scope: !924)
!931 = !DILocation(line: 260, column: 14, scope: !924)
!932 = !DILocation(line: 262, column: 14, scope: !924)
!933 = !DILocation(line: 262, column: 19, scope: !924)
!934 = !DILocation(line: 262, column: 23, scope: !924)
!935 = !DILocation(line: 262, column: 32, scope: !924)
!936 = !DILocation(line: 262, column: 35, scope: !924)
!937 = !DILocation(line: 262, column: 3, scope: !924)
!938 = !DILocation(line: 264, column: 18, scope: !924)
!939 = !DILocation(line: 264, column: 23, scope: !924)
!940 = !DILocation(line: 264, column: 27, scope: !924)
!941 = !DILocation(line: 264, column: 32, scope: !924)
!942 = !DILocation(line: 264, column: 40, scope: !924)
!943 = !DILocation(line: 264, column: 45, scope: !924)
!944 = !DILocation(line: 264, column: 56, scope: !924)
!945 = !DILocation(line: 264, column: 3, scope: !924)
!946 = !DILocation(line: 266, column: 14, scope: !924)
!947 = !DILocation(line: 266, column: 25, scope: !924)
!948 = !DILocation(line: 266, column: 29, scope: !924)
!949 = !DILocation(line: 266, column: 3, scope: !924)
!950 = !DILocation(line: 267, column: 2, scope: !924)
!951 = !DILocation(line: 268, column: 1, scope: !846)
!952 = distinct !DISubprogram(name: "BKE_bmbvh_find_face_segment", scope: !1, file: !1, line: 360, type: !953, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !351)
!953 = !DISubroutineType(types: !954)
!954 = !{!121, !145, !633, !633, !65, !65, !65}
!955 = !DILocalVariable(name: "bmtree", arg: 1, scope: !952, file: !1, line: 360, type: !145)
!956 = !DILocation(line: 360, column: 48, scope: !952)
!957 = !DILocalVariable(name: "co_a", arg: 2, scope: !952, file: !1, line: 360, type: !633)
!958 = !DILocation(line: 360, column: 68, scope: !952)
!959 = !DILocalVariable(name: "co_b", arg: 3, scope: !952, file: !1, line: 360, type: !633)
!960 = !DILocation(line: 360, column: 89, scope: !952)
!961 = !DILocalVariable(name: "r_fac", arg: 4, scope: !952, file: !1, line: 361, type: !65)
!962 = !DILocation(line: 361, column: 44, scope: !952)
!963 = !DILocalVariable(name: "r_hitout", arg: 5, scope: !952, file: !1, line: 361, type: !65)
!964 = !DILocation(line: 361, column: 57, scope: !952)
!965 = !DILocalVariable(name: "r_cagehit", arg: 6, scope: !952, file: !1, line: 361, type: !65)
!966 = !DILocation(line: 361, column: 76, scope: !952)
!967 = !DILocalVariable(name: "hit", scope: !952, file: !1, line: 363, type: !728)
!968 = !DILocation(line: 363, column: 16, scope: !952)
!969 = !DILocalVariable(name: "bmcb_data", scope: !952, file: !1, line: 364, type: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentUserData", file: !1, line: 316, size: 320, elements: !971)
!971 = !{!972, !973, !974, !975, !976}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !970, file: !1, line: 318, baseType: !68, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "cos_cage", scope: !970, file: !1, line: 319, baseType: !135, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !970, file: !1, line: 322, baseType: !743, size: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "co_a", scope: !970, file: !1, line: 323, baseType: !633, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "co_b", scope: !970, file: !1, line: 323, baseType: !633, size: 64, offset: 256)
!977 = !DILocation(line: 364, column: 25, scope: !952)
!978 = !DILocalVariable(name: "dist", scope: !952, file: !1, line: 365, type: !137)
!979 = !DILocation(line: 365, column: 14, scope: !952)
!980 = !DILocation(line: 365, column: 30, scope: !952)
!981 = !DILocation(line: 365, column: 36, scope: !952)
!982 = !DILocation(line: 365, column: 21, scope: !952)
!983 = !DILocalVariable(name: "dir", scope: !952, file: !1, line: 366, type: !98)
!984 = !DILocation(line: 366, column: 8, scope: !952)
!985 = !DILocation(line: 368, column: 6, scope: !986)
!986 = distinct !DILexicalBlock(scope: !952, file: !1, line: 368, column: 6)
!987 = !DILocation(line: 368, column: 14, scope: !986)
!988 = !DILocation(line: 368, column: 6, scope: !952)
!989 = !DILocation(line: 368, column: 24, scope: !986)
!990 = !DILocation(line: 370, column: 14, scope: !952)
!991 = !DILocation(line: 370, column: 19, scope: !952)
!992 = !DILocation(line: 370, column: 25, scope: !952)
!993 = !DILocation(line: 370, column: 2, scope: !952)
!994 = !DILocation(line: 372, column: 13, scope: !952)
!995 = !DILocation(line: 372, column: 6, scope: !952)
!996 = !DILocation(line: 372, column: 11, scope: !952)
!997 = !DILocation(line: 373, column: 6, scope: !952)
!998 = !DILocation(line: 373, column: 12, scope: !952)
!999 = !DILocation(line: 376, column: 45, scope: !952)
!1000 = !DILocation(line: 376, column: 53, scope: !952)
!1001 = !DILocation(line: 376, column: 12, scope: !952)
!1002 = !DILocation(line: 376, column: 21, scope: !952)
!1003 = !DILocation(line: 377, column: 43, scope: !952)
!1004 = !DILocation(line: 377, column: 51, scope: !952)
!1005 = !DILocation(line: 377, column: 12, scope: !952)
!1006 = !DILocation(line: 377, column: 21, scope: !952)
!1007 = !DILocation(line: 378, column: 19, scope: !952)
!1008 = !DILocation(line: 378, column: 12, scope: !952)
!1009 = !DILocation(line: 378, column: 17, scope: !952)
!1010 = !DILocation(line: 379, column: 19, scope: !952)
!1011 = !DILocation(line: 379, column: 12, scope: !952)
!1012 = !DILocation(line: 379, column: 17, scope: !952)
!1013 = !DILocation(line: 381, column: 23, scope: !952)
!1014 = !DILocation(line: 381, column: 31, scope: !952)
!1015 = !DILocation(line: 381, column: 37, scope: !952)
!1016 = !DILocation(line: 381, column: 43, scope: !952)
!1017 = !DILocation(line: 381, column: 88, scope: !952)
!1018 = !DILocation(line: 381, column: 2, scope: !952)
!1019 = !DILocation(line: 382, column: 10, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !952, file: !1, line: 382, column: 6)
!1021 = !DILocation(line: 382, column: 16, scope: !1020)
!1022 = !DILocation(line: 382, column: 22, scope: !1020)
!1023 = !DILocation(line: 382, column: 29, scope: !1020)
!1024 = !DILocation(line: 382, column: 37, scope: !1020)
!1025 = !DILocation(line: 382, column: 34, scope: !1020)
!1026 = !DILocation(line: 382, column: 6, scope: !952)
!1027 = !DILocation(line: 384, column: 7, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !1, line: 384, column: 7)
!1029 = distinct !DILexicalBlock(scope: !1020, file: !1, line: 382, column: 43)
!1030 = !DILocation(line: 384, column: 7, scope: !1029)
!1031 = !DILocation(line: 385, column: 8, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !1, line: 385, column: 8)
!1033 = distinct !DILexicalBlock(scope: !1028, file: !1, line: 384, column: 17)
!1034 = !DILocation(line: 385, column: 16, scope: !1032)
!1035 = !DILocation(line: 385, column: 21, scope: !1032)
!1036 = !DILocation(line: 385, column: 8, scope: !1033)
!1037 = !DILocalVariable(name: "ltri", scope: !1038, file: !1, line: 386, type: !797)
!1038 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 385, column: 42)
!1039 = !DILocation(line: 386, column: 14, scope: !1038)
!1040 = !DILocation(line: 386, column: 21, scope: !1038)
!1041 = !DILocation(line: 386, column: 29, scope: !1038)
!1042 = !DILocation(line: 386, column: 42, scope: !1038)
!1043 = !DILocation(line: 387, column: 25, scope: !1038)
!1044 = !DILocation(line: 387, column: 35, scope: !1038)
!1045 = !DILocation(line: 387, column: 44, scope: !1038)
!1046 = !DILocation(line: 387, column: 47, scope: !1038)
!1047 = !DILocation(line: 387, column: 51, scope: !1038)
!1048 = !DILocation(line: 387, column: 60, scope: !1038)
!1049 = !DILocation(line: 387, column: 63, scope: !1038)
!1050 = !DILocation(line: 387, column: 67, scope: !1038)
!1051 = !DILocation(line: 387, column: 76, scope: !1038)
!1052 = !DILocation(line: 387, column: 79, scope: !1038)
!1053 = !DILocation(line: 387, column: 93, scope: !1038)
!1054 = !DILocation(line: 387, column: 83, scope: !1038)
!1055 = !DILocation(line: 387, column: 5, scope: !1038)
!1056 = !DILocation(line: 388, column: 4, scope: !1038)
!1057 = !DILocation(line: 390, column: 16, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 389, column: 9)
!1059 = !DILocation(line: 390, column: 30, scope: !1058)
!1060 = !DILocation(line: 390, column: 26, scope: !1058)
!1061 = !DILocation(line: 390, column: 5, scope: !1058)
!1062 = !DILocation(line: 393, column: 8, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1033, file: !1, line: 393, column: 8)
!1064 = !DILocation(line: 393, column: 8, scope: !1033)
!1065 = !DILocation(line: 394, column: 16, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1063, file: !1, line: 393, column: 19)
!1067 = !DILocation(line: 394, column: 31, scope: !1066)
!1068 = !DILocation(line: 394, column: 27, scope: !1066)
!1069 = !DILocation(line: 394, column: 5, scope: !1066)
!1070 = !DILocation(line: 395, column: 4, scope: !1066)
!1071 = !DILocation(line: 396, column: 3, scope: !1033)
!1072 = !DILocation(line: 399, column: 7, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1029, file: !1, line: 399, column: 7)
!1074 = !DILocation(line: 399, column: 7, scope: !1029)
!1075 = !DILocation(line: 400, column: 17, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1073, file: !1, line: 399, column: 14)
!1077 = !DILocation(line: 400, column: 24, scope: !1076)
!1078 = !DILocation(line: 400, column: 22, scope: !1076)
!1079 = !DILocation(line: 400, column: 5, scope: !1076)
!1080 = !DILocation(line: 400, column: 11, scope: !1076)
!1081 = !DILocation(line: 401, column: 3, scope: !1076)
!1082 = !DILocation(line: 403, column: 10, scope: !1029)
!1083 = !DILocation(line: 403, column: 18, scope: !1029)
!1084 = !DILocation(line: 403, column: 31, scope: !1029)
!1085 = !DILocation(line: 403, column: 42, scope: !1029)
!1086 = !DILocation(line: 403, column: 3, scope: !1029)
!1087 = !DILocation(line: 406, column: 2, scope: !952)
!1088 = !DILocation(line: 407, column: 1, scope: !952)
!1089 = distinct !DISubprogram(name: "len_v3v3", scope: !630, file: !630, line: 759, type: !1090, scopeLine: 760, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!66, !633, !633}
!1092 = !DILocalVariable(name: "a", arg: 1, scope: !1089, file: !630, line: 759, type: !633)
!1093 = !DILocation(line: 759, column: 36, scope: !1089)
!1094 = !DILocalVariable(name: "b", arg: 2, scope: !1089, file: !630, line: 759, type: !633)
!1095 = !DILocation(line: 759, column: 54, scope: !1089)
!1096 = !DILocalVariable(name: "d", scope: !1089, file: !630, line: 761, type: !98)
!1097 = !DILocation(line: 761, column: 8, scope: !1089)
!1098 = !DILocation(line: 763, column: 14, scope: !1089)
!1099 = !DILocation(line: 763, column: 17, scope: !1089)
!1100 = !DILocation(line: 763, column: 20, scope: !1089)
!1101 = !DILocation(line: 763, column: 2, scope: !1089)
!1102 = !DILocation(line: 764, column: 16, scope: !1089)
!1103 = !DILocation(line: 764, column: 9, scope: !1089)
!1104 = !DILocation(line: 764, column: 2, scope: !1089)
!1105 = distinct !DISubprogram(name: "sub_v3_v3v3", scope: !630, file: !630, line: 357, type: !1106, scopeLine: 358, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{null, !65, !633, !633}
!1108 = !DILocalVariable(name: "r", arg: 1, scope: !1105, file: !630, line: 357, type: !65)
!1109 = !DILocation(line: 357, column: 32, scope: !1105)
!1110 = !DILocalVariable(name: "a", arg: 2, scope: !1105, file: !630, line: 357, type: !633)
!1111 = !DILocation(line: 357, column: 50, scope: !1105)
!1112 = !DILocalVariable(name: "b", arg: 3, scope: !1105, file: !630, line: 357, type: !633)
!1113 = !DILocation(line: 357, column: 68, scope: !1105)
!1114 = !DILocation(line: 359, column: 9, scope: !1105)
!1115 = !DILocation(line: 359, column: 16, scope: !1105)
!1116 = !DILocation(line: 359, column: 14, scope: !1105)
!1117 = !DILocation(line: 359, column: 2, scope: !1105)
!1118 = !DILocation(line: 359, column: 7, scope: !1105)
!1119 = !DILocation(line: 360, column: 9, scope: !1105)
!1120 = !DILocation(line: 360, column: 16, scope: !1105)
!1121 = !DILocation(line: 360, column: 14, scope: !1105)
!1122 = !DILocation(line: 360, column: 2, scope: !1105)
!1123 = !DILocation(line: 360, column: 7, scope: !1105)
!1124 = !DILocation(line: 361, column: 9, scope: !1105)
!1125 = !DILocation(line: 361, column: 16, scope: !1105)
!1126 = !DILocation(line: 361, column: 14, scope: !1105)
!1127 = !DILocation(line: 361, column: 2, scope: !1105)
!1128 = !DILocation(line: 361, column: 7, scope: !1105)
!1129 = !DILocation(line: 362, column: 1, scope: !1105)
!1130 = distinct !DISubprogram(name: "bmbvh_find_face_segment_cb", scope: !1, file: !1, line: 326, type: !847, scopeLine: 327, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!1131 = !DILocalVariable(name: "userdata", arg: 1, scope: !1130, file: !1, line: 326, type: !67)
!1132 = !DILocation(line: 326, column: 46, scope: !1130)
!1133 = !DILocalVariable(name: "index", arg: 2, scope: !1130, file: !1, line: 326, type: !81)
!1134 = !DILocation(line: 326, column: 60, scope: !1130)
!1135 = !DILocalVariable(name: "ray", arg: 3, scope: !1130, file: !1, line: 326, type: !849)
!1136 = !DILocation(line: 326, column: 85, scope: !1130)
!1137 = !DILocalVariable(name: "hit", arg: 4, scope: !1130, file: !1, line: 326, type: !857)
!1138 = !DILocation(line: 326, column: 105, scope: !1130)
!1139 = !DILocalVariable(name: "bmcb_data", scope: !1130, file: !1, line: 328, type: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!1141 = !DILocation(line: 328, column: 26, scope: !1130)
!1142 = !DILocation(line: 328, column: 38, scope: !1130)
!1143 = !DILocalVariable(name: "ltri", scope: !1130, file: !1, line: 329, type: !871)
!1144 = !DILocation(line: 329, column: 17, scope: !1130)
!1145 = !DILocation(line: 329, column: 24, scope: !1130)
!1146 = !DILocation(line: 329, column: 35, scope: !1130)
!1147 = !DILocation(line: 329, column: 44, scope: !1130)
!1148 = !DILocalVariable(name: "dist", scope: !1130, file: !1, line: 330, type: !66)
!1149 = !DILocation(line: 330, column: 8, scope: !1130)
!1150 = !DILocalVariable(name: "uv", scope: !1130, file: !1, line: 330, type: !743)
!1151 = !DILocation(line: 330, column: 14, scope: !1130)
!1152 = !DILocalVariable(name: "tri_cos", scope: !1130, file: !1, line: 331, type: !881)
!1153 = !DILocation(line: 331, column: 15, scope: !1130)
!1154 = !DILocation(line: 333, column: 22, scope: !1130)
!1155 = !DILocation(line: 333, column: 31, scope: !1130)
!1156 = !DILocation(line: 333, column: 37, scope: !1130)
!1157 = !DILocation(line: 333, column: 48, scope: !1130)
!1158 = !DILocation(line: 333, column: 2, scope: !1130)
!1159 = !DILocation(line: 335, column: 18, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1130, file: !1, line: 335, column: 6)
!1161 = !DILocation(line: 335, column: 29, scope: !1160)
!1162 = !DILocation(line: 335, column: 35, scope: !1160)
!1163 = !DILocation(line: 335, column: 6, scope: !1160)
!1164 = !DILocation(line: 335, column: 47, scope: !1160)
!1165 = !DILocation(line: 336, column: 18, scope: !1160)
!1166 = !DILocation(line: 336, column: 29, scope: !1160)
!1167 = !DILocation(line: 336, column: 35, scope: !1160)
!1168 = !DILocation(line: 336, column: 6, scope: !1160)
!1169 = !DILocation(line: 336, column: 47, scope: !1160)
!1170 = !DILocation(line: 337, column: 18, scope: !1160)
!1171 = !DILocation(line: 337, column: 29, scope: !1160)
!1172 = !DILocation(line: 337, column: 35, scope: !1160)
!1173 = !DILocation(line: 337, column: 6, scope: !1160)
!1174 = !DILocation(line: 337, column: 47, scope: !1160)
!1175 = !DILocation(line: 339, column: 18, scope: !1160)
!1176 = !DILocation(line: 339, column: 29, scope: !1160)
!1177 = !DILocation(line: 339, column: 35, scope: !1160)
!1178 = !DILocation(line: 339, column: 6, scope: !1160)
!1179 = !DILocation(line: 339, column: 47, scope: !1160)
!1180 = !DILocation(line: 340, column: 18, scope: !1160)
!1181 = !DILocation(line: 340, column: 29, scope: !1160)
!1182 = !DILocation(line: 340, column: 35, scope: !1160)
!1183 = !DILocation(line: 340, column: 6, scope: !1160)
!1184 = !DILocation(line: 340, column: 47, scope: !1160)
!1185 = !DILocation(line: 341, column: 18, scope: !1160)
!1186 = !DILocation(line: 341, column: 29, scope: !1160)
!1187 = !DILocation(line: 341, column: 35, scope: !1160)
!1188 = !DILocation(line: 341, column: 6, scope: !1160)
!1189 = !DILocation(line: 335, column: 6, scope: !1130)
!1190 = !DILocation(line: 343, column: 3, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1160, file: !1, line: 342, column: 2)
!1192 = !DILocation(line: 346, column: 23, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1130, file: !1, line: 346, column: 6)
!1194 = !DILocation(line: 346, column: 28, scope: !1193)
!1195 = !DILocation(line: 346, column: 36, scope: !1193)
!1196 = !DILocation(line: 346, column: 41, scope: !1193)
!1197 = !DILocation(line: 346, column: 52, scope: !1193)
!1198 = !DILocation(line: 346, column: 64, scope: !1193)
!1199 = !DILocation(line: 346, column: 76, scope: !1193)
!1200 = !DILocation(line: 346, column: 95, scope: !1193)
!1201 = !DILocation(line: 346, column: 6, scope: !1193)
!1202 = !DILocation(line: 346, column: 99, scope: !1193)
!1203 = !DILocation(line: 347, column: 7, scope: !1193)
!1204 = !DILocation(line: 347, column: 14, scope: !1193)
!1205 = !DILocation(line: 347, column: 19, scope: !1193)
!1206 = !DILocation(line: 347, column: 12, scope: !1193)
!1207 = !DILocation(line: 346, column: 6, scope: !1130)
!1208 = !DILocation(line: 349, column: 15, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1193, file: !1, line: 348, column: 2)
!1210 = !DILocation(line: 349, column: 3, scope: !1209)
!1211 = !DILocation(line: 349, column: 8, scope: !1209)
!1212 = !DILocation(line: 349, column: 13, scope: !1209)
!1213 = !DILocation(line: 350, column: 16, scope: !1209)
!1214 = !DILocation(line: 350, column: 3, scope: !1209)
!1215 = !DILocation(line: 350, column: 8, scope: !1209)
!1216 = !DILocation(line: 350, column: 14, scope: !1209)
!1217 = !DILocation(line: 352, column: 14, scope: !1209)
!1218 = !DILocation(line: 352, column: 19, scope: !1209)
!1219 = !DILocation(line: 352, column: 23, scope: !1209)
!1220 = !DILocation(line: 352, column: 32, scope: !1209)
!1221 = !DILocation(line: 352, column: 35, scope: !1209)
!1222 = !DILocation(line: 352, column: 3, scope: !1209)
!1223 = !DILocation(line: 354, column: 18, scope: !1209)
!1224 = !DILocation(line: 354, column: 23, scope: !1209)
!1225 = !DILocation(line: 354, column: 27, scope: !1209)
!1226 = !DILocation(line: 354, column: 32, scope: !1209)
!1227 = !DILocation(line: 354, column: 40, scope: !1209)
!1228 = !DILocation(line: 354, column: 45, scope: !1209)
!1229 = !DILocation(line: 354, column: 56, scope: !1209)
!1230 = !DILocation(line: 354, column: 3, scope: !1209)
!1231 = !DILocation(line: 356, column: 14, scope: !1209)
!1232 = !DILocation(line: 356, column: 25, scope: !1209)
!1233 = !DILocation(line: 356, column: 29, scope: !1209)
!1234 = !DILocation(line: 356, column: 3, scope: !1209)
!1235 = !DILocation(line: 357, column: 2, scope: !1209)
!1236 = !DILocation(line: 358, column: 1, scope: !1130)
!1237 = distinct !DISubprogram(name: "BKE_bmbvh_find_vert_closest", scope: !1, file: !1, line: 447, type: !1238, scopeLine: 448, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !351)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!87, !145, !633, !137}
!1240 = !DILocalVariable(name: "bmtree", arg: 1, scope: !1237, file: !1, line: 447, type: !145)
!1241 = !DILocation(line: 447, column: 48, scope: !1237)
!1242 = !DILocalVariable(name: "co", arg: 2, scope: !1237, file: !1, line: 447, type: !633)
!1243 = !DILocation(line: 447, column: 68, scope: !1237)
!1244 = !DILocalVariable(name: "dist_max", arg: 3, scope: !1237, file: !1, line: 447, type: !137)
!1245 = !DILocation(line: 447, column: 87, scope: !1237)
!1246 = !DILocalVariable(name: "hit", scope: !1237, file: !1, line: 449, type: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeNearest", file: !152, line: 59, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeNearest", file: !152, line: 53, size: 288, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1248, file: !152, line: 54, baseType: !81, size: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1248, file: !152, line: 55, baseType: !98, size: 96, offset: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1248, file: !152, line: 56, baseType: !98, size: 96, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "dist_sq", scope: !1248, file: !152, line: 57, baseType: !66, size: 32, offset: 224)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1248, file: !152, line: 58, baseType: !81, size: 32, offset: 256)
!1255 = !DILocation(line: 449, column: 17, scope: !1237)
!1256 = !DILocalVariable(name: "bmcb_data", scope: !1237, file: !1, line: 450, type: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VertSearchUserData", file: !1, line: 413, size: 192, elements: !1258)
!1258 = !{!1259, !1260, !1261, !1262}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !1257, file: !1, line: 415, baseType: !68, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "cos_cage", scope: !1257, file: !1, line: 416, baseType: !135, size: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "dist_max_sq", scope: !1257, file: !1, line: 419, baseType: !66, size: 32, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "index_tri", scope: !1257, file: !1, line: 420, baseType: !81, size: 32, offset: 160)
!1263 = !DILocation(line: 450, column: 28, scope: !1237)
!1264 = !DILocalVariable(name: "dist_max_sq", scope: !1237, file: !1, line: 451, type: !137)
!1265 = !DILocation(line: 451, column: 14, scope: !1237)
!1266 = !DILocation(line: 451, column: 28, scope: !1237)
!1267 = !DILocation(line: 451, column: 39, scope: !1237)
!1268 = !DILocation(line: 451, column: 37, scope: !1237)
!1269 = !DILocation(line: 453, column: 6, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1237, file: !1, line: 453, column: 6)
!1271 = !DILocation(line: 453, column: 14, scope: !1270)
!1272 = !DILocation(line: 453, column: 6, scope: !1237)
!1273 = !DILocation(line: 453, column: 24, scope: !1270)
!1274 = !DILocation(line: 455, column: 16, scope: !1237)
!1275 = !DILocation(line: 455, column: 6, scope: !1237)
!1276 = !DILocation(line: 455, column: 14, scope: !1237)
!1277 = !DILocation(line: 456, column: 6, scope: !1237)
!1278 = !DILocation(line: 456, column: 12, scope: !1237)
!1279 = !DILocation(line: 458, column: 45, scope: !1237)
!1280 = !DILocation(line: 458, column: 53, scope: !1237)
!1281 = !DILocation(line: 458, column: 12, scope: !1237)
!1282 = !DILocation(line: 458, column: 21, scope: !1237)
!1283 = !DILocation(line: 459, column: 43, scope: !1237)
!1284 = !DILocation(line: 459, column: 51, scope: !1237)
!1285 = !DILocation(line: 459, column: 12, scope: !1237)
!1286 = !DILocation(line: 459, column: 21, scope: !1237)
!1287 = !DILocation(line: 460, column: 26, scope: !1237)
!1288 = !DILocation(line: 460, column: 12, scope: !1237)
!1289 = !DILocation(line: 460, column: 24, scope: !1237)
!1290 = !DILocation(line: 462, column: 27, scope: !1237)
!1291 = !DILocation(line: 462, column: 35, scope: !1237)
!1292 = !DILocation(line: 462, column: 41, scope: !1237)
!1293 = !DILocation(line: 462, column: 79, scope: !1237)
!1294 = !DILocation(line: 462, column: 2, scope: !1237)
!1295 = !DILocation(line: 463, column: 10, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1237, file: !1, line: 463, column: 6)
!1297 = !DILocation(line: 463, column: 16, scope: !1296)
!1298 = !DILocation(line: 463, column: 6, scope: !1237)
!1299 = !DILocalVariable(name: "ltri", scope: !1300, file: !1, line: 464, type: !797)
!1300 = distinct !DILexicalBlock(scope: !1296, file: !1, line: 463, column: 23)
!1301 = !DILocation(line: 464, column: 12, scope: !1300)
!1302 = !DILocation(line: 464, column: 19, scope: !1300)
!1303 = !DILocation(line: 464, column: 27, scope: !1300)
!1304 = !DILocation(line: 464, column: 40, scope: !1300)
!1305 = !DILocation(line: 465, column: 10, scope: !1300)
!1306 = !DILocation(line: 465, column: 25, scope: !1300)
!1307 = !DILocation(line: 465, column: 37, scope: !1300)
!1308 = !DILocation(line: 465, column: 3, scope: !1300)
!1309 = !DILocation(line: 468, column: 2, scope: !1237)
!1310 = !DILocation(line: 469, column: 1, scope: !1237)
!1311 = distinct !DISubprogram(name: "bmbvh_find_vert_closest_cb", scope: !1, file: !1, line: 423, type: !1312, scopeLine: 424, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !351)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{null, !67, !81, !633, !1314}
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1315 = !DILocalVariable(name: "userdata", arg: 1, scope: !1311, file: !1, line: 423, type: !67)
!1316 = !DILocation(line: 423, column: 46, scope: !1311)
!1317 = !DILocalVariable(name: "index", arg: 2, scope: !1311, file: !1, line: 423, type: !81)
!1318 = !DILocation(line: 423, column: 60, scope: !1311)
!1319 = !DILocalVariable(name: "co", arg: 3, scope: !1311, file: !1, line: 423, type: !633)
!1320 = !DILocation(line: 423, column: 79, scope: !1311)
!1321 = !DILocalVariable(name: "hit", arg: 4, scope: !1311, file: !1, line: 423, type: !1314)
!1322 = !DILocation(line: 423, column: 102, scope: !1311)
