; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_polygon.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_polygon.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMFace = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMLoop*, i32, [3 x float], i16 }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BMIter = type { %union.anon, void (i8*)*, i8* (i8*)*, i32, i8 }
%union.anon = type { %struct.BMIter__face_of_vert }
%struct.BMIter__face_of_vert = type { %struct.BMVert*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMEdge*, %struct.BMEdge* }

!41 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!42 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!43 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !22, line: 123, baseType: !5, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51}
!46 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!47 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!48 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!49 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!50 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!51 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 182, baseType: !5, size: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !58}
!54 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 1226, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63}
!62 = !DIEnumerator(name: "MOD_TRIANGULATE_NGON_BEAUTY", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "MOD_TRIANGULATE_NGON_EARCLIP", value: 1, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 260, baseType: !5, size: 32, elements: !66)
!65 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !{!67, !68, !69, !70, !71, !72, !73}
!67 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !75, line: 33, baseType: !5, size: 32, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 249, baseType: !5, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!86 = !{!87, !93, !90, !97, !98, !99, !103, !107, !170, !172, !154}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 64, elements: !91)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!91 = !{!92}
!92 = !DISubrange(count: 2)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 96, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 3)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !4, line: 79, baseType: !3)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !4, line: 158, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !97}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !4, line: 159, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!97, !97}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !65, line: 103, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !65, line: 90, size: 448, elements: !110)
!110 = !{!111, !122, !128, !130, !131}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !109, file: !65, line: 91, baseType: !112, size: 128)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !65, line: 82, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !65, line: 64, size: 128, elements: !114)
!114 = !{!115, !116, !118, !120, !121}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !65, line: 65, baseType: !97, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !113, file: !65, line: 66, baseType: !117, size: 32, offset: 64)
!117 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !113, file: !65, line: 73, baseType: !119, size: 8, offset: 96)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !113, file: !65, line: 74, baseType: !119, size: 8, offset: 104)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !113, file: !65, line: 80, baseType: !119, size: 8, offset: 112)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !109, file: !65, line: 92, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !65, line: 180, size: 16, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !124, file: !65, line: 181, baseType: !127, size: 16)
!127 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !109, file: !65, line: 94, baseType: !129, size: 96, offset: 192)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 96, elements: !95)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !109, file: !65, line: 95, baseType: !129, size: 96, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !109, file: !65, line: 102, baseType: !132, size: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !65, line: 110, size: 640, elements: !134)
!134 = !{!135, !136, !137, !139, !140, !163, !169}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !133, file: !65, line: 111, baseType: !112, size: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !133, file: !65, line: 112, baseType: !123, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !133, file: !65, line: 114, baseType: !138, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !133, file: !65, line: 114, baseType: !138, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !133, file: !65, line: 118, baseType: !141, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !65, line: 125, size: 576, elements: !143)
!143 = !{!144, !145, !146, !147, !159, !160, !161, !162}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !142, file: !65, line: 126, baseType: !112, size: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !142, file: !65, line: 129, baseType: !138, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !142, file: !65, line: 130, baseType: !132, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !142, file: !65, line: 131, baseType: !148, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !65, line: 164, size: 448, elements: !150)
!150 = !{!151, !152, !153, !156, !157, !158}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !149, file: !65, line: 165, baseType: !112, size: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !149, file: !65, line: 166, baseType: !123, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !149, file: !65, line: 172, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !65, line: 140, baseType: !142)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !149, file: !65, line: 174, baseType: !117, size: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !149, file: !65, line: 175, baseType: !129, size: 96, offset: 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !149, file: !65, line: 176, baseType: !127, size: 16, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !142, file: !65, line: 135, baseType: !141, size: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !142, file: !65, line: 135, baseType: !141, size: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !65, line: 139, baseType: !141, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !142, file: !65, line: 139, baseType: !141, size: 64, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !133, file: !65, line: 122, baseType: !164, size: 128, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !65, line: 108, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !65, line: 106, size: 128, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !65, line: 107, baseType: !132, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !165, file: !65, line: 107, baseType: !132, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !133, file: !65, line: 122, baseType: !164, size: 128, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !65, line: 123, baseType: !133)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !65, line: 178, baseType: !149)
!174 = !{i32 7, !"Dwarf Version", i32 4}
!175 = !{i32 2, !"Debug Info Version", i32 3}
!176 = !{i32 1, !"wchar_size", i32 4}
!177 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!178 = distinct !DISubprogram(name: "BM_face_calc_tessellation", scope: !1, file: !1, line: 150, type: !179, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !181, !183, !184}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, elements: !95)
!186 = !{}
!187 = !DILocalVariable(name: "f", arg: 1, scope: !178, file: !1, line: 150, type: !181)
!188 = !DILocation(line: 150, column: 46, scope: !178)
!189 = !DILocalVariable(name: "r_loops", arg: 2, scope: !178, file: !1, line: 150, type: !183)
!190 = !DILocation(line: 150, column: 58, scope: !178)
!191 = !DILocalVariable(name: "r_index", arg: 3, scope: !178, file: !1, line: 150, type: !184)
!192 = !DILocation(line: 150, column: 82, scope: !178)
!193 = !DILocalVariable(name: "l_first", scope: !178, file: !1, line: 152, type: !154)
!194 = !DILocation(line: 152, column: 10, scope: !178)
!195 = !DILocation(line: 152, column: 20, scope: !178)
!196 = !DILocalVariable(name: "l_iter", scope: !178, file: !1, line: 153, type: !154)
!197 = !DILocation(line: 153, column: 10, scope: !178)
!198 = !DILocation(line: 155, column: 6, scope: !199)
!199 = distinct !DILexicalBlock(scope: !178, file: !1, line: 155, column: 6)
!200 = !DILocation(line: 155, column: 9, scope: !199)
!201 = !DILocation(line: 155, column: 13, scope: !199)
!202 = !DILocation(line: 155, column: 6, scope: !178)
!203 = !DILocation(line: 156, column: 26, scope: !204)
!204 = distinct !DILexicalBlock(scope: !199, file: !1, line: 155, column: 19)
!205 = !DILocation(line: 156, column: 24, scope: !204)
!206 = !DILocation(line: 156, column: 11, scope: !204)
!207 = !DILocation(line: 156, column: 14, scope: !204)
!208 = !DILocation(line: 157, column: 26, scope: !204)
!209 = !DILocation(line: 157, column: 34, scope: !204)
!210 = !DILocation(line: 157, column: 24, scope: !204)
!211 = !DILocation(line: 157, column: 11, scope: !204)
!212 = !DILocation(line: 157, column: 14, scope: !204)
!213 = !DILocation(line: 158, column: 26, scope: !204)
!214 = !DILocation(line: 158, column: 34, scope: !204)
!215 = !DILocation(line: 158, column: 11, scope: !204)
!216 = !DILocation(line: 158, column: 14, scope: !204)
!217 = !DILocation(line: 160, column: 3, scope: !204)
!218 = !DILocation(line: 160, column: 17, scope: !204)
!219 = !DILocation(line: 161, column: 3, scope: !204)
!220 = !DILocation(line: 161, column: 17, scope: !204)
!221 = !DILocation(line: 162, column: 3, scope: !204)
!222 = !DILocation(line: 162, column: 17, scope: !204)
!223 = !DILocation(line: 163, column: 2, scope: !204)
!224 = !DILocation(line: 164, column: 11, scope: !225)
!225 = distinct !DILexicalBlock(scope: !199, file: !1, line: 164, column: 11)
!226 = !DILocation(line: 164, column: 14, scope: !225)
!227 = !DILocation(line: 164, column: 18, scope: !225)
!228 = !DILocation(line: 164, column: 11, scope: !199)
!229 = !DILocation(line: 165, column: 26, scope: !230)
!230 = distinct !DILexicalBlock(scope: !225, file: !1, line: 164, column: 24)
!231 = !DILocation(line: 165, column: 24, scope: !230)
!232 = !DILocation(line: 165, column: 11, scope: !230)
!233 = !DILocation(line: 165, column: 14, scope: !230)
!234 = !DILocation(line: 166, column: 26, scope: !230)
!235 = !DILocation(line: 166, column: 34, scope: !230)
!236 = !DILocation(line: 166, column: 24, scope: !230)
!237 = !DILocation(line: 166, column: 11, scope: !230)
!238 = !DILocation(line: 166, column: 14, scope: !230)
!239 = !DILocation(line: 167, column: 26, scope: !230)
!240 = !DILocation(line: 167, column: 34, scope: !230)
!241 = !DILocation(line: 167, column: 24, scope: !230)
!242 = !DILocation(line: 167, column: 11, scope: !230)
!243 = !DILocation(line: 167, column: 14, scope: !230)
!244 = !DILocation(line: 168, column: 26, scope: !230)
!245 = !DILocation(line: 168, column: 34, scope: !230)
!246 = !DILocation(line: 168, column: 11, scope: !230)
!247 = !DILocation(line: 168, column: 14, scope: !230)
!248 = !DILocation(line: 170, column: 3, scope: !230)
!249 = !DILocation(line: 170, column: 17, scope: !230)
!250 = !DILocation(line: 171, column: 3, scope: !230)
!251 = !DILocation(line: 171, column: 17, scope: !230)
!252 = !DILocation(line: 172, column: 3, scope: !230)
!253 = !DILocation(line: 172, column: 17, scope: !230)
!254 = !DILocation(line: 174, column: 3, scope: !230)
!255 = !DILocation(line: 174, column: 17, scope: !230)
!256 = !DILocation(line: 175, column: 3, scope: !230)
!257 = !DILocation(line: 175, column: 17, scope: !230)
!258 = !DILocation(line: 176, column: 3, scope: !230)
!259 = !DILocation(line: 176, column: 17, scope: !230)
!260 = !DILocation(line: 177, column: 2, scope: !230)
!261 = !DILocalVariable(name: "axis_mat", scope: !262, file: !1, line: 179, type: !263)
!262 = distinct !DILexicalBlock(scope: !225, file: !1, line: 178, column: 7)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 288, elements: !264)
!264 = !{!96, !96}
!265 = !DILocation(line: 179, column: 9, scope: !262)
!266 = !DILocalVariable(name: "projverts", scope: !262, file: !1, line: 180, type: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !91)
!269 = !DILocation(line: 180, column: 11, scope: !262)
!270 = !DILocation(line: 180, column: 27, scope: !262)
!271 = !DILocalVariable(name: "j", scope: !262, file: !1, line: 181, type: !117)
!272 = !DILocation(line: 181, column: 7, scope: !262)
!273 = !DILocation(line: 183, column: 26, scope: !262)
!274 = !DILocation(line: 183, column: 36, scope: !262)
!275 = !DILocation(line: 183, column: 39, scope: !262)
!276 = !DILocation(line: 183, column: 3, scope: !262)
!277 = !DILocation(line: 185, column: 5, scope: !262)
!278 = !DILocation(line: 186, column: 12, scope: !262)
!279 = !DILocation(line: 186, column: 10, scope: !262)
!280 = !DILocation(line: 187, column: 3, scope: !262)
!281 = !DILocation(line: 188, column: 16, scope: !282)
!282 = distinct !DILexicalBlock(scope: !262, file: !1, line: 187, column: 6)
!283 = !DILocation(line: 188, column: 26, scope: !282)
!284 = !DILocation(line: 188, column: 30, scope: !282)
!285 = !DILocation(line: 188, column: 40, scope: !282)
!286 = !DILocation(line: 188, column: 48, scope: !282)
!287 = !DILocation(line: 188, column: 51, scope: !282)
!288 = !DILocation(line: 188, column: 4, scope: !282)
!289 = !DILocation(line: 189, column: 17, scope: !282)
!290 = !DILocation(line: 189, column: 4, scope: !282)
!291 = !DILocation(line: 189, column: 12, scope: !282)
!292 = !DILocation(line: 189, column: 15, scope: !282)
!293 = !DILocation(line: 190, column: 5, scope: !282)
!294 = !DILocation(line: 191, column: 3, scope: !282)
!295 = !DILocation(line: 191, column: 22, scope: !262)
!296 = !DILocation(line: 191, column: 30, scope: !262)
!297 = !DILocation(line: 191, column: 20, scope: !262)
!298 = !DILocation(line: 191, column: 39, scope: !262)
!299 = !DILocation(line: 191, column: 36, scope: !262)
!300 = distinct !{!300, !280, !301}
!301 = !DILocation(line: 191, column: 46, scope: !262)
!302 = !DILocation(line: 194, column: 41, scope: !262)
!303 = !DILocation(line: 194, column: 52, scope: !262)
!304 = !DILocation(line: 194, column: 55, scope: !262)
!305 = !DILocation(line: 194, column: 64, scope: !262)
!306 = !DILocation(line: 194, column: 3, scope: !262)
!307 = !DILocation(line: 196, column: 1, scope: !178)
!308 = distinct !DISubprogram(name: "BM_face_calc_area", scope: !1, file: !1, line: 201, type: !309, scopeLine: 202, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!309 = !DISubroutineType(types: !310)
!310 = !{!90, !172}
!311 = !DILocalVariable(name: "f", arg: 1, scope: !308, file: !1, line: 201, type: !172)
!312 = !DILocation(line: 201, column: 33, scope: !308)
!313 = !DILocalVariable(name: "l_iter", scope: !308, file: !1, line: 203, type: !154)
!314 = !DILocation(line: 203, column: 10, scope: !308)
!315 = !DILocalVariable(name: "l_first", scope: !308, file: !1, line: 203, type: !154)
!316 = !DILocation(line: 203, column: 19, scope: !308)
!317 = !DILocalVariable(name: "verts", scope: !308, file: !1, line: 204, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!319 = !DILocation(line: 204, column: 10, scope: !308)
!320 = !DILocation(line: 204, column: 22, scope: !308)
!321 = !DILocalVariable(name: "area", scope: !308, file: !1, line: 205, type: !90)
!322 = !DILocation(line: 205, column: 8, scope: !308)
!323 = !DILocalVariable(name: "i", scope: !308, file: !1, line: 206, type: !5)
!324 = !DILocation(line: 206, column: 15, scope: !308)
!325 = !DILocation(line: 208, column: 21, scope: !308)
!326 = !DILocation(line: 208, column: 19, scope: !308)
!327 = !DILocation(line: 208, column: 9, scope: !308)
!328 = !DILocation(line: 209, column: 2, scope: !308)
!329 = !DILocation(line: 210, column: 14, scope: !330)
!330 = distinct !DILexicalBlock(scope: !308, file: !1, line: 209, column: 5)
!331 = !DILocation(line: 210, column: 21, scope: !330)
!332 = !DILocation(line: 210, column: 26, scope: !330)
!333 = !DILocation(line: 210, column: 34, scope: !330)
!334 = !DILocation(line: 210, column: 37, scope: !330)
!335 = !DILocation(line: 210, column: 3, scope: !330)
!336 = !DILocation(line: 211, column: 2, scope: !330)
!337 = !DILocation(line: 211, column: 21, scope: !308)
!338 = !DILocation(line: 211, column: 29, scope: !308)
!339 = !DILocation(line: 211, column: 19, scope: !308)
!340 = !DILocation(line: 211, column: 38, scope: !308)
!341 = !DILocation(line: 211, column: 35, scope: !308)
!342 = distinct !{!342, !328, !343}
!343 = !DILocation(line: 211, column: 45, scope: !308)
!344 = !DILocation(line: 213, column: 6, scope: !345)
!345 = distinct !DILexicalBlock(scope: !308, file: !1, line: 213, column: 6)
!346 = !DILocation(line: 213, column: 9, scope: !345)
!347 = !DILocation(line: 213, column: 13, scope: !345)
!348 = !DILocation(line: 213, column: 6, scope: !308)
!349 = !DILocation(line: 214, column: 22, scope: !350)
!350 = distinct !DILexicalBlock(scope: !345, file: !1, line: 213, column: 19)
!351 = !DILocation(line: 214, column: 32, scope: !350)
!352 = !DILocation(line: 214, column: 42, scope: !350)
!353 = !DILocation(line: 214, column: 10, scope: !350)
!354 = !DILocation(line: 214, column: 8, scope: !350)
!355 = !DILocation(line: 215, column: 2, scope: !350)
!356 = !DILocation(line: 216, column: 11, scope: !357)
!357 = distinct !DILexicalBlock(scope: !345, file: !1, line: 216, column: 11)
!358 = !DILocation(line: 216, column: 14, scope: !357)
!359 = !DILocation(line: 216, column: 18, scope: !357)
!360 = !DILocation(line: 216, column: 11, scope: !345)
!361 = !DILocation(line: 217, column: 23, scope: !362)
!362 = distinct !DILexicalBlock(scope: !357, file: !1, line: 216, column: 24)
!363 = !DILocation(line: 217, column: 33, scope: !362)
!364 = !DILocation(line: 217, column: 43, scope: !362)
!365 = !DILocation(line: 217, column: 53, scope: !362)
!366 = !DILocation(line: 217, column: 10, scope: !362)
!367 = !DILocation(line: 217, column: 8, scope: !362)
!368 = !DILocation(line: 218, column: 2, scope: !362)
!369 = !DILocation(line: 220, column: 43, scope: !370)
!370 = distinct !DILexicalBlock(scope: !357, file: !1, line: 219, column: 7)
!371 = !DILocation(line: 220, column: 50, scope: !370)
!372 = !DILocation(line: 220, column: 53, scope: !370)
!373 = !DILocation(line: 220, column: 10, scope: !370)
!374 = !DILocation(line: 220, column: 8, scope: !370)
!375 = !DILocation(line: 223, column: 9, scope: !308)
!376 = !DILocation(line: 223, column: 2, scope: !308)
!377 = distinct !DISubprogram(name: "copy_v3_v3", scope: !378, file: !378, line: 64, type: !379, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!378 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!379 = !DISubroutineType(types: !380)
!380 = !{null, !381, !382}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!383 = !DILocalVariable(name: "r", arg: 1, scope: !377, file: !378, line: 64, type: !381)
!384 = !DILocation(line: 64, column: 31, scope: !377)
!385 = !DILocalVariable(name: "a", arg: 2, scope: !377, file: !378, line: 64, type: !382)
!386 = !DILocation(line: 64, column: 49, scope: !377)
!387 = !DILocation(line: 66, column: 9, scope: !377)
!388 = !DILocation(line: 66, column: 2, scope: !377)
!389 = !DILocation(line: 66, column: 7, scope: !377)
!390 = !DILocation(line: 67, column: 9, scope: !377)
!391 = !DILocation(line: 67, column: 2, scope: !377)
!392 = !DILocation(line: 67, column: 7, scope: !377)
!393 = !DILocation(line: 68, column: 9, scope: !377)
!394 = !DILocation(line: 68, column: 2, scope: !377)
!395 = !DILocation(line: 68, column: 7, scope: !377)
!396 = !DILocation(line: 69, column: 1, scope: !377)
!397 = distinct !DISubprogram(name: "BM_face_calc_perimeter", scope: !1, file: !1, line: 229, type: !309, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!398 = !DILocalVariable(name: "f", arg: 1, scope: !397, file: !1, line: 229, type: !172)
!399 = !DILocation(line: 229, column: 38, scope: !397)
!400 = !DILocalVariable(name: "l_iter", scope: !397, file: !1, line: 231, type: !154)
!401 = !DILocation(line: 231, column: 10, scope: !397)
!402 = !DILocalVariable(name: "l_first", scope: !397, file: !1, line: 231, type: !154)
!403 = !DILocation(line: 231, column: 19, scope: !397)
!404 = !DILocalVariable(name: "perimeter", scope: !397, file: !1, line: 232, type: !90)
!405 = !DILocation(line: 232, column: 8, scope: !397)
!406 = !DILocation(line: 234, column: 21, scope: !397)
!407 = !DILocation(line: 234, column: 19, scope: !397)
!408 = !DILocation(line: 234, column: 9, scope: !397)
!409 = !DILocation(line: 235, column: 2, scope: !397)
!410 = !DILocation(line: 236, column: 25, scope: !411)
!411 = distinct !DILexicalBlock(scope: !397, file: !1, line: 235, column: 5)
!412 = !DILocation(line: 236, column: 33, scope: !411)
!413 = !DILocation(line: 236, column: 36, scope: !411)
!414 = !DILocation(line: 236, column: 40, scope: !411)
!415 = !DILocation(line: 236, column: 48, scope: !411)
!416 = !DILocation(line: 236, column: 54, scope: !411)
!417 = !DILocation(line: 236, column: 57, scope: !411)
!418 = !DILocation(line: 236, column: 16, scope: !411)
!419 = !DILocation(line: 236, column: 13, scope: !411)
!420 = !DILocation(line: 237, column: 2, scope: !411)
!421 = !DILocation(line: 237, column: 21, scope: !397)
!422 = !DILocation(line: 237, column: 29, scope: !397)
!423 = !DILocation(line: 237, column: 19, scope: !397)
!424 = !DILocation(line: 237, column: 38, scope: !397)
!425 = !DILocation(line: 237, column: 35, scope: !397)
!426 = distinct !{!426, !409, !427}
!427 = !DILocation(line: 237, column: 45, scope: !397)
!428 = !DILocation(line: 239, column: 9, scope: !397)
!429 = !DILocation(line: 239, column: 2, scope: !397)
!430 = distinct !DISubprogram(name: "len_v3v3", scope: !378, file: !378, line: 759, type: !431, scopeLine: 760, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!431 = !DISubroutineType(types: !432)
!432 = !{!90, !382, !382}
!433 = !DILocalVariable(name: "a", arg: 1, scope: !430, file: !378, line: 759, type: !382)
!434 = !DILocation(line: 759, column: 36, scope: !430)
!435 = !DILocalVariable(name: "b", arg: 2, scope: !430, file: !378, line: 759, type: !382)
!436 = !DILocation(line: 759, column: 54, scope: !430)
!437 = !DILocalVariable(name: "d", scope: !430, file: !378, line: 761, type: !129)
!438 = !DILocation(line: 761, column: 8, scope: !430)
!439 = !DILocation(line: 763, column: 14, scope: !430)
!440 = !DILocation(line: 763, column: 17, scope: !430)
!441 = !DILocation(line: 763, column: 20, scope: !430)
!442 = !DILocation(line: 763, column: 2, scope: !430)
!443 = !DILocation(line: 764, column: 16, scope: !430)
!444 = !DILocation(line: 764, column: 9, scope: !430)
!445 = !DILocation(line: 764, column: 2, scope: !430)
!446 = distinct !DISubprogram(name: "BM_vert_tri_calc_plane", scope: !1, file: !1, line: 242, type: !447, scopeLine: 243, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !449, !381}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!450 = !DILocalVariable(name: "verts", arg: 1, scope: !446, file: !1, line: 242, type: !449)
!451 = !DILocation(line: 242, column: 37, scope: !446)
!452 = !DILocalVariable(name: "r_plane", arg: 2, scope: !446, file: !1, line: 242, type: !381)
!453 = !DILocation(line: 242, column: 53, scope: !446)
!454 = !DILocalVariable(name: "lens", scope: !446, file: !1, line: 244, type: !129)
!455 = !DILocation(line: 244, column: 8, scope: !446)
!456 = !DILocalVariable(name: "difs", scope: !446, file: !1, line: 245, type: !129)
!457 = !DILocation(line: 245, column: 8, scope: !446)
!458 = !DILocalVariable(name: "order", scope: !446, file: !1, line: 246, type: !459)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 96, elements: !95)
!460 = !DILocation(line: 246, column: 7, scope: !446)
!461 = !DILocation(line: 248, column: 21, scope: !446)
!462 = !DILocation(line: 248, column: 31, scope: !446)
!463 = !DILocation(line: 248, column: 35, scope: !446)
!464 = !DILocation(line: 248, column: 45, scope: !446)
!465 = !DILocation(line: 248, column: 12, scope: !446)
!466 = !DILocation(line: 248, column: 2, scope: !446)
!467 = !DILocation(line: 248, column: 10, scope: !446)
!468 = !DILocation(line: 249, column: 21, scope: !446)
!469 = !DILocation(line: 249, column: 31, scope: !446)
!470 = !DILocation(line: 249, column: 35, scope: !446)
!471 = !DILocation(line: 249, column: 45, scope: !446)
!472 = !DILocation(line: 249, column: 12, scope: !446)
!473 = !DILocation(line: 249, column: 2, scope: !446)
!474 = !DILocation(line: 249, column: 10, scope: !446)
!475 = !DILocation(line: 250, column: 21, scope: !446)
!476 = !DILocation(line: 250, column: 31, scope: !446)
!477 = !DILocation(line: 250, column: 35, scope: !446)
!478 = !DILocation(line: 250, column: 45, scope: !446)
!479 = !DILocation(line: 250, column: 12, scope: !446)
!480 = !DILocation(line: 250, column: 2, scope: !446)
!481 = !DILocation(line: 250, column: 10, scope: !446)
!482 = !DILocation(line: 253, column: 18, scope: !446)
!483 = !DILocation(line: 253, column: 28, scope: !446)
!484 = !DILocation(line: 253, column: 26, scope: !446)
!485 = !DILocation(line: 253, column: 12, scope: !446)
!486 = !DILocation(line: 253, column: 2, scope: !446)
!487 = !DILocation(line: 253, column: 10, scope: !446)
!488 = !DILocation(line: 254, column: 18, scope: !446)
!489 = !DILocation(line: 254, column: 28, scope: !446)
!490 = !DILocation(line: 254, column: 26, scope: !446)
!491 = !DILocation(line: 254, column: 12, scope: !446)
!492 = !DILocation(line: 254, column: 2, scope: !446)
!493 = !DILocation(line: 254, column: 10, scope: !446)
!494 = !DILocation(line: 255, column: 18, scope: !446)
!495 = !DILocation(line: 255, column: 28, scope: !446)
!496 = !DILocation(line: 255, column: 26, scope: !446)
!497 = !DILocation(line: 255, column: 12, scope: !446)
!498 = !DILocation(line: 255, column: 2, scope: !446)
!499 = !DILocation(line: 255, column: 10, scope: !446)
!500 = !DILocation(line: 257, column: 15, scope: !446)
!501 = !DILocation(line: 257, column: 21, scope: !446)
!502 = !DILocation(line: 257, column: 2, scope: !446)
!503 = !DILocation(line: 258, column: 14, scope: !446)
!504 = !DILocation(line: 258, column: 23, scope: !446)
!505 = !DILocation(line: 258, column: 29, scope: !446)
!506 = !DILocation(line: 258, column: 40, scope: !446)
!507 = !DILocation(line: 258, column: 44, scope: !446)
!508 = !DILocation(line: 258, column: 51, scope: !446)
!509 = !DILocation(line: 258, column: 60, scope: !446)
!510 = !DILocation(line: 258, column: 65, scope: !446)
!511 = !DILocation(line: 258, column: 71, scope: !446)
!512 = !DILocation(line: 258, column: 2, scope: !446)
!513 = !DILocation(line: 259, column: 1, scope: !446)
!514 = distinct !DISubprogram(name: "sub_v3_v3v3", scope: !378, file: !378, line: 357, type: !515, scopeLine: 358, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !381, !382, !382}
!517 = !DILocalVariable(name: "r", arg: 1, scope: !514, file: !378, line: 357, type: !381)
!518 = !DILocation(line: 357, column: 32, scope: !514)
!519 = !DILocalVariable(name: "a", arg: 2, scope: !514, file: !378, line: 357, type: !382)
!520 = !DILocation(line: 357, column: 50, scope: !514)
!521 = !DILocalVariable(name: "b", arg: 3, scope: !514, file: !378, line: 357, type: !382)
!522 = !DILocation(line: 357, column: 68, scope: !514)
!523 = !DILocation(line: 359, column: 9, scope: !514)
!524 = !DILocation(line: 359, column: 16, scope: !514)
!525 = !DILocation(line: 359, column: 14, scope: !514)
!526 = !DILocation(line: 359, column: 2, scope: !514)
!527 = !DILocation(line: 359, column: 7, scope: !514)
!528 = !DILocation(line: 360, column: 9, scope: !514)
!529 = !DILocation(line: 360, column: 16, scope: !514)
!530 = !DILocation(line: 360, column: 14, scope: !514)
!531 = !DILocation(line: 360, column: 2, scope: !514)
!532 = !DILocation(line: 360, column: 7, scope: !514)
!533 = !DILocation(line: 361, column: 9, scope: !514)
!534 = !DILocation(line: 361, column: 16, scope: !514)
!535 = !DILocation(line: 361, column: 14, scope: !514)
!536 = !DILocation(line: 361, column: 2, scope: !514)
!537 = !DILocation(line: 361, column: 7, scope: !514)
!538 = !DILocation(line: 362, column: 1, scope: !514)
!539 = distinct !DISubprogram(name: "BM_face_calc_plane", scope: !1, file: !1, line: 265, type: !540, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !172, !381}
!542 = !DILocalVariable(name: "f", arg: 1, scope: !539, file: !1, line: 265, type: !172)
!543 = !DILocation(line: 265, column: 33, scope: !539)
!544 = !DILocalVariable(name: "r_plane", arg: 2, scope: !539, file: !1, line: 265, type: !381)
!545 = !DILocation(line: 265, column: 42, scope: !539)
!546 = !DILocation(line: 267, column: 6, scope: !547)
!547 = distinct !DILexicalBlock(scope: !539, file: !1, line: 267, column: 6)
!548 = !DILocation(line: 267, column: 9, scope: !547)
!549 = !DILocation(line: 267, column: 13, scope: !547)
!550 = !DILocation(line: 267, column: 6, scope: !539)
!551 = !DILocalVariable(name: "verts", scope: !552, file: !1, line: 268, type: !553)
!552 = distinct !DILexicalBlock(scope: !547, file: !1, line: 267, column: 19)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 192, elements: !95)
!554 = !DILocation(line: 268, column: 11, scope: !552)
!555 = !DILocation(line: 270, column: 29, scope: !552)
!556 = !DILocation(line: 270, column: 32, scope: !552)
!557 = !DILocation(line: 270, column: 3, scope: !552)
!558 = !DILocation(line: 272, column: 26, scope: !552)
!559 = !DILocation(line: 272, column: 33, scope: !552)
!560 = !DILocation(line: 272, column: 3, scope: !552)
!561 = !DILocation(line: 273, column: 2, scope: !552)
!562 = !DILocation(line: 274, column: 11, scope: !563)
!563 = distinct !DILexicalBlock(scope: !547, file: !1, line: 274, column: 11)
!564 = !DILocation(line: 274, column: 14, scope: !563)
!565 = !DILocation(line: 274, column: 18, scope: !563)
!566 = !DILocation(line: 274, column: 11, scope: !547)
!567 = !DILocalVariable(name: "verts", scope: !568, file: !1, line: 275, type: !569)
!568 = distinct !DILexicalBlock(scope: !563, file: !1, line: 274, column: 24)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 256, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 4)
!572 = !DILocation(line: 275, column: 11, scope: !568)
!573 = !DILocalVariable(name: "vec", scope: !568, file: !1, line: 276, type: !129)
!574 = !DILocation(line: 276, column: 9, scope: !568)
!575 = !DILocalVariable(name: "vec_a", scope: !568, file: !1, line: 276, type: !129)
!576 = !DILocation(line: 276, column: 17, scope: !568)
!577 = !DILocalVariable(name: "vec_b", scope: !568, file: !1, line: 276, type: !129)
!578 = !DILocation(line: 276, column: 27, scope: !568)
!579 = !DILocation(line: 279, column: 30, scope: !568)
!580 = !DILocation(line: 279, column: 33, scope: !568)
!581 = !DILocation(line: 279, column: 3, scope: !568)
!582 = !DILocation(line: 281, column: 15, scope: !568)
!583 = !DILocation(line: 281, column: 22, scope: !568)
!584 = !DILocation(line: 281, column: 32, scope: !568)
!585 = !DILocation(line: 281, column: 36, scope: !568)
!586 = !DILocation(line: 281, column: 46, scope: !568)
!587 = !DILocation(line: 281, column: 3, scope: !568)
!588 = !DILocation(line: 282, column: 15, scope: !568)
!589 = !DILocation(line: 282, column: 22, scope: !568)
!590 = !DILocation(line: 282, column: 32, scope: !568)
!591 = !DILocation(line: 282, column: 36, scope: !568)
!592 = !DILocation(line: 282, column: 46, scope: !568)
!593 = !DILocation(line: 282, column: 3, scope: !568)
!594 = !DILocation(line: 283, column: 15, scope: !568)
!595 = !DILocation(line: 283, column: 24, scope: !568)
!596 = !DILocation(line: 283, column: 31, scope: !568)
!597 = !DILocation(line: 283, column: 3, scope: !568)
!598 = !DILocation(line: 285, column: 15, scope: !568)
!599 = !DILocation(line: 285, column: 22, scope: !568)
!600 = !DILocation(line: 285, column: 32, scope: !568)
!601 = !DILocation(line: 285, column: 36, scope: !568)
!602 = !DILocation(line: 285, column: 46, scope: !568)
!603 = !DILocation(line: 285, column: 3, scope: !568)
!604 = !DILocation(line: 286, column: 15, scope: !568)
!605 = !DILocation(line: 286, column: 22, scope: !568)
!606 = !DILocation(line: 286, column: 32, scope: !568)
!607 = !DILocation(line: 286, column: 36, scope: !568)
!608 = !DILocation(line: 286, column: 46, scope: !568)
!609 = !DILocation(line: 286, column: 3, scope: !568)
!610 = !DILocation(line: 287, column: 15, scope: !568)
!611 = !DILocation(line: 287, column: 20, scope: !568)
!612 = !DILocation(line: 287, column: 27, scope: !568)
!613 = !DILocation(line: 287, column: 3, scope: !568)
!614 = !DILocation(line: 289, column: 22, scope: !615)
!615 = distinct !DILexicalBlock(scope: !568, file: !1, line: 289, column: 7)
!616 = !DILocation(line: 289, column: 7, scope: !615)
!617 = !DILocation(line: 289, column: 48, scope: !615)
!618 = !DILocation(line: 289, column: 33, scope: !615)
!619 = !DILocation(line: 289, column: 31, scope: !615)
!620 = !DILocation(line: 289, column: 7, scope: !568)
!621 = !DILocation(line: 290, column: 15, scope: !622)
!622 = distinct !DILexicalBlock(scope: !615, file: !1, line: 289, column: 54)
!623 = !DILocation(line: 290, column: 24, scope: !622)
!624 = !DILocation(line: 290, column: 4, scope: !622)
!625 = !DILocation(line: 291, column: 3, scope: !622)
!626 = !DILocation(line: 292, column: 2, scope: !568)
!627 = !DILocalVariable(name: "l_long", scope: !628, file: !1, line: 294, type: !154)
!628 = distinct !DILexicalBlock(scope: !563, file: !1, line: 293, column: 7)
!629 = !DILocation(line: 294, column: 11, scope: !628)
!630 = !DILocation(line: 294, column: 47, scope: !628)
!631 = !DILocation(line: 294, column: 21, scope: !628)
!632 = !DILocation(line: 296, column: 15, scope: !628)
!633 = !DILocation(line: 296, column: 24, scope: !628)
!634 = !DILocation(line: 296, column: 32, scope: !628)
!635 = !DILocation(line: 296, column: 35, scope: !628)
!636 = !DILocation(line: 296, column: 39, scope: !628)
!637 = !DILocation(line: 296, column: 47, scope: !628)
!638 = !DILocation(line: 296, column: 53, scope: !628)
!639 = !DILocation(line: 296, column: 56, scope: !628)
!640 = !DILocation(line: 296, column: 3, scope: !628)
!641 = !DILocation(line: 299, column: 15, scope: !539)
!642 = !DILocation(line: 299, column: 2, scope: !539)
!643 = !DILocation(line: 300, column: 1, scope: !539)
!644 = distinct !DISubprogram(name: "BM_face_as_array_vert_tri", scope: !1, file: !1, line: 1113, type: !645, scopeLine: 1114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !172, !449}
!647 = !DILocalVariable(name: "f", arg: 1, scope: !644, file: !1, line: 1113, type: !172)
!648 = !DILocation(line: 1113, column: 40, scope: !644)
!649 = !DILocalVariable(name: "r_verts", arg: 2, scope: !644, file: !1, line: 1113, type: !449)
!650 = !DILocation(line: 1113, column: 51, scope: !644)
!651 = !DILocalVariable(name: "l", scope: !644, file: !1, line: 1115, type: !154)
!652 = !DILocation(line: 1115, column: 10, scope: !644)
!653 = !DILocation(line: 1115, column: 14, scope: !644)
!654 = !DILocation(line: 1119, column: 15, scope: !644)
!655 = !DILocation(line: 1119, column: 18, scope: !644)
!656 = !DILocation(line: 1119, column: 2, scope: !644)
!657 = !DILocation(line: 1119, column: 13, scope: !644)
!658 = !DILocation(line: 1119, column: 25, scope: !644)
!659 = !DILocation(line: 1119, column: 28, scope: !644)
!660 = !DILocation(line: 1119, column: 23, scope: !644)
!661 = !DILocation(line: 1120, column: 15, scope: !644)
!662 = !DILocation(line: 1120, column: 18, scope: !644)
!663 = !DILocation(line: 1120, column: 2, scope: !644)
!664 = !DILocation(line: 1120, column: 13, scope: !644)
!665 = !DILocation(line: 1120, column: 25, scope: !644)
!666 = !DILocation(line: 1120, column: 28, scope: !644)
!667 = !DILocation(line: 1120, column: 23, scope: !644)
!668 = !DILocation(line: 1121, column: 15, scope: !644)
!669 = !DILocation(line: 1121, column: 18, scope: !644)
!670 = !DILocation(line: 1121, column: 2, scope: !644)
!671 = !DILocation(line: 1121, column: 13, scope: !644)
!672 = !DILocation(line: 1122, column: 1, scope: !644)
!673 = distinct !DISubprogram(name: "BM_face_as_array_vert_quad", scope: !1, file: !1, line: 1128, type: !645, scopeLine: 1129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!674 = !DILocalVariable(name: "f", arg: 1, scope: !673, file: !1, line: 1128, type: !172)
!675 = !DILocation(line: 1128, column: 41, scope: !673)
!676 = !DILocalVariable(name: "r_verts", arg: 2, scope: !673, file: !1, line: 1128, type: !449)
!677 = !DILocation(line: 1128, column: 52, scope: !673)
!678 = !DILocalVariable(name: "l", scope: !673, file: !1, line: 1130, type: !154)
!679 = !DILocation(line: 1130, column: 10, scope: !673)
!680 = !DILocation(line: 1130, column: 14, scope: !673)
!681 = !DILocation(line: 1134, column: 15, scope: !673)
!682 = !DILocation(line: 1134, column: 18, scope: !673)
!683 = !DILocation(line: 1134, column: 2, scope: !673)
!684 = !DILocation(line: 1134, column: 13, scope: !673)
!685 = !DILocation(line: 1134, column: 25, scope: !673)
!686 = !DILocation(line: 1134, column: 28, scope: !673)
!687 = !DILocation(line: 1134, column: 23, scope: !673)
!688 = !DILocation(line: 1135, column: 15, scope: !673)
!689 = !DILocation(line: 1135, column: 18, scope: !673)
!690 = !DILocation(line: 1135, column: 2, scope: !673)
!691 = !DILocation(line: 1135, column: 13, scope: !673)
!692 = !DILocation(line: 1135, column: 25, scope: !673)
!693 = !DILocation(line: 1135, column: 28, scope: !673)
!694 = !DILocation(line: 1135, column: 23, scope: !673)
!695 = !DILocation(line: 1136, column: 15, scope: !673)
!696 = !DILocation(line: 1136, column: 18, scope: !673)
!697 = !DILocation(line: 1136, column: 2, scope: !673)
!698 = !DILocation(line: 1136, column: 13, scope: !673)
!699 = !DILocation(line: 1136, column: 25, scope: !673)
!700 = !DILocation(line: 1136, column: 28, scope: !673)
!701 = !DILocation(line: 1136, column: 23, scope: !673)
!702 = !DILocation(line: 1137, column: 15, scope: !673)
!703 = !DILocation(line: 1137, column: 18, scope: !673)
!704 = !DILocation(line: 1137, column: 2, scope: !673)
!705 = !DILocation(line: 1137, column: 13, scope: !673)
!706 = !DILocation(line: 1138, column: 1, scope: !673)
!707 = distinct !DISubprogram(name: "add_v3_v3v3", scope: !378, file: !378, line: 309, type: !515, scopeLine: 310, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!708 = !DILocalVariable(name: "r", arg: 1, scope: !707, file: !378, line: 309, type: !381)
!709 = !DILocation(line: 309, column: 32, scope: !707)
!710 = !DILocalVariable(name: "a", arg: 2, scope: !707, file: !378, line: 309, type: !382)
!711 = !DILocation(line: 309, column: 50, scope: !707)
!712 = !DILocalVariable(name: "b", arg: 3, scope: !707, file: !378, line: 309, type: !382)
!713 = !DILocation(line: 309, column: 68, scope: !707)
!714 = !DILocation(line: 311, column: 9, scope: !707)
!715 = !DILocation(line: 311, column: 16, scope: !707)
!716 = !DILocation(line: 311, column: 14, scope: !707)
!717 = !DILocation(line: 311, column: 2, scope: !707)
!718 = !DILocation(line: 311, column: 7, scope: !707)
!719 = !DILocation(line: 312, column: 9, scope: !707)
!720 = !DILocation(line: 312, column: 16, scope: !707)
!721 = !DILocation(line: 312, column: 14, scope: !707)
!722 = !DILocation(line: 312, column: 2, scope: !707)
!723 = !DILocation(line: 312, column: 7, scope: !707)
!724 = !DILocation(line: 313, column: 9, scope: !707)
!725 = !DILocation(line: 313, column: 16, scope: !707)
!726 = !DILocation(line: 313, column: 14, scope: !707)
!727 = !DILocation(line: 313, column: 2, scope: !707)
!728 = !DILocation(line: 313, column: 7, scope: !707)
!729 = !DILocation(line: 314, column: 1, scope: !707)
!730 = distinct !DISubprogram(name: "len_squared_v3", scope: !378, file: !378, line: 671, type: !731, scopeLine: 672, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!731 = !DISubroutineType(types: !732)
!732 = !{!90, !382}
!733 = !DILocalVariable(name: "v", arg: 1, scope: !730, file: !378, line: 671, type: !382)
!734 = !DILocation(line: 671, column: 42, scope: !730)
!735 = !DILocation(line: 673, column: 9, scope: !730)
!736 = !DILocation(line: 673, column: 16, scope: !730)
!737 = !DILocation(line: 673, column: 14, scope: !730)
!738 = !DILocation(line: 673, column: 23, scope: !730)
!739 = !DILocation(line: 673, column: 30, scope: !730)
!740 = !DILocation(line: 673, column: 28, scope: !730)
!741 = !DILocation(line: 673, column: 21, scope: !730)
!742 = !DILocation(line: 673, column: 37, scope: !730)
!743 = !DILocation(line: 673, column: 44, scope: !730)
!744 = !DILocation(line: 673, column: 42, scope: !730)
!745 = !DILocation(line: 673, column: 35, scope: !730)
!746 = !DILocation(line: 673, column: 2, scope: !730)
!747 = distinct !DISubprogram(name: "normalize_v3", scope: !378, file: !378, line: 830, type: !748, scopeLine: 831, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!748 = !DISubroutineType(types: !749)
!749 = !{!90, !381}
!750 = !DILocalVariable(name: "n", arg: 1, scope: !747, file: !378, line: 830, type: !381)
!751 = !DILocation(line: 830, column: 34, scope: !747)
!752 = !DILocation(line: 832, column: 25, scope: !747)
!753 = !DILocation(line: 832, column: 28, scope: !747)
!754 = !DILocation(line: 832, column: 9, scope: !747)
!755 = !DILocation(line: 832, column: 2, scope: !747)
!756 = distinct !DISubprogram(name: "BM_face_calc_center_bounds", scope: !1, file: !1, line: 305, type: !540, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!757 = !DILocalVariable(name: "f", arg: 1, scope: !756, file: !1, line: 305, type: !172)
!758 = !DILocation(line: 305, column: 41, scope: !756)
!759 = !DILocalVariable(name: "r_cent", arg: 2, scope: !756, file: !1, line: 305, type: !381)
!760 = !DILocation(line: 305, column: 50, scope: !756)
!761 = !DILocalVariable(name: "l_iter", scope: !756, file: !1, line: 307, type: !154)
!762 = !DILocation(line: 307, column: 10, scope: !756)
!763 = !DILocalVariable(name: "l_first", scope: !756, file: !1, line: 308, type: !154)
!764 = !DILocation(line: 308, column: 10, scope: !756)
!765 = !DILocalVariable(name: "min", scope: !756, file: !1, line: 309, type: !129)
!766 = !DILocation(line: 309, column: 8, scope: !756)
!767 = !DILocalVariable(name: "max", scope: !756, file: !1, line: 309, type: !129)
!768 = !DILocation(line: 309, column: 16, scope: !756)
!769 = !DILocation(line: 311, column: 2, scope: !770)
!770 = distinct !DILexicalBlock(scope: !756, file: !1, line: 311, column: 2)
!771 = !DILocation(line: 313, column: 21, scope: !756)
!772 = !DILocation(line: 313, column: 19, scope: !756)
!773 = !DILocation(line: 313, column: 9, scope: !756)
!774 = !DILocation(line: 314, column: 2, scope: !756)
!775 = !DILocation(line: 315, column: 18, scope: !776)
!776 = distinct !DILexicalBlock(scope: !756, file: !1, line: 314, column: 5)
!777 = !DILocation(line: 315, column: 23, scope: !776)
!778 = !DILocation(line: 315, column: 28, scope: !776)
!779 = !DILocation(line: 315, column: 36, scope: !776)
!780 = !DILocation(line: 315, column: 39, scope: !776)
!781 = !DILocation(line: 315, column: 3, scope: !776)
!782 = !DILocation(line: 316, column: 2, scope: !776)
!783 = !DILocation(line: 316, column: 21, scope: !756)
!784 = !DILocation(line: 316, column: 29, scope: !756)
!785 = !DILocation(line: 316, column: 19, scope: !756)
!786 = !DILocation(line: 316, column: 38, scope: !756)
!787 = !DILocation(line: 316, column: 35, scope: !756)
!788 = distinct !{!788, !774, !789}
!789 = !DILocation(line: 316, column: 45, scope: !756)
!790 = !DILocation(line: 318, column: 14, scope: !756)
!791 = !DILocation(line: 318, column: 22, scope: !756)
!792 = !DILocation(line: 318, column: 27, scope: !756)
!793 = !DILocation(line: 318, column: 2, scope: !756)
!794 = !DILocation(line: 319, column: 1, scope: !756)
!795 = distinct !DISubprogram(name: "BM_face_calc_center_mean", scope: !1, file: !1, line: 324, type: !540, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!796 = !DILocalVariable(name: "f", arg: 1, scope: !795, file: !1, line: 324, type: !172)
!797 = !DILocation(line: 324, column: 39, scope: !795)
!798 = !DILocalVariable(name: "r_cent", arg: 2, scope: !795, file: !1, line: 324, type: !381)
!799 = !DILocation(line: 324, column: 48, scope: !795)
!800 = !DILocalVariable(name: "l_iter", scope: !795, file: !1, line: 326, type: !154)
!801 = !DILocation(line: 326, column: 10, scope: !795)
!802 = !DILocalVariable(name: "l_first", scope: !795, file: !1, line: 326, type: !154)
!803 = !DILocation(line: 326, column: 19, scope: !795)
!804 = !DILocation(line: 328, column: 10, scope: !795)
!805 = !DILocation(line: 328, column: 2, scope: !795)
!806 = !DILocation(line: 330, column: 21, scope: !795)
!807 = !DILocation(line: 330, column: 19, scope: !795)
!808 = !DILocation(line: 330, column: 9, scope: !795)
!809 = !DILocation(line: 331, column: 2, scope: !795)
!810 = !DILocation(line: 332, column: 13, scope: !811)
!811 = distinct !DILexicalBlock(scope: !795, file: !1, line: 331, column: 5)
!812 = !DILocation(line: 332, column: 21, scope: !811)
!813 = !DILocation(line: 332, column: 29, scope: !811)
!814 = !DILocation(line: 332, column: 32, scope: !811)
!815 = !DILocation(line: 332, column: 3, scope: !811)
!816 = !DILocation(line: 333, column: 2, scope: !811)
!817 = !DILocation(line: 333, column: 21, scope: !795)
!818 = !DILocation(line: 333, column: 29, scope: !795)
!819 = !DILocation(line: 333, column: 19, scope: !795)
!820 = !DILocation(line: 333, column: 38, scope: !795)
!821 = !DILocation(line: 333, column: 35, scope: !795)
!822 = distinct !{!822, !809, !823}
!823 = !DILocation(line: 333, column: 45, scope: !795)
!824 = !DILocation(line: 334, column: 12, scope: !795)
!825 = !DILocation(line: 334, column: 35, scope: !795)
!826 = !DILocation(line: 334, column: 38, scope: !795)
!827 = !DILocation(line: 334, column: 27, scope: !795)
!828 = !DILocation(line: 334, column: 25, scope: !795)
!829 = !DILocation(line: 334, column: 2, scope: !795)
!830 = !DILocation(line: 335, column: 1, scope: !795)
!831 = distinct !DISubprogram(name: "zero_v3", scope: !378, file: !378, line: 43, type: !832, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !381}
!834 = !DILocalVariable(name: "r", arg: 1, scope: !831, file: !378, line: 43, type: !381)
!835 = !DILocation(line: 43, column: 28, scope: !831)
!836 = !DILocation(line: 45, column: 2, scope: !831)
!837 = !DILocation(line: 45, column: 7, scope: !831)
!838 = !DILocation(line: 46, column: 2, scope: !831)
!839 = !DILocation(line: 46, column: 7, scope: !831)
!840 = !DILocation(line: 47, column: 2, scope: !831)
!841 = !DILocation(line: 47, column: 7, scope: !831)
!842 = !DILocation(line: 48, column: 1, scope: !831)
!843 = distinct !DISubprogram(name: "add_v3_v3", scope: !378, file: !378, line: 302, type: !379, scopeLine: 303, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!844 = !DILocalVariable(name: "r", arg: 1, scope: !843, file: !378, line: 302, type: !381)
!845 = !DILocation(line: 302, column: 30, scope: !843)
!846 = !DILocalVariable(name: "a", arg: 2, scope: !843, file: !378, line: 302, type: !382)
!847 = !DILocation(line: 302, column: 48, scope: !843)
!848 = !DILocation(line: 304, column: 10, scope: !843)
!849 = !DILocation(line: 304, column: 2, scope: !843)
!850 = !DILocation(line: 304, column: 7, scope: !843)
!851 = !DILocation(line: 305, column: 10, scope: !843)
!852 = !DILocation(line: 305, column: 2, scope: !843)
!853 = !DILocation(line: 305, column: 7, scope: !843)
!854 = !DILocation(line: 306, column: 10, scope: !843)
!855 = !DILocation(line: 306, column: 2, scope: !843)
!856 = !DILocation(line: 306, column: 7, scope: !843)
!857 = !DILocation(line: 307, column: 1, scope: !843)
!858 = distinct !DISubprogram(name: "mul_v3_fl", scope: !378, file: !378, line: 392, type: !859, scopeLine: 393, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !381, !90}
!861 = !DILocalVariable(name: "r", arg: 1, scope: !858, file: !378, line: 392, type: !381)
!862 = !DILocation(line: 392, column: 30, scope: !858)
!863 = !DILocalVariable(name: "f", arg: 2, scope: !858, file: !378, line: 392, type: !90)
!864 = !DILocation(line: 392, column: 42, scope: !858)
!865 = !DILocation(line: 394, column: 10, scope: !858)
!866 = !DILocation(line: 394, column: 2, scope: !858)
!867 = !DILocation(line: 394, column: 7, scope: !858)
!868 = !DILocation(line: 395, column: 10, scope: !858)
!869 = !DILocation(line: 395, column: 2, scope: !858)
!870 = !DILocation(line: 395, column: 7, scope: !858)
!871 = !DILocation(line: 396, column: 10, scope: !858)
!872 = !DILocation(line: 396, column: 2, scope: !858)
!873 = !DILocation(line: 396, column: 7, scope: !858)
!874 = !DILocation(line: 397, column: 1, scope: !858)
!875 = distinct !DISubprogram(name: "BM_face_calc_center_mean_weighted", scope: !1, file: !1, line: 341, type: !540, scopeLine: 342, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!876 = !DILocalVariable(name: "f", arg: 1, scope: !875, file: !1, line: 341, type: !172)
!877 = !DILocation(line: 341, column: 48, scope: !875)
!878 = !DILocalVariable(name: "r_cent", arg: 2, scope: !875, file: !1, line: 341, type: !381)
!879 = !DILocation(line: 341, column: 57, scope: !875)
!880 = !DILocalVariable(name: "l_iter", scope: !875, file: !1, line: 343, type: !154)
!881 = !DILocation(line: 343, column: 10, scope: !875)
!882 = !DILocalVariable(name: "l_first", scope: !875, file: !1, line: 344, type: !154)
!883 = !DILocation(line: 344, column: 10, scope: !875)
!884 = !DILocalVariable(name: "totw", scope: !875, file: !1, line: 345, type: !90)
!885 = !DILocation(line: 345, column: 8, scope: !875)
!886 = !DILocalVariable(name: "w_prev", scope: !875, file: !1, line: 346, type: !90)
!887 = !DILocation(line: 346, column: 8, scope: !875)
!888 = !DILocation(line: 348, column: 10, scope: !875)
!889 = !DILocation(line: 348, column: 2, scope: !875)
!890 = !DILocation(line: 351, column: 21, scope: !875)
!891 = !DILocation(line: 351, column: 19, scope: !875)
!892 = !DILocation(line: 351, column: 9, scope: !875)
!893 = !DILocation(line: 352, column: 31, scope: !875)
!894 = !DILocation(line: 352, column: 39, scope: !875)
!895 = !DILocation(line: 352, column: 45, scope: !875)
!896 = !DILocation(line: 352, column: 11, scope: !875)
!897 = !DILocation(line: 352, column: 9, scope: !875)
!898 = !DILocation(line: 353, column: 2, scope: !875)
!899 = !DILocalVariable(name: "w_curr", scope: !900, file: !1, line: 354, type: !89)
!900 = distinct !DILexicalBlock(scope: !875, file: !1, line: 353, column: 5)
!901 = !DILocation(line: 354, column: 15, scope: !900)
!902 = !DILocation(line: 354, column: 44, scope: !900)
!903 = !DILocation(line: 354, column: 52, scope: !900)
!904 = !DILocation(line: 354, column: 24, scope: !900)
!905 = !DILocalVariable(name: "w", scope: !900, file: !1, line: 355, type: !89)
!906 = !DILocation(line: 355, column: 15, scope: !900)
!907 = !DILocation(line: 355, column: 20, scope: !900)
!908 = !DILocation(line: 355, column: 29, scope: !900)
!909 = !DILocation(line: 355, column: 27, scope: !900)
!910 = !DILocation(line: 356, column: 16, scope: !900)
!911 = !DILocation(line: 356, column: 24, scope: !900)
!912 = !DILocation(line: 356, column: 32, scope: !900)
!913 = !DILocation(line: 356, column: 35, scope: !900)
!914 = !DILocation(line: 356, column: 39, scope: !900)
!915 = !DILocation(line: 356, column: 3, scope: !900)
!916 = !DILocation(line: 357, column: 11, scope: !900)
!917 = !DILocation(line: 357, column: 8, scope: !900)
!918 = !DILocation(line: 358, column: 12, scope: !900)
!919 = !DILocation(line: 358, column: 10, scope: !900)
!920 = !DILocation(line: 359, column: 2, scope: !900)
!921 = !DILocation(line: 359, column: 21, scope: !875)
!922 = !DILocation(line: 359, column: 29, scope: !875)
!923 = !DILocation(line: 359, column: 19, scope: !875)
!924 = !DILocation(line: 359, column: 38, scope: !875)
!925 = !DILocation(line: 359, column: 35, scope: !875)
!926 = distinct !{!926, !898, !927}
!927 = !DILocation(line: 359, column: 45, scope: !875)
!928 = !DILocation(line: 361, column: 6, scope: !929)
!929 = distinct !DILexicalBlock(scope: !875, file: !1, line: 361, column: 6)
!930 = !DILocation(line: 361, column: 11, scope: !929)
!931 = !DILocation(line: 361, column: 6, scope: !875)
!932 = !DILocation(line: 362, column: 13, scope: !929)
!933 = !DILocation(line: 362, column: 36, scope: !929)
!934 = !DILocation(line: 362, column: 26, scope: !929)
!935 = !DILocation(line: 362, column: 3, scope: !929)
!936 = !DILocation(line: 363, column: 1, scope: !875)
!937 = distinct !DISubprogram(name: "madd_v3_v3fl", scope: !378, file: !378, line: 507, type: !938, scopeLine: 508, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !381, !382, !90}
!940 = !DILocalVariable(name: "r", arg: 1, scope: !937, file: !378, line: 507, type: !381)
!941 = !DILocation(line: 507, column: 33, scope: !937)
!942 = !DILocalVariable(name: "a", arg: 2, scope: !937, file: !378, line: 507, type: !382)
!943 = !DILocation(line: 507, column: 51, scope: !937)
!944 = !DILocalVariable(name: "f", arg: 3, scope: !937, file: !378, line: 507, type: !90)
!945 = !DILocation(line: 507, column: 63, scope: !937)
!946 = !DILocation(line: 509, column: 10, scope: !937)
!947 = !DILocation(line: 509, column: 17, scope: !937)
!948 = !DILocation(line: 509, column: 15, scope: !937)
!949 = !DILocation(line: 509, column: 2, scope: !937)
!950 = !DILocation(line: 509, column: 7, scope: !937)
!951 = !DILocation(line: 510, column: 10, scope: !937)
!952 = !DILocation(line: 510, column: 17, scope: !937)
!953 = !DILocation(line: 510, column: 15, scope: !937)
!954 = !DILocation(line: 510, column: 2, scope: !937)
!955 = !DILocation(line: 510, column: 7, scope: !937)
!956 = !DILocation(line: 511, column: 10, scope: !937)
!957 = !DILocation(line: 511, column: 17, scope: !937)
!958 = !DILocation(line: 511, column: 15, scope: !937)
!959 = !DILocation(line: 511, column: 2, scope: !937)
!960 = !DILocation(line: 511, column: 7, scope: !937)
!961 = !DILocation(line: 512, column: 1, scope: !937)
!962 = distinct !DISubprogram(name: "poly_rotate_plane", scope: !1, file: !1, line: 394, type: !963, scopeLine: 395, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !382, !318, !965}
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!966 = !DILocalVariable(name: "normal", arg: 1, scope: !962, file: !1, line: 394, type: !382)
!967 = !DILocation(line: 394, column: 36, scope: !962)
!968 = !DILocalVariable(name: "verts", arg: 2, scope: !962, file: !1, line: 394, type: !318)
!969 = !DILocation(line: 394, column: 55, scope: !962)
!970 = !DILocalVariable(name: "nverts", arg: 3, scope: !962, file: !1, line: 394, type: !965)
!971 = !DILocation(line: 394, column: 85, scope: !962)
!972 = !DILocalVariable(name: "mat", scope: !962, file: !1, line: 396, type: !263)
!973 = !DILocation(line: 396, column: 8, scope: !962)
!974 = !DILocalVariable(name: "co", scope: !962, file: !1, line: 397, type: !129)
!975 = !DILocation(line: 397, column: 8, scope: !962)
!976 = !DILocalVariable(name: "i", scope: !962, file: !1, line: 398, type: !5)
!977 = !DILocation(line: 398, column: 15, scope: !962)
!978 = !DILocation(line: 400, column: 2, scope: !962)
!979 = !DILocation(line: 400, column: 8, scope: !962)
!980 = !DILocation(line: 402, column: 25, scope: !962)
!981 = !DILocation(line: 402, column: 30, scope: !962)
!982 = !DILocation(line: 402, column: 2, scope: !962)
!983 = !DILocation(line: 403, column: 9, scope: !984)
!984 = distinct !DILexicalBlock(scope: !962, file: !1, line: 403, column: 2)
!985 = !DILocation(line: 403, column: 7, scope: !984)
!986 = !DILocation(line: 403, column: 14, scope: !987)
!987 = distinct !DILexicalBlock(scope: !984, file: !1, line: 403, column: 2)
!988 = !DILocation(line: 403, column: 18, scope: !987)
!989 = !DILocation(line: 403, column: 16, scope: !987)
!990 = !DILocation(line: 403, column: 2, scope: !984)
!991 = !DILocation(line: 404, column: 15, scope: !992)
!992 = distinct !DILexicalBlock(scope: !987, file: !1, line: 403, column: 31)
!993 = !DILocation(line: 404, column: 19, scope: !992)
!994 = !DILocation(line: 404, column: 24, scope: !992)
!995 = !DILocation(line: 404, column: 30, scope: !992)
!996 = !DILocation(line: 404, column: 3, scope: !992)
!997 = !DILocation(line: 405, column: 14, scope: !992)
!998 = !DILocation(line: 405, column: 20, scope: !992)
!999 = !DILocation(line: 405, column: 24, scope: !992)
!1000 = !DILocation(line: 405, column: 3, scope: !992)
!1001 = !DILocation(line: 406, column: 2, scope: !992)
!1002 = !DILocation(line: 403, column: 27, scope: !987)
!1003 = !DILocation(line: 403, column: 2, scope: !987)
!1004 = distinct !{!1004, !990, !1005}
!1005 = !DILocation(line: 406, column: 2, scope: !984)
!1006 = !DILocation(line: 407, column: 1, scope: !962)
!1007 = distinct !DISubprogram(name: "BM_edge_normals_update", scope: !1, file: !1, line: 412, type: !1008, scopeLine: 413, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !170}
!1010 = !DILocalVariable(name: "e", arg: 1, scope: !1007, file: !1, line: 412, type: !170)
!1011 = !DILocation(line: 412, column: 37, scope: !1007)
!1012 = !DILocalVariable(name: "iter", scope: !1007, file: !1, line: 414, type: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !4, line: 186, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !4, line: 164, size: 512, elements: !1015)
!1015 = !{!1016, !1098, !1099, !1100, !1101}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1014, file: !4, line: 179, baseType: !1017, size: 320)
!1017 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1014, file: !4, line: 166, size: 320, elements: !1018)
!1018 = !{!1019, !1036, !1042, !1050, !1058, !1064, !1070, !1076, !1080, !1086, !1092}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !1017, file: !4, line: 167, baseType: !1020, size: 192)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !4, line: 113, size: 192, elements: !1021)
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !1020, file: !4, line: 114, baseType: !1023, size: 192)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !1024, line: 80, baseType: !1025)
!1024 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !1024, line: 76, size: 192, elements: !1026)
!1026 = !{!1027, !1032, !1035}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1025, file: !1024, line: 77, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !1024, line: 47, baseType: !1030)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !1031, line: 71, flags: DIFlagFwdDecl)
!1031 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !1025, file: !1024, line: 78, baseType: !1033, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !1024, line: 45, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !1025, file: !1024, line: 79, baseType: !5, size: 32, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !1017, file: !4, line: 169, baseType: !1037, size: 192)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !4, line: 116, size: 192, elements: !1038)
!1038 = !{!1039, !1040, !1041}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1037, file: !4, line: 117, baseType: !107, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !1037, file: !4, line: 118, baseType: !170, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !1037, file: !4, line: 118, baseType: !170, size: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !1017, file: !4, line: 170, baseType: !1043, size: 320)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !4, line: 120, size: 320, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1043, file: !4, line: 121, baseType: !107, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1043, file: !4, line: 122, baseType: !154, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1043, file: !4, line: 122, baseType: !154, size: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !1043, file: !4, line: 123, baseType: !170, size: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !1043, file: !4, line: 123, baseType: !170, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !1017, file: !4, line: 171, baseType: !1051, size: 320)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !4, line: 125, size: 320, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056, !1057}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1051, file: !4, line: 126, baseType: !107, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1051, file: !4, line: 127, baseType: !154, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1051, file: !4, line: 127, baseType: !154, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !1051, file: !4, line: 128, baseType: !170, size: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !1051, file: !4, line: 128, baseType: !170, size: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !1017, file: !4, line: 172, baseType: !1059, size: 192)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !4, line: 130, size: 192, elements: !1060)
!1060 = !{!1061, !1062, !1063}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1059, file: !4, line: 131, baseType: !170, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1059, file: !4, line: 132, baseType: !154, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1059, file: !4, line: 132, baseType: !154, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !1017, file: !4, line: 173, baseType: !1065, size: 192)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !4, line: 134, size: 192, elements: !1066)
!1066 = !{!1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !1065, file: !4, line: 135, baseType: !154, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1065, file: !4, line: 136, baseType: !154, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1065, file: !4, line: 136, baseType: !154, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !1017, file: !4, line: 174, baseType: !1071, size: 192)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !4, line: 138, size: 192, elements: !1072)
!1072 = !{!1073, !1074, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1071, file: !4, line: 139, baseType: !170, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1071, file: !4, line: 140, baseType: !154, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1071, file: !4, line: 140, baseType: !154, size: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !1017, file: !4, line: 175, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !4, line: 142, size: 64, elements: !1078)
!1078 = !{!1079}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1077, file: !4, line: 143, baseType: !170, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !1017, file: !4, line: 176, baseType: !1081, size: 192)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !4, line: 145, size: 192, elements: !1082)
!1082 = !{!1083, !1084, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1081, file: !4, line: 146, baseType: !172, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1081, file: !4, line: 147, baseType: !154, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1081, file: !4, line: 147, baseType: !154, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !1017, file: !4, line: 177, baseType: !1087, size: 192)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !4, line: 149, size: 192, elements: !1088)
!1088 = !{!1089, !1090, !1091}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1087, file: !4, line: 150, baseType: !172, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1087, file: !4, line: 151, baseType: !154, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1087, file: !4, line: 151, baseType: !154, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !1017, file: !4, line: 178, baseType: !1093, size: 192)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !4, line: 153, size: 192, elements: !1094)
!1094 = !{!1095, !1096, !1097}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1093, file: !4, line: 154, baseType: !172, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1093, file: !4, line: 155, baseType: !154, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1093, file: !4, line: 155, baseType: !154, size: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !1014, file: !4, line: 181, baseType: !99, size: 64, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1014, file: !4, line: 182, baseType: !103, size: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1014, file: !4, line: 184, baseType: !117, size: 32, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !1014, file: !4, line: 185, baseType: !119, size: 8, offset: 480)
!1102 = !DILocation(line: 414, column: 9, scope: !1007)
!1103 = !DILocalVariable(name: "f", scope: !1007, file: !1, line: 415, type: !172)
!1104 = !DILocation(line: 415, column: 10, scope: !1007)
!1105 = !DILocation(line: 417, column: 2, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1007, file: !1, line: 417, column: 2)
!1107 = !DILocation(line: 417, column: 2, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 417, column: 2)
!1109 = !DILocation(line: 418, column: 25, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1108, file: !1, line: 417, column: 47)
!1111 = !DILocation(line: 418, column: 3, scope: !1110)
!1112 = !DILocation(line: 419, column: 2, scope: !1110)
!1113 = distinct !{!1113, !1105, !1114}
!1114 = !DILocation(line: 419, column: 2, scope: !1106)
!1115 = !DILocation(line: 421, column: 24, scope: !1007)
!1116 = !DILocation(line: 421, column: 27, scope: !1007)
!1117 = !DILocation(line: 421, column: 2, scope: !1007)
!1118 = !DILocation(line: 422, column: 24, scope: !1007)
!1119 = !DILocation(line: 422, column: 27, scope: !1007)
!1120 = !DILocation(line: 422, column: 2, scope: !1007)
!1121 = !DILocation(line: 423, column: 1, scope: !1007)
!1122 = distinct !DISubprogram(name: "BM_iter_new", scope: !1123, file: !1123, line: 172, type: !1124, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!1123 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!97, !1126, !1127, !1167, !97}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !65, line: 246, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !65, line: 186, size: 8064, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1142, !1143, !1144, !1145, !1146, !1148, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1210, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1263, !1264, !1265}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !1129, file: !65, line: 187, baseType: !117, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !1129, file: !65, line: 187, baseType: !117, size: 32, offset: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !1129, file: !65, line: 187, baseType: !117, size: 32, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !1129, file: !65, line: 187, baseType: !117, size: 32, offset: 96)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !1129, file: !65, line: 188, baseType: !117, size: 32, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !1129, file: !65, line: 188, baseType: !117, size: 32, offset: 160)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !1129, file: !65, line: 188, baseType: !117, size: 32, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !1129, file: !65, line: 193, baseType: !119, size: 8, offset: 224)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !1129, file: !65, line: 197, baseType: !119, size: 8, offset: 232)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !1129, file: !65, line: 201, baseType: !1141, size: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !1129, file: !65, line: 201, baseType: !1141, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !1129, file: !65, line: 201, baseType: !1141, size: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !1129, file: !65, line: 201, baseType: !1141, size: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1129, file: !65, line: 208, baseType: !449, size: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !1129, file: !65, line: 209, baseType: !1147, size: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !1129, file: !65, line: 210, baseType: !1149, size: 64, offset: 640)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !1129, file: !65, line: 213, baseType: !117, size: 32, offset: 704)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !1129, file: !65, line: 214, baseType: !117, size: 32, offset: 736)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !1129, file: !65, line: 215, baseType: !117, size: 32, offset: 768)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !1129, file: !65, line: 218, baseType: !1141, size: 64, offset: 832)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !1129, file: !65, line: 218, baseType: !1141, size: 64, offset: 896)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !1129, file: !65, line: 218, baseType: !1141, size: 64, offset: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !1129, file: !65, line: 220, baseType: !117, size: 32, offset: 1024)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !1129, file: !65, line: 221, baseType: !1158, size: 64, offset: 1088)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !22, line: 190, size: 10496, elements: !1160)
!1160 = !{!1161, !1197, !1198, !1202, !1206, !1207, !1209}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !1159, file: !22, line: 191, baseType: !1162, size: 5120)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1163, size: 5120, elements: !1195)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !22, line: 147, size: 320, elements: !1164)
!1164 = !{!1165, !1168, !1170, !1180, !1181}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !1163, file: !22, line: 148, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !1163, file: !22, line: 149, baseType: !1169, size: 32, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !22, line: 112, baseType: !21)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !1163, file: !22, line: 150, baseType: !1171, size: 32, offset: 96)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !22, line: 142, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !22, line: 138, size: 32, elements: !1173)
!1173 = !{!1174, !1176, !1178}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1172, file: !22, line: 139, baseType: !1175, size: 32)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !22, line: 122, baseType: !32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1172, file: !22, line: 140, baseType: !1177, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !22, line: 136, baseType: !38)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1172, file: !22, line: 141, baseType: !1179, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !22, line: 130, baseType: !44)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1163, file: !22, line: 152, baseType: !117, size: 32, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !22, line: 162, baseType: !1182, size: 128, offset: 192)
!1182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1163, file: !22, line: 155, size: 128, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1188, !1190}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !1182, file: !22, line: 156, baseType: !117, size: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1182, file: !22, line: 157, baseType: !90, size: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1182, file: !22, line: 158, baseType: !97, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1182, file: !22, line: 159, baseType: !129, size: 96)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1182, file: !22, line: 160, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !1182, file: !22, line: 161, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !1193, line: 48, baseType: !1194)
!1193 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1193, line: 48, flags: DIFlagFwdDecl)
!1195 = !{!1196}
!1196 = !DISubrange(count: 16)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !1159, file: !22, line: 192, baseType: !1162, size: 5120, offset: 5120)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1159, file: !22, line: 193, baseType: !1199, size: 64, offset: 10240)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{null, !1127, !1158}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !1159, file: !22, line: 194, baseType: !1203, size: 64, offset: 10304)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !1205, line: 52, flags: DIFlagFwdDecl)
!1205 = !DIFile(filename: "blender/source/blender/blenlib/BLI_memarena.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1159, file: !22, line: 195, baseType: !117, size: 32, offset: 10368)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !1159, file: !22, line: 196, baseType: !1208, size: 32, offset: 10400)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !22, line: 188, baseType: !52)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1159, file: !22, line: 197, baseType: !117, size: 32, offset: 10432)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1129, file: !65, line: 223, baseType: !1211, size: 1600, offset: 1152)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !1031, line: 73, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !1031, line: 64, size: 1600, elements: !1213)
!1213 = !{!1214, !1232, !1236, !1237, !1238, !1239, !1240}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !1212, file: !1031, line: 65, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !1031, line: 53, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !1031, line: 42, size: 832, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1231}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1217, file: !1031, line: 43, baseType: !117, size: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1217, file: !1031, line: 44, baseType: !117, size: 32, offset: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1217, file: !1031, line: 45, baseType: !117, size: 32, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1217, file: !1031, line: 46, baseType: !117, size: 32, offset: 96)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !1217, file: !1031, line: 47, baseType: !117, size: 32, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !1217, file: !1031, line: 48, baseType: !117, size: 32, offset: 160)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !1217, file: !1031, line: 49, baseType: !117, size: 32, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1217, file: !1031, line: 50, baseType: !117, size: 32, offset: 224)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1217, file: !1031, line: 51, baseType: !1228, size: 512, offset: 256)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !1229)
!1229 = !{!1230}
!1230 = !DISubrange(count: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !1031, line: 52, baseType: !97, size: 64, offset: 768)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !1212, file: !1031, line: 66, baseType: !1233, size: 1312, offset: 64)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 1312, elements: !1234)
!1234 = !{!1235}
!1235 = !DISubrange(count: 41)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !1212, file: !1031, line: 69, baseType: !117, size: 32, offset: 1376)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !1212, file: !1031, line: 69, baseType: !117, size: 32, offset: 1408)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !1212, file: !1031, line: 70, baseType: !117, size: 32, offset: 1440)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1212, file: !1031, line: 71, baseType: !1141, size: 64, offset: 1472)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !1212, file: !1031, line: 72, baseType: !1241, size: 64, offset: 1536)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !1031, line: 59, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !1031, line: 57, size: 8192, elements: !1244)
!1244 = !{!1245}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1243, file: !1031, line: 58, baseType: !1246, size: 8192)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8192, elements: !1247)
!1247 = !{!1248}
!1248 = !DISubrange(count: 1024)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1129, file: !65, line: 223, baseType: !1211, size: 1600, offset: 2752)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !1129, file: !65, line: 223, baseType: !1211, size: 1600, offset: 4352)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1129, file: !65, line: 223, baseType: !1211, size: 1600, offset: 5952)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1129, file: !65, line: 233, baseType: !127, size: 16, offset: 7552)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1129, file: !65, line: 236, baseType: !117, size: 32, offset: 7584)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !1129, file: !65, line: 238, baseType: !117, size: 32, offset: 7616)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !1129, file: !65, line: 238, baseType: !117, size: 32, offset: 7648)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !1129, file: !65, line: 239, baseType: !1257, size: 128, offset: 7680)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1258, line: 71, baseType: !1259)
!1258 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1258, line: 69, size: 128, elements: !1260)
!1260 = !{!1261, !1262}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1259, file: !1258, line: 70, baseType: !97, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1259, file: !1258, line: 70, baseType: !97, size: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !1129, file: !65, line: 241, baseType: !172, size: 64, offset: 7808)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !1129, file: !65, line: 243, baseType: !1257, size: 128, offset: 7872)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !1129, file: !65, line: 245, baseType: !97, size: 64, offset: 8000)
!1266 = !DILocalVariable(name: "iter", arg: 1, scope: !1122, file: !1123, line: 172, type: !1126)
!1267 = !DILocation(line: 172, column: 38, scope: !1122)
!1268 = !DILocalVariable(name: "bm", arg: 2, scope: !1122, file: !1123, line: 172, type: !1127)
!1269 = !DILocation(line: 172, column: 51, scope: !1122)
!1270 = !DILocalVariable(name: "itype", arg: 3, scope: !1122, file: !1123, line: 172, type: !1167)
!1271 = !DILocation(line: 172, column: 66, scope: !1122)
!1272 = !DILocalVariable(name: "data", arg: 4, scope: !1122, file: !1123, line: 172, type: !97)
!1273 = !DILocation(line: 172, column: 79, scope: !1122)
!1274 = !DILocation(line: 174, column: 6, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1122, file: !1123, line: 174, column: 6)
!1276 = !DILocation(line: 174, column: 6, scope: !1122)
!1277 = !DILocation(line: 175, column: 23, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1275, file: !1123, line: 174, column: 51)
!1279 = !DILocation(line: 175, column: 10, scope: !1278)
!1280 = !DILocation(line: 175, column: 3, scope: !1278)
!1281 = !DILocation(line: 178, column: 3, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1275, file: !1123, line: 177, column: 7)
!1283 = !DILocation(line: 180, column: 1, scope: !1122)
!1284 = distinct !DISubprogram(name: "BM_face_normal_update", scope: !1, file: !1, line: 509, type: !1285, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{null, !172}
!1287 = !DILocalVariable(name: "f", arg: 1, scope: !1284, file: !1, line: 509, type: !172)
!1288 = !DILocation(line: 509, column: 36, scope: !1284)
!1289 = !DILocation(line: 511, column: 22, scope: !1284)
!1290 = !DILocation(line: 511, column: 25, scope: !1284)
!1291 = !DILocation(line: 511, column: 28, scope: !1284)
!1292 = !DILocation(line: 511, column: 2, scope: !1284)
!1293 = !DILocation(line: 512, column: 1, scope: !1284)
!1294 = distinct !DISubprogram(name: "BM_iter_step", scope: !1123, file: !1123, line: 40, type: !1295, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !186)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!97, !1126}
!1297 = !DILocalVariable(name: "iter", arg: 1, scope: !1294, file: !1123, line: 40, type: !1126)
!1298 = !DILocation(line: 40, column: 39, scope: !1294)
!1299 = !DILocation(line: 42, column: 9, scope: !1294)
!1300 = !DILocation(line: 42, column: 15, scope: !1294)
!1301 = !DILocation(line: 42, column: 20, scope: !1294)
!1302 = !DILocation(line: 42, column: 2, scope: !1294)
!1303 = distinct !DISubprogram(name: "BM_vert_normal_update", scope: !1, file: !1, line: 428, type: !1304, scopeLine: 429, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !186)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{null, !107}
!1306 = !DILocalVariable(name: "v", arg: 1, scope: !1303, file: !1, line: 428, type: !107)
!1307 = !DILocation(line: 428, column: 36, scope: !1303)
!1308 = !DILocalVariable(name: "liter", scope: !1303, file: !1, line: 432, type: !1013)
!1309 = !DILocation(line: 432, column: 9, scope: !1303)
!1310 = !DILocalVariable(name: "l", scope: !1303, file: !1, line: 433, type: !154)
!1311 = !DILocation(line: 433, column: 10, scope: !1303)
!1312 = !DILocalVariable(name: "vec1", scope: !1303, file: !1, line: 434, type: !129)
!1313 = !DILocation(line: 434, column: 8, scope: !1303)
!1314 = !DILocalVariable(name: "vec2", scope: !1303, file: !1, line: 434, type: !129)
!1315 = !DILocation(line: 434, column: 17, scope: !1303)
!1316 = !DILocalVariable(name: "fac", scope: !1303, file: !1, line: 434, type: !90)
!1317 = !DILocation(line: 434, column: 26, scope: !1303)
!1318 = !DILocalVariable(name: "len", scope: !1303, file: !1, line: 435, type: !117)
!1319 = !DILocation(line: 435, column: 6, scope: !1303)
