; ModuleID = 'blender/source/blender/editors/space_view3d/space_view3d.c'
source_filename = "blender/source/blender/editors/space_view3d/space_view3d.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!944 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!945 = !{!946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957}
!946 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!947 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!948 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!949 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!950 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!951 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!952 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!953 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!954 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!955 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!956 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!957 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!958 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 619, baseType: !7, size: 32, elements: !959)
!959 = !{!960, !961, !962}
!960 = !DIEnumerator(name: "OB_RESTRICT_VIEW", value: 1, isUnsigned: true)
!961 = !DIEnumerator(name: "OB_RESTRICT_SELECT", value: 2, isUnsigned: true)
!962 = !DIEnumerator(name: "OB_RESTRICT_RENDER", value: 4, isUnsigned: true)
!963 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !964, line: 180, baseType: !7, size: 32, elements: !965)
!964 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!965 = !{!966, !967}
!966 = !DIEnumerator(name: "CTX_DATA_TYPE_POINTER", value: 0, isUnsigned: true)
!967 = !DIEnumerator(name: "CTX_DATA_TYPE_COLLECTION", value: 1, isUnsigned: true)
!968 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !43, line: 666, baseType: !7, size: 32, elements: !969)
!969 = !{!970, !971, !972, !973, !974, !975, !976, !977}
!970 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!971 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!972 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!973 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!974 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!975 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!976 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!977 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!978 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !979, line: 776, baseType: !7, size: 32, elements: !980)
!979 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!980 = !{!981, !982, !983}
!981 = !DIEnumerator(name: "GAME_MAT_TEXFACE", value: 0, isUnsigned: true)
!982 = !DIEnumerator(name: "GAME_MAT_MULTITEX", value: 1, isUnsigned: true)
!983 = !DIEnumerator(name: "GAME_MAT_GLSL", value: 2, isUnsigned: true)
!984 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !985, line: 43, baseType: !7, size: 32, elements: !986)
!985 = !DIFile(filename: "blender/source/blender/windowmanager/wm_cursors.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!986 = !{!987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!987 = !DIEnumerator(name: "CURSOR_FACESEL", value: 1000, isUnsigned: true)
!988 = !DIEnumerator(name: "CURSOR_WAIT", value: 1001, isUnsigned: true)
!989 = !DIEnumerator(name: "CURSOR_EDIT", value: 1002, isUnsigned: true)
!990 = !DIEnumerator(name: "CURSOR_X_MOVE", value: 1003, isUnsigned: true)
!991 = !DIEnumerator(name: "CURSOR_Y_MOVE", value: 1004, isUnsigned: true)
!992 = !DIEnumerator(name: "CURSOR_HELP", value: 1005, isUnsigned: true)
!993 = !DIEnumerator(name: "CURSOR_STD", value: 1006, isUnsigned: true)
!994 = !DIEnumerator(name: "CURSOR_NONE", value: 1007, isUnsigned: true)
!995 = !DIEnumerator(name: "CURSOR_PENCIL", value: 1008, isUnsigned: true)
!996 = !DIEnumerator(name: "CURSOR_COPY", value: 1009, isUnsigned: true)
!997 = !{!998, !999, !1880, !3084, !1066, !1555, !3086}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "View3D", file: !1001, line: 221, baseType: !1002)
!1001 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view3d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View3D", file: !1001, line: 151, size: 3008, elements: !1003)
!1003 = !{!1004, !1026, !1027, !1028, !1029, !1030, !1031, !1035, !1036, !1037, !1039, !1043, !1044, !1045, !1046, !1047, !3023, !3024, !3025, !3026, !3049, !3051, !3052, !3053, !3054, !3055, !3056, !3057, !3058, !3059, !3060, !3061, !3062, !3063, !3064, !3065, !3066, !3067, !3068, !3069, !3070, !3071, !3072, !3073, !3074, !3075, !3076, !3077, !3078, !3079, !3080, !3081, !3082, !3083}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1002, file: !1001, line: 152, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !18, line: 85, size: 448, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1017, !1019, !1021}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1006, file: !18, line: 86, baseType: !1005, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1006, file: !18, line: 86, baseType: !1005, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1006, file: !18, line: 87, baseType: !1011, size: 128, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1012, line: 71, baseType: !1013)
!1012 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1012, line: 69, size: 128, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1013, file: !1012, line: 70, baseType: !998, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1013, file: !1012, line: 70, baseType: !998, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1006, file: !18, line: 88, baseType: !1018, size: 32, offset: 256)
!1018 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1006, file: !18, line: 89, baseType: !1020, size: 32, offset: 288)
!1020 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1006, file: !18, line: 90, baseType: !1022, size: 128, offset: 320)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1023, size: 128, elements: !1024)
!1023 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1024 = !{!1025}
!1025 = !DISubrange(count: 8)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1002, file: !1001, line: 152, baseType: !1005, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1002, file: !1001, line: 153, baseType: !1011, size: 128, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1002, file: !1001, line: 154, baseType: !1018, size: 32, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1002, file: !1001, line: 155, baseType: !1020, size: 32, offset: 288)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1002, file: !1001, line: 156, baseType: !1022, size: 128, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "viewquat", scope: !1002, file: !1001, line: 158, baseType: !1032, size: 128, offset: 448)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 128, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 4)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1002, file: !1001, line: 159, baseType: !1020, size: 32, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_size", scope: !1002, file: !1001, line: 161, baseType: !1020, size: 32, offset: 608)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_drawtype", scope: !1002, file: !1001, line: 162, baseType: !1038, size: 8, offset: 640)
!1038 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1002, file: !1001, line: 163, baseType: !1040, size: 24, offset: 648)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 24, elements: !1041)
!1041 = !{!1042}
!1042 = !DISubrange(count: 3)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lay_prev", scope: !1002, file: !1001, line: 165, baseType: !7, size: 32, offset: 672)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lay_used", scope: !1002, file: !1001, line: 166, baseType: !7, size: 32, offset: 704)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "persp", scope: !1002, file: !1001, line: 168, baseType: !1023, size: 16, offset: 736)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1002, file: !1001, line: 169, baseType: !1023, size: 16, offset: 752)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1002, file: !1001, line: 171, baseType: !1048, size: 64, offset: 768)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !43, line: 115, size: 11392, elements: !1050)
!1050 = !{!1051, !1113, !1117, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1134, !1143, !1157, !1158, !1200, !1201, !1204, !1205, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2959, !2960, !2961, !2962, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2972, !2973, !2976, !2979, !2980, !2981, !2982, !2983, !2984, !2987, !2990, !2993, !2994, !2995, !2996, !2997, !2998, !2999, !3000, !3001, !3004, !3007, !3008, !3011, !3012}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1049, file: !43, line: 116, baseType: !1052, size: 960)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1053, line: 130, baseType: !1054)
!1053 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1053, line: 117, size: 960, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1060, !1079, !1083, !1084, !1085, !1086, !1087}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1054, file: !1053, line: 118, baseType: !998, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1054, file: !1053, line: 118, baseType: !998, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1054, file: !1053, line: 119, baseType: !1059, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1054, file: !1053, line: 120, baseType: !1061, size: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1053, line: 136, size: 17600, elements: !1063)
!1063 = !{!1064, !1065, !1067, !1070, !1074, !1075, !1076}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1062, file: !1053, line: 137, baseType: !1052, size: 960)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1062, file: !1053, line: 138, baseType: !1066, size: 64, offset: 960)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1062, file: !1053, line: 139, baseType: !1068, size: 64, offset: 1024)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1053, line: 43, flags: DIFlagFwdDecl)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1062, file: !1053, line: 140, baseType: !1071, size: 8192, offset: 1088)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 8192, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 1024)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1062, file: !1053, line: 141, baseType: !1071, size: 8192, offset: 9280)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1062, file: !1053, line: 148, baseType: !1061, size: 64, offset: 17472)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1062, file: !1053, line: 150, baseType: !1077, size: 64, offset: 17536)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1053, line: 45, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1054, file: !1053, line: 121, baseType: !1080, size: 528, offset: 256)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 528, elements: !1081)
!1081 = !{!1082}
!1082 = !DISubrange(count: 66)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1054, file: !1053, line: 126, baseType: !1023, size: 16, offset: 784)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1054, file: !1053, line: 127, baseType: !1018, size: 32, offset: 800)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1054, file: !1053, line: 128, baseType: !1018, size: 32, offset: 832)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1054, file: !1053, line: 128, baseType: !1018, size: 32, offset: 864)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1054, file: !1053, line: 129, baseType: !1088, size: 64, offset: 896)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1053, line: 75, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1053, line: 62, size: 1024, elements: !1091)
!1091 = !{!1092, !1094, !1095, !1096, !1097, !1098, !1102, !1103, !1111, !1112}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !1053, line: 63, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1090, file: !1053, line: 63, baseType: !1093, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1090, file: !1053, line: 64, baseType: !1038, size: 8, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1090, file: !1053, line: 64, baseType: !1038, size: 8, offset: 136)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1090, file: !1053, line: 65, baseType: !1023, size: 16, offset: 144)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1090, file: !1053, line: 66, baseType: !1099, size: 512, offset: 160)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 512, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1090, file: !1053, line: 67, baseType: !1018, size: 32, offset: 672)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1090, file: !1053, line: 69, baseType: !1104, size: 256, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1053, line: 60, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1053, line: 48, size: 256, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1105, file: !1053, line: 49, baseType: !998, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1105, file: !1053, line: 58, baseType: !1011, size: 128, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1105, file: !1053, line: 59, baseType: !1018, size: 32, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1105, file: !1053, line: 59, baseType: !1018, size: 32, offset: 224)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1090, file: !1053, line: 70, baseType: !1018, size: 32, offset: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1090, file: !1053, line: 74, baseType: !1018, size: 32, offset: 992)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1049, file: !43, line: 117, baseType: !1114, size: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1116, line: 48, flags: DIFlagFwdDecl)
!1116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1049, file: !43, line: 119, baseType: !1118, size: 64, offset: 1024)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !43, line: 57, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1049, file: !43, line: 121, baseType: !1023, size: 16, offset: 1088)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1049, file: !43, line: 121, baseType: !1023, size: 16, offset: 1104)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1049, file: !43, line: 122, baseType: !1018, size: 32, offset: 1120)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1049, file: !43, line: 122, baseType: !1018, size: 32, offset: 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1049, file: !43, line: 122, baseType: !1018, size: 32, offset: 1184)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1049, file: !43, line: 123, baseType: !1099, size: 512, offset: 1216)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1049, file: !43, line: 124, baseType: !1048, size: 64, offset: 1728)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1049, file: !43, line: 124, baseType: !1048, size: 64, offset: 1792)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1049, file: !43, line: 127, baseType: !1048, size: 64, offset: 1856)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1049, file: !43, line: 127, baseType: !1048, size: 64, offset: 1920)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1049, file: !43, line: 127, baseType: !1048, size: 64, offset: 1984)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1049, file: !43, line: 128, baseType: !1132, size: 64, offset: 2048)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1116, line: 49, flags: DIFlagFwdDecl)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1049, file: !43, line: 130, baseType: !1135, size: 64, offset: 2112)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !43, line: 97, size: 832, elements: !1137)
!1137 = !{!1138, !1141, !1142}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1136, file: !43, line: 98, baseType: !1139, size: 768)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 768, elements: !1140)
!1140 = !{!1025, !1042}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1136, file: !43, line: 99, baseType: !1018, size: 32, offset: 768)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1136, file: !43, line: 99, baseType: !1018, size: 32, offset: 800)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1049, file: !43, line: 131, baseType: !1144, size: 64, offset: 2176)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1146, line: 486, size: 1600, elements: !1147)
!1146 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1145, file: !1146, line: 487, baseType: !1052, size: 960)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1145, file: !1146, line: 489, baseType: !1011, size: 128, offset: 960)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1145, file: !1146, line: 490, baseType: !1011, size: 128, offset: 1088)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1145, file: !1146, line: 491, baseType: !1011, size: 128, offset: 1216)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1145, file: !1146, line: 492, baseType: !1011, size: 128, offset: 1344)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1145, file: !1146, line: 494, baseType: !1018, size: 32, offset: 1472)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1145, file: !1146, line: 495, baseType: !1018, size: 32, offset: 1504)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1145, file: !1146, line: 497, baseType: !1018, size: 32, offset: 1536)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1145, file: !1146, line: 498, baseType: !1018, size: 32, offset: 1568)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1049, file: !43, line: 132, baseType: !1144, size: 64, offset: 2240)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1049, file: !43, line: 133, baseType: !1159, size: 64, offset: 2304)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1146, line: 334, size: 1728, elements: !1161)
!1161 = !{!1162, !1163, !1166, !1167, !1168, !1169, !1170, !1171, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1199}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1160, file: !1146, line: 335, baseType: !1011, size: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1160, file: !1146, line: 336, baseType: !1164, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1146, line: 47, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1160, file: !1146, line: 338, baseType: !1023, size: 16, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1160, file: !1146, line: 338, baseType: !1023, size: 16, offset: 208)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1160, file: !1146, line: 339, baseType: !7, size: 32, offset: 224)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1160, file: !1146, line: 340, baseType: !1018, size: 32, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1160, file: !1146, line: 342, baseType: !1020, size: 32, offset: 288)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1160, file: !1146, line: 343, baseType: !1172, size: 96, offset: 320)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 96, elements: !1041)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1160, file: !1146, line: 344, baseType: !1172, size: 96, offset: 416)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1160, file: !1146, line: 347, baseType: !1011, size: 128, offset: 512)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1160, file: !1146, line: 349, baseType: !1018, size: 32, offset: 640)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1160, file: !1146, line: 350, baseType: !1018, size: 32, offset: 672)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1160, file: !1146, line: 351, baseType: !998, size: 64, offset: 704)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1160, file: !1146, line: 352, baseType: !998, size: 64, offset: 768)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1160, file: !1146, line: 354, baseType: !1180, size: 384, offset: 832)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1146, line: 116, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1146, line: 94, size: 384, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1181, file: !1146, line: 96, baseType: !1018, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1181, file: !1146, line: 96, baseType: !1018, size: 32, offset: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1181, file: !1146, line: 97, baseType: !1018, size: 32, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1181, file: !1146, line: 97, baseType: !1018, size: 32, offset: 96)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1181, file: !1146, line: 99, baseType: !1023, size: 16, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1181, file: !1146, line: 100, baseType: !1023, size: 16, offset: 144)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1181, file: !1146, line: 102, baseType: !1023, size: 16, offset: 160)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1181, file: !1146, line: 105, baseType: !1023, size: 16, offset: 176)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1181, file: !1146, line: 108, baseType: !1023, size: 16, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1181, file: !1146, line: 109, baseType: !1023, size: 16, offset: 208)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1181, file: !1146, line: 111, baseType: !1023, size: 16, offset: 224)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1181, file: !1146, line: 112, baseType: !1023, size: 16, offset: 240)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1181, file: !1146, line: 114, baseType: !1018, size: 32, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1181, file: !1146, line: 114, baseType: !1018, size: 32, offset: 288)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1181, file: !1146, line: 115, baseType: !1018, size: 32, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1181, file: !1146, line: 115, baseType: !1018, size: 32, offset: 352)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1160, file: !1146, line: 355, baseType: !1099, size: 512, offset: 1216)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1049, file: !43, line: 134, baseType: !998, size: 64, offset: 2368)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1049, file: !43, line: 136, baseType: !1202, size: 64, offset: 2432)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !43, line: 58, flags: DIFlagFwdDecl)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1049, file: !43, line: 138, baseType: !1180, size: 384, offset: 2496)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1049, file: !43, line: 139, baseType: !1206, size: 64, offset: 2880)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1146, line: 80, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1146, line: 72, size: 192, elements: !1209)
!1209 = !{!1210, !1217, !1218, !1219, !1220}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1208, file: !1146, line: 73, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1146, line: 59, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1146, line: 56, size: 128, elements: !1214)
!1214 = !{!1215, !1216}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1213, file: !1146, line: 57, baseType: !1172, size: 96)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1213, file: !1146, line: 58, baseType: !1018, size: 32, offset: 96)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1208, file: !1146, line: 74, baseType: !1018, size: 32, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1208, file: !1146, line: 76, baseType: !1018, size: 32, offset: 96)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1208, file: !1146, line: 77, baseType: !1018, size: 32, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1208, file: !1146, line: 79, baseType: !1018, size: 32, offset: 160)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1049, file: !43, line: 141, baseType: !1011, size: 128, offset: 2944)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1049, file: !43, line: 142, baseType: !1011, size: 128, offset: 3072)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1049, file: !43, line: 143, baseType: !1011, size: 128, offset: 3200)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1049, file: !43, line: 144, baseType: !1011, size: 128, offset: 3328)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1049, file: !43, line: 146, baseType: !1018, size: 32, offset: 3456)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1049, file: !43, line: 147, baseType: !1018, size: 32, offset: 3488)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1049, file: !43, line: 150, baseType: !1228, size: 64, offset: 3520)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1116, line: 93, size: 7552, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1280, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !2889}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1230, file: !1116, line: 94, baseType: !1052, size: 960)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1230, file: !1116, line: 95, baseType: !1114, size: 64, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !1230, file: !1116, line: 97, baseType: !1023, size: 16, offset: 1024)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1230, file: !1116, line: 97, baseType: !1023, size: 16, offset: 1040)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1230, file: !1116, line: 99, baseType: !1020, size: 32, offset: 1056)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1230, file: !1116, line: 99, baseType: !1020, size: 32, offset: 1088)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1230, file: !1116, line: 99, baseType: !1020, size: 32, offset: 1120)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !1230, file: !1116, line: 100, baseType: !1020, size: 32, offset: 1152)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !1230, file: !1116, line: 100, baseType: !1020, size: 32, offset: 1184)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !1230, file: !1116, line: 100, baseType: !1020, size: 32, offset: 1216)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !1230, file: !1116, line: 101, baseType: !1020, size: 32, offset: 1248)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !1230, file: !1116, line: 101, baseType: !1020, size: 32, offset: 1280)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !1230, file: !1116, line: 101, baseType: !1020, size: 32, offset: 1312)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1230, file: !1116, line: 102, baseType: !1020, size: 32, offset: 1344)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1230, file: !1116, line: 102, baseType: !1020, size: 32, offset: 1376)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1230, file: !1116, line: 102, baseType: !1020, size: 32, offset: 1408)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !1230, file: !1116, line: 103, baseType: !1020, size: 32, offset: 1440)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !1230, file: !1116, line: 103, baseType: !1020, size: 32, offset: 1472)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !1230, file: !1116, line: 103, baseType: !1020, size: 32, offset: 1504)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !1230, file: !1116, line: 103, baseType: !1020, size: 32, offset: 1536)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !1230, file: !1116, line: 103, baseType: !1020, size: 32, offset: 1568)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1230, file: !1116, line: 104, baseType: !1020, size: 32, offset: 1600)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1230, file: !1116, line: 104, baseType: !1020, size: 32, offset: 1632)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !1230, file: !1116, line: 104, baseType: !1020, size: 32, offset: 1664)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !1230, file: !1116, line: 104, baseType: !1020, size: 32, offset: 1696)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !1230, file: !1116, line: 104, baseType: !1020, size: 32, offset: 1728)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !1230, file: !1116, line: 105, baseType: !1020, size: 32, offset: 1760)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !1230, file: !1116, line: 108, baseType: !1260, size: 704, offset: 1792)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !1116, line: 53, size: 704, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1260, file: !1116, line: 54, baseType: !1020, size: 32)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !1260, file: !1116, line: 55, baseType: !1020, size: 32, offset: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !1260, file: !1116, line: 56, baseType: !1020, size: 32, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !1260, file: !1116, line: 57, baseType: !1020, size: 32, offset: 96)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !1260, file: !1116, line: 59, baseType: !1172, size: 96, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !1260, file: !1116, line: 60, baseType: !1172, size: 96, offset: 224)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !1260, file: !1116, line: 61, baseType: !1172, size: 96, offset: 320)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !1260, file: !1116, line: 63, baseType: !1020, size: 32, offset: 416)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !1260, file: !1116, line: 64, baseType: !1020, size: 32, offset: 448)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !1260, file: !1116, line: 65, baseType: !1020, size: 32, offset: 480)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !1260, file: !1116, line: 67, baseType: !1023, size: 16, offset: 512)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !1260, file: !1116, line: 68, baseType: !1023, size: 16, offset: 528)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !1260, file: !1116, line: 69, baseType: !1023, size: 16, offset: 544)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !1260, file: !1116, line: 70, baseType: !1023, size: 16, offset: 560)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !1260, file: !1116, line: 72, baseType: !1020, size: 32, offset: 576)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !1260, file: !1116, line: 73, baseType: !1020, size: 32, offset: 608)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !1260, file: !1116, line: 74, baseType: !1020, size: 32, offset: 640)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !1260, file: !1116, line: 75, baseType: !1020, size: 32, offset: 672)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !1230, file: !1116, line: 109, baseType: !1281, size: 128, offset: 2496)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !1116, line: 79, size: 128, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1281, file: !1116, line: 80, baseType: !1018, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !1281, file: !1116, line: 81, baseType: !1018, size: 32, offset: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !1281, file: !1116, line: 82, baseType: !1018, size: 32, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1281, file: !1116, line: 83, baseType: !1018, size: 32, offset: 96)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !1230, file: !1116, line: 111, baseType: !1020, size: 32, offset: 2624)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !1230, file: !1116, line: 111, baseType: !1020, size: 32, offset: 2656)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !1230, file: !1116, line: 112, baseType: !1020, size: 32, offset: 2688)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !1230, file: !1116, line: 112, baseType: !1020, size: 32, offset: 2720)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1230, file: !1116, line: 113, baseType: !1020, size: 32, offset: 2752)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !1230, file: !1116, line: 114, baseType: !1020, size: 32, offset: 2784)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !1230, file: !1116, line: 114, baseType: !1020, size: 32, offset: 2816)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !1230, file: !1116, line: 115, baseType: !1023, size: 16, offset: 2848)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !1230, file: !1116, line: 115, baseType: !1023, size: 16, offset: 2864)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !1230, file: !1116, line: 116, baseType: !1023, size: 16, offset: 2880)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !1230, file: !1116, line: 117, baseType: !1038, size: 8, offset: 2896)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !1230, file: !1116, line: 117, baseType: !1038, size: 8, offset: 2904)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !1230, file: !1116, line: 119, baseType: !1020, size: 32, offset: 2912)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !1230, file: !1116, line: 119, baseType: !1020, size: 32, offset: 2944)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !1230, file: !1116, line: 120, baseType: !1023, size: 16, offset: 2976)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !1230, file: !1116, line: 120, baseType: !1023, size: 16, offset: 2992)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !1230, file: !1116, line: 121, baseType: !1020, size: 32, offset: 3008)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !1230, file: !1116, line: 121, baseType: !1020, size: 32, offset: 3040)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !1230, file: !1116, line: 122, baseType: !1020, size: 32, offset: 3072)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !1230, file: !1116, line: 123, baseType: !1020, size: 32, offset: 3104)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !1230, file: !1116, line: 124, baseType: !1023, size: 16, offset: 3136)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !1230, file: !1116, line: 125, baseType: !1023, size: 16, offset: 3152)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1230, file: !1116, line: 127, baseType: !1018, size: 32, offset: 3168)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !1230, file: !1116, line: 127, baseType: !1018, size: 32, offset: 3200)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !1230, file: !1116, line: 128, baseType: !1018, size: 32, offset: 3232)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !1230, file: !1116, line: 128, baseType: !1018, size: 32, offset: 3264)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !1230, file: !1116, line: 129, baseType: !1023, size: 16, offset: 3296)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !1230, file: !1116, line: 129, baseType: !1023, size: 16, offset: 3312)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !1230, file: !1116, line: 129, baseType: !1023, size: 16, offset: 3328)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !1230, file: !1116, line: 129, baseType: !1023, size: 16, offset: 3344)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !1230, file: !1116, line: 130, baseType: !1020, size: 32, offset: 3360)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !1230, file: !1116, line: 130, baseType: !1020, size: 32, offset: 3392)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !1230, file: !1116, line: 130, baseType: !1020, size: 32, offset: 3424)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !1230, file: !1116, line: 130, baseType: !1020, size: 32, offset: 3456)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !1230, file: !1116, line: 131, baseType: !1020, size: 32, offset: 3488)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !1230, file: !1116, line: 131, baseType: !1020, size: 32, offset: 3520)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !1230, file: !1116, line: 131, baseType: !1020, size: 32, offset: 3552)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !1230, file: !1116, line: 131, baseType: !1020, size: 32, offset: 3584)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !1230, file: !1116, line: 132, baseType: !1020, size: 32, offset: 3616)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !1230, file: !1116, line: 132, baseType: !1020, size: 32, offset: 3648)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !1230, file: !1116, line: 133, baseType: !1099, size: 512, offset: 3680)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !1230, file: !1116, line: 135, baseType: !1020, size: 32, offset: 4192)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !1230, file: !1116, line: 136, baseType: !1020, size: 32, offset: 4224)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !1230, file: !1116, line: 137, baseType: !1020, size: 32, offset: 4256)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !1230, file: !1116, line: 138, baseType: !1018, size: 32, offset: 4288)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !1230, file: !1116, line: 141, baseType: !1038, size: 8, offset: 4320)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1230, file: !1116, line: 141, baseType: !1038, size: 8, offset: 4328)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !1230, file: !1116, line: 141, baseType: !1038, size: 8, offset: 4336)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1230, file: !1116, line: 141, baseType: !1038, size: 8, offset: 4344)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !1230, file: !1116, line: 142, baseType: !1023, size: 16, offset: 4352)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !1230, file: !1116, line: 142, baseType: !1023, size: 16, offset: 4368)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !1230, file: !1116, line: 142, baseType: !1023, size: 16, offset: 4384)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !1230, file: !1116, line: 145, baseType: !1038, size: 8, offset: 4400)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1230, file: !1116, line: 145, baseType: !1038, size: 8, offset: 4408)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !1230, file: !1116, line: 148, baseType: !1023, size: 16, offset: 4416)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !1230, file: !1116, line: 148, baseType: !1023, size: 16, offset: 4432)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !1230, file: !1116, line: 149, baseType: !1020, size: 32, offset: 4448)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !1230, file: !1116, line: 149, baseType: !1020, size: 32, offset: 4480)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1230, file: !1116, line: 152, baseType: !1032, size: 128, offset: 4512)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !1230, file: !1116, line: 153, baseType: !1020, size: 32, offset: 4640)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !1230, file: !1116, line: 154, baseType: !1020, size: 32, offset: 4672)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1230, file: !1116, line: 157, baseType: !1023, size: 16, offset: 4704)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1230, file: !1116, line: 157, baseType: !1023, size: 16, offset: 4720)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !1230, file: !1116, line: 160, baseType: !1351, size: 64, offset: 4736)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !1353, line: 113, size: 6208, elements: !1354)
!1353 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1354 = !{!1355, !1356, !1357, !1358, !1359, !1360, !1364}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1352, file: !1353, line: 114, baseType: !1023, size: 16)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1352, file: !1353, line: 114, baseType: !1023, size: 16, offset: 16)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1352, file: !1353, line: 115, baseType: !1038, size: 8, offset: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1352, file: !1353, line: 115, baseType: !1038, size: 8, offset: 40)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1352, file: !1353, line: 116, baseType: !1038, size: 8, offset: 48)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1352, file: !1353, line: 117, baseType: !1361, size: 8, offset: 56)
!1361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 8, elements: !1362)
!1362 = !{!1363}
!1363 = !DISubrange(count: 1)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1352, file: !1353, line: 119, baseType: !1365, size: 6144, offset: 64)
!1365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1366, size: 6144, elements: !1375)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !1353, line: 109, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !1353, line: 106, size: 192, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1372, !1373, !1374}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1367, file: !1353, line: 107, baseType: !1020, size: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1367, file: !1353, line: 107, baseType: !1020, size: 32, offset: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1367, file: !1353, line: 107, baseType: !1020, size: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1367, file: !1353, line: 107, baseType: !1020, size: 32, offset: 96)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1367, file: !1353, line: 107, baseType: !1020, size: 32, offset: 128)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1367, file: !1353, line: 108, baseType: !1018, size: 32, offset: 160)
!1375 = !{!1376}
!1376 = !DISubrange(count: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !1230, file: !1116, line: 161, baseType: !1351, size: 64, offset: 4800)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !1230, file: !1116, line: 162, baseType: !1038, size: 8, offset: 4864)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !1230, file: !1116, line: 162, baseType: !1038, size: 8, offset: 4872)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !1230, file: !1116, line: 163, baseType: !1038, size: 8, offset: 4880)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !1230, file: !1116, line: 163, baseType: !1038, size: 8, offset: 4888)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !1230, file: !1116, line: 164, baseType: !1023, size: 16, offset: 4896)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1230, file: !1116, line: 164, baseType: !1023, size: 16, offset: 4912)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !1230, file: !1116, line: 165, baseType: !1020, size: 32, offset: 4928)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !1230, file: !1116, line: 165, baseType: !1020, size: 32, offset: 4960)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1230, file: !1116, line: 167, baseType: !1387, size: 1152, offset: 4992)
!1387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1388, size: 1152, elements: !2847)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1353, line: 57, size: 2496, elements: !1390)
!1390 = !{!1391, !1392, !1393, !1394, !1395, !1396, !2788, !2789, !2790, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1389, file: !1353, line: 59, baseType: !1023, size: 16)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1389, file: !1353, line: 59, baseType: !1023, size: 16, offset: 16)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1389, file: !1353, line: 59, baseType: !1023, size: 16, offset: 32)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1389, file: !1353, line: 59, baseType: !1023, size: 16, offset: 48)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1389, file: !1353, line: 60, baseType: !1048, size: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1389, file: !1353, line: 61, baseType: !1397, size: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1353, line: 202, size: 3328, elements: !1399)
!1399 = !{!1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !2698, !2699, !2700, !2701, !2702, !2728, !2729, !2758, !2778, !2786, !2787}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1398, file: !1353, line: 203, baseType: !1052, size: 960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1398, file: !1353, line: 204, baseType: !1114, size: 64, offset: 960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1398, file: !1353, line: 206, baseType: !1020, size: 32, offset: 1024)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1398, file: !1353, line: 206, baseType: !1020, size: 32, offset: 1056)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1398, file: !1353, line: 207, baseType: !1020, size: 32, offset: 1088)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1398, file: !1353, line: 207, baseType: !1020, size: 32, offset: 1120)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1398, file: !1353, line: 207, baseType: !1020, size: 32, offset: 1152)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1398, file: !1353, line: 207, baseType: !1020, size: 32, offset: 1184)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1398, file: !1353, line: 207, baseType: !1020, size: 32, offset: 1216)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1398, file: !1353, line: 207, baseType: !1020, size: 32, offset: 1248)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1398, file: !1353, line: 208, baseType: !1020, size: 32, offset: 1280)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1398, file: !1353, line: 208, baseType: !1020, size: 32, offset: 1312)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1398, file: !1353, line: 211, baseType: !1020, size: 32, offset: 1344)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1398, file: !1353, line: 211, baseType: !1020, size: 32, offset: 1376)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1398, file: !1353, line: 211, baseType: !1020, size: 32, offset: 1408)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1398, file: !1353, line: 211, baseType: !1020, size: 32, offset: 1440)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1398, file: !1353, line: 211, baseType: !1020, size: 32, offset: 1472)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1398, file: !1353, line: 214, baseType: !1020, size: 32, offset: 1504)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1398, file: !1353, line: 214, baseType: !1020, size: 32, offset: 1536)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1398, file: !1353, line: 217, baseType: !1020, size: 32, offset: 1568)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1398, file: !1353, line: 218, baseType: !1020, size: 32, offset: 1600)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1398, file: !1353, line: 219, baseType: !1020, size: 32, offset: 1632)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1398, file: !1353, line: 220, baseType: !1020, size: 32, offset: 1664)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1398, file: !1353, line: 221, baseType: !1020, size: 32, offset: 1696)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1398, file: !1353, line: 222, baseType: !1023, size: 16, offset: 1728)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1398, file: !1353, line: 222, baseType: !1023, size: 16, offset: 1744)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1398, file: !1353, line: 224, baseType: !1023, size: 16, offset: 1760)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1398, file: !1353, line: 224, baseType: !1023, size: 16, offset: 1776)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1398, file: !1353, line: 227, baseType: !1023, size: 16, offset: 1792)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1398, file: !1353, line: 227, baseType: !1023, size: 16, offset: 1808)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1398, file: !1353, line: 229, baseType: !1023, size: 16, offset: 1824)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1398, file: !1353, line: 229, baseType: !1023, size: 16, offset: 1840)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1398, file: !1353, line: 230, baseType: !1023, size: 16, offset: 1856)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1398, file: !1353, line: 230, baseType: !1023, size: 16, offset: 1872)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1398, file: !1353, line: 232, baseType: !1020, size: 32, offset: 1888)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1398, file: !1353, line: 232, baseType: !1020, size: 32, offset: 1920)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1398, file: !1353, line: 232, baseType: !1020, size: 32, offset: 1952)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1398, file: !1353, line: 232, baseType: !1020, size: 32, offset: 1984)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1398, file: !1353, line: 233, baseType: !1018, size: 32, offset: 2016)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1398, file: !1353, line: 234, baseType: !1018, size: 32, offset: 2048)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1398, file: !1353, line: 235, baseType: !1023, size: 16, offset: 2080)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1398, file: !1353, line: 235, baseType: !1023, size: 16, offset: 2096)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1398, file: !1353, line: 236, baseType: !1023, size: 16, offset: 2112)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1398, file: !1353, line: 239, baseType: !1023, size: 16, offset: 2128)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1398, file: !1353, line: 240, baseType: !1018, size: 32, offset: 2144)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1398, file: !1353, line: 241, baseType: !1018, size: 32, offset: 2176)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1398, file: !1353, line: 241, baseType: !1018, size: 32, offset: 2208)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1398, file: !1353, line: 241, baseType: !1018, size: 32, offset: 2240)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1398, file: !1353, line: 243, baseType: !1020, size: 32, offset: 2272)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1398, file: !1353, line: 243, baseType: !1020, size: 32, offset: 2304)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1398, file: !1353, line: 244, baseType: !1020, size: 32, offset: 2336)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1398, file: !1353, line: 246, baseType: !1452, size: 320, offset: 2368)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1453, line: 50, size: 320, elements: !1454)
!1453 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1454 = !{!1455, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2697}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1452, file: !1453, line: 51, baseType: !1456, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !979, line: 1216, size: 39680, elements: !1458)
!1458 = !{!1459, !1460, !1461, !1462, !1465, !1466, !1467, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1568, !2057, !2272, !2275, !2555, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2577, !2578, !2579, !2580, !2581, !2589, !2656, !2663, !2664, !2671, !2672, !2678, !2679, !2680, !2681, !2682}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1457, file: !979, line: 1217, baseType: !1052, size: 960)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1457, file: !979, line: 1218, baseType: !1114, size: 64, offset: 960)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1457, file: !979, line: 1220, baseType: !1048, size: 64, offset: 1024)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1457, file: !979, line: 1221, baseType: !1463, size: 64, offset: 1088)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !979, line: 52, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1457, file: !979, line: 1223, baseType: !1456, size: 64, offset: 1152)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1457, file: !979, line: 1225, baseType: !1011, size: 128, offset: 1216)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1457, file: !979, line: 1226, baseType: !1468, size: 64, offset: 1344)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !979, line: 69, size: 320, elements: !1470)
!1470 = !{!1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1469, file: !979, line: 70, baseType: !1468, size: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1469, file: !979, line: 70, baseType: !1468, size: 64, offset: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1469, file: !979, line: 71, baseType: !7, size: 32, offset: 128)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1469, file: !979, line: 71, baseType: !7, size: 32, offset: 160)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1469, file: !979, line: 72, baseType: !1018, size: 32, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1469, file: !979, line: 73, baseType: !1023, size: 16, offset: 224)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1469, file: !979, line: 73, baseType: !1023, size: 16, offset: 240)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1469, file: !979, line: 74, baseType: !1048, size: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1457, file: !979, line: 1227, baseType: !1048, size: 64, offset: 1408)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1457, file: !979, line: 1229, baseType: !1172, size: 96, offset: 1472)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1457, file: !979, line: 1230, baseType: !1172, size: 96, offset: 1568)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1457, file: !979, line: 1231, baseType: !1172, size: 96, offset: 1664)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1457, file: !979, line: 1231, baseType: !1172, size: 96, offset: 1760)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1457, file: !979, line: 1233, baseType: !7, size: 32, offset: 1856)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1457, file: !979, line: 1234, baseType: !1018, size: 32, offset: 1888)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1457, file: !979, line: 1235, baseType: !7, size: 32, offset: 1920)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1457, file: !979, line: 1237, baseType: !1023, size: 16, offset: 1952)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1457, file: !979, line: 1239, baseType: !1038, size: 8, offset: 1968)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1457, file: !979, line: 1240, baseType: !1361, size: 8, offset: 1976)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1457, file: !979, line: 1242, baseType: !1491, size: 64, offset: 1984)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1493, line: 328, size: 3456, elements: !1494)
!1493 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1494 = !{!1495, !1496, !1497, !1500, !1501, !1505, !1506, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1533, !1534, !1535, !1538, !1543, !1544, !1547, !1551, !1556, !1560, !1564, !1565, !1566, !1567}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1492, file: !1493, line: 329, baseType: !1052, size: 960)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1492, file: !1493, line: 330, baseType: !1114, size: 64, offset: 960)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1492, file: !1493, line: 332, baseType: !1498, size: 64, offset: 1024)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64)
!1499 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1493, line: 332, flags: DIFlagFwdDecl)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1492, file: !1493, line: 333, baseType: !1099, size: 512, offset: 1088)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1492, file: !1493, line: 335, baseType: !1502, size: 64, offset: 1600)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1504, line: 41, flags: DIFlagFwdDecl)
!1504 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1492, file: !1493, line: 337, baseType: !1202, size: 64, offset: 1664)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1492, file: !1493, line: 338, baseType: !1507, size: 64, offset: 1728)
!1507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 64, elements: !1508)
!1508 = !{!1509}
!1509 = !DISubrange(count: 2)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1492, file: !1493, line: 340, baseType: !1011, size: 128, offset: 1792)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1492, file: !1493, line: 340, baseType: !1011, size: 128, offset: 1920)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1492, file: !1493, line: 342, baseType: !1018, size: 32, offset: 2048)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1492, file: !1493, line: 342, baseType: !1018, size: 32, offset: 2080)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1492, file: !1493, line: 343, baseType: !1018, size: 32, offset: 2112)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1492, file: !1493, line: 345, baseType: !1018, size: 32, offset: 2144)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1492, file: !1493, line: 346, baseType: !1018, size: 32, offset: 2176)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1492, file: !1493, line: 347, baseType: !1023, size: 16, offset: 2208)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1492, file: !1493, line: 348, baseType: !1023, size: 16, offset: 2224)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1492, file: !1493, line: 349, baseType: !1018, size: 32, offset: 2240)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1492, file: !1493, line: 351, baseType: !1018, size: 32, offset: 2272)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1492, file: !1493, line: 353, baseType: !1023, size: 16, offset: 2304)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1492, file: !1493, line: 354, baseType: !1023, size: 16, offset: 2320)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1492, file: !1493, line: 355, baseType: !1018, size: 32, offset: 2336)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1492, file: !1493, line: 357, baseType: !1525, size: 128, offset: 2368)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1526, line: 95, baseType: !1527)
!1526 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1526, line: 92, size: 128, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1532}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1527, file: !1526, line: 93, baseType: !1020, size: 32)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1527, file: !1526, line: 93, baseType: !1020, size: 32, offset: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1527, file: !1526, line: 94, baseType: !1020, size: 32, offset: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1527, file: !1526, line: 94, baseType: !1020, size: 32, offset: 96)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1492, file: !1493, line: 363, baseType: !1011, size: 128, offset: 2496)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1492, file: !1493, line: 363, baseType: !1011, size: 128, offset: 2624)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1492, file: !1493, line: 368, baseType: !1536, size: 64, offset: 2752)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64)
!1537 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1493, line: 48, flags: DIFlagFwdDecl)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1492, file: !1493, line: 372, baseType: !1539, size: 32, offset: 2816)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1493, line: 274, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1493, line: 271, size: 32, elements: !1541)
!1541 = !{!1542}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1540, file: !1493, line: 273, baseType: !7, size: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1492, file: !1493, line: 373, baseType: !1018, size: 32, offset: 2848)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1492, file: !1493, line: 382, baseType: !1545, size: 64, offset: 2880)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64)
!1546 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1493, line: 46, flags: DIFlagFwdDecl)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1492, file: !1493, line: 385, baseType: !1548, size: 64, offset: 2944)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{null, !998, !1020}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1492, file: !1493, line: 386, baseType: !1552, size: 64, offset: 3008)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{null, !998, !1555}
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1492, file: !1493, line: 387, baseType: !1557, size: 64, offset: 3072)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!1018, !998}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1492, file: !1493, line: 388, baseType: !1561, size: 64, offset: 3136)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{null, !998}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1492, file: !1493, line: 389, baseType: !998, size: 64, offset: 3200)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1492, file: !1493, line: 389, baseType: !998, size: 64, offset: 3264)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1492, file: !1493, line: 389, baseType: !998, size: 64, offset: 3328)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1492, file: !1493, line: 389, baseType: !998, size: 64, offset: 3392)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1457, file: !979, line: 1244, baseType: !1569, size: 64, offset: 2048)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1571, line: 200, size: 17024, elements: !1572)
!1571 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1572 = !{!1573, !1575, !1576, !1577, !2050, !2051, !2052, !2053, !2054, !2055, !2056}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1570, file: !1571, line: 201, baseType: !1574, size: 64)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1570, file: !1571, line: 202, baseType: !1011, size: 128, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1570, file: !1571, line: 203, baseType: !1011, size: 128, offset: 192)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1570, file: !1571, line: 206, baseType: !1578, size: 64, offset: 320)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1571, line: 190, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1571, line: 126, size: 2816, elements: !1581)
!1581 = !{!1582, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1680, !1681, !1682, !1683, !2023, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1580, file: !1571, line: 127, baseType: !1583, size: 64)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1580, file: !1571, line: 127, baseType: !1583, size: 64, offset: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1580, file: !1571, line: 128, baseType: !998, size: 64, offset: 128)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1580, file: !1571, line: 129, baseType: !998, size: 64, offset: 192)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1580, file: !1571, line: 130, baseType: !1099, size: 512, offset: 256)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1580, file: !1571, line: 132, baseType: !1018, size: 32, offset: 768)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1580, file: !1571, line: 132, baseType: !1018, size: 32, offset: 800)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1580, file: !1571, line: 133, baseType: !1018, size: 32, offset: 832)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1580, file: !1571, line: 134, baseType: !1018, size: 32, offset: 864)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1580, file: !1571, line: 134, baseType: !1018, size: 32, offset: 896)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1580, file: !1571, line: 134, baseType: !1018, size: 32, offset: 928)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1580, file: !1571, line: 135, baseType: !1018, size: 32, offset: 960)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1580, file: !1571, line: 135, baseType: !1018, size: 32, offset: 992)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1580, file: !1571, line: 136, baseType: !1018, size: 32, offset: 1024)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1580, file: !1571, line: 136, baseType: !1018, size: 32, offset: 1056)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1580, file: !1571, line: 137, baseType: !1018, size: 32, offset: 1088)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1580, file: !1571, line: 137, baseType: !1018, size: 32, offset: 1120)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1580, file: !1571, line: 138, baseType: !1020, size: 32, offset: 1152)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1580, file: !1571, line: 139, baseType: !1020, size: 32, offset: 1184)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1580, file: !1571, line: 139, baseType: !1020, size: 32, offset: 1216)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1580, file: !1571, line: 141, baseType: !1023, size: 16, offset: 1248)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1580, file: !1571, line: 142, baseType: !1023, size: 16, offset: 1264)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1580, file: !1571, line: 143, baseType: !1018, size: 32, offset: 1280)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1580, file: !1571, line: 144, baseType: !1018, size: 32, offset: 1312)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1580, file: !1571, line: 146, baseType: !1608, size: 64, offset: 1344)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1571, line: 114, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1571, line: 99, size: 7232, elements: !1611)
!1611 = !{!1612, !1614, !1615, !1616, !1617, !1618, !1619, !1630, !1634, !1648, !1657, !1664, !1674}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1610, file: !1571, line: 100, baseType: !1613, size: 64)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1610, file: !1571, line: 100, baseType: !1613, size: 64, offset: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1610, file: !1571, line: 101, baseType: !1018, size: 32, offset: 128)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1610, file: !1571, line: 101, baseType: !1018, size: 32, offset: 160)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1610, file: !1571, line: 102, baseType: !1018, size: 32, offset: 192)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1610, file: !1571, line: 102, baseType: !1018, size: 32, offset: 224)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1610, file: !1571, line: 103, baseType: !1620, size: 64, offset: 256)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1571, line: 59, baseType: !1622)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1571, line: 56, size: 2112, elements: !1623)
!1623 = !{!1624, !1628, !1629}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1622, file: !1571, line: 57, baseType: !1625, size: 2048)
!1625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 2048, elements: !1626)
!1626 = !{!1627}
!1627 = !DISubrange(count: 256)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1622, file: !1571, line: 58, baseType: !1018, size: 32, offset: 2048)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1622, file: !1571, line: 58, baseType: !1018, size: 32, offset: 2080)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1610, file: !1571, line: 106, baseType: !1631, size: 6144, offset: 320)
!1631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 6144, elements: !1632)
!1632 = !{!1633}
!1633 = !DISubrange(count: 768)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1610, file: !1571, line: 107, baseType: !1635, size: 64, offset: 6464)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1571, line: 97, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1571, line: 83, size: 8320, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1644, !1645, !1646, !1647}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1637, file: !1571, line: 84, baseType: !1631, size: 6144)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1637, file: !1571, line: 87, baseType: !1625, size: 2048, offset: 6144)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1637, file: !1571, line: 88, baseType: !1642, size: 64, offset: 8192)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64)
!1643 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1453, line: 41, flags: DIFlagFwdDecl)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1637, file: !1571, line: 90, baseType: !1023, size: 16, offset: 8256)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1637, file: !1571, line: 92, baseType: !1023, size: 16, offset: 8272)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1637, file: !1571, line: 93, baseType: !1023, size: 16, offset: 8288)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1637, file: !1571, line: 95, baseType: !1023, size: 16, offset: 8304)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1610, file: !1571, line: 108, baseType: !1649, size: 64, offset: 6528)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64)
!1650 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1571, line: 66, baseType: !1651)
!1651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1571, line: 61, size: 128, elements: !1652)
!1652 = !{!1653, !1654, !1655, !1656}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1651, file: !1571, line: 62, baseType: !1018, size: 32)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1651, file: !1571, line: 63, baseType: !1018, size: 32, offset: 32)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1651, file: !1571, line: 64, baseType: !1018, size: 32, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1651, file: !1571, line: 65, baseType: !1018, size: 32, offset: 96)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1610, file: !1571, line: 109, baseType: !1658, size: 64, offset: 6592)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64)
!1659 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1571, line: 71, baseType: !1660)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1571, line: 68, size: 64, elements: !1661)
!1661 = !{!1662, !1663}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1660, file: !1571, line: 69, baseType: !1018, size: 32)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1660, file: !1571, line: 70, baseType: !1018, size: 32, offset: 32)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1610, file: !1571, line: 110, baseType: !1665, size: 64, offset: 6656)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64)
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1571, line: 81, baseType: !1667)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1571, line: 73, size: 352, elements: !1668)
!1668 = !{!1669, !1670, !1671, !1672, !1673}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1667, file: !1571, line: 74, baseType: !1172, size: 96)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1667, file: !1571, line: 75, baseType: !1172, size: 96, offset: 96)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1667, file: !1571, line: 76, baseType: !1172, size: 96, offset: 192)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1667, file: !1571, line: 77, baseType: !1018, size: 32, offset: 288)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1667, file: !1571, line: 78, baseType: !1018, size: 32, offset: 320)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1610, file: !1571, line: 113, baseType: !1675, size: 512, offset: 6720)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1676, line: 182, baseType: !1677)
!1676 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1676, line: 180, size: 512, elements: !1678)
!1678 = !{!1679}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1677, file: !1676, line: 181, baseType: !1099, size: 512)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1580, file: !1571, line: 148, baseType: !1132, size: 64, offset: 1408)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1580, file: !1571, line: 151, baseType: !1456, size: 64, offset: 1472)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1580, file: !1571, line: 152, baseType: !1048, size: 64, offset: 1536)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1580, file: !1571, line: 153, baseType: !1684, size: 64, offset: 1600)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64)
!1685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1686, line: 64, size: 19136, elements: !1687)
!1686 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1687 = !{!1688, !1689, !1690, !1691, !1692, !1693, !1695, !1696, !1697, !1698, !1701, !1702, !2009, !2010, !2018, !2019, !2020, !2021, !2022}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1685, file: !1686, line: 65, baseType: !1052, size: 960)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1685, file: !1686, line: 66, baseType: !1114, size: 64, offset: 960)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1685, file: !1686, line: 68, baseType: !1071, size: 8192, offset: 1024)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1685, file: !1686, line: 70, baseType: !1018, size: 32, offset: 9216)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1685, file: !1686, line: 71, baseType: !1018, size: 32, offset: 9248)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1685, file: !1686, line: 72, baseType: !1694, size: 64, offset: 9280)
!1694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 64, elements: !1508)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1685, file: !1686, line: 74, baseType: !1020, size: 32, offset: 9344)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1685, file: !1686, line: 74, baseType: !1020, size: 32, offset: 9376)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1685, file: !1686, line: 76, baseType: !1642, size: 64, offset: 9408)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1685, file: !1686, line: 77, baseType: !1699, size: 64, offset: 9472)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64)
!1700 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1686, line: 77, flags: DIFlagFwdDecl)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1685, file: !1686, line: 78, baseType: !1202, size: 64, offset: 9536)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1685, file: !1686, line: 80, baseType: !1703, size: 2624, offset: 9600)
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1704, line: 340, size: 2624, elements: !1705)
!1704 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1705 = !{!1706, !1734, !1752, !1753, !1754, !1771, !1829, !1830, !1989, !1990, !1991, !1992, !1998}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1703, file: !1704, line: 341, baseType: !1707, size: 576)
!1707 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1704, line: 251, baseType: !1708)
!1708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1704, line: 207, size: 576, elements: !1709)
!1709 = !{!1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1708, file: !1704, line: 208, baseType: !1018, size: 32)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1708, file: !1704, line: 211, baseType: !1023, size: 16, offset: 32)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1708, file: !1704, line: 212, baseType: !1023, size: 16, offset: 48)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1708, file: !1704, line: 213, baseType: !1020, size: 32, offset: 64)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1708, file: !1704, line: 214, baseType: !1023, size: 16, offset: 96)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1708, file: !1704, line: 215, baseType: !1023, size: 16, offset: 112)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1708, file: !1704, line: 216, baseType: !1023, size: 16, offset: 128)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1708, file: !1704, line: 217, baseType: !1023, size: 16, offset: 144)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1708, file: !1704, line: 218, baseType: !1023, size: 16, offset: 160)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1708, file: !1704, line: 219, baseType: !1023, size: 16, offset: 176)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1708, file: !1704, line: 220, baseType: !1020, size: 32, offset: 192)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1708, file: !1704, line: 222, baseType: !1023, size: 16, offset: 224)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1708, file: !1704, line: 225, baseType: !1023, size: 16, offset: 240)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1708, file: !1704, line: 228, baseType: !1018, size: 32, offset: 256)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1708, file: !1704, line: 229, baseType: !1018, size: 32, offset: 288)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1708, file: !1704, line: 233, baseType: !1018, size: 32, offset: 320)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1708, file: !1704, line: 236, baseType: !1023, size: 16, offset: 352)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1708, file: !1704, line: 236, baseType: !1023, size: 16, offset: 368)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1708, file: !1704, line: 241, baseType: !1020, size: 32, offset: 384)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1708, file: !1704, line: 244, baseType: !1018, size: 32, offset: 416)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1708, file: !1704, line: 244, baseType: !1018, size: 32, offset: 448)
