; ModuleID = 'blender/source/blender/editors/physics/particle_boids.c'
source_filename = "blender/source/blender/editors/physics/particle_boids.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/physics/particle_boids.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !13}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 351, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 519, baseType: !5, size: 32, elements: !15)
!14 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!20 = !{i32 7, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{i32 1, !"wchar_size", i32 4}
!23 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!24 = distinct !DISubprogram(name: "BOID_OT_rule_add", scope: !1, file: !1, line: 83, type: !25, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !317)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !29, line: 568, baseType: !30)
!29 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !29, line: 508, size: 1536, elements: !31)
!31 = !{!32, !36, !37, !38, !39, !239, !244, !250, !254, !255, !259, !260, !261, !262, !266, !267, !282, !283, !287, !316}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !29, line: 509, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !30, file: !29, line: 510, baseType: !33, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !30, file: !29, line: 511, baseType: !33, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !30, file: !29, line: 512, baseType: !33, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !30, file: !29, line: 518, baseType: !40, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !47}
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !46, line: 44, flags: DIFlagFwdDecl)
!46 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !4, line: 328, size: 1344, elements: !49)
!49 = !{!50, !51, !52, !56, !88, !90, !91, !92, !104, !229, !230, !231, !234, !235}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !4, line: 329, baseType: !47, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !48, file: !4, line: 329, baseType: !47, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !48, file: !4, line: 332, baseType: !53, size: 512, offset: 128)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !48, file: !4, line: 333, baseType: !57, size: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !59, line: 75, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !59, line: 62, size: 1024, elements: !61)
!61 = !{!62, !64, !65, !66, !67, !69, !70, !71, !86, !87}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !60, file: !59, line: 63, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !60, file: !59, line: 63, baseType: !63, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !59, line: 64, baseType: !35, size: 8, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !60, file: !59, line: 64, baseType: !35, size: 8, offset: 136)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !60, file: !59, line: 65, baseType: !68, size: 16, offset: 144)
!68 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !60, file: !59, line: 66, baseType: !53, size: 512, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !60, file: !59, line: 67, baseType: !43, size: 32, offset: 672)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !60, file: !59, line: 69, baseType: !72, size: 256, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !59, line: 60, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !59, line: 48, size: 256, elements: !74)
!74 = !{!75, !77, !84, !85}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !73, file: !59, line: 49, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !73, file: !59, line: 58, baseType: !78, size: 128, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !79, line: 71, baseType: !80)
!79 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !79, line: 69, size: 128, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !80, file: !79, line: 70, baseType: !76, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !80, file: !79, line: 70, baseType: !76, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !73, file: !59, line: 59, baseType: !43, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !73, file: !59, line: 59, baseType: !43, size: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !60, file: !59, line: 70, baseType: !43, size: 32, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !60, file: !59, line: 74, baseType: !43, size: 32, offset: 992)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !48, file: !4, line: 336, baseType: !89, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !48, file: !4, line: 337, baseType: !76, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !48, file: !4, line: 338, baseType: !76, size: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !48, file: !4, line: 340, baseType: !93, size: 64, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !46, line: 55, size: 192, elements: !95)
!95 = !{!96, !100, !103}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !94, file: !46, line: 58, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !94, file: !46, line: 56, size: 64, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !46, line: 57, baseType: !76, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !46, line: 60, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !46, line: 41, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !46, line: 61, baseType: !76, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !48, file: !4, line: 341, baseType: !105, size: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !4, line: 106, size: 320, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !106, file: !4, line: 107, baseType: !78, size: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !106, file: !4, line: 108, baseType: !43, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !106, file: !4, line: 109, baseType: !43, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !4, line: 110, baseType: !43, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !106, file: !4, line: 110, baseType: !43, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !106, file: !4, line: 111, baseType: !114, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !29, line: 490, size: 768, elements: !116)
!116 = !{!117, !118, !119, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !29, line: 491, baseType: !114, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !29, line: 491, baseType: !114, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !115, file: !29, line: 493, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !4, line: 169, size: 2048, elements: !122)
!122 = !{!123, !124, !125, !126, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !195, !198, !212, !213, !214, !215, !216, !217, !218, !219}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !4, line: 170, baseType: !120, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !4, line: 170, baseType: !120, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !121, file: !4, line: 172, baseType: !76, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !121, file: !4, line: 174, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !129, line: 41, flags: DIFlagFwdDecl)
!129 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !121, file: !4, line: 175, baseType: !127, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !121, file: !4, line: 176, baseType: !53, size: 512, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !121, file: !4, line: 178, baseType: !68, size: 16, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !121, file: !4, line: 178, baseType: !68, size: 16, offset: 848)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !121, file: !4, line: 178, baseType: !68, size: 16, offset: 864)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !121, file: !4, line: 178, baseType: !68, size: 16, offset: 880)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !121, file: !4, line: 179, baseType: !68, size: 16, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !121, file: !4, line: 180, baseType: !68, size: 16, offset: 912)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !121, file: !4, line: 181, baseType: !68, size: 16, offset: 928)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !121, file: !4, line: 182, baseType: !68, size: 16, offset: 944)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !121, file: !4, line: 183, baseType: !68, size: 16, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !121, file: !4, line: 184, baseType: !68, size: 16, offset: 976)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !121, file: !4, line: 185, baseType: !68, size: 16, offset: 992)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !121, file: !4, line: 186, baseType: !68, size: 16, offset: 1008)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !121, file: !4, line: 188, baseType: !43, size: 32, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !121, file: !4, line: 190, baseType: !68, size: 16, offset: 1056)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !121, file: !4, line: 191, baseType: !68, size: 16, offset: 1072)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !121, file: !4, line: 194, baseType: !148, size: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !29, line: 421, size: 960, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157, !161, !165, !166, !167, !168, !169, !170, !171, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !191, !192, !193, !194}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !29, line: 422, baseType: !148, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !29, line: 422, baseType: !148, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !29, line: 424, baseType: !68, size: 16, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !149, file: !29, line: 425, baseType: !68, size: 16, offset: 144)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !149, file: !29, line: 426, baseType: !43, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !149, file: !29, line: 426, baseType: !43, size: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !149, file: !29, line: 427, baseType: !158, size: 64, offset: 224)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 2)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !149, file: !29, line: 428, baseType: !162, size: 48, offset: 288)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 48, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 6)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !149, file: !29, line: 431, baseType: !35, size: 8, offset: 336)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !149, file: !29, line: 432, baseType: !35, size: 8, offset: 344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !149, file: !29, line: 435, baseType: !68, size: 16, offset: 352)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !149, file: !29, line: 436, baseType: !68, size: 16, offset: 368)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !149, file: !29, line: 437, baseType: !43, size: 32, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !149, file: !29, line: 437, baseType: !43, size: 32, offset: 416)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !149, file: !29, line: 438, baseType: !172, size: 64, offset: 448)
!172 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !149, file: !29, line: 439, baseType: !43, size: 32, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !149, file: !29, line: 439, baseType: !43, size: 32, offset: 544)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !149, file: !29, line: 442, baseType: !68, size: 16, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !149, file: !29, line: 442, baseType: !68, size: 16, offset: 592)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !149, file: !29, line: 442, baseType: !68, size: 16, offset: 608)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !149, file: !29, line: 442, baseType: !68, size: 16, offset: 624)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !149, file: !29, line: 443, baseType: !68, size: 16, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !149, file: !29, line: 446, baseType: !68, size: 16, offset: 656)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !149, file: !29, line: 449, baseType: !33, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !149, file: !29, line: 452, baseType: !183, size: 64, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !29, line: 463, size: 128, elements: !185)
!185 = !{!186, !187, !189, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !184, file: !29, line: 464, baseType: !43, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !184, file: !29, line: 465, baseType: !188, size: 32, offset: 32)
!188 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !184, file: !29, line: 466, baseType: !188, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !184, file: !29, line: 467, baseType: !188, size: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !149, file: !29, line: 455, baseType: !68, size: 16, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !149, file: !29, line: 456, baseType: !68, size: 16, offset: 848)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !149, file: !29, line: 457, baseType: !43, size: 32, offset: 864)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !149, file: !29, line: 458, baseType: !76, size: 64, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !121, file: !4, line: 196, baseType: !196, size: 64, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !4, line: 55, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !121, file: !4, line: 198, baseType: !199, size: 64, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !29, line: 398, size: 448, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !29, line: 399, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !200, file: !29, line: 399, baseType: !199, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !200, file: !29, line: 400, baseType: !43, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !200, file: !29, line: 401, baseType: !43, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !29, line: 402, baseType: !43, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !200, file: !29, line: 403, baseType: !43, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !200, file: !29, line: 404, baseType: !43, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !29, line: 405, baseType: !43, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !200, file: !29, line: 407, baseType: !76, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !200, file: !29, line: 414, baseType: !76, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !121, file: !4, line: 200, baseType: !43, size: 32, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !121, file: !4, line: 200, baseType: !43, size: 32, offset: 1312)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !121, file: !4, line: 201, baseType: !76, size: 64, offset: 1344)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !121, file: !4, line: 203, baseType: !78, size: 128, offset: 1408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !121, file: !4, line: 204, baseType: !78, size: 128, offset: 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !121, file: !4, line: 205, baseType: !78, size: 128, offset: 1664)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !121, file: !4, line: 207, baseType: !78, size: 128, offset: 1792)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !121, file: !4, line: 208, baseType: !78, size: 128, offset: 1920)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !115, file: !29, line: 495, baseType: !172, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !115, file: !29, line: 496, baseType: !43, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !115, file: !29, line: 497, baseType: !76, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !115, file: !29, line: 499, baseType: !172, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !115, file: !29, line: 500, baseType: !172, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !115, file: !29, line: 502, baseType: !172, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !115, file: !29, line: 503, baseType: !172, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !115, file: !29, line: 504, baseType: !172, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !115, file: !29, line: 505, baseType: !43, size: 32, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !48, file: !4, line: 343, baseType: !78, size: 128, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "opm", scope: !48, file: !4, line: 344, baseType: !47, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !48, file: !4, line: 345, baseType: !232, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !4, line: 61, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !48, file: !4, line: 346, baseType: !68, size: 16, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !48, file: !4, line: 346, baseType: !236, size: 48, offset: 1296)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 48, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 3)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !30, file: !29, line: 524, baseType: !240, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !44, !47}
!243 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !30, file: !29, line: 530, baseType: !245, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!43, !44, !47, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !30, file: !29, line: 531, baseType: !251, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !44, !47}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !30, file: !29, line: 532, baseType: !245, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !30, file: !29, line: 536, baseType: !256, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!43, !44}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !30, file: !29, line: 539, baseType: !251, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !30, file: !29, line: 542, baseType: !101, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !30, file: !29, line: 545, baseType: !63, size: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !30, file: !29, line: 549, baseType: !263, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !46, line: 333, baseType: !265)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !46, line: 39, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !30, file: !29, line: 552, baseType: !78, size: 128, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !30, file: !29, line: 555, baseType: !268, size: 64, offset: 1024)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !4, line: 281, size: 1088, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !4, line: 282, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !269, file: !4, line: 282, baseType: !268, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !269, file: !4, line: 284, baseType: !78, size: 128, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !269, file: !4, line: 285, baseType: !78, size: 128, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !269, file: !4, line: 287, baseType: !53, size: 512, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !269, file: !4, line: 288, baseType: !68, size: 16, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !269, file: !4, line: 289, baseType: !68, size: 16, offset: 912)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !4, line: 291, baseType: !68, size: 16, offset: 928)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !269, file: !4, line: 292, baseType: !68, size: 16, offset: 944)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !269, file: !4, line: 295, baseType: !256, size: 64, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !269, file: !4, line: 296, baseType: !76, size: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !30, file: !29, line: 559, baseType: !76, size: 64, offset: 1088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !30, file: !29, line: 560, baseType: !284, size: 64, offset: 1152)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!43, !44, !89}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !30, file: !29, line: 563, baseType: !288, size: 256, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !46, line: 436, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !46, line: 430, size: 256, elements: !290)
!290 = !{!291, !292, !295, !311}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !289, file: !46, line: 431, baseType: !76, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !289, file: !46, line: 432, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !46, line: 417, baseType: !102)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !289, file: !46, line: 433, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !46, line: 408, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!43, !44, !93, !300, !302}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !46, line: 38, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !46, line: 348, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !46, line: 337, size: 256, elements: !305)
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !46, line: 339, baseType: !76, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !304, file: !46, line: 342, baseType: !300, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !304, file: !46, line: 345, baseType: !43, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !304, file: !46, line: 347, baseType: !43, size: 32, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !304, file: !46, line: 347, baseType: !43, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !289, file: !46, line: 434, baseType: !312, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !46, line: 409, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !76}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !30, file: !29, line: 566, baseType: !68, size: 16, offset: 1472)
!317 = !{}
!318 = !DILocalVariable(name: "ot", arg: 1, scope: !24, file: !1, line: 83, type: !27)
!319 = !DILocation(line: 83, column: 39, scope: !24)
!320 = !DILocation(line: 86, column: 2, scope: !24)
!321 = !DILocation(line: 86, column: 6, scope: !24)
!322 = !DILocation(line: 86, column: 11, scope: !24)
!323 = !DILocation(line: 87, column: 2, scope: !24)
!324 = !DILocation(line: 87, column: 6, scope: !24)
!325 = !DILocation(line: 87, column: 18, scope: !24)
!326 = !DILocation(line: 88, column: 2, scope: !24)
!327 = !DILocation(line: 88, column: 6, scope: !24)
!328 = !DILocation(line: 88, column: 13, scope: !24)
!329 = !DILocation(line: 91, column: 2, scope: !24)
!330 = !DILocation(line: 91, column: 6, scope: !24)
!331 = !DILocation(line: 91, column: 13, scope: !24)
!332 = !DILocation(line: 92, column: 2, scope: !24)
!333 = !DILocation(line: 92, column: 6, scope: !24)
!334 = !DILocation(line: 92, column: 11, scope: !24)
!335 = !DILocation(line: 95, column: 2, scope: !24)
!336 = !DILocation(line: 95, column: 6, scope: !24)
!337 = !DILocation(line: 95, column: 11, scope: !24)
!338 = !DILocation(line: 97, column: 26, scope: !24)
!339 = !DILocation(line: 97, column: 30, scope: !24)
!340 = !DILocation(line: 97, column: 13, scope: !24)
!341 = !DILocation(line: 97, column: 2, scope: !24)
!342 = !DILocation(line: 97, column: 6, scope: !24)
!343 = !DILocation(line: 97, column: 11, scope: !24)
!344 = !DILocation(line: 98, column: 1, scope: !24)
!345 = distinct !DISubprogram(name: "rule_add_exec", scope: !1, file: !1, line: 56, type: !346, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !317)
!346 = !DISubroutineType(types: !347)
!347 = !{!43, !348, !350}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !129, line: 69, baseType: !45)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperator", file: !4, line: 348, baseType: !48)
!352 = !DILocalVariable(name: "C", arg: 1, scope: !345, file: !1, line: 56, type: !348)
!353 = !DILocation(line: 56, column: 36, scope: !345)
!354 = !DILocalVariable(name: "op", arg: 2, scope: !345, file: !1, line: 56, type: !350)
!355 = !DILocation(line: 56, column: 51, scope: !345)
!356 = !DILocalVariable(name: "ptr", scope: !345, file: !1, line: 58, type: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !46, line: 62, baseType: !94)
!358 = !DILocation(line: 58, column: 13, scope: !345)
!359 = !DILocation(line: 58, column: 45, scope: !345)
!360 = !DILocation(line: 58, column: 19, scope: !345)
!361 = !DILocalVariable(name: "part", scope: !345, file: !1, line: 59, type: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleSettings", file: !364, line: 251, baseType: !365)
!364 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleSettings", file: !364, line: 153, size: 6400, elements: !366)
!366 = !{!367, !403, !406, !434, !455, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !365, file: !364, line: 154, baseType: !368, size: 960)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !59, line: 130, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !59, line: 117, size: 960, elements: !370)
!370 = !{!371, !372, !373, !375, !394, !398, !399, !400, !401, !402}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !59, line: 118, baseType: !76, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !369, file: !59, line: 118, baseType: !76, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !369, file: !59, line: 119, baseType: !374, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !369, file: !59, line: 120, baseType: !376, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !59, line: 136, size: 17600, elements: !378)
!378 = !{!379, !380, !382, !385, !389, !390, !391}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !377, file: !59, line: 137, baseType: !368, size: 960)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !377, file: !59, line: 138, baseType: !381, size: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !377, file: !59, line: 139, baseType: !383, size: 64, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !59, line: 43, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !59, line: 140, baseType: !386, size: 8192, offset: 1088)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8192, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 1024)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !377, file: !59, line: 141, baseType: !386, size: 8192, offset: 9280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !377, file: !59, line: 148, baseType: !376, size: 64, offset: 17472)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !377, file: !59, line: 150, baseType: !392, size: 64, offset: 17536)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !59, line: 45, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !369, file: !59, line: 121, baseType: !395, size: 528, offset: 256)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 528, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 66)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !59, line: 126, baseType: !68, size: 16, offset: 784)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !369, file: !59, line: 127, baseType: !43, size: 32, offset: 800)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !369, file: !59, line: 128, baseType: !43, size: 32, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !369, file: !59, line: 128, baseType: !43, size: 32, offset: 864)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !369, file: !59, line: 129, baseType: !57, size: 64, offset: 896)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !365, file: !364, line: 155, baseType: !404, size: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !364, line: 39, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "boids", scope: !365, file: !364, line: 157, baseType: !407, size: 64, offset: 1024)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoidSettings", file: !409, line: 189, size: 832, elements: !410)
!409 = !DIFile(filename: "blender/source/blender/makesdna/DNA_boid_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !408, file: !409, line: 190, baseType: !43, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "last_state_id", scope: !408, file: !409, line: 190, baseType: !43, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "landing_smoothness", scope: !408, file: !409, line: 192, baseType: !188, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !408, file: !409, line: 192, baseType: !188, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "banking", scope: !408, file: !409, line: 193, baseType: !188, size: 32, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !408, file: !409, line: 193, baseType: !188, size: 32, offset: 160)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "health", scope: !408, file: !409, line: 195, baseType: !188, size: 32, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "aggression", scope: !408, file: !409, line: 195, baseType: !188, size: 32, offset: 224)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !408, file: !409, line: 196, baseType: !188, size: 32, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "accuracy", scope: !408, file: !409, line: 196, baseType: !188, size: 32, offset: 288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !408, file: !409, line: 196, baseType: !188, size: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "air_min_speed", scope: !408, file: !409, line: 199, baseType: !188, size: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "air_max_speed", scope: !408, file: !409, line: 199, baseType: !188, size: 32, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "air_max_acc", scope: !408, file: !409, line: 200, baseType: !188, size: 32, offset: 416)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "air_max_ave", scope: !408, file: !409, line: 200, baseType: !188, size: 32, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "air_personal_space", scope: !408, file: !409, line: 201, baseType: !188, size: 32, offset: 480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "land_jump_speed", scope: !408, file: !409, line: 204, baseType: !188, size: 32, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "land_max_speed", scope: !408, file: !409, line: 204, baseType: !188, size: 32, offset: 544)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "land_max_acc", scope: !408, file: !409, line: 205, baseType: !188, size: 32, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "land_max_ave", scope: !408, file: !409, line: 205, baseType: !188, size: 32, offset: 608)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "land_personal_space", scope: !408, file: !409, line: 206, baseType: !188, size: 32, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "land_stick_force", scope: !408, file: !409, line: 207, baseType: !188, size: 32, offset: 672)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !408, file: !409, line: 209, baseType: !80, size: 128, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "fluid", scope: !365, file: !364, line: 158, baseType: !435, size: 64, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SPHFluidSettings", file: !364, line: 127, size: 544, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !436, file: !364, line: 129, baseType: !188, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "spring_k", scope: !436, file: !364, line: 129, baseType: !188, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rest_length", scope: !436, file: !364, line: 129, baseType: !188, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "plasticity_constant", scope: !436, file: !364, line: 130, baseType: !188, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "yield_ratio", scope: !436, file: !364, line: 130, baseType: !188, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "plasticity_balance", scope: !436, file: !364, line: 131, baseType: !188, size: 32, offset: 160)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "yield_balance", scope: !436, file: !364, line: 131, baseType: !188, size: 32, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "viscosity_omega", scope: !436, file: !364, line: 132, baseType: !188, size: 32, offset: 224)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "viscosity_beta", scope: !436, file: !364, line: 132, baseType: !188, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "stiffness_k", scope: !436, file: !364, line: 133, baseType: !188, size: 32, offset: 288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "stiffness_knear", scope: !436, file: !364, line: 133, baseType: !188, size: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "rest_density", scope: !436, file: !364, line: 133, baseType: !188, size: 32, offset: 352)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "buoyancy", scope: !436, file: !364, line: 134, baseType: !188, size: 32, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !364, line: 135, baseType: !43, size: 32, offset: 416)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "spring_frames", scope: !436, file: !364, line: 135, baseType: !43, size: 32, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "solver", scope: !436, file: !364, line: 136, baseType: !68, size: 16, offset: 480)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !436, file: !364, line: 137, baseType: !236, size: 48, offset: 496)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "effector_weights", scope: !365, file: !364, line: 160, baseType: !456, size: 64, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "EffectorWeights", file: !364, line: 160, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !365, file: !364, line: 162, baseType: !43, size: 32, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !365, file: !364, line: 162, baseType: !43, size: 32, offset: 1248)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !365, file: !364, line: 163, baseType: !68, size: 16, offset: 1280)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !365, file: !364, line: 163, baseType: !68, size: 16, offset: 1296)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "distr", scope: !365, file: !364, line: 163, baseType: !68, size: 16, offset: 1312)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !365, file: !364, line: 163, baseType: !68, size: 16, offset: 1328)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "phystype", scope: !365, file: !364, line: 165, baseType: !68, size: 16, offset: 1344)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !365, file: !364, line: 165, baseType: !68, size: 16, offset: 1360)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "avemode", scope: !365, file: !364, line: 165, baseType: !68, size: 16, offset: 1376)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reactevent", scope: !365, file: !364, line: 165, baseType: !68, size: 16, offset: 1392)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !365, file: !364, line: 166, baseType: !43, size: 32, offset: 1408)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !365, file: !364, line: 166, baseType: !43, size: 32, offset: 1440)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "draw_as", scope: !365, file: !364, line: 167, baseType: !68, size: 16, offset: 1472)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "draw_size", scope: !365, file: !364, line: 167, baseType: !68, size: 16, offset: 1488)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "childtype", scope: !365, file: !364, line: 167, baseType: !68, size: 16, offset: 1504)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !365, file: !364, line: 167, baseType: !68, size: 16, offset: 1520)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ren_as", scope: !365, file: !364, line: 168, baseType: !68, size: 16, offset: 1536)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "subframes", scope: !365, file: !364, line: 168, baseType: !68, size: 16, offset: 1552)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "draw_col", scope: !365, file: !364, line: 168, baseType: !68, size: 16, offset: 1568)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !365, file: !364, line: 170, baseType: !68, size: 16, offset: 1584)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ren_step", scope: !365, file: !364, line: 170, baseType: !68, size: 16, offset: 1600)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "hair_step", scope: !365, file: !364, line: 171, baseType: !68, size: 16, offset: 1616)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "keys_step", scope: !365, file: !364, line: 171, baseType: !68, size: 16, offset: 1632)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_angle", scope: !365, file: !364, line: 174, baseType: !68, size: 16, offset: 1648)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_pix", scope: !365, file: !364, line: 174, baseType: !68, size: 16, offset: 1664)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !365, file: !364, line: 176, baseType: !68, size: 16, offset: 1680)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "omat", scope: !365, file: !364, line: 176, baseType: !68, size: 16, offset: 1696)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "interpolation", scope: !365, file: !364, line: 176, baseType: !68, size: 16, offset: 1712)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "integrator", scope: !365, file: !364, line: 176, baseType: !68, size: 16, offset: 1728)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rotfrom", scope: !365, file: !364, line: 177, baseType: !68, size: 16, offset: 1744)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !365, file: !364, line: 178, baseType: !68, size: 16, offset: 1760)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !365, file: !364, line: 178, baseType: !68, size: 16, offset: 1776)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bb_align", scope: !365, file: !364, line: 181, baseType: !68, size: 16, offset: 1792)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bb_uv_split", scope: !365, file: !364, line: 181, baseType: !68, size: 16, offset: 1808)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bb_anim", scope: !365, file: !364, line: 181, baseType: !68, size: 16, offset: 1824)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "bb_split_offset", scope: !365, file: !364, line: 181, baseType: !68, size: 16, offset: 1840)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bb_tilt", scope: !365, file: !364, line: 182, baseType: !188, size: 32, offset: 1856)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "bb_rand_tilt", scope: !365, file: !364, line: 182, baseType: !188, size: 32, offset: 1888)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bb_offset", scope: !365, file: !364, line: 182, baseType: !497, size: 64, offset: 1920)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 64, elements: !159)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bb_size", scope: !365, file: !364, line: 182, baseType: !497, size: 64, offset: 1984)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bb_vel_head", scope: !365, file: !364, line: 182, baseType: !188, size: 32, offset: 2048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bb_vel_tail", scope: !365, file: !364, line: 182, baseType: !188, size: 32, offset: 2080)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "color_vec_max", scope: !365, file: !364, line: 185, baseType: !188, size: 32, offset: 2112)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_flag", scope: !365, file: !364, line: 188, baseType: !68, size: 16, offset: 2144)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_refsize", scope: !365, file: !364, line: 188, baseType: !68, size: 16, offset: 2160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_rate", scope: !365, file: !364, line: 189, baseType: !188, size: 32, offset: 2176)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_transition", scope: !365, file: !364, line: 189, baseType: !188, size: 32, offset: 2208)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_viewport", scope: !365, file: !364, line: 190, baseType: !188, size: 32, offset: 2240)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sta", scope: !365, file: !364, line: 193, baseType: !188, size: 32, offset: 2272)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !365, file: !364, line: 193, baseType: !188, size: 32, offset: 2304)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !365, file: !364, line: 193, baseType: !188, size: 32, offset: 2336)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "randlife", scope: !365, file: !364, line: 193, baseType: !188, size: 32, offset: 2368)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "timetweak", scope: !365, file: !364, line: 194, baseType: !188, size: 32, offset: 2400)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "courant_target", scope: !365, file: !364, line: 194, baseType: !188, size: 32, offset: 2432)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "jitfac", scope: !365, file: !364, line: 195, baseType: !188, size: 32, offset: 2464)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "eff_hair", scope: !365, file: !364, line: 195, baseType: !188, size: 32, offset: 2496)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "grid_rand", scope: !365, file: !364, line: 195, baseType: !188, size: 32, offset: 2528)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ps_offset", scope: !365, file: !364, line: 195, baseType: !517, size: 32, offset: 2560)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 32, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 1)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "totpart", scope: !365, file: !364, line: 196, baseType: !43, size: 32, offset: 2592)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "userjit", scope: !365, file: !364, line: 196, baseType: !43, size: 32, offset: 2624)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "grid_res", scope: !365, file: !364, line: 196, baseType: !43, size: 32, offset: 2656)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "effector_amount", scope: !365, file: !364, line: 196, baseType: !43, size: 32, offset: 2688)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "time_flag", scope: !365, file: !364, line: 197, baseType: !68, size: 16, offset: 2720)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "time_pad", scope: !365, file: !364, line: 197, baseType: !236, size: 48, offset: 2736)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "normfac", scope: !365, file: !364, line: 200, baseType: !188, size: 32, offset: 2784)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "obfac", scope: !365, file: !364, line: 200, baseType: !188, size: 32, offset: 2816)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "randfac", scope: !365, file: !364, line: 200, baseType: !188, size: 32, offset: 2848)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "partfac", scope: !365, file: !364, line: 200, baseType: !188, size: 32, offset: 2880)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tanfac", scope: !365, file: !364, line: 200, baseType: !188, size: 32, offset: 2912)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tanphase", scope: !365, file: !364, line: 200, baseType: !188, size: 32, offset: 2944)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reactfac", scope: !365, file: !364, line: 200, baseType: !188, size: 32, offset: 2976)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ob_vel", scope: !365, file: !364, line: 201, baseType: !534, size: 96, offset: 3008)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 96, elements: !237)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "avefac", scope: !365, file: !364, line: 202, baseType: !188, size: 32, offset: 3104)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "phasefac", scope: !365, file: !364, line: 202, baseType: !188, size: 32, offset: 3136)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "randrotfac", scope: !365, file: !364, line: 202, baseType: !188, size: 32, offset: 3168)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "randphasefac", scope: !365, file: !364, line: 202, baseType: !188, size: 32, offset: 3200)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !365, file: !364, line: 204, baseType: !188, size: 32, offset: 3232)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !365, file: !364, line: 204, baseType: !188, size: 32, offset: 3264)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "randsize", scope: !365, file: !364, line: 204, baseType: !188, size: 32, offset: 3296)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !365, file: !364, line: 206, baseType: !534, size: 96, offset: 3328)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dragfac", scope: !365, file: !364, line: 206, baseType: !188, size: 32, offset: 3424)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "brownfac", scope: !365, file: !364, line: 206, baseType: !188, size: 32, offset: 3456)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !365, file: !364, line: 206, baseType: !188, size: 32, offset: 3488)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "randlength", scope: !365, file: !364, line: 208, baseType: !188, size: 32, offset: 3520)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "child_nbr", scope: !365, file: !364, line: 210, baseType: !43, size: 32, offset: 3552)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ren_child_nbr", scope: !365, file: !364, line: 210, baseType: !43, size: 32, offset: 3584)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "parents", scope: !365, file: !364, line: 211, baseType: !188, size: 32, offset: 3616)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "childsize", scope: !365, file: !364, line: 211, baseType: !188, size: 32, offset: 3648)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "childrandsize", scope: !365, file: !364, line: 211, baseType: !188, size: 32, offset: 3680)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "childrad", scope: !365, file: !364, line: 212, baseType: !188, size: 32, offset: 3712)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "childflat", scope: !365, file: !364, line: 212, baseType: !188, size: 32, offset: 3744)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !365, file: !364, line: 214, baseType: !188, size: 32, offset: 3776)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "clumppow", scope: !365, file: !364, line: 214, baseType: !188, size: 32, offset: 3808)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !365, file: !364, line: 216, baseType: !188, size: 32, offset: 3840)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !365, file: !364, line: 216, baseType: !188, size: 32, offset: 3872)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !365, file: !364, line: 216, baseType: !188, size: 32, offset: 3904)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "kink_flat", scope: !365, file: !364, line: 216, baseType: !188, size: 32, offset: 3936)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp_clump", scope: !365, file: !364, line: 217, baseType: !188, size: 32, offset: 3968)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rough1", scope: !365, file: !364, line: 219, baseType: !188, size: 32, offset: 4000)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rough1_size", scope: !365, file: !364, line: 219, baseType: !188, size: 32, offset: 4032)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rough2", scope: !365, file: !364, line: 220, baseType: !188, size: 32, offset: 4064)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rough2_size", scope: !365, file: !364, line: 220, baseType: !188, size: 32, offset: 4096)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rough2_thres", scope: !365, file: !364, line: 220, baseType: !188, size: 32, offset: 4128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rough_end", scope: !365, file: !364, line: 221, baseType: !188, size: 32, offset: 4160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rough_end_shape", scope: !365, file: !364, line: 221, baseType: !188, size: 32, offset: 4192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "clength", scope: !365, file: !364, line: 223, baseType: !188, size: 32, offset: 4224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "clength_thres", scope: !365, file: !364, line: 223, baseType: !188, size: 32, offset: 4256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "parting_fac", scope: !365, file: !364, line: 225, baseType: !188, size: 32, offset: 4288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "parting_min", scope: !365, file: !364, line: 226, baseType: !188, size: 32, offset: 4320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "parting_max", scope: !365, file: !364, line: 226, baseType: !188, size: 32, offset: 4352)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "branch_thres", scope: !365, file: !364, line: 228, baseType: !188, size: 32, offset: 4384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "draw_line", scope: !365, file: !364, line: 230, baseType: !497, size: 64, offset: 4416)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "path_start", scope: !365, file: !364, line: 231, baseType: !188, size: 32, offset: 4480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "path_end", scope: !365, file: !364, line: 231, baseType: !188, size: 32, offset: 4512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "trail_count", scope: !365, file: !364, line: 232, baseType: !43, size: 32, offset: 4544)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "keyed_loops", scope: !365, file: !364, line: 234, baseType: !43, size: 32, offset: 4576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !365, file: !364, line: 236, baseType: !580, size: 1152, offset: 4608)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 1152, elements: !1233)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !583, line: 57, size: 2496, elements: !584)
!583 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!584 = !{!585, !586, !587, !588, !589, !875, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !582, file: !583, line: 59, baseType: !68, size: 16)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !582, file: !583, line: 59, baseType: !68, size: 16, offset: 16)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !582, file: !583, line: 59, baseType: !68, size: 16, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !582, file: !583, line: 59, baseType: !68, size: 16, offset: 48)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !582, file: !583, line: 60, baseType: !590, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !14, line: 115, size: 11392, elements: !592)
!592 = !{!593, !594, !595, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !612, !622, !636, !637, !678, !679, !682, !683, !699, !700, !701, !702, !703, !704, !705, !709, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !725, !726, !727, !728, !729, !730, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !790, !791, !792, !793, !794, !795, !796, !797, !798, !801, !804, !807, !808, !809, !810, !811, !814, !817, !820, !821, !827, !828, !829, !830, !831, !832, !834, !837, !840, !841, !863, !864}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !591, file: !14, line: 116, baseType: !368, size: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !591, file: !14, line: 117, baseType: !404, size: 64, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !591, file: !14, line: 119, baseType: !596, size: 64, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !14, line: 57, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !591, file: !14, line: 121, baseType: !68, size: 16, offset: 1088)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !591, file: !14, line: 121, baseType: !68, size: 16, offset: 1104)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !591, file: !14, line: 122, baseType: !43, size: 32, offset: 1120)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !591, file: !14, line: 122, baseType: !43, size: 32, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !591, file: !14, line: 122, baseType: !43, size: 32, offset: 1184)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !591, file: !14, line: 123, baseType: !53, size: 512, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !591, file: !14, line: 124, baseType: !590, size: 64, offset: 1728)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !591, file: !14, line: 124, baseType: !590, size: 64, offset: 1792)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !591, file: !14, line: 127, baseType: !590, size: 64, offset: 1856)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !591, file: !14, line: 127, baseType: !590, size: 64, offset: 1920)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !591, file: !14, line: 127, baseType: !590, size: 64, offset: 1984)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !591, file: !14, line: 128, baseType: !610, size: 64, offset: 2048)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !364, line: 243, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !591, file: !14, line: 130, baseType: !613, size: 64, offset: 2112)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !14, line: 97, size: 832, elements: !615)
!615 = !{!616, !620, !621}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !614, file: !14, line: 98, baseType: !617, size: 768)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 768, elements: !618)
!618 = !{!619, !238}
!619 = !DISubrange(count: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !614, file: !14, line: 99, baseType: !43, size: 32, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !614, file: !14, line: 99, baseType: !43, size: 32, offset: 800)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !591, file: !14, line: 131, baseType: !623, size: 64, offset: 2176)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !625, line: 486, size: 1600, elements: !626)
!625 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !624, file: !625, line: 487, baseType: !368, size: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !624, file: !625, line: 489, baseType: !78, size: 128, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !624, file: !625, line: 490, baseType: !78, size: 128, offset: 1088)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !624, file: !625, line: 491, baseType: !78, size: 128, offset: 1216)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !624, file: !625, line: 492, baseType: !78, size: 128, offset: 1344)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !624, file: !625, line: 494, baseType: !43, size: 32, offset: 1472)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !624, file: !625, line: 495, baseType: !43, size: 32, offset: 1504)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !624, file: !625, line: 497, baseType: !43, size: 32, offset: 1536)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !624, file: !625, line: 498, baseType: !43, size: 32, offset: 1568)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !591, file: !14, line: 132, baseType: !623, size: 64, offset: 2240)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !591, file: !14, line: 133, baseType: !638, size: 64, offset: 2304)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !625, line: 334, size: 1728, elements: !640)
!640 = !{!641, !642, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !677}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !639, file: !625, line: 335, baseType: !78, size: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !639, file: !625, line: 336, baseType: !643, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !625, line: 47, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !639, file: !625, line: 338, baseType: !68, size: 16, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !639, file: !625, line: 338, baseType: !68, size: 16, offset: 208)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !639, file: !625, line: 339, baseType: !5, size: 32, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !639, file: !625, line: 340, baseType: !43, size: 32, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !639, file: !625, line: 342, baseType: !188, size: 32, offset: 288)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !639, file: !625, line: 343, baseType: !534, size: 96, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !639, file: !625, line: 344, baseType: !534, size: 96, offset: 416)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !639, file: !625, line: 347, baseType: !78, size: 128, offset: 512)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !639, file: !625, line: 349, baseType: !43, size: 32, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !639, file: !625, line: 350, baseType: !43, size: 32, offset: 672)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !639, file: !625, line: 351, baseType: !76, size: 64, offset: 704)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !639, file: !625, line: 352, baseType: !76, size: 64, offset: 768)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !639, file: !625, line: 354, baseType: !658, size: 384, offset: 832)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !625, line: 116, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !625, line: 94, size: 384, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !659, file: !625, line: 96, baseType: !43, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !659, file: !625, line: 96, baseType: !43, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !659, file: !625, line: 97, baseType: !43, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !659, file: !625, line: 97, baseType: !43, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !659, file: !625, line: 99, baseType: !68, size: 16, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !659, file: !625, line: 100, baseType: !68, size: 16, offset: 144)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !659, file: !625, line: 102, baseType: !68, size: 16, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !659, file: !625, line: 105, baseType: !68, size: 16, offset: 176)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !659, file: !625, line: 108, baseType: !68, size: 16, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !659, file: !625, line: 109, baseType: !68, size: 16, offset: 208)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !659, file: !625, line: 111, baseType: !68, size: 16, offset: 224)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !659, file: !625, line: 112, baseType: !68, size: 16, offset: 240)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !659, file: !625, line: 114, baseType: !43, size: 32, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !659, file: !625, line: 114, baseType: !43, size: 32, offset: 288)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !659, file: !625, line: 115, baseType: !43, size: 32, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !659, file: !625, line: 115, baseType: !43, size: 32, offset: 352)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !639, file: !625, line: 355, baseType: !53, size: 512, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !591, file: !14, line: 134, baseType: !76, size: 64, offset: 2368)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !591, file: !14, line: 136, baseType: !680, size: 64, offset: 2432)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !14, line: 58, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !591, file: !14, line: 138, baseType: !658, size: 384, offset: 2496)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !591, file: !14, line: 139, baseType: !684, size: 64, offset: 2880)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !625, line: 80, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !625, line: 72, size: 192, elements: !687)
!687 = !{!688, !695, !696, !697, !698}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !686, file: !625, line: 73, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !625, line: 59, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !625, line: 56, size: 128, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !691, file: !625, line: 57, baseType: !534, size: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !625, line: 58, baseType: !43, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !686, file: !625, line: 74, baseType: !43, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !686, file: !625, line: 76, baseType: !43, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !686, file: !625, line: 77, baseType: !43, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !686, file: !625, line: 79, baseType: !43, size: 32, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !591, file: !14, line: 141, baseType: !78, size: 128, offset: 2944)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !591, file: !14, line: 142, baseType: !78, size: 128, offset: 3072)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !591, file: !14, line: 143, baseType: !78, size: 128, offset: 3200)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !591, file: !14, line: 144, baseType: !78, size: 128, offset: 3328)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !591, file: !14, line: 146, baseType: !43, size: 32, offset: 3456)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !591, file: !14, line: 147, baseType: !43, size: 32, offset: 3488)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !591, file: !14, line: 150, baseType: !706, size: 64, offset: 3520)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !14, line: 50, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !591, file: !14, line: 151, baseType: !710, size: 64, offset: 3584)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !591, file: !14, line: 152, baseType: !43, size: 32, offset: 3648)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !591, file: !14, line: 153, baseType: !43, size: 32, offset: 3680)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !591, file: !14, line: 156, baseType: !534, size: 96, offset: 3712)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !591, file: !14, line: 156, baseType: !534, size: 96, offset: 3808)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !591, file: !14, line: 156, baseType: !534, size: 96, offset: 3904)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !591, file: !14, line: 157, baseType: !534, size: 96, offset: 4000)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !591, file: !14, line: 158, baseType: !534, size: 96, offset: 4096)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !591, file: !14, line: 159, baseType: !534, size: 96, offset: 4192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !591, file: !14, line: 160, baseType: !534, size: 96, offset: 4288)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !591, file: !14, line: 160, baseType: !534, size: 96, offset: 4384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !591, file: !14, line: 161, baseType: !722, size: 128, offset: 4480)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 4)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !591, file: !14, line: 161, baseType: !722, size: 128, offset: 4608)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !591, file: !14, line: 162, baseType: !534, size: 96, offset: 4736)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !591, file: !14, line: 162, baseType: !534, size: 96, offset: 4832)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !591, file: !14, line: 163, baseType: !188, size: 32, offset: 4928)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !591, file: !14, line: 163, baseType: !188, size: 32, offset: 4960)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !591, file: !14, line: 164, baseType: !731, size: 512, offset: 4992)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 512, elements: !732)
!732 = !{!724, !724}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !591, file: !14, line: 165, baseType: !731, size: 512, offset: 5504)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !591, file: !14, line: 166, baseType: !731, size: 512, offset: 6016)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !591, file: !14, line: 167, baseType: !731, size: 512, offset: 6528)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !591, file: !14, line: 176, baseType: !731, size: 512, offset: 7040)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !591, file: !14, line: 178, baseType: !5, size: 32, offset: 7552)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !591, file: !14, line: 180, baseType: !68, size: 16, offset: 7584)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !591, file: !14, line: 181, baseType: !68, size: 16, offset: 7600)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !591, file: !14, line: 183, baseType: !68, size: 16, offset: 7616)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !591, file: !14, line: 183, baseType: !68, size: 16, offset: 7632)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !591, file: !14, line: 184, baseType: !68, size: 16, offset: 7648)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !591, file: !14, line: 184, baseType: !68, size: 16, offset: 7664)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !591, file: !14, line: 185, baseType: !68, size: 16, offset: 7680)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !591, file: !14, line: 186, baseType: !68, size: 16, offset: 7696)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !591, file: !14, line: 187, baseType: !68, size: 16, offset: 7712)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !591, file: !14, line: 188, baseType: !35, size: 8, offset: 7728)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !591, file: !14, line: 189, baseType: !35, size: 8, offset: 7736)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !591, file: !14, line: 192, baseType: !43, size: 32, offset: 7744)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !591, file: !14, line: 192, baseType: !43, size: 32, offset: 7776)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !591, file: !14, line: 192, baseType: !43, size: 32, offset: 7808)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !591, file: !14, line: 192, baseType: !43, size: 32, offset: 7840)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !591, file: !14, line: 194, baseType: !43, size: 32, offset: 7872)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !591, file: !14, line: 202, baseType: !188, size: 32, offset: 7904)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !591, file: !14, line: 202, baseType: !188, size: 32, offset: 7936)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !591, file: !14, line: 202, baseType: !188, size: 32, offset: 7968)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !591, file: !14, line: 211, baseType: !188, size: 32, offset: 8000)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !591, file: !14, line: 212, baseType: !188, size: 32, offset: 8032)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !591, file: !14, line: 213, baseType: !188, size: 32, offset: 8064)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !591, file: !14, line: 214, baseType: !188, size: 32, offset: 8096)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !591, file: !14, line: 215, baseType: !188, size: 32, offset: 8128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !591, file: !14, line: 216, baseType: !188, size: 32, offset: 8160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !591, file: !14, line: 219, baseType: !188, size: 32, offset: 8192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !591, file: !14, line: 220, baseType: !188, size: 32, offset: 8224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !591, file: !14, line: 221, baseType: !188, size: 32, offset: 8256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !591, file: !14, line: 224, baseType: !767, size: 16, offset: 8288)
!767 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !591, file: !14, line: 224, baseType: !767, size: 16, offset: 8304)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !591, file: !14, line: 226, baseType: !68, size: 16, offset: 8320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !591, file: !14, line: 228, baseType: !35, size: 8, offset: 8336)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !591, file: !14, line: 229, baseType: !35, size: 8, offset: 8344)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !591, file: !14, line: 231, baseType: !68, size: 16, offset: 8352)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !591, file: !14, line: 232, baseType: !35, size: 8, offset: 8368)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !591, file: !14, line: 233, baseType: !35, size: 8, offset: 8376)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !591, file: !14, line: 234, baseType: !188, size: 32, offset: 8384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !591, file: !14, line: 235, baseType: !188, size: 32, offset: 8416)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !591, file: !14, line: 237, baseType: !78, size: 128, offset: 8448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !591, file: !14, line: 238, baseType: !78, size: 128, offset: 8576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !591, file: !14, line: 239, baseType: !78, size: 128, offset: 8704)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !591, file: !14, line: 240, baseType: !78, size: 128, offset: 8832)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !591, file: !14, line: 242, baseType: !188, size: 32, offset: 8960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !591, file: !14, line: 244, baseType: !68, size: 16, offset: 8992)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !591, file: !14, line: 245, baseType: !767, size: 16, offset: 9008)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !591, file: !14, line: 246, baseType: !722, size: 128, offset: 9024)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !591, file: !14, line: 248, baseType: !43, size: 32, offset: 9152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !591, file: !14, line: 249, baseType: !43, size: 32, offset: 9184)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !591, file: !14, line: 251, baseType: !788, size: 64, offset: 9216)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !14, line: 251, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !591, file: !14, line: 253, baseType: !35, size: 8, offset: 9280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !591, file: !14, line: 254, baseType: !35, size: 8, offset: 9288)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !591, file: !14, line: 255, baseType: !68, size: 16, offset: 9296)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !591, file: !14, line: 256, baseType: !534, size: 96, offset: 9312)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !591, file: !14, line: 258, baseType: !78, size: 128, offset: 9408)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !591, file: !14, line: 259, baseType: !78, size: 128, offset: 9536)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !591, file: !14, line: 260, baseType: !78, size: 128, offset: 9664)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !591, file: !14, line: 261, baseType: !78, size: 128, offset: 9792)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !591, file: !14, line: 263, baseType: !799, size: 64, offset: 9920)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !364, line: 244, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !591, file: !14, line: 264, baseType: !802, size: 64, offset: 9984)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !14, line: 53, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !591, file: !14, line: 265, baseType: !805, size: 64, offset: 10048)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !364, line: 238, flags: DIFlagFwdDecl)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !591, file: !14, line: 267, baseType: !35, size: 8, offset: 10112)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !591, file: !14, line: 268, baseType: !35, size: 8, offset: 10120)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !591, file: !14, line: 269, baseType: !68, size: 16, offset: 10128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !591, file: !14, line: 270, baseType: !188, size: 32, offset: 10144)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !591, file: !14, line: 272, baseType: !812, size: 64, offset: 10176)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !14, line: 54, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !591, file: !14, line: 275, baseType: !815, size: 64, offset: 10240)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !14, line: 275, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !591, file: !14, line: 277, baseType: !818, size: 64, offset: 10304)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !364, line: 272, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !591, file: !14, line: 277, baseType: !818, size: 64, offset: 10368)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !591, file: !14, line: 278, baseType: !822, size: 64, offset: 10432)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !823, line: 27, baseType: !824)
!823 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !825, line: 45, baseType: !826)
!825 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!826 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !591, file: !14, line: 279, baseType: !822, size: 64, offset: 10496)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !591, file: !14, line: 280, baseType: !5, size: 32, offset: 10560)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !591, file: !14, line: 281, baseType: !5, size: 32, offset: 10592)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !591, file: !14, line: 283, baseType: !78, size: 128, offset: 10624)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !591, file: !14, line: 284, baseType: !78, size: 128, offset: 10752)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !591, file: !14, line: 285, baseType: !833, size: 64, offset: 10880)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !591, file: !14, line: 287, baseType: !835, size: 64, offset: 10944)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !14, line: 59, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !591, file: !14, line: 288, baseType: !838, size: 64, offset: 11008)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !14, line: 288, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !591, file: !14, line: 290, baseType: !497, size: 64, offset: 11072)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !591, file: !14, line: 291, baseType: !842, size: 64, offset: 11136)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
