; ModuleID = 'blender/source/blender/editors/physics/rigidbody_constraint.c'
source_filename = "blender/source/blender/editors/physics/rigidbody_constraint.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Scene = type { %struct.ID, %struct.AnimData*, %struct.Object*, %struct.World*, %struct.Scene*, %struct.ListBase, %struct.Base*, %struct.Object*, [3 x float], [3 x float], [3 x float], [3 x float], i32, i32, i32, i16, i8, [1 x i8], %struct.bNodeTree*, %struct.Editing*, %struct.ToolSettings*, %struct.SceneStats*, %struct.RenderData, %struct.AudioData, %struct.ListBase, %struct.ListBase, i8*, i8*, i8*, i8*, i8*, %struct.DagForest*, i16, i16, i32, %struct.ListBase, %struct.GameFraming, %struct.GameData, %struct.UnitSettings, %struct.bGPdata*, %struct.PhysicsSettings, %struct.MovieClip*, i64, i64, %struct.ColorManagedViewSettings, %struct.ColorManagedDisplaySettings, %struct.ColorManagedColorspaceSettings, %struct.RigidBodyWorld* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!19 = !DIEnumerator(name: "RBC_FLAG_ENABLED", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "RBC_FLAG_NEEDS_VALIDATE", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "RBC_FLAG_DISABLE_COLLISIONS", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "RBC_FLAG_USE_BREAKING", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "RBC_FLAG_OVERRIDE_SOLVER_ITERATIONS", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_LIN_X", value: 32, isUnsigned: true)
!25 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_LIN_Y", value: 64, isUnsigned: true)
!26 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_LIN_Z", value: 128, isUnsigned: true)
!27 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_ANG_X", value: 256, isUnsigned: true)
!28 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_ANG_Y", value: 512, isUnsigned: true)
!29 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_ANG_Z", value: 1024, isUnsigned: true)
!30 = !DIEnumerator(name: "RBC_FLAG_USE_SPRING_X", value: 2048, isUnsigned: true)
!31 = !DIEnumerator(name: "RBC_FLAG_USE_SPRING_Y", value: 4096, isUnsigned: true)
!32 = !DIEnumerator(name: "RBC_FLAG_USE_SPRING_Z", value: 8192, isUnsigned: true)
!33 = !DIEnumerator(name: "RBC_FLAG_USE_MOTOR_LIN", value: 16384, isUnsigned: true)
!34 = !DIEnumerator(name: "RBC_FLAG_USE_MOTOR_ANG", value: 32768, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 519, baseType: !5, size: 32, elements: !37)
!36 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRigidBodyCon_Type", file: !17, line: 246, baseType: !5, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!44 = !DIEnumerator(name: "RBC_TYPE_POINT", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "RBC_TYPE_HINGE", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "RBC_TYPE_HINGE2", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "RBC_TYPE_SLIDER", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "RBC_TYPE_CONE_TWIST", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "RBC_TYPE_6DOF", value: 5, isUnsigned: true)
!50 = !DIEnumerator(name: "RBC_TYPE_6DOF_SPRING", value: 6, isUnsigned: true)
!51 = !DIEnumerator(name: "RBC_TYPE_UNIVERSAL", value: 7, isUnsigned: true)
!52 = !DIEnumerator(name: "RBC_TYPE_FIXED", value: 8, isUnsigned: true)
!53 = !DIEnumerator(name: "RBC_TYPE_PISTON", value: 9, isUnsigned: true)
!54 = !DIEnumerator(name: "RBC_TYPE_SPRING", value: 10, isUnsigned: true)
!55 = !DIEnumerator(name: "RBC_TYPE_MOTOR", value: 11, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 351, baseType: !5, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63}
!58 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!63 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !{i32 7, !"Dwarf Version", i32 4}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!70 = distinct !DISubprogram(name: "ED_rigidbody_constraint_add", scope: !1, file: !1, line: 75, type: !71, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1829)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !74, !1682, !115, !1684}
!73 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !76, line: 1299, baseType: !77)
!76 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !76, line: 1216, size: 39680, elements: !78)
!78 = !{!79, !150, !154, !497, !500, !501, !502, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !528, !603, !1031, !1245, !1248, !1537, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1559, !1560, !1561, !1562, !1563, !1571, !1638, !1645, !1646, !1653, !1654, !1655, !1656, !1657, !1658, !1659}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !77, file: !76, line: 1217, baseType: !80, size: 960)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !81, line: 130, baseType: !82)
!81 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !81, line: 117, size: 960, elements: !83)
!83 = !{!84, !85, !86, !88, !108, !112, !114, !116, !117, !118}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !81, line: 118, baseType: !65, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !82, file: !81, line: 118, baseType: !65, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !82, file: !81, line: 119, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !82, file: !81, line: 120, baseType: !89, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !81, line: 136, size: 17600, elements: !91)
!91 = !{!92, !93, !95, !98, !103, !104, !105}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !90, file: !81, line: 137, baseType: !80, size: 960)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !90, file: !81, line: 138, baseType: !94, size: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !90, file: !81, line: 139, baseType: !96, size: 64, offset: 1024)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !81, line: 43, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !81, line: 140, baseType: !99, size: 8192, offset: 1088)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 8192, elements: !101)
!100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!101 = !{!102}
!102 = !DISubrange(count: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !90, file: !81, line: 141, baseType: !99, size: 8192, offset: 9280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !90, file: !81, line: 148, baseType: !89, size: 64, offset: 17472)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !90, file: !81, line: 150, baseType: !106, size: 64, offset: 17536)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !81, line: 45, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !81, line: 121, baseType: !109, size: 528, offset: 256)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 528, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 66)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !82, file: !81, line: 126, baseType: !113, size: 16, offset: 784)
!113 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !82, file: !81, line: 127, baseType: !115, size: 32, offset: 800)
!115 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !82, file: !81, line: 128, baseType: !115, size: 32, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !82, file: !81, line: 128, baseType: !115, size: 32, offset: 864)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !82, file: !81, line: 129, baseType: !119, size: 64, offset: 896)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !81, line: 75, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !81, line: 62, size: 1024, elements: !122)
!122 = !{!123, !125, !126, !127, !128, !129, !133, !134, !148, !149}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !81, line: 63, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !81, line: 63, baseType: !124, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !81, line: 64, baseType: !100, size: 8, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !121, file: !81, line: 64, baseType: !100, size: 8, offset: 136)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !81, line: 65, baseType: !113, size: 16, offset: 144)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !81, line: 66, baseType: !130, size: 512, offset: 160)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 512, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !121, file: !81, line: 67, baseType: !115, size: 32, offset: 672)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !81, line: 69, baseType: !135, size: 256, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !81, line: 60, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !81, line: 48, size: 256, elements: !137)
!137 = !{!138, !139, !146, !147}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !136, file: !81, line: 49, baseType: !65, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !136, file: !81, line: 58, baseType: !140, size: 128, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !141, line: 71, baseType: !142)
!141 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !141, line: 69, size: 128, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !142, file: !141, line: 70, baseType: !65, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !142, file: !141, line: 70, baseType: !65, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !136, file: !81, line: 59, baseType: !115, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !136, file: !81, line: 59, baseType: !115, size: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !121, file: !81, line: 70, baseType: !115, size: 32, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !121, file: !81, line: 74, baseType: !115, size: 32, offset: 992)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !77, file: !76, line: 1218, baseType: !151, size: 64, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !153, line: 45, flags: DIFlagFwdDecl)
!153 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !77, file: !76, line: 1220, baseType: !155, size: 64, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !36, line: 115, size: 11392, elements: !157)
!157 = !{!158, !159, !160, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !177, !189, !203, !204, !247, !248, !251, !252, !268, !269, !270, !271, !272, !273, !274, !278, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !294, !295, !296, !297, !298, !299, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !359, !360, !361, !362, !363, !364, !365, !366, !367, !370, !373, !376, !377, !378, !379, !380, !383, !386, !389, !390, !396, !397, !398, !399, !400, !401, !403, !426, !460, !464, !485, !486}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !156, file: !36, line: 116, baseType: !80, size: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !156, file: !36, line: 117, baseType: !151, size: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !156, file: !36, line: 119, baseType: !161, size: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !36, line: 57, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !36, line: 121, baseType: !113, size: 16, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !156, file: !36, line: 121, baseType: !113, size: 16, offset: 1104)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !156, file: !36, line: 122, baseType: !115, size: 32, offset: 1120)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !156, file: !36, line: 122, baseType: !115, size: 32, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !156, file: !36, line: 122, baseType: !115, size: 32, offset: 1184)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !156, file: !36, line: 123, baseType: !130, size: 512, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !156, file: !36, line: 124, baseType: !155, size: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !156, file: !36, line: 124, baseType: !155, size: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !156, file: !36, line: 127, baseType: !155, size: 64, offset: 1856)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !156, file: !36, line: 127, baseType: !155, size: 64, offset: 1920)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !156, file: !36, line: 127, baseType: !155, size: 64, offset: 1984)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !156, file: !36, line: 128, baseType: !175, size: 64, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !153, line: 46, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !156, file: !36, line: 130, baseType: !178, size: 64, offset: 2112)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !36, line: 97, size: 832, elements: !180)
!180 = !{!181, !187, !188}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !179, file: !36, line: 98, baseType: !182, size: 768)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 768, elements: !184)
!183 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!184 = !{!185, !186}
!185 = !DISubrange(count: 8)
!186 = !DISubrange(count: 3)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !36, line: 99, baseType: !115, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !179, file: !36, line: 99, baseType: !115, size: 32, offset: 800)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !156, file: !36, line: 131, baseType: !190, size: 64, offset: 2176)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !192, line: 486, size: 1600, elements: !193)
!192 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !191, file: !192, line: 487, baseType: !80, size: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !191, file: !192, line: 489, baseType: !140, size: 128, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !191, file: !192, line: 490, baseType: !140, size: 128, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !191, file: !192, line: 491, baseType: !140, size: 128, offset: 1216)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !191, file: !192, line: 492, baseType: !140, size: 128, offset: 1344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !192, line: 494, baseType: !115, size: 32, offset: 1472)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !191, file: !192, line: 495, baseType: !115, size: 32, offset: 1504)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !191, file: !192, line: 497, baseType: !115, size: 32, offset: 1536)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !191, file: !192, line: 498, baseType: !115, size: 32, offset: 1568)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !156, file: !36, line: 132, baseType: !190, size: 64, offset: 2240)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !156, file: !36, line: 133, baseType: !205, size: 64, offset: 2304)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !192, line: 334, size: 1728, elements: !207)
!207 = !{!208, !209, !212, !213, !214, !215, !216, !217, !220, !221, !222, !223, !224, !225, !226, !246}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !206, file: !192, line: 335, baseType: !140, size: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !206, file: !192, line: 336, baseType: !210, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !192, line: 47, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !206, file: !192, line: 338, baseType: !113, size: 16, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !206, file: !192, line: 338, baseType: !113, size: 16, offset: 208)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !206, file: !192, line: 339, baseType: !5, size: 32, offset: 224)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !206, file: !192, line: 340, baseType: !115, size: 32, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !206, file: !192, line: 342, baseType: !183, size: 32, offset: 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !206, file: !192, line: 343, baseType: !218, size: 96, offset: 320)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 96, elements: !219)
!219 = !{!186}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !206, file: !192, line: 344, baseType: !218, size: 96, offset: 416)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !206, file: !192, line: 347, baseType: !140, size: 128, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !206, file: !192, line: 349, baseType: !115, size: 32, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !206, file: !192, line: 350, baseType: !115, size: 32, offset: 672)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !206, file: !192, line: 351, baseType: !65, size: 64, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !206, file: !192, line: 352, baseType: !65, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !206, file: !192, line: 354, baseType: !227, size: 384, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !192, line: 116, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !192, line: 94, size: 384, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !228, file: !192, line: 96, baseType: !115, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !228, file: !192, line: 96, baseType: !115, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !228, file: !192, line: 97, baseType: !115, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !228, file: !192, line: 97, baseType: !115, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !228, file: !192, line: 99, baseType: !113, size: 16, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !228, file: !192, line: 100, baseType: !113, size: 16, offset: 144)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !228, file: !192, line: 102, baseType: !113, size: 16, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !228, file: !192, line: 105, baseType: !113, size: 16, offset: 176)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !228, file: !192, line: 108, baseType: !113, size: 16, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !228, file: !192, line: 109, baseType: !113, size: 16, offset: 208)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !228, file: !192, line: 111, baseType: !113, size: 16, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !228, file: !192, line: 112, baseType: !113, size: 16, offset: 240)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !228, file: !192, line: 114, baseType: !115, size: 32, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !228, file: !192, line: 114, baseType: !115, size: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !228, file: !192, line: 115, baseType: !115, size: 32, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !228, file: !192, line: 115, baseType: !115, size: 32, offset: 352)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !206, file: !192, line: 355, baseType: !130, size: 512, offset: 1216)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !156, file: !36, line: 134, baseType: !65, size: 64, offset: 2368)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !156, file: !36, line: 136, baseType: !249, size: 64, offset: 2432)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !36, line: 58, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !156, file: !36, line: 138, baseType: !227, size: 384, offset: 2496)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !156, file: !36, line: 139, baseType: !253, size: 64, offset: 2880)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !192, line: 80, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !192, line: 72, size: 192, elements: !256)
!256 = !{!257, !264, !265, !266, !267}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !255, file: !192, line: 73, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !192, line: 59, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !192, line: 56, size: 128, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !260, file: !192, line: 57, baseType: !218, size: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !192, line: 58, baseType: !115, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !255, file: !192, line: 74, baseType: !115, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !255, file: !192, line: 76, baseType: !115, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !255, file: !192, line: 77, baseType: !115, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !255, file: !192, line: 79, baseType: !115, size: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !156, file: !36, line: 141, baseType: !140, size: 128, offset: 2944)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !156, file: !36, line: 142, baseType: !140, size: 128, offset: 3072)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !156, file: !36, line: 143, baseType: !140, size: 128, offset: 3200)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !156, file: !36, line: 144, baseType: !140, size: 128, offset: 3328)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !156, file: !36, line: 146, baseType: !115, size: 32, offset: 3456)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !156, file: !36, line: 147, baseType: !115, size: 32, offset: 3488)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !156, file: !36, line: 150, baseType: !275, size: 64, offset: 3520)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !36, line: 50, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !156, file: !36, line: 151, baseType: !279, size: 64, offset: 3584)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !156, file: !36, line: 152, baseType: !115, size: 32, offset: 3648)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !156, file: !36, line: 153, baseType: !115, size: 32, offset: 3680)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !156, file: !36, line: 156, baseType: !218, size: 96, offset: 3712)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !156, file: !36, line: 156, baseType: !218, size: 96, offset: 3808)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !156, file: !36, line: 156, baseType: !218, size: 96, offset: 3904)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !156, file: !36, line: 157, baseType: !218, size: 96, offset: 4000)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !156, file: !36, line: 158, baseType: !218, size: 96, offset: 4096)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !156, file: !36, line: 159, baseType: !218, size: 96, offset: 4192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !156, file: !36, line: 160, baseType: !218, size: 96, offset: 4288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !156, file: !36, line: 160, baseType: !218, size: 96, offset: 4384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !156, file: !36, line: 161, baseType: !291, size: 128, offset: 4480)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 128, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 4)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !156, file: !36, line: 161, baseType: !291, size: 128, offset: 4608)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !156, file: !36, line: 162, baseType: !218, size: 96, offset: 4736)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !156, file: !36, line: 162, baseType: !218, size: 96, offset: 4832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !156, file: !36, line: 163, baseType: !183, size: 32, offset: 4928)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !156, file: !36, line: 163, baseType: !183, size: 32, offset: 4960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !156, file: !36, line: 164, baseType: !300, size: 512, offset: 4992)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 512, elements: !301)
!301 = !{!293, !293}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !156, file: !36, line: 165, baseType: !300, size: 512, offset: 5504)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !156, file: !36, line: 166, baseType: !300, size: 512, offset: 6016)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !156, file: !36, line: 167, baseType: !300, size: 512, offset: 6528)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !156, file: !36, line: 176, baseType: !300, size: 512, offset: 7040)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !156, file: !36, line: 178, baseType: !5, size: 32, offset: 7552)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !156, file: !36, line: 180, baseType: !113, size: 16, offset: 7584)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !156, file: !36, line: 181, baseType: !113, size: 16, offset: 7600)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !156, file: !36, line: 183, baseType: !113, size: 16, offset: 7616)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !156, file: !36, line: 183, baseType: !113, size: 16, offset: 7632)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !156, file: !36, line: 184, baseType: !113, size: 16, offset: 7648)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !156, file: !36, line: 184, baseType: !113, size: 16, offset: 7664)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !156, file: !36, line: 185, baseType: !113, size: 16, offset: 7680)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !156, file: !36, line: 186, baseType: !113, size: 16, offset: 7696)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !156, file: !36, line: 187, baseType: !113, size: 16, offset: 7712)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !156, file: !36, line: 188, baseType: !100, size: 8, offset: 7728)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !156, file: !36, line: 189, baseType: !100, size: 8, offset: 7736)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !156, file: !36, line: 192, baseType: !115, size: 32, offset: 7744)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !156, file: !36, line: 192, baseType: !115, size: 32, offset: 7776)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !156, file: !36, line: 192, baseType: !115, size: 32, offset: 7808)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !156, file: !36, line: 192, baseType: !115, size: 32, offset: 7840)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !156, file: !36, line: 194, baseType: !115, size: 32, offset: 7872)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !156, file: !36, line: 202, baseType: !183, size: 32, offset: 7904)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !156, file: !36, line: 202, baseType: !183, size: 32, offset: 7936)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !156, file: !36, line: 202, baseType: !183, size: 32, offset: 7968)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !156, file: !36, line: 211, baseType: !183, size: 32, offset: 8000)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !156, file: !36, line: 212, baseType: !183, size: 32, offset: 8032)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !156, file: !36, line: 213, baseType: !183, size: 32, offset: 8064)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !156, file: !36, line: 214, baseType: !183, size: 32, offset: 8096)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !156, file: !36, line: 215, baseType: !183, size: 32, offset: 8128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !156, file: !36, line: 216, baseType: !183, size: 32, offset: 8160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !156, file: !36, line: 219, baseType: !183, size: 32, offset: 8192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !156, file: !36, line: 220, baseType: !183, size: 32, offset: 8224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !156, file: !36, line: 221, baseType: !183, size: 32, offset: 8256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !156, file: !36, line: 224, baseType: !336, size: 16, offset: 8288)
!336 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !156, file: !36, line: 224, baseType: !336, size: 16, offset: 8304)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !156, file: !36, line: 226, baseType: !113, size: 16, offset: 8320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !156, file: !36, line: 228, baseType: !100, size: 8, offset: 8336)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !156, file: !36, line: 229, baseType: !100, size: 8, offset: 8344)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !156, file: !36, line: 231, baseType: !113, size: 16, offset: 8352)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !156, file: !36, line: 232, baseType: !100, size: 8, offset: 8368)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !156, file: !36, line: 233, baseType: !100, size: 8, offset: 8376)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !156, file: !36, line: 234, baseType: !183, size: 32, offset: 8384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !156, file: !36, line: 235, baseType: !183, size: 32, offset: 8416)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !156, file: !36, line: 237, baseType: !140, size: 128, offset: 8448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !156, file: !36, line: 238, baseType: !140, size: 128, offset: 8576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !156, file: !36, line: 239, baseType: !140, size: 128, offset: 8704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !156, file: !36, line: 240, baseType: !140, size: 128, offset: 8832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !156, file: !36, line: 242, baseType: !183, size: 32, offset: 8960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !156, file: !36, line: 244, baseType: !113, size: 16, offset: 8992)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !156, file: !36, line: 245, baseType: !336, size: 16, offset: 9008)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !156, file: !36, line: 246, baseType: !291, size: 128, offset: 9024)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !156, file: !36, line: 248, baseType: !115, size: 32, offset: 9152)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !156, file: !36, line: 249, baseType: !115, size: 32, offset: 9184)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !156, file: !36, line: 251, baseType: !357, size: 64, offset: 9216)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !36, line: 251, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !156, file: !36, line: 253, baseType: !100, size: 8, offset: 9280)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !156, file: !36, line: 254, baseType: !100, size: 8, offset: 9288)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !156, file: !36, line: 255, baseType: !113, size: 16, offset: 9296)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !156, file: !36, line: 256, baseType: !218, size: 96, offset: 9312)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !156, file: !36, line: 258, baseType: !140, size: 128, offset: 9408)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !156, file: !36, line: 259, baseType: !140, size: 128, offset: 9536)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !156, file: !36, line: 260, baseType: !140, size: 128, offset: 9664)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !156, file: !36, line: 261, baseType: !140, size: 128, offset: 9792)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !156, file: !36, line: 263, baseType: !368, size: 64, offset: 9920)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !36, line: 52, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !156, file: !36, line: 264, baseType: !371, size: 64, offset: 9984)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !36, line: 53, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !156, file: !36, line: 265, baseType: !374, size: 64, offset: 10048)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !192, line: 46, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !156, file: !36, line: 267, baseType: !100, size: 8, offset: 10112)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !156, file: !36, line: 268, baseType: !100, size: 8, offset: 10120)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !156, file: !36, line: 269, baseType: !113, size: 16, offset: 10128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !156, file: !36, line: 270, baseType: !183, size: 32, offset: 10144)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !156, file: !36, line: 272, baseType: !381, size: 64, offset: 10176)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !36, line: 54, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !156, file: !36, line: 275, baseType: !384, size: 64, offset: 10240)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !36, line: 275, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !156, file: !36, line: 277, baseType: !387, size: 64, offset: 10304)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !36, line: 56, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !156, file: !36, line: 277, baseType: !387, size: 64, offset: 10368)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !156, file: !36, line: 278, baseType: !391, size: 64, offset: 10432)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !392, line: 27, baseType: !393)
!392 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !394, line: 45, baseType: !395)
!394 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!395 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !156, file: !36, line: 279, baseType: !391, size: 64, offset: 10496)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !36, line: 280, baseType: !5, size: 32, offset: 10560)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !156, file: !36, line: 281, baseType: !5, size: 32, offset: 10592)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !156, file: !36, line: 283, baseType: !140, size: 128, offset: 10624)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !156, file: !36, line: 284, baseType: !140, size: 128, offset: 10752)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !156, file: !36, line: 285, baseType: !402, size: 64, offset: 10880)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !156, file: !36, line: 287, baseType: !404, size: 64, offset: 10944)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !17, line: 95, size: 768, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "physics_object", scope: !405, file: !17, line: 97, baseType: !65, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "physics_shape", scope: !405, file: !17, line: 98, baseType: !65, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !405, file: !17, line: 101, baseType: !113, size: 16, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !405, file: !17, line: 102, baseType: !113, size: 16, offset: 144)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !405, file: !17, line: 104, baseType: !115, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "col_groups", scope: !405, file: !17, line: 105, baseType: !115, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mesh_source", scope: !405, file: !17, line: 106, baseType: !113, size: 16, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !405, file: !17, line: 107, baseType: !113, size: 16, offset: 240)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !405, file: !17, line: 110, baseType: !183, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !405, file: !17, line: 112, baseType: !183, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "restitution", scope: !405, file: !17, line: 113, baseType: !183, size: 32, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !405, file: !17, line: 115, baseType: !183, size: 32, offset: 352)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lin_damping", scope: !405, file: !17, line: 117, baseType: !183, size: 32, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ang_damping", scope: !405, file: !17, line: 118, baseType: !183, size: 32, offset: 416)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lin_sleep_thresh", scope: !405, file: !17, line: 120, baseType: !183, size: 32, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ang_sleep_thresh", scope: !405, file: !17, line: 121, baseType: !183, size: 32, offset: 480)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "orn", scope: !405, file: !17, line: 123, baseType: !291, size: 128, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !405, file: !17, line: 124, baseType: !218, size: 96, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !405, file: !17, line: 125, baseType: !183, size: 32, offset: 736)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !156, file: !36, line: 288, baseType: !427, size: 64, offset: 11008)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !17, line: 195, size: 1024, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ob1", scope: !428, file: !17, line: 196, baseType: !155, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ob2", scope: !428, file: !17, line: 197, baseType: !155, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !428, file: !17, line: 200, baseType: !113, size: 16, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "num_solver_iterations", scope: !428, file: !17, line: 201, baseType: !113, size: 16, offset: 144)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !17, line: 203, baseType: !115, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "breaking_threshold", scope: !428, file: !17, line: 205, baseType: !183, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !428, file: !17, line: 206, baseType: !183, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_x_lower", scope: !428, file: !17, line: 210, baseType: !183, size: 32, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_x_upper", scope: !428, file: !17, line: 211, baseType: !183, size: 32, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_y_lower", scope: !428, file: !17, line: 212, baseType: !183, size: 32, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_y_upper", scope: !428, file: !17, line: 213, baseType: !183, size: 32, offset: 352)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_z_lower", scope: !428, file: !17, line: 214, baseType: !183, size: 32, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_z_upper", scope: !428, file: !17, line: 215, baseType: !183, size: 32, offset: 416)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_x_lower", scope: !428, file: !17, line: 217, baseType: !183, size: 32, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_x_upper", scope: !428, file: !17, line: 218, baseType: !183, size: 32, offset: 480)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_y_lower", scope: !428, file: !17, line: 219, baseType: !183, size: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_y_upper", scope: !428, file: !17, line: 220, baseType: !183, size: 32, offset: 544)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_z_lower", scope: !428, file: !17, line: 221, baseType: !183, size: 32, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_z_upper", scope: !428, file: !17, line: 222, baseType: !183, size: 32, offset: 608)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "spring_stiffness_x", scope: !428, file: !17, line: 226, baseType: !183, size: 32, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "spring_stiffness_y", scope: !428, file: !17, line: 227, baseType: !183, size: 32, offset: 672)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "spring_stiffness_z", scope: !428, file: !17, line: 228, baseType: !183, size: 32, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "spring_damping_x", scope: !428, file: !17, line: 230, baseType: !183, size: 32, offset: 736)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "spring_damping_y", scope: !428, file: !17, line: 231, baseType: !183, size: 32, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "spring_damping_z", scope: !428, file: !17, line: 232, baseType: !183, size: 32, offset: 800)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "motor_lin_target_velocity", scope: !428, file: !17, line: 235, baseType: !183, size: 32, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "motor_ang_target_velocity", scope: !428, file: !17, line: 236, baseType: !183, size: 32, offset: 864)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "motor_lin_max_impulse", scope: !428, file: !17, line: 237, baseType: !183, size: 32, offset: 896)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "motor_ang_max_impulse", scope: !428, file: !17, line: 238, baseType: !183, size: 32, offset: 928)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "physics_constraint", scope: !428, file: !17, line: 241, baseType: !65, size: 64, offset: 960)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !156, file: !36, line: 290, baseType: !461, size: 64, offset: 11072)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 64, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 2)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !156, file: !36, line: 291, baseType: !465, size: 64, offset: 11136)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !467, line: 65, baseType: !468)
!467 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !467, line: 50, size: 320, elements: !469)
!469 = !{!470, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !468, file: !467, line: 51, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !468, file: !467, line: 53, baseType: !115, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !468, file: !467, line: 54, baseType: !115, size: 32, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !468, file: !467, line: 55, baseType: !115, size: 32, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !468, file: !467, line: 55, baseType: !115, size: 32, offset: 160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !468, file: !467, line: 56, baseType: !100, size: 8, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !468, file: !467, line: 56, baseType: !100, size: 8, offset: 200)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !468, file: !467, line: 57, baseType: !100, size: 8, offset: 208)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !468, file: !467, line: 57, baseType: !100, size: 8, offset: 216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !468, file: !467, line: 59, baseType: !113, size: 16, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !468, file: !467, line: 59, baseType: !113, size: 16, offset: 240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !468, file: !467, line: 59, baseType: !113, size: 16, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !468, file: !467, line: 61, baseType: !113, size: 16, offset: 272)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !468, file: !467, line: 63, baseType: !115, size: 32, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !156, file: !36, line: 293, baseType: !140, size: 128, offset: 11200)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !156, file: !36, line: 294, baseType: !487, size: 64, offset: 11328)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !36, line: 113, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !36, line: 108, size: 256, elements: !490)
!490 = !{!491, !493, !494, !495, !496}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !36, line: 109, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !489, file: !36, line: 109, baseType: !492, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !489, file: !36, line: 110, baseType: !155, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !489, file: !36, line: 111, baseType: !115, size: 32, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !489, file: !36, line: 112, baseType: !183, size: 32, offset: 224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !77, file: !76, line: 1221, baseType: !498, size: 64, offset: 1088)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !76, line: 52, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !77, file: !76, line: 1223, baseType: !471, size: 64, offset: 1152)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !77, file: !76, line: 1225, baseType: !140, size: 128, offset: 1216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !77, file: !76, line: 1226, baseType: !503, size: 64, offset: 1344)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !76, line: 69, size: 320, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !76, line: 70, baseType: !503, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !504, file: !76, line: 70, baseType: !503, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !504, file: !76, line: 71, baseType: !5, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !504, file: !76, line: 71, baseType: !5, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !504, file: !76, line: 72, baseType: !115, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !504, file: !76, line: 73, baseType: !113, size: 16, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !504, file: !76, line: 73, baseType: !113, size: 16, offset: 240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !504, file: !76, line: 74, baseType: !155, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !77, file: !76, line: 1227, baseType: !155, size: 64, offset: 1408)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !77, file: !76, line: 1229, baseType: !218, size: 96, offset: 1472)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !77, file: !76, line: 1230, baseType: !218, size: 96, offset: 1568)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !77, file: !76, line: 1231, baseType: !218, size: 96, offset: 1664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !77, file: !76, line: 1231, baseType: !218, size: 96, offset: 1760)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !77, file: !76, line: 1233, baseType: !5, size: 32, offset: 1856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !77, file: !76, line: 1234, baseType: !115, size: 32, offset: 1888)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !77, file: !76, line: 1235, baseType: !5, size: 32, offset: 1920)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !77, file: !76, line: 1237, baseType: !113, size: 16, offset: 1952)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !77, file: !76, line: 1239, baseType: !100, size: 8, offset: 1968)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !77, file: !76, line: 1240, baseType: !525, size: 8, offset: 1976)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 8, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 1)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !77, file: !76, line: 1242, baseType: !529, size: 64, offset: 1984)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !531, line: 328, size: 3456, elements: !532)
!531 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!532 = !{!533, !534, !535, !539, !540, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !569, !570, !571, !574, !579, !580, !583, !587, !591, !595, !599, !600, !601, !602}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !530, file: !531, line: 329, baseType: !80, size: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !530, file: !531, line: 330, baseType: !151, size: 64, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !530, file: !531, line: 332, baseType: !536, size: 64, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !538, line: 32, flags: DIFlagFwdDecl)
!538 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!539 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !530, file: !531, line: 333, baseType: !130, size: 512, offset: 1088)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !530, file: !531, line: 335, baseType: !541, size: 64, offset: 1600)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !543, line: 41, flags: DIFlagFwdDecl)
!543 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !530, file: !531, line: 337, baseType: !249, size: 64, offset: 1664)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !530, file: !531, line: 338, baseType: !461, size: 64, offset: 1728)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !530, file: !531, line: 340, baseType: !140, size: 128, offset: 1792)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !530, file: !531, line: 340, baseType: !140, size: 128, offset: 1920)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !531, line: 342, baseType: !115, size: 32, offset: 2048)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !530, file: !531, line: 342, baseType: !115, size: 32, offset: 2080)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !530, file: !531, line: 343, baseType: !115, size: 32, offset: 2112)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !530, file: !531, line: 345, baseType: !115, size: 32, offset: 2144)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !530, file: !531, line: 346, baseType: !115, size: 32, offset: 2176)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !530, file: !531, line: 347, baseType: !113, size: 16, offset: 2208)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !530, file: !531, line: 348, baseType: !113, size: 16, offset: 2224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !530, file: !531, line: 349, baseType: !115, size: 32, offset: 2240)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !530, file: !531, line: 351, baseType: !115, size: 32, offset: 2272)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !530, file: !531, line: 353, baseType: !113, size: 16, offset: 2304)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !530, file: !531, line: 354, baseType: !113, size: 16, offset: 2320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !530, file: !531, line: 355, baseType: !115, size: 32, offset: 2336)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !530, file: !531, line: 357, baseType: !561, size: 128, offset: 2368)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !562, line: 95, baseType: !563)
!562 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !562, line: 92, size: 128, elements: !564)
!564 = !{!565, !566, !567, !568}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !563, file: !562, line: 93, baseType: !183, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !563, file: !562, line: 93, baseType: !183, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !563, file: !562, line: 94, baseType: !183, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !563, file: !562, line: 94, baseType: !183, size: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !530, file: !531, line: 363, baseType: !140, size: 128, offset: 2496)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !530, file: !531, line: 363, baseType: !140, size: 128, offset: 2624)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !530, file: !531, line: 368, baseType: !572, size: 64, offset: 2752)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !531, line: 48, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !530, file: !531, line: 372, baseType: !575, size: 32, offset: 2816)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !531, line: 274, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !531, line: 271, size: 32, elements: !577)
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !576, file: !531, line: 273, baseType: !5, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !530, file: !531, line: 373, baseType: !115, size: 32, offset: 2848)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !530, file: !531, line: 382, baseType: !581, size: 64, offset: 2880)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !531, line: 46, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !530, file: !531, line: 385, baseType: !584, size: 64, offset: 2944)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !65, !183}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !530, file: !531, line: 386, baseType: !588, size: 64, offset: 3008)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !65, !279}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !530, file: !531, line: 387, baseType: !592, size: 64, offset: 3072)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!115, !65}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !530, file: !531, line: 388, baseType: !596, size: 64, offset: 3136)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !65}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !530, file: !531, line: 389, baseType: !65, size: 64, offset: 3200)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !530, file: !531, line: 389, baseType: !65, size: 64, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !530, file: !531, line: 389, baseType: !65, size: 64, offset: 3328)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !530, file: !531, line: 389, baseType: !65, size: 64, offset: 3392)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !77, file: !76, line: 1244, baseType: !604, size: 64, offset: 2048)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !606, line: 200, size: 17024, elements: !607)
!606 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!607 = !{!608, !609, !610, !611, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !605, file: !606, line: 201, baseType: !402, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !605, file: !606, line: 202, baseType: !140, size: 128, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !605, file: !606, line: 203, baseType: !140, size: 128, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !605, file: !606, line: 206, baseType: !612, size: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !606, line: 190, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !606, line: 126, size: 2816, elements: !615)
!615 = !{!616, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !714, !715, !716, !717, !995, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1023}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !614, file: !606, line: 127, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !614, file: !606, line: 127, baseType: !617, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !614, file: !606, line: 128, baseType: !65, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !614, file: !606, line: 129, baseType: !65, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !614, file: !606, line: 130, baseType: !130, size: 512, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !614, file: !606, line: 132, baseType: !115, size: 32, offset: 768)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !614, file: !606, line: 132, baseType: !115, size: 32, offset: 800)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !614, file: !606, line: 133, baseType: !115, size: 32, offset: 832)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !614, file: !606, line: 134, baseType: !115, size: 32, offset: 864)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !614, file: !606, line: 134, baseType: !115, size: 32, offset: 896)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !614, file: !606, line: 134, baseType: !115, size: 32, offset: 928)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !614, file: !606, line: 135, baseType: !115, size: 32, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !614, file: !606, line: 135, baseType: !115, size: 32, offset: 992)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !614, file: !606, line: 136, baseType: !115, size: 32, offset: 1024)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !614, file: !606, line: 136, baseType: !115, size: 32, offset: 1056)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !614, file: !606, line: 137, baseType: !115, size: 32, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !614, file: !606, line: 137, baseType: !115, size: 32, offset: 1120)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !614, file: !606, line: 138, baseType: !183, size: 32, offset: 1152)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !614, file: !606, line: 139, baseType: !183, size: 32, offset: 1184)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !614, file: !606, line: 139, baseType: !183, size: 32, offset: 1216)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !614, file: !606, line: 141, baseType: !113, size: 16, offset: 1248)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !614, file: !606, line: 142, baseType: !113, size: 16, offset: 1264)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !614, file: !606, line: 143, baseType: !115, size: 32, offset: 1280)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !614, file: !606, line: 144, baseType: !115, size: 32, offset: 1312)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !614, file: !606, line: 146, baseType: !642, size: 64, offset: 1344)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !606, line: 114, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !606, line: 99, size: 7232, elements: !645)
!645 = !{!646, !648, !649, !650, !651, !652, !653, !664, !668, !682, !691, !698, !708}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !644, file: !606, line: 100, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !644, file: !606, line: 100, baseType: !647, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !644, file: !606, line: 101, baseType: !115, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !644, file: !606, line: 101, baseType: !115, size: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !644, file: !606, line: 102, baseType: !115, size: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !644, file: !606, line: 102, baseType: !115, size: 32, offset: 224)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !644, file: !606, line: 103, baseType: !654, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !606, line: 59, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !606, line: 56, size: 2112, elements: !657)
!657 = !{!658, !662, !663}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !656, file: !606, line: 57, baseType: !659, size: 2048)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2048, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !656, file: !606, line: 58, baseType: !115, size: 32, offset: 2048)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !656, file: !606, line: 58, baseType: !115, size: 32, offset: 2080)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !644, file: !606, line: 106, baseType: !665, size: 6144, offset: 320)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 6144, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 768)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !644, file: !606, line: 107, baseType: !669, size: 64, offset: 6464)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !606, line: 97, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !606, line: 83, size: 8320, elements: !672)
!672 = !{!673, !674, !675, !678, !679, !680, !681}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !671, file: !606, line: 84, baseType: !665, size: 6144)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !671, file: !606, line: 87, baseType: !659, size: 2048, offset: 6144)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !671, file: !606, line: 88, baseType: !676, size: 64, offset: 8192)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !467, line: 41, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !671, file: !606, line: 90, baseType: !113, size: 16, offset: 8256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !671, file: !606, line: 92, baseType: !113, size: 16, offset: 8272)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !671, file: !606, line: 93, baseType: !113, size: 16, offset: 8288)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !671, file: !606, line: 95, baseType: !113, size: 16, offset: 8304)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !644, file: !606, line: 108, baseType: !683, size: 64, offset: 6528)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !606, line: 66, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !606, line: 61, size: 128, elements: !686)
!686 = !{!687, !688, !689, !690}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !685, file: !606, line: 62, baseType: !115, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !685, file: !606, line: 63, baseType: !115, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !685, file: !606, line: 64, baseType: !115, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !685, file: !606, line: 65, baseType: !115, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !644, file: !606, line: 109, baseType: !692, size: 64, offset: 6592)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !606, line: 71, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !606, line: 68, size: 64, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !694, file: !606, line: 69, baseType: !115, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !694, file: !606, line: 70, baseType: !115, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !644, file: !606, line: 110, baseType: !699, size: 64, offset: 6656)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !606, line: 81, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !606, line: 73, size: 352, elements: !702)
!702 = !{!703, !704, !705, !706, !707}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !701, file: !606, line: 74, baseType: !218, size: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !701, file: !606, line: 75, baseType: !218, size: 96, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !701, file: !606, line: 76, baseType: !218, size: 96, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !701, file: !606, line: 77, baseType: !115, size: 32, offset: 288)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !701, file: !606, line: 78, baseType: !115, size: 32, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !644, file: !606, line: 113, baseType: !709, size: 512, offset: 6720)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !710, line: 182, baseType: !711)
!710 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !710, line: 180, size: 512, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !711, file: !710, line: 181, baseType: !130, size: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !614, file: !606, line: 148, baseType: !175, size: 64, offset: 1408)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !614, file: !606, line: 151, baseType: !471, size: 64, offset: 1472)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !614, file: !606, line: 152, baseType: !155, size: 64, offset: 1536)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !614, file: !606, line: 153, baseType: !718, size: 64, offset: 1600)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !720, line: 64, size: 19136, elements: !721)
!720 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!721 = !{!722, !723, !724, !725, !726, !727, !729, !730, !731, !732, !735, !736, !981, !982, !990, !991, !992, !993, !994}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !719, file: !720, line: 65, baseType: !80, size: 960)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !719, file: !720, line: 66, baseType: !151, size: 64, offset: 960)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !719, file: !720, line: 68, baseType: !99, size: 8192, offset: 1024)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !719, file: !720, line: 70, baseType: !115, size: 32, offset: 9216)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !719, file: !720, line: 71, baseType: !115, size: 32, offset: 9248)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !719, file: !720, line: 72, baseType: !728, size: 64, offset: 9280)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 64, elements: !462)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !719, file: !720, line: 74, baseType: !183, size: 32, offset: 9344)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !719, file: !720, line: 74, baseType: !183, size: 32, offset: 9376)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !719, file: !720, line: 76, baseType: !676, size: 64, offset: 9408)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !719, file: !720, line: 77, baseType: !733, size: 64, offset: 9472)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !720, line: 77, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !719, file: !720, line: 78, baseType: !249, size: 64, offset: 9536)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !719, file: !720, line: 80, baseType: !737, size: 2624, offset: 9600)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !738, line: 340, size: 2624, elements: !739)
!738 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!739 = !{!740, !768, !786, !787, !788, !803, !861, !862, !961, !962, !963, !964, !970}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !737, file: !738, line: 341, baseType: !741, size: 576)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !738, line: 251, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !738, line: 207, size: 576, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !742, file: !738, line: 208, baseType: !115, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !742, file: !738, line: 211, baseType: !113, size: 16, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !742, file: !738, line: 212, baseType: !113, size: 16, offset: 48)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !742, file: !738, line: 213, baseType: !183, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !742, file: !738, line: 214, baseType: !113, size: 16, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !742, file: !738, line: 215, baseType: !113, size: 16, offset: 112)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !742, file: !738, line: 216, baseType: !113, size: 16, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !742, file: !738, line: 217, baseType: !113, size: 16, offset: 144)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !742, file: !738, line: 218, baseType: !113, size: 16, offset: 160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !742, file: !738, line: 219, baseType: !113, size: 16, offset: 176)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !742, file: !738, line: 220, baseType: !183, size: 32, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !742, file: !738, line: 222, baseType: !113, size: 16, offset: 224)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !742, file: !738, line: 225, baseType: !113, size: 16, offset: 240)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !742, file: !738, line: 228, baseType: !115, size: 32, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !742, file: !738, line: 229, baseType: !115, size: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !742, file: !738, line: 233, baseType: !115, size: 32, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !742, file: !738, line: 236, baseType: !113, size: 16, offset: 352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !742, file: !738, line: 236, baseType: !113, size: 16, offset: 368)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !742, file: !738, line: 241, baseType: !183, size: 32, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !742, file: !738, line: 244, baseType: !115, size: 32, offset: 416)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !742, file: !738, line: 244, baseType: !115, size: 32, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !742, file: !738, line: 245, baseType: !183, size: 32, offset: 480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !742, file: !738, line: 248, baseType: !183, size: 32, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !742, file: !738, line: 250, baseType: !115, size: 32, offset: 544)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !737, file: !738, line: 342, baseType: !769, size: 448, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !738, line: 79, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !738, line: 61, size: 448, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !770, file: !738, line: 62, baseType: !65, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !770, file: !738, line: 64, baseType: !113, size: 16, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !770, file: !738, line: 65, baseType: !113, size: 16, offset: 80)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !770, file: !738, line: 67, baseType: !183, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !770, file: !738, line: 68, baseType: !183, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !770, file: !738, line: 69, baseType: !183, size: 32, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !770, file: !738, line: 70, baseType: !113, size: 16, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !770, file: !738, line: 71, baseType: !113, size: 16, offset: 208)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !770, file: !738, line: 72, baseType: !461, size: 64, offset: 224)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !770, file: !738, line: 75, baseType: !183, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !770, file: !738, line: 75, baseType: !183, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !770, file: !738, line: 75, baseType: !183, size: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !770, file: !738, line: 78, baseType: !183, size: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !770, file: !738, line: 78, baseType: !183, size: 32, offset: 416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !737, file: !738, line: 343, baseType: !140, size: 128, offset: 1024)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !737, file: !738, line: 344, baseType: !140, size: 128, offset: 1152)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !737, file: !738, line: 345, baseType: !789, size: 192, offset: 1280)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !738, line: 278, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !738, line: 270, size: 192, elements: !791)
!791 = !{!792, !793, !794, !795, !796}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !790, file: !738, line: 271, baseType: !115, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !790, file: !738, line: 273, baseType: !183, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !790, file: !738, line: 275, baseType: !115, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !790, file: !738, line: 276, baseType: !115, size: 32, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !790, file: !738, line: 277, baseType: !797, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !738, line: 55, size: 576, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !798, file: !738, line: 56, baseType: !115, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !798, file: !738, line: 57, baseType: !183, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !798, file: !738, line: 58, baseType: !300, size: 512, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !737, file: !738, line: 346, baseType: !804, size: 384, offset: 1472)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !738, line: 268, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !738, line: 253, size: 384, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !855, !856, !857, !858, !859, !860}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !805, file: !738, line: 254, baseType: !115, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !805, file: !738, line: 255, baseType: !115, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !805, file: !738, line: 255, baseType: !115, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !805, file: !738, line: 258, baseType: !183, size: 32, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !805, file: !738, line: 259, baseType: !812, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !738, line: 164, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !738, line: 108, size: 1664, elements: !815)
!815 = !{!816, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !814, file: !738, line: 109, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !814, file: !738, line: 109, baseType: !817, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !738, line: 111, baseType: !130, size: 512, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !814, file: !738, line: 119, baseType: !461, size: 64, offset: 640)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !814, file: !738, line: 119, baseType: !461, size: 64, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !814, file: !738, line: 125, baseType: !461, size: 64, offset: 768)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !814, file: !738, line: 125, baseType: !461, size: 64, offset: 832)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !814, file: !738, line: 127, baseType: !461, size: 64, offset: 896)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !814, file: !738, line: 130, baseType: !115, size: 32, offset: 960)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !814, file: !738, line: 131, baseType: !115, size: 32, offset: 992)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !814, file: !738, line: 132, baseType: !828, size: 64, offset: 1024)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !738, line: 106, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !738, line: 81, size: 512, elements: !831)
!831 = !{!832, !833, !836, !837, !838, !839}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !830, file: !738, line: 82, baseType: !461, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !830, file: !738, line: 97, baseType: !834, size: 256, offset: 64)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 256, elements: !835)
!835 = !{!293, !463}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !830, file: !738, line: 102, baseType: !461, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !830, file: !738, line: 102, baseType: !461, size: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !830, file: !738, line: 104, baseType: !115, size: 32, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !830, file: !738, line: 105, baseType: !115, size: 32, offset: 480)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !814, file: !738, line: 135, baseType: !218, size: 96, offset: 1088)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !814, file: !738, line: 136, baseType: !183, size: 32, offset: 1184)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !814, file: !738, line: 139, baseType: !115, size: 32, offset: 1216)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !814, file: !738, line: 139, baseType: !115, size: 32, offset: 1248)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !814, file: !738, line: 139, baseType: !115, size: 32, offset: 1280)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !814, file: !738, line: 140, baseType: !218, size: 96, offset: 1312)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !814, file: !738, line: 143, baseType: !113, size: 16, offset: 1408)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !814, file: !738, line: 144, baseType: !113, size: 16, offset: 1424)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !814, file: !738, line: 145, baseType: !113, size: 16, offset: 1440)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !814, file: !738, line: 148, baseType: !113, size: 16, offset: 1456)
