; ModuleID = 'blender/source/blender/render/intern/source/strand.c'
source_filename = "blender/source/blender/render/intern/source/strand.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StrandSegment = type { [4 x %struct.StrandVert*], %struct.StrandRen*, %struct.StrandBuffer*, %struct.ObjectInstanceRen*, float, %struct.StrandPoint, %struct.StrandPoint, i32 }
%struct.StrandVert = type { [3 x float], float }
%struct.StrandRen = type { %struct.StrandVert*, %struct.StrandBuffer*, i32, i32, i32, i32, [3 x float] }
%struct.StrandBuffer = type { %struct.StrandBuffer*, %struct.StrandBuffer*, %struct.StrandVert*, %struct.StrandBound*, i32, i32, %struct.ObjectRen*, %struct.Material*, %struct.StrandSurface*, i32, i32, i32, i32, float, float, float, float, [4 x [4 x float]], i32, i32 }
%struct.StrandBound = type { i32, i32, [2 x [3 x float]] }
%struct.ObjectRen = type { %struct.ObjectRen*, %struct.ObjectRen*, %struct.Object*, %struct.Object*, %struct.Scene*, i32, i32, i32, i32, [2 x [3 x float]], i32, i32, i32, i32, i32, i32, i32, i32, %struct.VertTableNode*, %struct.VlakTableNode*, %struct.StrandTableNode*, %struct.HaloRen**, %struct.StrandBuffer*, [64 x i8]*, [64 x i8]*, i32, i32, i32, [4 x [4 x float]], %struct.RayObject*, %struct.RayFace*, %struct.VlakPrimitive*, %struct.ObjectInstanceRen* }

!24 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !4, line: 152, baseType: !5, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 124, baseType: !5, size: 32, elements: !33)
!32 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "KEY_LINEAR", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "KEY_CARDINAL", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "KEY_BSPLINE", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "KEY_CATMULL_ROM", value: 3, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ScenePassType", file: !39, line: 213, baseType: !40, size: 32, elements: !41)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!42 = !DIEnumerator(name: "SCE_PASS_COMBINED", value: 1)
!43 = !DIEnumerator(name: "SCE_PASS_Z", value: 2)
!44 = !DIEnumerator(name: "SCE_PASS_RGBA", value: 4)
!45 = !DIEnumerator(name: "SCE_PASS_DIFFUSE", value: 8)
!46 = !DIEnumerator(name: "SCE_PASS_SPEC", value: 16)
!47 = !DIEnumerator(name: "SCE_PASS_SHADOW", value: 32)
!48 = !DIEnumerator(name: "SCE_PASS_AO", value: 64)
!49 = !DIEnumerator(name: "SCE_PASS_REFLECT", value: 128)
!50 = !DIEnumerator(name: "SCE_PASS_NORMAL", value: 256)
!51 = !DIEnumerator(name: "SCE_PASS_VECTOR", value: 512)
!52 = !DIEnumerator(name: "SCE_PASS_REFRACT", value: 1024)
!53 = !DIEnumerator(name: "SCE_PASS_INDEXOB", value: 2048)
!54 = !DIEnumerator(name: "SCE_PASS_UV", value: 4096)
!55 = !DIEnumerator(name: "SCE_PASS_INDIRECT", value: 8192)
!56 = !DIEnumerator(name: "SCE_PASS_MIST", value: 16384)
!57 = !DIEnumerator(name: "SCE_PASS_RAYHITS", value: 32768)
!58 = !DIEnumerator(name: "SCE_PASS_EMIT", value: 65536)
!59 = !DIEnumerator(name: "SCE_PASS_ENVIRONMENT", value: 131072)
!60 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!61 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!62 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!63 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!64 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!65 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!66 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!67 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!68 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!69 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!70 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!71 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!72 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!73 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!74 = !{!75, !76, !40, !2820, !2833}
!75 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "StrandPart", file: !1, line: 455, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StrandPart", file: !1, line: 436, size: 1024, elements: !79)
!79 = !{!80, !2672, !2751, !2752, !2753, !2754, !2755, !2760, !2761, !2762, !2763, !2764, !2766, !2767, !2806, !2807, !2808}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !78, file: !1, line: 437, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "Render", file: !83, line: 58, baseType: !84)
!83 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Render", file: !85, line: 126, size: 49920, elements: !86)
!85 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!86 = !{!87, !89, !90, !95, !96, !98, !99, !100, !101, !103, !2178, !2179, !2180, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2231, !2234, !2235, !2236, !2238, !2296, !2299, !2301, !2303, !2304, !2305, !2306, !2307, !2310, !2313, !2316, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2368, !2369, !2370, !2371, !2585, !2586, !2587, !2588, !2589, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2600, !2604, !2605, !2606, !2607, !2612, !2613, !2617, !2618, !2650, !2651, !2655, !2656, !2660, !2661, !2665, !2666, !2667, !2670, !2671}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !85, line: 128, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !84, file: !85, line: 128, baseType: !88, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !85, line: 129, baseType: !91, size: 592, offset: 128)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 592, elements: !93)
!92 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!93 = !{!94}
!94 = !DISubrange(count: 74)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !84, file: !85, line: 130, baseType: !40, size: 32, offset: 736)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !84, file: !85, line: 133, baseType: !97, size: 16, offset: 768)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !84, file: !85, line: 133, baseType: !97, size: 16, offset: 784)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !84, file: !85, line: 133, baseType: !97, size: 16, offset: 800)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "result_ok", scope: !84, file: !85, line: 133, baseType: !97, size: 16, offset: 816)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "scene_color_manage", scope: !84, file: !85, line: 136, baseType: !102, size: 8, offset: 832)
!102 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !84, file: !85, line: 139, baseType: !104, size: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderResult", file: !83, line: 148, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !83, line: 110, size: 1152, elements: !107)
!107 = !{!108, !110, !111, !112, !113, !114, !115, !117, !119, !120, !129, !130, !131, !139, !141, !2174, !2175, !2176, !2177}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !83, line: 111, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !106, file: !83, line: 111, baseType: !109, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !106, file: !83, line: 114, baseType: !40, size: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !106, file: !83, line: 114, baseType: !40, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !106, file: !83, line: 115, baseType: !97, size: 16, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !106, file: !83, line: 115, baseType: !97, size: 16, offset: 208)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !106, file: !83, line: 118, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !106, file: !83, line: 120, baseType: !118, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !106, file: !83, line: 122, baseType: !118, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !106, file: !83, line: 125, baseType: !121, size: 128, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !122, line: 89, baseType: !123)
!122 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !122, line: 86, size: 128, elements: !124)
!124 = !{!125, !126, !127, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !123, file: !122, line: 87, baseType: !40, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !123, file: !122, line: 87, baseType: !40, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !123, file: !122, line: 88, baseType: !40, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !123, file: !122, line: 88, baseType: !40, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !106, file: !83, line: 127, baseType: !40, size: 32, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !106, file: !83, line: 127, baseType: !40, size: 32, offset: 608)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !106, file: !83, line: 130, baseType: !132, size: 128, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !133, line: 71, baseType: !134)
!133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !133, line: 69, size: 128, elements: !135)
!135 = !{!136, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !134, file: !133, line: 70, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !134, file: !133, line: 70, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !106, file: !83, line: 133, baseType: !140, size: 128, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !106, file: !83, line: 134, baseType: !142, size: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !83, line: 108, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !83, line: 85, size: 1600, elements: !146)
!146 = !{!147, !149, !150, !151, !152, !153, !154, !155, !156, !157, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !83, line: 86, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !145, file: !83, line: 86, baseType: !148, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !83, line: 89, baseType: !91, size: 592, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !145, file: !83, line: 90, baseType: !5, size: 32, offset: 736)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !145, file: !83, line: 90, baseType: !5, size: 32, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !145, file: !83, line: 90, baseType: !5, size: 32, offset: 800)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !145, file: !83, line: 91, baseType: !40, size: 32, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !145, file: !83, line: 91, baseType: !40, size: 32, offset: 864)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !145, file: !83, line: 91, baseType: !40, size: 32, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !145, file: !83, line: 93, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !160, line: 93, size: 7552, elements: !161)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !{!162, !224, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !276, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !345, !346, !347, !348, !349, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2164}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !159, file: !160, line: 94, baseType: !163, size: 960)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !164, line: 130, baseType: !165)
!164 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !164, line: 117, size: 960, elements: !166)
!166 = !{!167, !168, !169, !171, !190, !194, !195, !196, !197, !198}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !164, line: 118, baseType: !137, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !165, file: !164, line: 118, baseType: !137, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !165, file: !164, line: 119, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !165, file: !164, line: 120, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !164, line: 136, size: 17600, elements: !174)
!174 = !{!175, !176, !178, !181, !185, !186, !187}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !173, file: !164, line: 137, baseType: !163, size: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !173, file: !164, line: 138, baseType: !177, size: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !173, file: !164, line: 139, baseType: !179, size: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !164, line: 43, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !164, line: 140, baseType: !182, size: 8192, offset: 1088)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 8192, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !173, file: !164, line: 141, baseType: !182, size: 8192, offset: 9280)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !173, file: !164, line: 148, baseType: !172, size: 64, offset: 17472)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !173, file: !164, line: 150, baseType: !188, size: 64, offset: 17536)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !164, line: 45, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !165, file: !164, line: 121, baseType: !191, size: 528, offset: 256)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 528, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 66)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !165, file: !164, line: 126, baseType: !97, size: 16, offset: 784)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !165, file: !164, line: 127, baseType: !40, size: 32, offset: 800)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !165, file: !164, line: 128, baseType: !40, size: 32, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !165, file: !164, line: 128, baseType: !40, size: 32, offset: 864)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !165, file: !164, line: 129, baseType: !199, size: 64, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !164, line: 75, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !164, line: 62, size: 1024, elements: !202)
!202 = !{!203, !205, !206, !207, !208, !209, !213, !214, !222, !223}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !164, line: 63, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !164, line: 63, baseType: !204, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !201, file: !164, line: 64, baseType: !92, size: 8, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !201, file: !164, line: 64, baseType: !92, size: 8, offset: 136)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !201, file: !164, line: 65, baseType: !97, size: 16, offset: 144)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !164, line: 66, baseType: !210, size: 512, offset: 160)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 512, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !201, file: !164, line: 67, baseType: !40, size: 32, offset: 672)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !201, file: !164, line: 69, baseType: !215, size: 256, offset: 704)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !164, line: 60, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !164, line: 48, size: 256, elements: !217)
!217 = !{!218, !219, !220, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !216, file: !164, line: 49, baseType: !137, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !216, file: !164, line: 58, baseType: !132, size: 128, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !216, file: !164, line: 59, baseType: !40, size: 32, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !216, file: !164, line: 59, baseType: !40, size: 32, offset: 224)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !201, file: !164, line: 70, baseType: !40, size: 32, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !201, file: !164, line: 74, baseType: !40, size: 32, offset: 992)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !159, file: !160, line: 95, baseType: !225, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !32, line: 42, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !159, file: !160, line: 97, baseType: !97, size: 16, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !160, line: 97, baseType: !97, size: 16, offset: 1040)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !159, file: !160, line: 99, baseType: !75, size: 32, offset: 1056)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !159, file: !160, line: 99, baseType: !75, size: 32, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !159, file: !160, line: 99, baseType: !75, size: 32, offset: 1120)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !159, file: !160, line: 100, baseType: !75, size: 32, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !159, file: !160, line: 100, baseType: !75, size: 32, offset: 1184)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !159, file: !160, line: 100, baseType: !75, size: 32, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !159, file: !160, line: 101, baseType: !75, size: 32, offset: 1248)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !159, file: !160, line: 101, baseType: !75, size: 32, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !159, file: !160, line: 101, baseType: !75, size: 32, offset: 1312)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !159, file: !160, line: 102, baseType: !75, size: 32, offset: 1344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !159, file: !160, line: 102, baseType: !75, size: 32, offset: 1376)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !159, file: !160, line: 102, baseType: !75, size: 32, offset: 1408)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !159, file: !160, line: 103, baseType: !75, size: 32, offset: 1440)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !159, file: !160, line: 103, baseType: !75, size: 32, offset: 1472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !159, file: !160, line: 103, baseType: !75, size: 32, offset: 1504)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !159, file: !160, line: 103, baseType: !75, size: 32, offset: 1536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !159, file: !160, line: 103, baseType: !75, size: 32, offset: 1568)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !159, file: !160, line: 104, baseType: !75, size: 32, offset: 1600)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !159, file: !160, line: 104, baseType: !75, size: 32, offset: 1632)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !159, file: !160, line: 104, baseType: !75, size: 32, offset: 1664)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !159, file: !160, line: 104, baseType: !75, size: 32, offset: 1696)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !159, file: !160, line: 104, baseType: !75, size: 32, offset: 1728)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !159, file: !160, line: 105, baseType: !75, size: 32, offset: 1760)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !159, file: !160, line: 108, baseType: !253, size: 704, offset: 1792)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !160, line: 53, size: 704, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !253, file: !160, line: 54, baseType: !75, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !253, file: !160, line: 55, baseType: !75, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !253, file: !160, line: 56, baseType: !75, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !253, file: !160, line: 57, baseType: !75, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !253, file: !160, line: 59, baseType: !260, size: 96, offset: 128)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 96, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 3)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !253, file: !160, line: 60, baseType: !260, size: 96, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !253, file: !160, line: 61, baseType: !260, size: 96, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !253, file: !160, line: 63, baseType: !75, size: 32, offset: 416)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !253, file: !160, line: 64, baseType: !75, size: 32, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !253, file: !160, line: 65, baseType: !75, size: 32, offset: 480)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !253, file: !160, line: 67, baseType: !97, size: 16, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !253, file: !160, line: 68, baseType: !97, size: 16, offset: 528)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !253, file: !160, line: 69, baseType: !97, size: 16, offset: 544)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !253, file: !160, line: 70, baseType: !97, size: 16, offset: 560)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !253, file: !160, line: 72, baseType: !75, size: 32, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !253, file: !160, line: 73, baseType: !75, size: 32, offset: 608)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !253, file: !160, line: 74, baseType: !75, size: 32, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !253, file: !160, line: 75, baseType: !75, size: 32, offset: 672)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !159, file: !160, line: 109, baseType: !277, size: 128, offset: 2496)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !160, line: 79, size: 128, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !160, line: 80, baseType: !40, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !277, file: !160, line: 81, baseType: !40, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !277, file: !160, line: 82, baseType: !40, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !277, file: !160, line: 83, baseType: !40, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !159, file: !160, line: 111, baseType: !75, size: 32, offset: 2624)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !159, file: !160, line: 111, baseType: !75, size: 32, offset: 2656)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !159, file: !160, line: 112, baseType: !75, size: 32, offset: 2688)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !159, file: !160, line: 112, baseType: !75, size: 32, offset: 2720)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !159, file: !160, line: 113, baseType: !75, size: 32, offset: 2752)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !159, file: !160, line: 114, baseType: !75, size: 32, offset: 2784)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !159, file: !160, line: 114, baseType: !75, size: 32, offset: 2816)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !159, file: !160, line: 115, baseType: !97, size: 16, offset: 2848)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !159, file: !160, line: 115, baseType: !97, size: 16, offset: 2864)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !159, file: !160, line: 116, baseType: !97, size: 16, offset: 2880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !159, file: !160, line: 117, baseType: !92, size: 8, offset: 2896)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !159, file: !160, line: 117, baseType: !92, size: 8, offset: 2904)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !159, file: !160, line: 119, baseType: !75, size: 32, offset: 2912)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !159, file: !160, line: 119, baseType: !75, size: 32, offset: 2944)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !159, file: !160, line: 120, baseType: !97, size: 16, offset: 2976)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !159, file: !160, line: 120, baseType: !97, size: 16, offset: 2992)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !159, file: !160, line: 121, baseType: !75, size: 32, offset: 3008)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !159, file: !160, line: 121, baseType: !75, size: 32, offset: 3040)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !159, file: !160, line: 122, baseType: !75, size: 32, offset: 3072)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !159, file: !160, line: 123, baseType: !75, size: 32, offset: 3104)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !159, file: !160, line: 124, baseType: !97, size: 16, offset: 3136)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !159, file: !160, line: 125, baseType: !97, size: 16, offset: 3152)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !159, file: !160, line: 127, baseType: !40, size: 32, offset: 3168)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !159, file: !160, line: 127, baseType: !40, size: 32, offset: 3200)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !159, file: !160, line: 128, baseType: !40, size: 32, offset: 3232)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !159, file: !160, line: 128, baseType: !40, size: 32, offset: 3264)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !159, file: !160, line: 129, baseType: !97, size: 16, offset: 3296)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !159, file: !160, line: 129, baseType: !97, size: 16, offset: 3312)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !159, file: !160, line: 129, baseType: !97, size: 16, offset: 3328)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !159, file: !160, line: 129, baseType: !97, size: 16, offset: 3344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !159, file: !160, line: 130, baseType: !75, size: 32, offset: 3360)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !159, file: !160, line: 130, baseType: !75, size: 32, offset: 3392)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !159, file: !160, line: 130, baseType: !75, size: 32, offset: 3424)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !159, file: !160, line: 130, baseType: !75, size: 32, offset: 3456)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !159, file: !160, line: 131, baseType: !75, size: 32, offset: 3488)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !159, file: !160, line: 131, baseType: !75, size: 32, offset: 3520)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !159, file: !160, line: 131, baseType: !75, size: 32, offset: 3552)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !159, file: !160, line: 131, baseType: !75, size: 32, offset: 3584)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !159, file: !160, line: 132, baseType: !75, size: 32, offset: 3616)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !159, file: !160, line: 132, baseType: !75, size: 32, offset: 3648)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !159, file: !160, line: 133, baseType: !210, size: 512, offset: 3680)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !159, file: !160, line: 135, baseType: !75, size: 32, offset: 4192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !159, file: !160, line: 136, baseType: !75, size: 32, offset: 4224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !159, file: !160, line: 137, baseType: !75, size: 32, offset: 4256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !159, file: !160, line: 138, baseType: !40, size: 32, offset: 4288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !159, file: !160, line: 141, baseType: !92, size: 8, offset: 4320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !159, file: !160, line: 141, baseType: !92, size: 8, offset: 4328)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !159, file: !160, line: 141, baseType: !92, size: 8, offset: 4336)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !159, file: !160, line: 141, baseType: !92, size: 8, offset: 4344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !159, file: !160, line: 142, baseType: !97, size: 16, offset: 4352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !159, file: !160, line: 142, baseType: !97, size: 16, offset: 4368)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !159, file: !160, line: 142, baseType: !97, size: 16, offset: 4384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !159, file: !160, line: 145, baseType: !92, size: 8, offset: 4400)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !159, file: !160, line: 145, baseType: !92, size: 8, offset: 4408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !159, file: !160, line: 148, baseType: !97, size: 16, offset: 4416)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !159, file: !160, line: 148, baseType: !97, size: 16, offset: 4432)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !159, file: !160, line: 149, baseType: !75, size: 32, offset: 4448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !159, file: !160, line: 149, baseType: !75, size: 32, offset: 4480)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !159, file: !160, line: 152, baseType: !342, size: 128, offset: 4512)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 4)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !159, file: !160, line: 153, baseType: !75, size: 32, offset: 4640)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !159, file: !160, line: 154, baseType: !75, size: 32, offset: 4672)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !159, file: !160, line: 157, baseType: !97, size: 16, offset: 4704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !159, file: !160, line: 157, baseType: !97, size: 16, offset: 4720)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !159, file: !160, line: 160, baseType: !350, size: 64, offset: 4736)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !352, line: 113, size: 6208, elements: !353)
!352 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!353 = !{!354, !355, !356, !357, !358, !359, !363}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !351, file: !352, line: 114, baseType: !97, size: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !351, file: !352, line: 114, baseType: !97, size: 16, offset: 16)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !351, file: !352, line: 115, baseType: !92, size: 8, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !351, file: !352, line: 115, baseType: !92, size: 8, offset: 40)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !351, file: !352, line: 116, baseType: !92, size: 8, offset: 48)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !351, file: !352, line: 117, baseType: !360, size: 8, offset: 56)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 8, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 1)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !351, file: !352, line: 119, baseType: !364, size: 6144, offset: 64)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 6144, elements: !374)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !352, line: 109, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !352, line: 106, size: 192, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !366, file: !352, line: 107, baseType: !75, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !366, file: !352, line: 107, baseType: !75, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !366, file: !352, line: 107, baseType: !75, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !366, file: !352, line: 107, baseType: !75, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !366, file: !352, line: 107, baseType: !75, size: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !366, file: !352, line: 108, baseType: !40, size: 32, offset: 160)
!374 = !{!375}
!375 = !DISubrange(count: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !159, file: !160, line: 161, baseType: !350, size: 64, offset: 4800)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !159, file: !160, line: 162, baseType: !92, size: 8, offset: 4864)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !159, file: !160, line: 162, baseType: !92, size: 8, offset: 4872)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !159, file: !160, line: 163, baseType: !92, size: 8, offset: 4880)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !159, file: !160, line: 163, baseType: !92, size: 8, offset: 4888)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !159, file: !160, line: 164, baseType: !97, size: 16, offset: 4896)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !159, file: !160, line: 164, baseType: !97, size: 16, offset: 4912)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !159, file: !160, line: 165, baseType: !75, size: 32, offset: 4928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !159, file: !160, line: 165, baseType: !75, size: 32, offset: 4960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !159, file: !160, line: 167, baseType: !386, size: 1152, offset: 4992)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 1152, elements: !2122)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !352, line: 57, size: 2496, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !1917, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !388, file: !352, line: 59, baseType: !97, size: 16)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !388, file: !352, line: 59, baseType: !97, size: 16, offset: 16)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !388, file: !352, line: 59, baseType: !97, size: 16, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !388, file: !352, line: 59, baseType: !97, size: 16, offset: 48)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !388, file: !352, line: 60, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !397, line: 115, size: 11392, elements: !398)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !{!399, !400, !401, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !418, !428, !442, !443, !485, !486, !489, !490, !506, !507, !508, !509, !510, !511, !512, !514, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !592, !593, !594, !595, !596, !597, !598, !599, !600, !603, !606, !609, !610, !611, !612, !613, !616, !619, !1103, !1104, !1110, !1111, !1112, !1113, !1114, !1115, !1117, !1120, !1123, !1125, !1905, !1906}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !396, file: !397, line: 116, baseType: !163, size: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !396, file: !397, line: 117, baseType: !225, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !396, file: !397, line: 119, baseType: !402, size: 64, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !397, line: 57, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !396, file: !397, line: 121, baseType: !97, size: 16, offset: 1088)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !396, file: !397, line: 121, baseType: !97, size: 16, offset: 1104)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !396, file: !397, line: 122, baseType: !40, size: 32, offset: 1120)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !396, file: !397, line: 122, baseType: !40, size: 32, offset: 1152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !396, file: !397, line: 122, baseType: !40, size: 32, offset: 1184)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !396, file: !397, line: 123, baseType: !210, size: 512, offset: 1216)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !396, file: !397, line: 124, baseType: !395, size: 64, offset: 1728)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !396, file: !397, line: 124, baseType: !395, size: 64, offset: 1792)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !396, file: !397, line: 127, baseType: !395, size: 64, offset: 1856)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !396, file: !397, line: 127, baseType: !395, size: 64, offset: 1920)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !396, file: !397, line: 127, baseType: !395, size: 64, offset: 1984)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !396, file: !397, line: 128, baseType: !416, size: 64, offset: 2048)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !32, line: 43, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !396, file: !397, line: 130, baseType: !419, size: 64, offset: 2112)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !397, line: 97, size: 832, elements: !421)
!421 = !{!422, !426, !427}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !420, file: !397, line: 98, baseType: !423, size: 768)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 768, elements: !424)
!424 = !{!425, !262}
!425 = !DISubrange(count: 8)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !420, file: !397, line: 99, baseType: !40, size: 32, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !420, file: !397, line: 99, baseType: !40, size: 32, offset: 800)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !396, file: !397, line: 131, baseType: !429, size: 64, offset: 2176)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !431, line: 486, size: 1600, elements: !432)
!431 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !430, file: !431, line: 487, baseType: !163, size: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !430, file: !431, line: 489, baseType: !132, size: 128, offset: 960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !430, file: !431, line: 490, baseType: !132, size: 128, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !430, file: !431, line: 491, baseType: !132, size: 128, offset: 1216)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !430, file: !431, line: 492, baseType: !132, size: 128, offset: 1344)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !430, file: !431, line: 494, baseType: !40, size: 32, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !430, file: !431, line: 495, baseType: !40, size: 32, offset: 1504)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !430, file: !431, line: 497, baseType: !40, size: 32, offset: 1536)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !430, file: !431, line: 498, baseType: !40, size: 32, offset: 1568)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !396, file: !397, line: 132, baseType: !429, size: 64, offset: 2240)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !396, file: !397, line: 133, baseType: !444, size: 64, offset: 2304)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !431, line: 334, size: 1728, elements: !446)
!446 = !{!447, !448, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !484}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !445, file: !431, line: 335, baseType: !132, size: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !445, file: !431, line: 336, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !451, line: 48, flags: DIFlagFwdDecl)
!451 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !431, line: 338, baseType: !97, size: 16, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !445, file: !431, line: 338, baseType: !97, size: 16, offset: 208)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !445, file: !431, line: 339, baseType: !5, size: 32, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !445, file: !431, line: 340, baseType: !40, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !445, file: !431, line: 342, baseType: !75, size: 32, offset: 288)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !445, file: !431, line: 343, baseType: !260, size: 96, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !445, file: !431, line: 344, baseType: !260, size: 96, offset: 416)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !445, file: !431, line: 347, baseType: !132, size: 128, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !445, file: !431, line: 349, baseType: !40, size: 32, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !445, file: !431, line: 350, baseType: !40, size: 32, offset: 672)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !445, file: !431, line: 351, baseType: !137, size: 64, offset: 704)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !445, file: !431, line: 352, baseType: !137, size: 64, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !445, file: !431, line: 354, baseType: !465, size: 384, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !431, line: 116, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !431, line: 94, size: 384, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !466, file: !431, line: 96, baseType: !40, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !466, file: !431, line: 96, baseType: !40, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !466, file: !431, line: 97, baseType: !40, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !466, file: !431, line: 97, baseType: !40, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !466, file: !431, line: 99, baseType: !97, size: 16, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !466, file: !431, line: 100, baseType: !97, size: 16, offset: 144)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !466, file: !431, line: 102, baseType: !97, size: 16, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !466, file: !431, line: 105, baseType: !97, size: 16, offset: 176)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !466, file: !431, line: 108, baseType: !97, size: 16, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !466, file: !431, line: 109, baseType: !97, size: 16, offset: 208)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !466, file: !431, line: 111, baseType: !97, size: 16, offset: 224)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !466, file: !431, line: 112, baseType: !97, size: 16, offset: 240)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !466, file: !431, line: 114, baseType: !40, size: 32, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !466, file: !431, line: 114, baseType: !40, size: 32, offset: 288)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !466, file: !431, line: 115, baseType: !40, size: 32, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !466, file: !431, line: 115, baseType: !40, size: 32, offset: 352)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !445, file: !431, line: 355, baseType: !210, size: 512, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !396, file: !397, line: 134, baseType: !137, size: 64, offset: 2368)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !396, file: !397, line: 136, baseType: !487, size: 64, offset: 2432)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !39, line: 61, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !396, file: !397, line: 138, baseType: !465, size: 384, offset: 2496)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !396, file: !397, line: 139, baseType: !491, size: 64, offset: 2880)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !431, line: 80, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !431, line: 72, size: 192, elements: !494)
!494 = !{!495, !502, !503, !504, !505}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !493, file: !431, line: 73, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !431, line: 59, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !431, line: 56, size: 128, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !498, file: !431, line: 57, baseType: !260, size: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !498, file: !431, line: 58, baseType: !40, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !493, file: !431, line: 74, baseType: !40, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !493, file: !431, line: 76, baseType: !40, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !493, file: !431, line: 77, baseType: !40, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !493, file: !431, line: 79, baseType: !40, size: 32, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !396, file: !397, line: 141, baseType: !132, size: 128, offset: 2944)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !396, file: !397, line: 142, baseType: !132, size: 128, offset: 3072)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !396, file: !397, line: 143, baseType: !132, size: 128, offset: 3200)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !396, file: !397, line: 144, baseType: !132, size: 128, offset: 3328)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !396, file: !397, line: 146, baseType: !40, size: 32, offset: 3456)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !396, file: !397, line: 147, baseType: !40, size: 32, offset: 3488)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !396, file: !397, line: 150, baseType: !513, size: 64, offset: 3520)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !396, file: !397, line: 151, baseType: !515, size: 64, offset: 3584)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !396, file: !397, line: 152, baseType: !40, size: 32, offset: 3648)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !396, file: !397, line: 153, baseType: !40, size: 32, offset: 3680)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !396, file: !397, line: 156, baseType: !260, size: 96, offset: 3712)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !396, file: !397, line: 156, baseType: !260, size: 96, offset: 3808)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !396, file: !397, line: 156, baseType: !260, size: 96, offset: 3904)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !396, file: !397, line: 157, baseType: !260, size: 96, offset: 4000)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !396, file: !397, line: 158, baseType: !260, size: 96, offset: 4096)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !396, file: !397, line: 159, baseType: !260, size: 96, offset: 4192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !396, file: !397, line: 160, baseType: !260, size: 96, offset: 4288)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !396, file: !397, line: 160, baseType: !260, size: 96, offset: 4384)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !396, file: !397, line: 161, baseType: !342, size: 128, offset: 4480)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !396, file: !397, line: 161, baseType: !342, size: 128, offset: 4608)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !396, file: !397, line: 162, baseType: !260, size: 96, offset: 4736)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !396, file: !397, line: 162, baseType: !260, size: 96, offset: 4832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !396, file: !397, line: 163, baseType: !75, size: 32, offset: 4928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !396, file: !397, line: 163, baseType: !75, size: 32, offset: 4960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !396, file: !397, line: 164, baseType: !533, size: 512, offset: 4992)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, elements: !534)
!534 = !{!344, !344}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !396, file: !397, line: 165, baseType: !533, size: 512, offset: 5504)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !396, file: !397, line: 166, baseType: !533, size: 512, offset: 6016)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !396, file: !397, line: 167, baseType: !533, size: 512, offset: 6528)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !396, file: !397, line: 176, baseType: !533, size: 512, offset: 7040)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !396, file: !397, line: 178, baseType: !5, size: 32, offset: 7552)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !396, file: !397, line: 180, baseType: !97, size: 16, offset: 7584)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !396, file: !397, line: 181, baseType: !97, size: 16, offset: 7600)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !396, file: !397, line: 183, baseType: !97, size: 16, offset: 7616)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !396, file: !397, line: 183, baseType: !97, size: 16, offset: 7632)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !396, file: !397, line: 184, baseType: !97, size: 16, offset: 7648)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !396, file: !397, line: 184, baseType: !97, size: 16, offset: 7664)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !396, file: !397, line: 185, baseType: !97, size: 16, offset: 7680)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !396, file: !397, line: 186, baseType: !97, size: 16, offset: 7696)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !396, file: !397, line: 187, baseType: !97, size: 16, offset: 7712)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !396, file: !397, line: 188, baseType: !92, size: 8, offset: 7728)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !396, file: !397, line: 189, baseType: !92, size: 8, offset: 7736)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !396, file: !397, line: 192, baseType: !40, size: 32, offset: 7744)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !396, file: !397, line: 192, baseType: !40, size: 32, offset: 7776)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !396, file: !397, line: 192, baseType: !40, size: 32, offset: 7808)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !396, file: !397, line: 192, baseType: !40, size: 32, offset: 7840)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !396, file: !397, line: 194, baseType: !40, size: 32, offset: 7872)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !396, file: !397, line: 202, baseType: !75, size: 32, offset: 7904)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !396, file: !397, line: 202, baseType: !75, size: 32, offset: 7936)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !396, file: !397, line: 202, baseType: !75, size: 32, offset: 7968)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !396, file: !397, line: 211, baseType: !75, size: 32, offset: 8000)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !396, file: !397, line: 212, baseType: !75, size: 32, offset: 8032)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !396, file: !397, line: 213, baseType: !75, size: 32, offset: 8064)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !396, file: !397, line: 214, baseType: !75, size: 32, offset: 8096)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !396, file: !397, line: 215, baseType: !75, size: 32, offset: 8128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !396, file: !397, line: 216, baseType: !75, size: 32, offset: 8160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !396, file: !397, line: 219, baseType: !75, size: 32, offset: 8192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !396, file: !397, line: 220, baseType: !75, size: 32, offset: 8224)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !396, file: !397, line: 221, baseType: !75, size: 32, offset: 8256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !396, file: !397, line: 224, baseType: !569, size: 16, offset: 8288)
!569 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !396, file: !397, line: 224, baseType: !569, size: 16, offset: 8304)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !396, file: !397, line: 226, baseType: !97, size: 16, offset: 8320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !396, file: !397, line: 228, baseType: !92, size: 8, offset: 8336)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !396, file: !397, line: 229, baseType: !92, size: 8, offset: 8344)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !396, file: !397, line: 231, baseType: !97, size: 16, offset: 8352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !396, file: !397, line: 232, baseType: !92, size: 8, offset: 8368)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !396, file: !397, line: 233, baseType: !92, size: 8, offset: 8376)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !396, file: !397, line: 234, baseType: !75, size: 32, offset: 8384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !396, file: !397, line: 235, baseType: !75, size: 32, offset: 8416)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !396, file: !397, line: 237, baseType: !132, size: 128, offset: 8448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !396, file: !397, line: 238, baseType: !132, size: 128, offset: 8576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !396, file: !397, line: 239, baseType: !132, size: 128, offset: 8704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !396, file: !397, line: 240, baseType: !132, size: 128, offset: 8832)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !396, file: !397, line: 242, baseType: !75, size: 32, offset: 8960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !396, file: !397, line: 244, baseType: !97, size: 16, offset: 8992)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !396, file: !397, line: 245, baseType: !569, size: 16, offset: 9008)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !396, file: !397, line: 246, baseType: !342, size: 128, offset: 9024)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !396, file: !397, line: 248, baseType: !40, size: 32, offset: 9152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !396, file: !397, line: 249, baseType: !40, size: 32, offset: 9184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !396, file: !397, line: 251, baseType: !590, size: 64, offset: 9216)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !397, line: 251, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !396, file: !397, line: 253, baseType: !92, size: 8, offset: 9280)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !396, file: !397, line: 254, baseType: !92, size: 8, offset: 9288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !396, file: !397, line: 255, baseType: !97, size: 16, offset: 9296)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !396, file: !397, line: 256, baseType: !260, size: 96, offset: 9312)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !396, file: !397, line: 258, baseType: !132, size: 128, offset: 9408)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !396, file: !397, line: 259, baseType: !132, size: 128, offset: 9536)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !396, file: !397, line: 260, baseType: !132, size: 128, offset: 9664)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !396, file: !397, line: 261, baseType: !132, size: 128, offset: 9792)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !396, file: !397, line: 263, baseType: !601, size: 64, offset: 9920)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !397, line: 52, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !396, file: !397, line: 264, baseType: !604, size: 64, offset: 9984)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !397, line: 53, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !396, file: !397, line: 265, baseType: !607, size: 64, offset: 10048)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !160, line: 46, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !396, file: !397, line: 267, baseType: !92, size: 8, offset: 10112)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !396, file: !397, line: 268, baseType: !92, size: 8, offset: 10120)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !396, file: !397, line: 269, baseType: !97, size: 16, offset: 10128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !396, file: !397, line: 270, baseType: !75, size: 32, offset: 10144)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !396, file: !397, line: 272, baseType: !614, size: 64, offset: 10176)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !397, line: 54, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !396, file: !397, line: 275, baseType: !617, size: 64, offset: 10240)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !397, line: 275, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !396, file: !397, line: 277, baseType: !620, size: 64, offset: 10304)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !622)
!622 = !{!623, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !676, !679, !681, !682, !684, !685, !686, !687, !693, !698, !699, !703, !704, !705, !706, !707, !720, !732, !746, !750, !754, !758, !767, !779, !783, !787, !791, !795, !799, !800, !801, !802, !803, !804, !808, !809, !810, !811, !815, !816, !817, !818, !819, !824, !825, !826, !827, !828, !832, !833, !834, !835, !836, !843, !854, !858, !864, !874, !880, !891, !898, !905, !909, !913, !917, !922, !923, !924, !931, !937, !938, !939, !943, !944, !953, !1060, !1064, !1072, !1076, !1080, !1084, !1092, !1102}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !621, file: !4, line: 180, baseType: !624, size: 1600)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !625, line: 73, baseType: !626)
!625 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !625, line: 64, size: 1600, elements: !627)
!627 = !{!628, !643, !647, !648, !649, !650, !653}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !626, file: !625, line: 65, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !625, line: 53, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !625, line: 42, size: 832, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !631, file: !625, line: 43, baseType: !40, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !631, file: !625, line: 44, baseType: !40, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !631, file: !625, line: 45, baseType: !40, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !631, file: !625, line: 46, baseType: !40, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !631, file: !625, line: 47, baseType: !40, size: 32, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !631, file: !625, line: 48, baseType: !40, size: 32, offset: 160)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !631, file: !625, line: 49, baseType: !40, size: 32, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !631, file: !625, line: 50, baseType: !40, size: 32, offset: 224)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !631, file: !625, line: 51, baseType: !210, size: 512, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !631, file: !625, line: 52, baseType: !137, size: 64, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !626, file: !625, line: 66, baseType: !644, size: 1312, offset: 64)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1312, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 41)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !626, file: !625, line: 69, baseType: !40, size: 32, offset: 1376)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !626, file: !625, line: 69, baseType: !40, size: 32, offset: 1408)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !626, file: !625, line: 70, baseType: !40, size: 32, offset: 1440)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !626, file: !625, line: 71, baseType: !651, size: 64, offset: 1472)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !625, line: 71, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !626, file: !625, line: 72, baseType: !654, size: 64, offset: 1536)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !625, line: 59, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !625, line: 57, size: 8192, elements: !657)
!657 = !{!658}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !656, file: !625, line: 58, baseType: !182, size: 8192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !621, file: !4, line: 180, baseType: !624, size: 1600, offset: 1600)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !621, file: !4, line: 180, baseType: !624, size: 1600, offset: 3200)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !621, file: !4, line: 180, baseType: !624, size: 1600, offset: 4800)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !621, file: !4, line: 180, baseType: !624, size: 1600, offset: 6400)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !621, file: !4, line: 181, baseType: !40, size: 32, offset: 8000)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !621, file: !4, line: 181, baseType: !40, size: 32, offset: 8032)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !621, file: !4, line: 181, baseType: !40, size: 32, offset: 8064)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !621, file: !4, line: 181, baseType: !40, size: 32, offset: 8096)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !621, file: !4, line: 181, baseType: !40, size: 32, offset: 8128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !621, file: !4, line: 182, baseType: !40, size: 32, offset: 8160)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !621, file: !4, line: 183, baseType: !40, size: 32, offset: 8192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !621, file: !4, line: 184, baseType: !671, size: 64, offset: 8256)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !672, line: 124, baseType: !673)
!672 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !675, line: 118, flags: DIFlagFwdDecl)
!675 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!676 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !621, file: !4, line: 185, baseType: !677, size: 64, offset: 8320)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !621, file: !4, line: 186, baseType: !680, size: 32, offset: 8384)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !621, file: !4, line: 187, baseType: !75, size: 32, offset: 8416)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !621, file: !4, line: 188, baseType: !683, size: 32, offset: 8448)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !621, file: !4, line: 189, baseType: !40, size: 32, offset: 8480)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !621, file: !4, line: 190, baseType: !513, size: 64, offset: 8512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !621, file: !4, line: 193, baseType: !92, size: 8, offset: 8576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !621, file: !4, line: 196, baseType: !688, size: 64, offset: 8640)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !691}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !621)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !621, file: !4, line: 199, baseType: !694, size: 64, offset: 8704)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !691, !697}
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !621, file: !4, line: 202, baseType: !688, size: 64, offset: 8768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !621, file: !4, line: 207, baseType: !700, size: 64, offset: 8832)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!40, !691}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !621, file: !4, line: 208, baseType: !700, size: 64, offset: 8896)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !621, file: !4, line: 209, baseType: !700, size: 64, offset: 8960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !621, file: !4, line: 210, baseType: !700, size: 64, offset: 9024)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !621, file: !4, line: 211, baseType: !700, size: 64, offset: 9088)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !621, file: !4, line: 218, baseType: !708, size: 64, offset: 9152)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !691, !40, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !713, line: 65, size: 160, elements: !714)
!713 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!714 = !{!715, !716, !718, !719}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !712, file: !713, line: 66, baseType: !260, size: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !712, file: !713, line: 67, baseType: !717, size: 48, offset: 96)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 48, elements: !261)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !712, file: !713, line: 68, baseType: !92, size: 8, offset: 144)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !712, file: !713, line: 68, baseType: !92, size: 8, offset: 152)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !621, file: !4, line: 219, baseType: !721, size: 64, offset: 9216)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !691, !40, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !713, line: 48, size: 96, elements: !726)
!726 = !{!727, !728, !729, !730, !731}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !725, file: !713, line: 49, baseType: !5, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !725, file: !713, line: 49, baseType: !5, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !725, file: !713, line: 50, baseType: !92, size: 8, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !725, file: !713, line: 50, baseType: !92, size: 8, offset: 72)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !725, file: !713, line: 51, baseType: !97, size: 16, offset: 80)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !621, file: !4, line: 220, baseType: !733, size: 64, offset: 9280)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !691, !40, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !713, line: 42, size: 160, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !737, file: !713, line: 43, baseType: !5, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !737, file: !713, line: 43, baseType: !5, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !737, file: !713, line: 43, baseType: !5, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !737, file: !713, line: 43, baseType: !5, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !737, file: !713, line: 44, baseType: !97, size: 16, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !737, file: !713, line: 45, baseType: !92, size: 8, offset: 144)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !737, file: !713, line: 45, baseType: !92, size: 8, offset: 152)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !621, file: !4, line: 227, baseType: !747, size: 64, offset: 9344)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!711, !691}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !621, file: !4, line: 228, baseType: !751, size: 64, offset: 9408)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!724, !691}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !621, file: !4, line: 229, baseType: !755, size: 64, offset: 9472)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!736, !691}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !621, file: !4, line: 230, baseType: !759, size: 64, offset: 9536)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!762, !691}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !713, line: 88, size: 64, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !763, file: !713, line: 89, baseType: !5, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !763, file: !713, line: 90, baseType: !5, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !621, file: !4, line: 231, baseType: !768, size: 64, offset: 9600)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!771, !691}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !713, line: 79, size: 96, elements: !773)
!773 = !{!774, !775, !776, !777, !778}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !772, file: !713, line: 81, baseType: !40, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !772, file: !713, line: 82, baseType: !40, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !772, file: !713, line: 83, baseType: !97, size: 16, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !772, file: !713, line: 84, baseType: !92, size: 8, offset: 80)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !772, file: !713, line: 84, baseType: !92, size: 8, offset: 88)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !621, file: !4, line: 236, baseType: !780, size: 64, offset: 9664)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !691, !711}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !621, file: !4, line: 237, baseType: !784, size: 64, offset: 9728)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !691, !724}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !621, file: !4, line: 238, baseType: !788, size: 64, offset: 9792)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !691, !736}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !621, file: !4, line: 239, baseType: !792, size: 64, offset: 9856)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !691, !762}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !621, file: !4, line: 240, baseType: !796, size: 64, offset: 9920)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !691, !771}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !621, file: !4, line: 245, baseType: !747, size: 64, offset: 9984)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !621, file: !4, line: 246, baseType: !751, size: 64, offset: 10048)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !621, file: !4, line: 247, baseType: !755, size: 64, offset: 10112)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !621, file: !4, line: 248, baseType: !759, size: 64, offset: 10176)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !621, file: !4, line: 249, baseType: !768, size: 64, offset: 10240)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !621, file: !4, line: 255, baseType: !805, size: 64, offset: 10304)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!137, !691, !40, !40}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !621, file: !4, line: 256, baseType: !805, size: 64, offset: 10368)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !621, file: !4, line: 257, baseType: !805, size: 64, offset: 10432)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !621, file: !4, line: 258, baseType: !805, size: 64, offset: 10496)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !621, file: !4, line: 264, baseType: !812, size: 64, offset: 10560)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!137, !691, !40}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !621, file: !4, line: 265, baseType: !812, size: 64, offset: 10624)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !621, file: !4, line: 266, baseType: !812, size: 64, offset: 10688)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !621, file: !4, line: 267, baseType: !812, size: 64, offset: 10752)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !621, file: !4, line: 268, baseType: !812, size: 64, offset: 10816)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !621, file: !4, line: 272, baseType: !820, size: 64, offset: 10880)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!823, !691}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !621, file: !4, line: 273, baseType: !820, size: 64, offset: 10944)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !621, file: !4, line: 274, baseType: !820, size: 64, offset: 11008)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !621, file: !4, line: 275, baseType: !820, size: 64, offset: 11072)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !621, file: !4, line: 276, baseType: !820, size: 64, offset: 11136)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !621, file: !4, line: 279, baseType: !829, size: 64, offset: 11200)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !691, !40, !823, !40}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !621, file: !4, line: 280, baseType: !829, size: 64, offset: 11264)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !621, file: !4, line: 281, baseType: !829, size: 64, offset: 11328)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !621, file: !4, line: 284, baseType: !700, size: 64, offset: 11392)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !621, file: !4, line: 285, baseType: !700, size: 64, offset: 11456)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !621, file: !4, line: 286, baseType: !837, size: 64, offset: 11520)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!840, !691}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !621, file: !4, line: 287, baseType: !844, size: 64, offset: 11584)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!847, !691}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !850)
!850 = !{!851, !853}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !849, file: !4, line: 118, baseType: !852, size: 128)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !343)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !849, file: !4, line: 119, baseType: !852, size: 128, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !621, file: !4, line: 288, baseType: !855, size: 64, offset: 11648)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!116, !691}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !621, file: !4, line: 289, baseType: !859, size: 64, offset: 11712)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !691, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !621, file: !4, line: 290, baseType: !865, size: 64, offset: 11776)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!868, !691}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !870, file: !4, line: 124, baseType: !97, size: 16)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !870, file: !4, line: 125, baseType: !92, size: 8, offset: 16)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !621, file: !4, line: 291, baseType: !875, size: 64, offset: 11840)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!878, !691}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !621, file: !4, line: 299, baseType: !881, size: 64, offset: 11904)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !691, !884, !137, !890}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !137, !40, !887, !887, !888}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !4, line: 162, baseType: !15)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !621, file: !4, line: 309, baseType: !892, size: 64, offset: 11968)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
