; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_bisect_plane.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_bisect_plane.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57}
!51 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !59, line: 57, baseType: !5, size: 32, elements: !60)
!59 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!61 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 83, baseType: !5, size: 32, elements: !77)
!76 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79}
!78 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!80 = !{!81, !84, !5, !85, !87, !88, !92, !96, !161, !163, !145, !108, !165, !166}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !82, line: 46, baseType: !83)
!82 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!83 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !59, line: 79, baseType: !58)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !59, line: 158, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !84}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !59, line: 159, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!84, !84}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !99)
!99 = !{!100, !111, !116, !121, !122}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !98, file: !43, line: 91, baseType: !101, size: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !103)
!103 = !{!104, !105, !107, !109, !110}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !43, line: 65, baseType: !84, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !102, file: !43, line: 66, baseType: !106, size: 32, offset: 64)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !102, file: !43, line: 73, baseType: !108, size: 8, offset: 96)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !102, file: !43, line: 74, baseType: !108, size: 8, offset: 104)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !102, file: !43, line: 80, baseType: !108, size: 8, offset: 112)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !98, file: !43, line: 92, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !113, file: !43, line: 181, baseType: !86, size: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !98, file: !43, line: 94, baseType: !117, size: 96, offset: 192)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 96, elements: !119)
!118 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!119 = !{!120}
!120 = !DISubrange(count: 3)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !98, file: !43, line: 95, baseType: !117, size: 96, offset: 288)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !98, file: !43, line: 102, baseType: !123, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !125)
!125 = !{!126, !127, !128, !130, !131, !154, !160}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !124, file: !43, line: 111, baseType: !101, size: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !124, file: !43, line: 112, baseType: !112, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !124, file: !43, line: 114, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !124, file: !43, line: 114, baseType: !129, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !124, file: !43, line: 118, baseType: !132, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !134)
!134 = !{!135, !136, !137, !138, !150, !151, !152, !153}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !133, file: !43, line: 126, baseType: !101, size: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !133, file: !43, line: 129, baseType: !129, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !133, file: !43, line: 130, baseType: !123, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !133, file: !43, line: 131, baseType: !139, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !141)
!141 = !{!142, !143, !144, !147, !148, !149}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !140, file: !43, line: 165, baseType: !101, size: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !140, file: !43, line: 166, baseType: !112, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !140, file: !43, line: 172, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !133)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !43, line: 174, baseType: !106, size: 32, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !140, file: !43, line: 175, baseType: !117, size: 96, offset: 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !140, file: !43, line: 176, baseType: !86, size: 16, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !133, file: !43, line: 135, baseType: !132, size: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !133, file: !43, line: 135, baseType: !132, size: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !43, line: 139, baseType: !132, size: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !133, file: !43, line: 139, baseType: !132, size: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !124, file: !43, line: 122, baseType: !155, size: 128, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !43, line: 107, baseType: !123, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !43, line: 107, baseType: !123, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !124, file: !43, line: 122, baseType: !155, size: 128, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !124)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !140)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!167 = !{i32 7, !"Dwarf Version", i32 4}
!168 = !{i32 2, !"Debug Info Version", i32 3}
!169 = !{i32 1, !"wchar_size", i32 4}
!170 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!171 = distinct !DISubprogram(name: "BM_mesh_bisect_plane", scope: !1, file: !1, line: 297, type: !172, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !320)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174, !315, !317, !317, !319, !316}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !191, !192, !193, !194, !195, !197, !199, !200, !201, !202, !203, !204, !205, !206, !258, !298, !299, !300, !301, !302, !303, !304, !305, !312, !313, !314}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !176, file: !43, line: 187, baseType: !106, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !176, file: !43, line: 187, baseType: !106, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !176, file: !43, line: 187, baseType: !106, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !176, file: !43, line: 187, baseType: !106, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !176, file: !43, line: 188, baseType: !106, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !176, file: !43, line: 188, baseType: !106, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !176, file: !43, line: 188, baseType: !106, size: 32, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !176, file: !43, line: 193, baseType: !108, size: 8, offset: 224)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !176, file: !43, line: 197, baseType: !108, size: 8, offset: 232)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !176, file: !43, line: 201, baseType: !188, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !190, line: 39, flags: DIFlagFwdDecl)
!190 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !176, file: !43, line: 201, baseType: !188, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !176, file: !43, line: 201, baseType: !188, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !176, file: !43, line: 201, baseType: !188, size: 64, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !176, file: !43, line: 208, baseType: !166, size: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !176, file: !43, line: 209, baseType: !196, size: 64, offset: 576)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !176, file: !43, line: 210, baseType: !198, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !176, file: !43, line: 213, baseType: !106, size: 32, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !176, file: !43, line: 214, baseType: !106, size: 32, offset: 736)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !176, file: !43, line: 215, baseType: !106, size: 32, offset: 768)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !176, file: !43, line: 218, baseType: !188, size: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !176, file: !43, line: 218, baseType: !188, size: 64, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !176, file: !43, line: 218, baseType: !188, size: 64, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !176, file: !43, line: 220, baseType: !106, size: 32, offset: 1024)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !176, file: !43, line: 221, baseType: !207, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !209)
!209 = !{!210, !246, !247, !251, !254, !255, !257}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !208, file: !4, line: 191, baseType: !211, size: 5120)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 5120, elements: !244)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !213)
!213 = !{!214, !217, !219, !229, !230}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !212, file: !4, line: 148, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !212, file: !4, line: 149, baseType: !218, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !212, file: !4, line: 150, baseType: !220, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !222)
!222 = !{!223, !225, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !221, file: !4, line: 139, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !221, file: !4, line: 140, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !221, file: !4, line: 141, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !212, file: !4, line: 152, baseType: !106, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !4, line: 162, baseType: !231, size: 128, offset: 192)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !212, file: !4, line: 155, size: 128, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !239}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !231, file: !4, line: 156, baseType: !106, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !231, file: !4, line: 157, baseType: !118, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !231, file: !4, line: 158, baseType: !84, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !231, file: !4, line: 159, baseType: !117, size: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !231, file: !4, line: 160, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !231, file: !4, line: 161, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !242, line: 48, baseType: !243)
!242 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !242, line: 48, flags: DIFlagFwdDecl)
!244 = !{!245}
!245 = !DISubrange(count: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !208, file: !4, line: 192, baseType: !211, size: 5120, offset: 5120)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !208, file: !4, line: 193, baseType: !248, size: 64, offset: 10240)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !174, !207}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !208, file: !4, line: 194, baseType: !252, size: 64, offset: 10304)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !190, line: 38, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !4, line: 195, baseType: !106, size: 32, offset: 10368)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !208, file: !4, line: 196, baseType: !256, size: 32, offset: 10400)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !208, file: !4, line: 197, baseType: !106, size: 32, offset: 10432)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !176, file: !43, line: 223, baseType: !259, size: 1600, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !260, line: 73, baseType: !261)
!260 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !260, line: 64, size: 1600, elements: !262)
!262 = !{!263, !281, !285, !286, !287, !288, !289}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !261, file: !260, line: 65, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !260, line: 53, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !260, line: 42, size: 832, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !280}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !260, line: 43, baseType: !106, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !266, file: !260, line: 44, baseType: !106, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !266, file: !260, line: 45, baseType: !106, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !266, file: !260, line: 46, baseType: !106, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !266, file: !260, line: 47, baseType: !106, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !266, file: !260, line: 48, baseType: !106, size: 32, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !266, file: !260, line: 49, baseType: !106, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !266, file: !260, line: 50, baseType: !106, size: 32, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !260, line: 51, baseType: !277, size: 512, offset: 256)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 512, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !260, line: 52, baseType: !84, size: 64, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !261, file: !260, line: 66, baseType: !282, size: 1312, offset: 64)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 1312, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 41)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !261, file: !260, line: 69, baseType: !106, size: 32, offset: 1376)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !261, file: !260, line: 69, baseType: !106, size: 32, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !261, file: !260, line: 70, baseType: !106, size: 32, offset: 1440)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !261, file: !260, line: 71, baseType: !188, size: 64, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !261, file: !260, line: 72, baseType: !290, size: 64, offset: 1536)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !260, line: 59, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !260, line: 57, size: 8192, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !292, file: !260, line: 58, baseType: !295, size: 8192)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 8192, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 1024)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !176, file: !43, line: 223, baseType: !259, size: 1600, offset: 2752)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !176, file: !43, line: 223, baseType: !259, size: 1600, offset: 4352)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !176, file: !43, line: 223, baseType: !259, size: 1600, offset: 5952)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !176, file: !43, line: 233, baseType: !86, size: 16, offset: 7552)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !176, file: !43, line: 236, baseType: !106, size: 32, offset: 7584)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !176, file: !43, line: 238, baseType: !106, size: 32, offset: 7616)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !176, file: !43, line: 238, baseType: !106, size: 32, offset: 7648)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !176, file: !43, line: 239, baseType: !306, size: 128, offset: 7680)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !307, line: 71, baseType: !308)
!307 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !307, line: 69, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !308, file: !307, line: 70, baseType: !84, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !308, file: !307, line: 70, baseType: !84, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !176, file: !43, line: 241, baseType: !163, size: 64, offset: 7808)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !176, file: !43, line: 243, baseType: !306, size: 128, offset: 7872)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !176, file: !43, line: 245, baseType: !84, size: 64, offset: 8000)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!318 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!320 = !{}
!321 = !DILocalVariable(name: "bm", arg: 1, scope: !171, file: !1, line: 298, type: !174)
!322 = !DILocation(line: 298, column: 16, scope: !171)
!323 = !DILocalVariable(name: "plane", arg: 2, scope: !171, file: !1, line: 298, type: !315)
!324 = !DILocation(line: 298, column: 32, scope: !171)
!325 = !DILocalVariable(name: "use_snap_center", arg: 3, scope: !171, file: !1, line: 299, type: !317)
!326 = !DILocation(line: 299, column: 20, scope: !171)
!327 = !DILocalVariable(name: "use_tag", arg: 4, scope: !171, file: !1, line: 299, type: !317)
!328 = !DILocation(line: 299, column: 48, scope: !171)
!329 = !DILocalVariable(name: "oflag_center", arg: 5, scope: !171, file: !1, line: 300, type: !319)
!330 = !DILocation(line: 300, column: 21, scope: !171)
!331 = !DILocalVariable(name: "eps", arg: 6, scope: !171, file: !1, line: 300, type: !316)
!332 = !DILocation(line: 300, column: 47, scope: !171)
!333 = !DILocalVariable(name: "einput_len", scope: !171, file: !1, line: 302, type: !5)
!334 = !DILocation(line: 302, column: 15, scope: !171)
!335 = !DILocalVariable(name: "i", scope: !171, file: !1, line: 303, type: !5)
!336 = !DILocation(line: 303, column: 15, scope: !171)
!337 = !DILocalVariable(name: "edges_arr", scope: !171, file: !1, line: 304, type: !196)
!338 = !DILocation(line: 304, column: 11, scope: !171)
!339 = !DILocation(line: 304, column: 23, scope: !171)
!340 = !DILocation(line: 304, column: 64, scope: !171)
!341 = !DILocation(line: 304, column: 68, scope: !171)
!342 = !DILocation(line: 304, column: 56, scope: !171)
!343 = !DILocation(line: 304, column: 54, scope: !171)
!344 = !DILocalVariable(name: "face_stack", scope: !171, file: !1, line: 306, type: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !190, line: 48, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !190, line: 45, size: 128, elements: !348)
!348 = !{!349, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !190, line: 46, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !347, file: !190, line: 47, baseType: !84, size: 64, offset: 64)
!352 = !DILocation(line: 306, column: 2, scope: !171)
!353 = !DILocalVariable(name: "_face_stack_pool", scope: !171, file: !1, line: 306, type: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !76, line: 47, baseType: !189)
!356 = !DILocalVariable(name: "_face_stack_type", scope: !171, file: !1, line: 306, type: !163)
!357 = !DILocalVariable(name: "v", scope: !171, file: !1, line: 308, type: !96)
!358 = !DILocation(line: 308, column: 10, scope: !171)
!359 = !DILocalVariable(name: "f", scope: !171, file: !1, line: 309, type: !163)
!360 = !DILocation(line: 309, column: 10, scope: !171)
!361 = !DILocalVariable(name: "iter", scope: !171, file: !1, line: 311, type: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !59, line: 186, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !59, line: 164, size: 512, elements: !364)
!364 = !{!365, !442, !443, !444, !445}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !363, file: !59, line: 179, baseType: !366, size: 320)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !59, line: 166, size: 320, elements: !367)
!367 = !{!368, !380, !386, !394, !402, !408, !414, !420, !424, !430, !436}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !366, file: !59, line: 167, baseType: !369, size: 192)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !59, line: 113, size: 192, elements: !370)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !369, file: !59, line: 114, baseType: !372, size: 192)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !76, line: 80, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !76, line: 76, size: 192, elements: !374)
!374 = !{!375, !376, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !373, file: !76, line: 77, baseType: !354, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !373, file: !76, line: 78, baseType: !377, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !76, line: 45, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !373, file: !76, line: 79, baseType: !5, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !366, file: !59, line: 169, baseType: !381, size: 192)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !59, line: 116, size: 192, elements: !382)
!382 = !{!383, !384, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !381, file: !59, line: 117, baseType: !96, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !381, file: !59, line: 118, baseType: !161, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !381, file: !59, line: 118, baseType: !161, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !366, file: !59, line: 170, baseType: !387, size: 320)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !59, line: 120, size: 320, elements: !388)
!388 = !{!389, !390, !391, !392, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !387, file: !59, line: 121, baseType: !96, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !387, file: !59, line: 122, baseType: !145, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !387, file: !59, line: 122, baseType: !145, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !387, file: !59, line: 123, baseType: !161, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !387, file: !59, line: 123, baseType: !161, size: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !366, file: !59, line: 171, baseType: !395, size: 320)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !59, line: 125, size: 320, elements: !396)
!396 = !{!397, !398, !399, !400, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !395, file: !59, line: 126, baseType: !96, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !395, file: !59, line: 127, baseType: !145, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !395, file: !59, line: 127, baseType: !145, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !395, file: !59, line: 128, baseType: !161, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !395, file: !59, line: 128, baseType: !161, size: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !366, file: !59, line: 172, baseType: !403, size: 192)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !59, line: 130, size: 192, elements: !404)
!404 = !{!405, !406, !407}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !403, file: !59, line: 131, baseType: !161, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !403, file: !59, line: 132, baseType: !145, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !403, file: !59, line: 132, baseType: !145, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !366, file: !59, line: 173, baseType: !409, size: 192)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !59, line: 134, size: 192, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !409, file: !59, line: 135, baseType: !145, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !409, file: !59, line: 136, baseType: !145, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !409, file: !59, line: 136, baseType: !145, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !366, file: !59, line: 174, baseType: !415, size: 192)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !59, line: 138, size: 192, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !415, file: !59, line: 139, baseType: !161, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !415, file: !59, line: 140, baseType: !145, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !415, file: !59, line: 140, baseType: !145, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !366, file: !59, line: 175, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !59, line: 142, size: 64, elements: !422)
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !421, file: !59, line: 143, baseType: !161, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !366, file: !59, line: 176, baseType: !425, size: 192)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !59, line: 145, size: 192, elements: !426)
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !425, file: !59, line: 146, baseType: !163, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !425, file: !59, line: 147, baseType: !145, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !425, file: !59, line: 147, baseType: !145, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !366, file: !59, line: 177, baseType: !431, size: 192)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !59, line: 149, size: 192, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !431, file: !59, line: 150, baseType: !163, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !431, file: !59, line: 151, baseType: !145, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !431, file: !59, line: 151, baseType: !145, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !366, file: !59, line: 178, baseType: !437, size: 192)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !59, line: 153, size: 192, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !437, file: !59, line: 154, baseType: !163, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !437, file: !59, line: 155, baseType: !145, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !437, file: !59, line: 155, baseType: !145, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !363, file: !59, line: 181, baseType: !88, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !363, file: !59, line: 182, baseType: !92, size: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !363, file: !59, line: 184, baseType: !106, size: 32, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !363, file: !59, line: 185, baseType: !108, size: 8, offset: 480)
!446 = !DILocation(line: 311, column: 9, scope: !171)
!447 = !DILocation(line: 313, column: 6, scope: !448)
!448 = distinct !DILexicalBlock(scope: !171, file: !1, line: 313, column: 6)
!449 = !DILocation(line: 313, column: 6, scope: !171)
!450 = !DILocalVariable(name: "e", scope: !451, file: !1, line: 315, type: !161)
!451 = distinct !DILexicalBlock(scope: !448, file: !1, line: 313, column: 15)
!452 = !DILocation(line: 315, column: 11, scope: !451)
!453 = !DILocation(line: 316, column: 14, scope: !451)
!454 = !DILocation(line: 319, column: 34, scope: !451)
!455 = !DILocation(line: 319, column: 3, scope: !451)
!456 = !DILocation(line: 322, column: 3, scope: !457)
!457 = distinct !DILexicalBlock(scope: !451, file: !1, line: 322, column: 3)
!458 = !DILocation(line: 322, column: 3, scope: !459)
!459 = distinct !DILexicalBlock(scope: !457, file: !1, line: 322, column: 3)
!460 = !DILocation(line: 323, column: 25, scope: !461)
!461 = distinct !DILexicalBlock(scope: !462, file: !1, line: 323, column: 8)
!462 = distinct !DILexicalBlock(scope: !459, file: !1, line: 322, column: 58)
!463 = !DILocation(line: 323, column: 8, scope: !461)
!464 = !DILocation(line: 323, column: 8, scope: !462)
!465 = !DILocation(line: 324, column: 31, scope: !466)
!466 = distinct !DILexicalBlock(scope: !461, file: !1, line: 323, column: 29)
!467 = !DILocation(line: 324, column: 5, scope: !466)
!468 = !DILocation(line: 324, column: 25, scope: !466)
!469 = !DILocation(line: 324, column: 29, scope: !466)
!470 = !DILocation(line: 327, column: 5, scope: !466)
!471 = !DILocation(line: 328, column: 5, scope: !466)
!472 = !DILocation(line: 329, column: 4, scope: !466)
!473 = !DILocation(line: 330, column: 3, scope: !462)
!474 = distinct !{!474, !456, !475}
!475 = !DILocation(line: 330, column: 3, scope: !457)
!476 = !DILocation(line: 333, column: 2, scope: !451)
!477 = !DILocalVariable(name: "e", scope: !478, file: !1, line: 335, type: !161)
!478 = distinct !DILexicalBlock(scope: !448, file: !1, line: 334, column: 7)
!479 = !DILocation(line: 335, column: 11, scope: !478)
!480 = !DILocation(line: 336, column: 30, scope: !478)
!481 = !DILocation(line: 336, column: 34, scope: !478)
!482 = !DILocation(line: 336, column: 14, scope: !478)
!483 = !DILocation(line: 337, column: 3, scope: !484)
!484 = distinct !DILexicalBlock(scope: !478, file: !1, line: 337, column: 3)
!485 = !DILocation(line: 337, column: 3, scope: !486)
!486 = distinct !DILexicalBlock(scope: !484, file: !1, line: 337, column: 3)
!487 = !DILocation(line: 338, column: 23, scope: !488)
!488 = distinct !DILexicalBlock(scope: !486, file: !1, line: 337, column: 58)
!489 = !DILocation(line: 338, column: 4, scope: !488)
!490 = !DILocation(line: 339, column: 19, scope: !488)
!491 = !DILocation(line: 339, column: 4, scope: !488)
!492 = !DILocation(line: 339, column: 14, scope: !488)
!493 = !DILocation(line: 339, column: 17, scope: !488)
!494 = !DILocation(line: 340, column: 3, scope: !488)
!495 = distinct !{!495, !483, !496}
!496 = !DILocation(line: 340, column: 3, scope: !484)
!497 = !DILocation(line: 342, column: 3, scope: !498)
!498 = distinct !DILexicalBlock(scope: !478, file: !1, line: 342, column: 3)
!499 = !DILocation(line: 342, column: 3, scope: !500)
!500 = distinct !DILexicalBlock(scope: !498, file: !1, line: 342, column: 3)
!501 = !DILocation(line: 343, column: 26, scope: !502)
!502 = distinct !DILexicalBlock(scope: !500, file: !1, line: 342, column: 49)
!503 = !DILocation(line: 343, column: 4, scope: !502)
!504 = !DILocation(line: 344, column: 3, scope: !502)
!505 = distinct !{!505, !497, !506}
!506 = !DILocation(line: 344, column: 3, scope: !498)
!507 = !DILocation(line: 348, column: 2, scope: !508)
!508 = distinct !DILexicalBlock(scope: !171, file: !1, line: 348, column: 2)
!509 = !DILocation(line: 348, column: 2, scope: !510)
