; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_delete.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_delete.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!13 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!14 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !4, line: 116, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !50, line: 57, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!52 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!66 = !{!67, !68, !69, !73, !77, !143, !145, !127, !97, !89}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !50, line: 79, baseType: !49)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !50, line: 158, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !67}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !50, line: 159, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!67, !67}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !80)
!80 = !{!81, !92, !98, !103, !104}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !79, file: !43, line: 91, baseType: !82, size: 128)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !84)
!84 = !{!85, !86, !88, !90, !91}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !43, line: 65, baseType: !67, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !83, file: !43, line: 66, baseType: !87, size: 32, offset: 64)
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !83, file: !43, line: 73, baseType: !89, size: 8, offset: 96)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !83, file: !43, line: 74, baseType: !89, size: 8, offset: 104)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !83, file: !43, line: 80, baseType: !89, size: 8, offset: 112)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !79, file: !43, line: 92, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !94, file: !43, line: 181, baseType: !97, size: 16)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !79, file: !43, line: 94, baseType: !99, size: 96, offset: 192)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 96, elements: !101)
!100 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!101 = !{!102}
!102 = !DISubrange(count: 3)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !79, file: !43, line: 95, baseType: !99, size: 96, offset: 288)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !79, file: !43, line: 102, baseType: !105, size: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !107)
!107 = !{!108, !109, !110, !112, !113, !136, !142}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !106, file: !43, line: 111, baseType: !82, size: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !106, file: !43, line: 112, baseType: !93, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !106, file: !43, line: 114, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !106, file: !43, line: 114, baseType: !111, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !106, file: !43, line: 118, baseType: !114, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !116)
!116 = !{!117, !118, !119, !120, !132, !133, !134, !135}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !115, file: !43, line: 126, baseType: !82, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !115, file: !43, line: 129, baseType: !111, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !115, file: !43, line: 130, baseType: !105, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !115, file: !43, line: 131, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !123)
!123 = !{!124, !125, !126, !129, !130, !131}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !122, file: !43, line: 165, baseType: !82, size: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !122, file: !43, line: 166, baseType: !93, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !122, file: !43, line: 172, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !115)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !122, file: !43, line: 174, baseType: !87, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !122, file: !43, line: 175, baseType: !99, size: 96, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !122, file: !43, line: 176, baseType: !97, size: 16, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !115, file: !43, line: 135, baseType: !114, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !115, file: !43, line: 135, baseType: !114, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !43, line: 139, baseType: !114, size: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !43, line: 139, baseType: !114, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !106, file: !43, line: 122, baseType: !137, size: 128, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !43, line: 107, baseType: !105, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !43, line: 107, baseType: !105, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !106, file: !43, line: 122, baseType: !137, size: 128, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !106)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !122)
!147 = !{i32 7, !"Dwarf Version", i32 4}
!148 = !{i32 2, !"Debug Info Version", i32 3}
!149 = !{i32 1, !"wchar_size", i32 4}
!150 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!151 = distinct !DISubprogram(name: "BMO_mesh_delete_oflag_tagged", scope: !1, file: !1, line: 99, type: !152, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !296)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !154, !295, !197}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !171, !172, !173, !174, !176, !178, !180, !181, !182, !183, !184, !185, !186, !187, !239, !278, !279, !280, !281, !282, !283, !284, !285, !292, !293, !294}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !156, file: !43, line: 187, baseType: !87, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !156, file: !43, line: 187, baseType: !87, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !156, file: !43, line: 187, baseType: !87, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !156, file: !43, line: 187, baseType: !87, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !156, file: !43, line: 188, baseType: !87, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !156, file: !43, line: 188, baseType: !87, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !156, file: !43, line: 188, baseType: !87, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !156, file: !43, line: 193, baseType: !89, size: 8, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !156, file: !43, line: 197, baseType: !89, size: 8, offset: 232)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !156, file: !43, line: 201, baseType: !168, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !170, line: 71, flags: DIFlagFwdDecl)
!170 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !156, file: !43, line: 201, baseType: !168, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !156, file: !43, line: 201, baseType: !168, size: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !156, file: !43, line: 201, baseType: !168, size: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !156, file: !43, line: 208, baseType: !175, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !156, file: !43, line: 209, baseType: !177, size: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !156, file: !43, line: 210, baseType: !179, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !156, file: !43, line: 213, baseType: !87, size: 32, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !156, file: !43, line: 214, baseType: !87, size: 32, offset: 736)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !156, file: !43, line: 215, baseType: !87, size: 32, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !156, file: !43, line: 218, baseType: !168, size: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !156, file: !43, line: 218, baseType: !168, size: 64, offset: 896)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !156, file: !43, line: 218, baseType: !168, size: 64, offset: 960)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !156, file: !43, line: 220, baseType: !87, size: 32, offset: 1024)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !156, file: !43, line: 221, baseType: !188, size: 64, offset: 1088)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !190)
!190 = !{!191, !227, !228, !232, !235, !236, !238}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !189, file: !4, line: 191, baseType: !192, size: 5120)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 5120, elements: !225)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !194)
!194 = !{!195, !198, !200, !210, !211}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !193, file: !4, line: 148, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !193, file: !4, line: 149, baseType: !199, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !193, file: !4, line: 150, baseType: !201, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !203)
!203 = !{!204, !206, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !202, file: !4, line: 139, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !202, file: !4, line: 140, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !202, file: !4, line: 141, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !193, file: !4, line: 152, baseType: !87, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !4, line: 162, baseType: !212, size: 128, offset: 192)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !193, file: !4, line: 155, size: 128, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !220}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !212, file: !4, line: 156, baseType: !87, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !212, file: !4, line: 157, baseType: !100, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !212, file: !4, line: 158, baseType: !67, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !212, file: !4, line: 159, baseType: !99, size: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !212, file: !4, line: 160, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !212, file: !4, line: 161, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !223, line: 48, baseType: !224)
!223 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !223, line: 48, flags: DIFlagFwdDecl)
!225 = !{!226}
!226 = !DISubrange(count: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !189, file: !4, line: 192, baseType: !192, size: 5120, offset: 5120)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !189, file: !4, line: 193, baseType: !229, size: 64, offset: 10240)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !154, !188}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !189, file: !4, line: 194, baseType: !233, size: 64, offset: 10304)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !4, line: 195, baseType: !87, size: 32, offset: 10368)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !189, file: !4, line: 196, baseType: !237, size: 32, offset: 10400)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !189, file: !4, line: 197, baseType: !87, size: 32, offset: 10432)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !156, file: !43, line: 223, baseType: !240, size: 1600, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !170, line: 73, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !170, line: 64, size: 1600, elements: !242)
!242 = !{!243, !261, !265, !266, !267, !268, !269}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !241, file: !170, line: 65, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !170, line: 53, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !170, line: 42, size: 832, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !260}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !246, file: !170, line: 43, baseType: !87, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !246, file: !170, line: 44, baseType: !87, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !246, file: !170, line: 45, baseType: !87, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !246, file: !170, line: 46, baseType: !87, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !246, file: !170, line: 47, baseType: !87, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !246, file: !170, line: 48, baseType: !87, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !246, file: !170, line: 49, baseType: !87, size: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !246, file: !170, line: 50, baseType: !87, size: 32, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !170, line: 51, baseType: !257, size: 512, offset: 256)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 512, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !246, file: !170, line: 52, baseType: !67, size: 64, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !241, file: !170, line: 66, baseType: !262, size: 1312, offset: 64)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1312, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 41)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !241, file: !170, line: 69, baseType: !87, size: 32, offset: 1376)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !241, file: !170, line: 69, baseType: !87, size: 32, offset: 1408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !241, file: !170, line: 70, baseType: !87, size: 32, offset: 1440)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !241, file: !170, line: 71, baseType: !168, size: 64, offset: 1472)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !241, file: !170, line: 72, baseType: !270, size: 64, offset: 1536)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !170, line: 59, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !170, line: 57, size: 8192, elements: !273)
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !272, file: !170, line: 58, baseType: !275, size: 8192)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 1024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !156, file: !43, line: 223, baseType: !240, size: 1600, offset: 2752)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !156, file: !43, line: 223, baseType: !240, size: 1600, offset: 4352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !156, file: !43, line: 223, baseType: !240, size: 1600, offset: 5952)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !156, file: !43, line: 233, baseType: !97, size: 16, offset: 7552)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !156, file: !43, line: 236, baseType: !87, size: 32, offset: 7584)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !156, file: !43, line: 238, baseType: !87, size: 32, offset: 7616)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !156, file: !43, line: 238, baseType: !87, size: 32, offset: 7648)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !156, file: !43, line: 239, baseType: !286, size: 128, offset: 7680)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !287, line: 71, baseType: !288)
!287 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !287, line: 69, size: 128, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !288, file: !287, line: 70, baseType: !67, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !288, file: !287, line: 70, baseType: !67, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !156, file: !43, line: 241, baseType: !145, size: 64, offset: 7808)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !156, file: !43, line: 243, baseType: !286, size: 128, offset: 7872)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !156, file: !43, line: 245, baseType: !67, size: 64, offset: 8000)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!296 = !{}
!297 = !DILocalVariable(name: "bm", arg: 1, scope: !151, file: !1, line: 99, type: !154)
!298 = !DILocation(line: 99, column: 42, scope: !151)
!299 = !DILocalVariable(name: "oflag", arg: 2, scope: !151, file: !1, line: 99, type: !295)
!300 = !DILocation(line: 99, column: 58, scope: !151)
!301 = !DILocalVariable(name: "htype", arg: 3, scope: !151, file: !1, line: 99, type: !197)
!302 = !DILocation(line: 99, column: 76, scope: !151)
!303 = !DILocation(line: 101, column: 6, scope: !304)
!304 = distinct !DILexicalBlock(scope: !151, file: !1, line: 101, column: 6)
!305 = !DILocation(line: 101, column: 12, scope: !304)
!306 = !DILocation(line: 101, column: 6, scope: !151)
!307 = !DILocation(line: 102, column: 27, scope: !308)
!308 = distinct !DILexicalBlock(scope: !304, file: !1, line: 101, column: 23)
!309 = !DILocation(line: 102, column: 31, scope: !308)
!310 = !DILocation(line: 102, column: 3, scope: !308)
!311 = !DILocation(line: 103, column: 2, scope: !308)
!312 = !DILocation(line: 104, column: 6, scope: !313)
!313 = distinct !DILexicalBlock(scope: !151, file: !1, line: 104, column: 6)
!314 = !DILocation(line: 104, column: 12, scope: !313)
!315 = !DILocation(line: 104, column: 6, scope: !151)
!316 = !DILocation(line: 105, column: 27, scope: !317)
!317 = distinct !DILexicalBlock(scope: !313, file: !1, line: 104, column: 23)
!318 = !DILocation(line: 105, column: 31, scope: !317)
!319 = !DILocation(line: 105, column: 3, scope: !317)
!320 = !DILocation(line: 106, column: 2, scope: !317)
!321 = !DILocation(line: 107, column: 6, scope: !322)
!322 = distinct !DILexicalBlock(scope: !151, file: !1, line: 107, column: 6)
!323 = !DILocation(line: 107, column: 12, scope: !322)
!324 = !DILocation(line: 107, column: 6, scope: !151)
!325 = !DILocation(line: 108, column: 27, scope: !326)
!326 = distinct !DILexicalBlock(scope: !322, file: !1, line: 107, column: 23)
!327 = !DILocation(line: 108, column: 31, scope: !326)
!328 = !DILocation(line: 108, column: 3, scope: !326)
!329 = !DILocation(line: 109, column: 2, scope: !326)
!330 = !DILocation(line: 110, column: 1, scope: !151)
!331 = distinct !DISubprogram(name: "bmo_remove_tagged_faces", scope: !1, file: !1, line: 51, type: !332, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !296)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !154, !295}
!334 = !DILocalVariable(name: "bm", arg: 1, scope: !331, file: !1, line: 51, type: !154)
!335 = !DILocation(line: 51, column: 44, scope: !331)
!336 = !DILocalVariable(name: "oflag", arg: 2, scope: !331, file: !1, line: 51, type: !295)
!337 = !DILocation(line: 51, column: 60, scope: !331)
!338 = !DILocalVariable(name: "f", scope: !331, file: !1, line: 53, type: !145)
!339 = !DILocation(line: 53, column: 10, scope: !331)
!340 = !DILocalVariable(name: "f_next", scope: !331, file: !1, line: 53, type: !145)
!341 = !DILocation(line: 53, column: 14, scope: !331)
!342 = !DILocalVariable(name: "iter", scope: !331, file: !1, line: 54, type: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !50, line: 186, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !50, line: 164, size: 512, elements: !345)
!345 = !{!346, !426, !427, !428, !429}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !344, file: !50, line: 179, baseType: !347, size: 320)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !344, file: !50, line: 166, size: 320, elements: !348)
!348 = !{!349, !364, !370, !378, !386, !392, !398, !404, !408, !414, !420}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !347, file: !50, line: 167, baseType: !350, size: 192)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !50, line: 113, size: 192, elements: !351)
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !350, file: !50, line: 114, baseType: !353, size: 192)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !354, line: 80, baseType: !355)
!354 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !354, line: 76, size: 192, elements: !356)
!356 = !{!357, !360, !363}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !355, file: !354, line: 77, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !354, line: 47, baseType: !169)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !355, file: !354, line: 78, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !354, line: 45, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !355, file: !354, line: 79, baseType: !5, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !347, file: !50, line: 169, baseType: !365, size: 192)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !50, line: 116, size: 192, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !365, file: !50, line: 117, baseType: !77, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !365, file: !50, line: 118, baseType: !143, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !365, file: !50, line: 118, baseType: !143, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !347, file: !50, line: 170, baseType: !371, size: 320)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !50, line: 120, size: 320, elements: !372)
!372 = !{!373, !374, !375, !376, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !371, file: !50, line: 121, baseType: !77, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !371, file: !50, line: 122, baseType: !127, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !371, file: !50, line: 122, baseType: !127, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !371, file: !50, line: 123, baseType: !143, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !371, file: !50, line: 123, baseType: !143, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !347, file: !50, line: 171, baseType: !379, size: 320)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !50, line: 125, size: 320, elements: !380)
!380 = !{!381, !382, !383, !384, !385}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !379, file: !50, line: 126, baseType: !77, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !379, file: !50, line: 127, baseType: !127, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !379, file: !50, line: 127, baseType: !127, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !379, file: !50, line: 128, baseType: !143, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !379, file: !50, line: 128, baseType: !143, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !347, file: !50, line: 172, baseType: !387, size: 192)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !50, line: 130, size: 192, elements: !388)
!388 = !{!389, !390, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !387, file: !50, line: 131, baseType: !143, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !387, file: !50, line: 132, baseType: !127, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !387, file: !50, line: 132, baseType: !127, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !347, file: !50, line: 173, baseType: !393, size: 192)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !50, line: 134, size: 192, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !393, file: !50, line: 135, baseType: !127, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !393, file: !50, line: 136, baseType: !127, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !393, file: !50, line: 136, baseType: !127, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !347, file: !50, line: 174, baseType: !399, size: 192)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !50, line: 138, size: 192, elements: !400)
!400 = !{!401, !402, !403}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !399, file: !50, line: 139, baseType: !143, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !399, file: !50, line: 140, baseType: !127, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !399, file: !50, line: 140, baseType: !127, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !347, file: !50, line: 175, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !50, line: 142, size: 64, elements: !406)
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !405, file: !50, line: 143, baseType: !143, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !347, file: !50, line: 176, baseType: !409, size: 192)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !50, line: 145, size: 192, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !409, file: !50, line: 146, baseType: !145, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !409, file: !50, line: 147, baseType: !127, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !409, file: !50, line: 147, baseType: !127, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !347, file: !50, line: 177, baseType: !415, size: 192)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !50, line: 149, size: 192, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !415, file: !50, line: 150, baseType: !145, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !415, file: !50, line: 151, baseType: !127, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !415, file: !50, line: 151, baseType: !127, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !347, file: !50, line: 178, baseType: !421, size: 192)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !50, line: 153, size: 192, elements: !422)
!422 = !{!423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !421, file: !50, line: 154, baseType: !145, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !421, file: !50, line: 155, baseType: !127, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !421, file: !50, line: 155, baseType: !127, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !344, file: !50, line: 181, baseType: !69, size: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !344, file: !50, line: 182, baseType: !73, size: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !344, file: !50, line: 184, baseType: !87, size: 32, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !344, file: !50, line: 185, baseType: !89, size: 8, offset: 480)
!430 = !DILocation(line: 54, column: 9, scope: !331)
!431 = !DILocation(line: 56, column: 2, scope: !432)
!432 = distinct !DILexicalBlock(scope: !331, file: !1, line: 56, column: 2)
!433 = !DILocation(line: 56, column: 2, scope: !434)
!434 = distinct !DILexicalBlock(scope: !432, file: !1, line: 56, column: 2)
!435 = !DILocation(line: 57, column: 7, scope: !436)
!436 = distinct !DILexicalBlock(scope: !437, file: !1, line: 57, column: 7)
!437 = distinct !DILexicalBlock(scope: !434, file: !1, line: 56, column: 64)
!438 = !DILocation(line: 57, column: 7, scope: !437)
!439 = !DILocation(line: 58, column: 17, scope: !440)
!440 = distinct !DILexicalBlock(scope: !436, file: !1, line: 57, column: 41)
!441 = !DILocation(line: 58, column: 21, scope: !440)
!442 = !DILocation(line: 58, column: 4, scope: !440)
!443 = !DILocation(line: 59, column: 3, scope: !440)
!444 = !DILocation(line: 60, column: 2, scope: !437)
!445 = distinct !{!445, !431, !446}
!446 = !DILocation(line: 60, column: 2, scope: !432)
!447 = !DILocation(line: 61, column: 1, scope: !331)
!448 = distinct !DISubprogram(name: "bmo_remove_tagged_edges", scope: !1, file: !1, line: 63, type: !332, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !296)
!449 = !DILocalVariable(name: "bm", arg: 1, scope: !448, file: !1, line: 63, type: !154)
!450 = !DILocation(line: 63, column: 44, scope: !448)
!451 = !DILocalVariable(name: "oflag", arg: 2, scope: !448, file: !1, line: 63, type: !295)
!452 = !DILocation(line: 63, column: 60, scope: !448)
!453 = !DILocalVariable(name: "e", scope: !448, file: !1, line: 65, type: !143)
!454 = !DILocation(line: 65, column: 10, scope: !448)
!455 = !DILocalVariable(name: "e_next", scope: !448, file: !1, line: 65, type: !143)
!456 = !DILocation(line: 65, column: 14, scope: !448)
!457 = !DILocalVariable(name: "iter", scope: !448, file: !1, line: 66, type: !343)
!458 = !DILocation(line: 66, column: 9, scope: !448)
!459 = !DILocation(line: 68, column: 2, scope: !460)
!460 = distinct !DILexicalBlock(scope: !448, file: !1, line: 68, column: 2)
!461 = !DILocation(line: 68, column: 2, scope: !462)
!462 = distinct !DILexicalBlock(scope: !460, file: !1, line: 68, column: 2)
!463 = !DILocation(line: 69, column: 7, scope: !464)
!464 = distinct !DILexicalBlock(scope: !465, file: !1, line: 69, column: 7)
!465 = distinct !DILexicalBlock(scope: !462, file: !1, line: 68, column: 64)
!466 = !DILocation(line: 69, column: 7, scope: !465)
!467 = !DILocation(line: 70, column: 17, scope: !468)
!468 = distinct !DILexicalBlock(scope: !464, file: !1, line: 69, column: 41)
!469 = !DILocation(line: 70, column: 21, scope: !468)
!470 = !DILocation(line: 70, column: 4, scope: !468)
!471 = !DILocation(line: 71, column: 3, scope: !468)
!472 = !DILocation(line: 72, column: 2, scope: !465)
!473 = distinct !{!473, !459, !474}
!474 = !DILocation(line: 72, column: 2, scope: !460)
!475 = !DILocation(line: 73, column: 1, scope: !448)
!476 = distinct !DISubprogram(name: "bmo_remove_tagged_verts", scope: !1, file: !1, line: 75, type: !332, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !296)
!477 = !DILocalVariable(name: "bm", arg: 1, scope: !476, file: !1, line: 75, type: !154)
!478 = !DILocation(line: 75, column: 44, scope: !476)
!479 = !DILocalVariable(name: "oflag", arg: 2, scope: !476, file: !1, line: 75, type: !295)
!480 = !DILocation(line: 75, column: 60, scope: !476)
!481 = !DILocalVariable(name: "v", scope: !476, file: !1, line: 77, type: !77)
!482 = !DILocation(line: 77, column: 10, scope: !476)
!483 = !DILocalVariable(name: "v_next", scope: !476, file: !1, line: 77, type: !77)
!484 = !DILocation(line: 77, column: 14, scope: !476)
!485 = !DILocalVariable(name: "iter", scope: !476, file: !1, line: 78, type: !343)
