; ModuleID = 'blender/source/blender/editors/space_nla/space_nla.c'
source_filename = "blender/source/blender/editors/space_nla/space_nla.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!231 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!232 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!233 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!234 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!235 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!236 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!237 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!238 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!239 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!240 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!241 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!242 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!243 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!244 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!245 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!246 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!247 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!248 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!249 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!250 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!251 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!252 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!253 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!254 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceNla_Flag", file: !16, line: 402, baseType: !5, size: 32, elements: !256)
!256 = !{!257, !258, !259, !260}
!257 = !DIEnumerator(name: "SNLA_DRAWTIME", value: 4, isUnsigned: true)
!258 = !DIEnumerator(name: "SNLA_NODRAWCFRANUM", value: 16, isUnsigned: true)
!259 = !DIEnumerator(name: "SNLA_NOSTRIPCURVES", value: 32, isUnsigned: true)
!260 = !DIEnumerator(name: "SNLA_NOREALTIMEUPDATES", value: 64, isUnsigned: true)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Units", file: !50, line: 73, baseType: !5, size: 32, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268}
!263 = !DIEnumerator(name: "V2D_UNIT_SECONDS", value: 0, isUnsigned: true)
!264 = !DIEnumerator(name: "V2D_UNIT_FRAMES", value: 1, isUnsigned: true)
!265 = !DIEnumerator(name: "V2D_UNIT_FRAMESCALE", value: 2, isUnsigned: true)
!266 = !DIEnumerator(name: "V2D_UNIT_VALUES", value: 3, isUnsigned: true)
!267 = !DIEnumerator(name: "V2D_UNIT_DEGREES", value: 4, isUnsigned: true)
!268 = !DIEnumerator(name: "V2D_UNIT_TIME", value: 5, isUnsigned: true)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Clamp", file: !50, line: 86, baseType: !5, size: 32, elements: !270)
!270 = !{!271, !272}
!271 = !DIEnumerator(name: "V2D_GRID_NOCLAMP", value: 0, isUnsigned: true)
!272 = !DIEnumerator(name: "V2D_GRID_CLAMP", value: 1, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Gridlines", file: !50, line: 92, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281}
!275 = !DIEnumerator(name: "V2D_HORIZONTAL_LINES", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "V2D_VERTICAL_LINES", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "V2D_HORIZONTAL_AXIS", value: 4, isUnsigned: true)
!278 = !DIEnumerator(name: "V2D_VERTICAL_AXIS", value: 8, isUnsigned: true)
!279 = !DIEnumerator(name: "V2D_HORIZONTAL_FINELINES", value: 16, isUnsigned: true)
!280 = !DIEnumerator(name: "V2D_GRIDLINES_MAJOR", value: 15, isUnsigned: true)
!281 = !DIEnumerator(name: "V2D_GRIDLINES_ALL", value: 31, isUnsigned: true)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimEditDraw_CurrentFrame", file: !283, line: 508, baseType: !5, size: 32, elements: !284)
!283 = !DIFile(filename: "blender/source/blender/editors/include/ED_anim_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!284 = !{!285, !286, !287, !288}
!285 = !DIEnumerator(name: "DRAWCFRA_PLAIN", value: 0, isUnsigned: true)
!286 = !DIEnumerator(name: "DRAWCFRA_SHOW_NUMBOX", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "DRAWCFRA_UNIT_SECONDS", value: 2, isUnsigned: true)
!288 = !DIEnumerator(name: "DRAWCFRA_WIDE", value: 4, isUnsigned: true)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !290, line: 44, baseType: !5, size: 32, elements: !291)
!290 = !DIFile(filename: "blender/source/blender/editors/include/ED_markers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!291 = !{!292, !293, !294}
!292 = !DIEnumerator(name: "DRAW_MARKERS_LINES", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "DRAW_MARKERS_LOCAL", value: 2, isUnsigned: true)
!294 = !DIEnumerator(name: "DRAW_MARKERS_MARGIN", value: 4, isUnsigned: true)
!295 = !{!296, !297, !366, !367, !381, !1841}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !299, line: 130, baseType: !300)
!299 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !299, line: 117, size: 960, elements: !301)
!301 = !{!302, !303, !304, !306, !325, !329, !331, !332, !333, !334}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !299, line: 118, baseType: !296, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !300, file: !299, line: 118, baseType: !296, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !300, file: !299, line: 119, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !300, file: !299, line: 120, baseType: !307, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !299, line: 136, size: 17600, elements: !309)
!309 = !{!310, !311, !312, !315, !320, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !308, file: !299, line: 137, baseType: !298, size: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !308, file: !299, line: 138, baseType: !297, size: 64, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !308, file: !299, line: 139, baseType: !313, size: 64, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !299, line: 43, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !299, line: 140, baseType: !316, size: 8192, offset: 1088)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 8192, elements: !318)
!317 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!318 = !{!319}
!319 = !DISubrange(count: 1024)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !308, file: !299, line: 141, baseType: !316, size: 8192, offset: 9280)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !299, line: 148, baseType: !307, size: 64, offset: 17472)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !308, file: !299, line: 150, baseType: !323, size: 64, offset: 17536)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !299, line: 45, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !299, line: 121, baseType: !326, size: 528, offset: 256)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 528, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 66)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !300, file: !299, line: 126, baseType: !330, size: 16, offset: 784)
!330 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !300, file: !299, line: 127, baseType: !51, size: 32, offset: 800)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !300, file: !299, line: 128, baseType: !51, size: 32, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !300, file: !299, line: 128, baseType: !51, size: 32, offset: 864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !300, file: !299, line: 129, baseType: !335, size: 64, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !299, line: 75, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !299, line: 62, size: 1024, elements: !338)
!338 = !{!339, !341, !342, !343, !344, !345, !349, !350, !364, !365}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !299, line: 63, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !337, file: !299, line: 63, baseType: !340, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !337, file: !299, line: 64, baseType: !317, size: 8, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !337, file: !299, line: 64, baseType: !317, size: 8, offset: 136)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !337, file: !299, line: 65, baseType: !330, size: 16, offset: 144)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !299, line: 66, baseType: !346, size: 512, offset: 160)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 512, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !337, file: !299, line: 67, baseType: !51, size: 32, offset: 672)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !337, file: !299, line: 69, baseType: !351, size: 256, offset: 704)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !299, line: 60, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !299, line: 48, size: 256, elements: !353)
!353 = !{!354, !355, !362, !363}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !352, file: !299, line: 49, baseType: !296, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !352, file: !299, line: 58, baseType: !356, size: 128, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !357, line: 71, baseType: !358)
!357 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !357, line: 69, size: 128, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !358, file: !357, line: 70, baseType: !296, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !358, file: !357, line: 70, baseType: !296, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !352, file: !299, line: 59, baseType: !51, size: 32, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !352, file: !299, line: 59, baseType: !51, size: 32, offset: 224)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !337, file: !299, line: 70, baseType: !51, size: 32, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !337, file: !299, line: 74, baseType: !51, size: 32, offset: 992)
!366 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !16, line: 91, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !16, line: 85, size: 448, elements: !370)
!370 = !{!371, !373, !374, !375, !376, !377}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !16, line: 86, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !369, file: !16, line: 86, baseType: !372, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !369, file: !16, line: 87, baseType: !356, size: 128, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !369, file: !16, line: 88, baseType: !51, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !369, file: !16, line: 89, baseType: !366, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !369, file: !16, line: 90, baseType: !378, size: 128, offset: 320)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 128, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 8)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceNla", file: !16, line: 399, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNla", file: !16, line: 386, size: 1856, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !408}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !16, line: 387, baseType: !372, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !16, line: 387, baseType: !372, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !383, file: !16, line: 388, baseType: !356, size: 128, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !383, file: !16, line: 389, baseType: !51, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !383, file: !16, line: 390, baseType: !366, size: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !383, file: !16, line: 391, baseType: !378, size: 128, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "autosnap", scope: !383, file: !16, line: 393, baseType: !330, size: 16, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !383, file: !16, line: 394, baseType: !330, size: 16, offset: 464)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !383, file: !16, line: 395, baseType: !51, size: 32, offset: 480)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !383, file: !16, line: 397, baseType: !395, size: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bDopeSheet", file: !41, line: 519, size: 896, elements: !397)
!397 = !{!398, !399, !400, !403, !404, !405, !406, !407}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !396, file: !41, line: 520, baseType: !297, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !396, file: !41, line: 521, baseType: !356, size: 128, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "filter_grp", scope: !396, file: !41, line: 523, baseType: !401, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !41, line: 46, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "searchstr", scope: !396, file: !41, line: 524, baseType: !346, size: 512, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "filterflag", scope: !396, file: !41, line: 526, baseType: !51, size: 32, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !396, file: !41, line: 527, baseType: !51, size: 32, offset: 800)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "renameIndex", scope: !396, file: !41, line: 529, baseType: !51, size: 32, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !396, file: !41, line: 530, baseType: !51, size: 32, offset: 864)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !383, file: !16, line: 398, baseType: !409, size: 1280, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !410, line: 71, baseType: !411)
!410 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !410, line: 40, size: 1280, elements: !412)
!412 = !{!413, !422, !423, !431, !432, !433, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !454, !455, !456, !459}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !411, file: !410, line: 41, baseType: !414, size: 128)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !415, line: 95, baseType: !416)
!415 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !415, line: 92, size: 128, elements: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !416, file: !415, line: 93, baseType: !366, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !416, file: !415, line: 93, baseType: !366, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !416, file: !415, line: 94, baseType: !366, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !416, file: !415, line: 94, baseType: !366, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !411, file: !410, line: 41, baseType: !414, size: 128, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !411, file: !410, line: 42, baseType: !424, size: 128, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !415, line: 89, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !415, line: 86, size: 128, elements: !426)
!426 = !{!427, !428, !429, !430}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !425, file: !415, line: 87, baseType: !51, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !425, file: !415, line: 87, baseType: !51, size: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !425, file: !415, line: 88, baseType: !51, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !425, file: !415, line: 88, baseType: !51, size: 32, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !411, file: !410, line: 42, baseType: !424, size: 128, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !411, file: !410, line: 43, baseType: !424, size: 128, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !411, file: !410, line: 45, baseType: !434, size: 64, offset: 640)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 64, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 2)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !411, file: !410, line: 45, baseType: !434, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !411, file: !410, line: 46, baseType: !366, size: 32, offset: 768)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !411, file: !410, line: 46, baseType: !366, size: 32, offset: 800)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !411, file: !410, line: 48, baseType: !330, size: 16, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !411, file: !410, line: 49, baseType: !330, size: 16, offset: 848)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !411, file: !410, line: 51, baseType: !330, size: 16, offset: 864)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !411, file: !410, line: 52, baseType: !330, size: 16, offset: 880)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !411, file: !410, line: 53, baseType: !330, size: 16, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !411, file: !410, line: 55, baseType: !330, size: 16, offset: 912)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !411, file: !410, line: 56, baseType: !330, size: 16, offset: 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !411, file: !410, line: 58, baseType: !330, size: 16, offset: 944)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !411, file: !410, line: 58, baseType: !330, size: 16, offset: 960)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !411, file: !410, line: 59, baseType: !330, size: 16, offset: 976)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !411, file: !410, line: 59, baseType: !330, size: 16, offset: 992)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !411, file: !410, line: 61, baseType: !330, size: 16, offset: 1008)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !411, file: !410, line: 63, baseType: !453, size: 64, offset: 1024)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !411, file: !410, line: 64, baseType: !51, size: 32, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !411, file: !410, line: 65, baseType: !51, size: 32, offset: 1120)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !411, file: !410, line: 68, baseType: !457, size: 64, offset: 1152)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !410, line: 68, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !411, file: !410, line: 69, baseType: !460, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !462, line: 490, size: 768, elements: !463)
!462 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!463 = !{!464, !465, !466, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !461, file: !462, line: 491, baseType: !460, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !461, file: !462, line: 491, baseType: !460, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !461, file: !462, line: 493, baseType: !467, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !469, line: 169, size: 2048, elements: !470)
!469 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!470 = !{!471, !472, !473, !474, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1807, !1810, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !469, line: 170, baseType: !467, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !468, file: !469, line: 170, baseType: !467, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !468, file: !469, line: 172, baseType: !296, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !468, file: !469, line: 174, baseType: !475, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !4, line: 49, size: 1984, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !476, file: !4, line: 50, baseType: !298, size: 960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !476, file: !4, line: 52, baseType: !356, size: 128, offset: 960)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !476, file: !4, line: 53, baseType: !356, size: 128, offset: 1088)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !476, file: !4, line: 54, baseType: !356, size: 128, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !476, file: !4, line: 55, baseType: !356, size: 128, offset: 1344)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !476, file: !4, line: 57, baseType: !484, size: 64, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !486, line: 1216, size: 39680, elements: !487)
!486 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!487 = !{!488, !489, !558, !562, !565, !566, !567, !579, !580, !584, !585, !586, !587, !588, !589, !590, !591, !592, !596, !665, !1101, !1316, !1319, !1600, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1622, !1623, !1624, !1625, !1626, !1634, !1701, !1708, !1709, !1716, !1717, !1723, !1724, !1725, !1726, !1727}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !485, file: !486, line: 1217, baseType: !298, size: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !485, file: !486, line: 1218, baseType: !490, size: 64, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !492, line: 838, size: 768, elements: !493)
!492 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!493 = !{!494, !508, !509, !519, !520, !551, !552, !553, !554, !555, !556, !557}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !491, file: !492, line: 840, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !41, line: 499, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !41, line: 486, size: 1600, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !497, file: !41, line: 487, baseType: !298, size: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !497, file: !41, line: 489, baseType: !356, size: 128, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !497, file: !41, line: 490, baseType: !356, size: 128, offset: 1088)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !497, file: !41, line: 491, baseType: !356, size: 128, offset: 1216)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !497, file: !41, line: 492, baseType: !356, size: 128, offset: 1344)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !497, file: !41, line: 494, baseType: !51, size: 32, offset: 1472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !497, file: !41, line: 495, baseType: !51, size: 32, offset: 1504)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !497, file: !41, line: 497, baseType: !51, size: 32, offset: 1536)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !497, file: !41, line: 498, baseType: !51, size: 32, offset: 1568)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !491, file: !492, line: 844, baseType: !495, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !491, file: !492, line: 848, baseType: !510, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !492, line: 549, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !492, line: 544, size: 320, elements: !513)
!513 = !{!514, !516, !517, !518}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !492, line: 545, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !512, file: !492, line: 545, baseType: !515, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !512, file: !492, line: 547, baseType: !495, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !512, file: !492, line: 548, baseType: !356, size: 128, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !491, file: !492, line: 851, baseType: !356, size: 128, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !491, file: !492, line: 853, baseType: !521, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !492, line: 594, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !492, line: 561, size: 1664, elements: !524)
!524 = !{!525, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !523, file: !492, line: 562, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !523, file: !492, line: 562, baseType: !526, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !523, file: !492, line: 564, baseType: !356, size: 128, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !523, file: !492, line: 565, baseType: !495, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !523, file: !492, line: 566, baseType: !510, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !523, file: !492, line: 568, baseType: !356, size: 128, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !523, file: !492, line: 569, baseType: !356, size: 128, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !523, file: !492, line: 571, baseType: !346, size: 512, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !523, file: !492, line: 573, baseType: !366, size: 32, offset: 1152)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !523, file: !492, line: 574, baseType: !366, size: 32, offset: 1184)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !523, file: !492, line: 576, baseType: !366, size: 32, offset: 1216)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !523, file: !492, line: 576, baseType: !366, size: 32, offset: 1248)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !523, file: !492, line: 577, baseType: !366, size: 32, offset: 1280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !523, file: !492, line: 577, baseType: !366, size: 32, offset: 1312)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !523, file: !492, line: 579, baseType: !366, size: 32, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !523, file: !492, line: 580, baseType: !366, size: 32, offset: 1376)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !523, file: !492, line: 582, baseType: !366, size: 32, offset: 1408)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !523, file: !492, line: 582, baseType: !366, size: 32, offset: 1440)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !523, file: !492, line: 583, baseType: !330, size: 16, offset: 1472)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !523, file: !492, line: 585, baseType: !330, size: 16, offset: 1488)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !523, file: !492, line: 586, baseType: !330, size: 16, offset: 1504)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !523, file: !492, line: 588, baseType: !330, size: 16, offset: 1520)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !523, file: !492, line: 590, baseType: !296, size: 64, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !523, file: !492, line: 592, baseType: !51, size: 32, offset: 1600)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !523, file: !492, line: 593, baseType: !51, size: 32, offset: 1632)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !491, file: !492, line: 858, baseType: !356, size: 128, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !491, file: !492, line: 859, baseType: !356, size: 128, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !491, file: !492, line: 862, baseType: !51, size: 32, offset: 640)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !491, file: !492, line: 863, baseType: !51, size: 32, offset: 672)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !491, file: !492, line: 866, baseType: !330, size: 16, offset: 704)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !491, file: !492, line: 867, baseType: !330, size: 16, offset: 720)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !491, file: !492, line: 868, baseType: !366, size: 32, offset: 736)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !485, file: !486, line: 1220, baseType: !559, size: 64, offset: 1024)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !561, line: 49, flags: DIFlagFwdDecl)
!561 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!562 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !485, file: !486, line: 1221, baseType: !563, size: 64, offset: 1088)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !486, line: 52, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !485, file: !486, line: 1223, baseType: !484, size: 64, offset: 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !485, file: !486, line: 1225, baseType: !356, size: 128, offset: 1216)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !485, file: !486, line: 1226, baseType: !568, size: 64, offset: 1344)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !486, line: 69, size: 320, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !569, file: !486, line: 70, baseType: !568, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !569, file: !486, line: 70, baseType: !568, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !569, file: !486, line: 71, baseType: !5, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !569, file: !486, line: 71, baseType: !5, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !569, file: !486, line: 72, baseType: !51, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !569, file: !486, line: 73, baseType: !330, size: 16, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !569, file: !486, line: 73, baseType: !330, size: 16, offset: 240)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !569, file: !486, line: 74, baseType: !559, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !485, file: !486, line: 1227, baseType: !559, size: 64, offset: 1408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !485, file: !486, line: 1229, baseType: !581, size: 96, offset: 1472)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 96, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 3)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !485, file: !486, line: 1230, baseType: !581, size: 96, offset: 1568)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !485, file: !486, line: 1231, baseType: !581, size: 96, offset: 1664)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !485, file: !486, line: 1231, baseType: !581, size: 96, offset: 1760)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !485, file: !486, line: 1233, baseType: !5, size: 32, offset: 1856)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !485, file: !486, line: 1234, baseType: !51, size: 32, offset: 1888)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !485, file: !486, line: 1235, baseType: !5, size: 32, offset: 1920)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !485, file: !486, line: 1237, baseType: !330, size: 16, offset: 1952)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !485, file: !486, line: 1239, baseType: !317, size: 8, offset: 1968)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !485, file: !486, line: 1240, baseType: !593, size: 8, offset: 1976)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 8, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 1)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !485, file: !486, line: 1242, baseType: !597, size: 64, offset: 1984)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !599, line: 328, size: 3456, elements: !600)
!599 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!600 = !{!601, !602, !603, !606, !607, !611, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !635, !640, !641, !644, !648, !653, !657, !661, !662, !663, !664}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !598, file: !599, line: 329, baseType: !298, size: 960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !598, file: !599, line: 330, baseType: !490, size: 64, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !598, file: !599, line: 332, baseType: !604, size: 64, offset: 1024)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !599, line: 332, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !598, file: !599, line: 333, baseType: !346, size: 512, offset: 1088)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !598, file: !599, line: 335, baseType: !608, size: 64, offset: 1600)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !610, line: 41, flags: DIFlagFwdDecl)
!610 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !598, file: !599, line: 337, baseType: !612, size: 64, offset: 1664)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !486, line: 61, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !598, file: !599, line: 338, baseType: !434, size: 64, offset: 1728)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !598, file: !599, line: 340, baseType: !356, size: 128, offset: 1792)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !598, file: !599, line: 340, baseType: !356, size: 128, offset: 1920)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !598, file: !599, line: 342, baseType: !51, size: 32, offset: 2048)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !598, file: !599, line: 342, baseType: !51, size: 32, offset: 2080)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !598, file: !599, line: 343, baseType: !51, size: 32, offset: 2112)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !598, file: !599, line: 345, baseType: !51, size: 32, offset: 2144)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !598, file: !599, line: 346, baseType: !51, size: 32, offset: 2176)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !598, file: !599, line: 347, baseType: !330, size: 16, offset: 2208)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !598, file: !599, line: 348, baseType: !330, size: 16, offset: 2224)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !598, file: !599, line: 349, baseType: !51, size: 32, offset: 2240)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !598, file: !599, line: 351, baseType: !51, size: 32, offset: 2272)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !598, file: !599, line: 353, baseType: !330, size: 16, offset: 2304)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !598, file: !599, line: 354, baseType: !330, size: 16, offset: 2320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !598, file: !599, line: 355, baseType: !51, size: 32, offset: 2336)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !598, file: !599, line: 357, baseType: !414, size: 128, offset: 2368)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !598, file: !599, line: 363, baseType: !356, size: 128, offset: 2496)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !598, file: !599, line: 363, baseType: !356, size: 128, offset: 2624)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !598, file: !599, line: 368, baseType: !633, size: 64, offset: 2752)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !599, line: 48, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !598, file: !599, line: 372, baseType: !636, size: 32, offset: 2816)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !599, line: 274, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !599, line: 271, size: 32, elements: !638)
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !637, file: !599, line: 273, baseType: !5, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !598, file: !599, line: 373, baseType: !51, size: 32, offset: 2848)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !598, file: !599, line: 382, baseType: !642, size: 64, offset: 2880)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !599, line: 46, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !598, file: !599, line: 385, baseType: !645, size: 64, offset: 2944)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !296, !366}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !598, file: !599, line: 386, baseType: !649, size: 64, offset: 3008)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !296, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !598, file: !599, line: 387, baseType: !654, size: 64, offset: 3072)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!51, !296}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !598, file: !599, line: 388, baseType: !658, size: 64, offset: 3136)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !296}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !598, file: !599, line: 389, baseType: !296, size: 64, offset: 3200)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !598, file: !599, line: 389, baseType: !296, size: 64, offset: 3264)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !598, file: !599, line: 389, baseType: !296, size: 64, offset: 3328)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !598, file: !599, line: 389, baseType: !296, size: 64, offset: 3392)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !485, file: !486, line: 1244, baseType: !666, size: 64, offset: 2048)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !668, line: 200, size: 17024, elements: !669)
!668 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!669 = !{!670, !672, !673, !674, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !667, file: !668, line: 201, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !667, file: !668, line: 202, baseType: !356, size: 128, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !667, file: !668, line: 203, baseType: !356, size: 128, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !667, file: !668, line: 206, baseType: !675, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !668, line: 190, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !668, line: 126, size: 2816, elements: !678)
!678 = !{!679, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !778, !781, !782, !783, !1065, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1093}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !677, file: !668, line: 127, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !677, file: !668, line: 127, baseType: !680, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !677, file: !668, line: 128, baseType: !296, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !677, file: !668, line: 129, baseType: !296, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !677, file: !668, line: 130, baseType: !346, size: 512, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !677, file: !668, line: 132, baseType: !51, size: 32, offset: 768)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !668, line: 132, baseType: !51, size: 32, offset: 800)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !677, file: !668, line: 133, baseType: !51, size: 32, offset: 832)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !677, file: !668, line: 134, baseType: !51, size: 32, offset: 864)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !677, file: !668, line: 134, baseType: !51, size: 32, offset: 896)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !677, file: !668, line: 134, baseType: !51, size: 32, offset: 928)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !677, file: !668, line: 135, baseType: !51, size: 32, offset: 960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !677, file: !668, line: 135, baseType: !51, size: 32, offset: 992)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !677, file: !668, line: 136, baseType: !51, size: 32, offset: 1024)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !677, file: !668, line: 136, baseType: !51, size: 32, offset: 1056)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !677, file: !668, line: 137, baseType: !51, size: 32, offset: 1088)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !677, file: !668, line: 137, baseType: !51, size: 32, offset: 1120)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !677, file: !668, line: 138, baseType: !366, size: 32, offset: 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !677, file: !668, line: 139, baseType: !366, size: 32, offset: 1184)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !677, file: !668, line: 139, baseType: !366, size: 32, offset: 1216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !677, file: !668, line: 141, baseType: !330, size: 16, offset: 1248)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !677, file: !668, line: 142, baseType: !330, size: 16, offset: 1264)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !677, file: !668, line: 143, baseType: !51, size: 32, offset: 1280)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !677, file: !668, line: 144, baseType: !51, size: 32, offset: 1312)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !677, file: !668, line: 146, baseType: !705, size: 64, offset: 1344)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !668, line: 114, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !668, line: 99, size: 7232, elements: !708)
!708 = !{!709, !711, !712, !713, !714, !715, !716, !727, !731, !746, !755, !762, !772}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !668, line: 100, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !707, file: !668, line: 100, baseType: !710, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !707, file: !668, line: 101, baseType: !51, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !707, file: !668, line: 101, baseType: !51, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !707, file: !668, line: 102, baseType: !51, size: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !707, file: !668, line: 102, baseType: !51, size: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !707, file: !668, line: 103, baseType: !717, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !668, line: 59, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !668, line: 56, size: 2112, elements: !720)
!720 = !{!721, !725, !726}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !719, file: !668, line: 57, baseType: !722, size: 2048)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 2048, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !719, file: !668, line: 58, baseType: !51, size: 32, offset: 2048)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !719, file: !668, line: 58, baseType: !51, size: 32, offset: 2080)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !707, file: !668, line: 106, baseType: !728, size: 6144, offset: 320)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 6144, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 768)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !707, file: !668, line: 107, baseType: !732, size: 64, offset: 6464)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !668, line: 97, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !668, line: 83, size: 8320, elements: !735)
!735 = !{!736, !737, !738, !742, !743, !744, !745}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !734, file: !668, line: 84, baseType: !728, size: 6144)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !734, file: !668, line: 87, baseType: !722, size: 2048, offset: 6144)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !734, file: !668, line: 88, baseType: !739, size: 64, offset: 8192)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !741, line: 41, flags: DIFlagFwdDecl)
!741 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !734, file: !668, line: 90, baseType: !330, size: 16, offset: 8256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !734, file: !668, line: 92, baseType: !330, size: 16, offset: 8272)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !734, file: !668, line: 93, baseType: !330, size: 16, offset: 8288)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !734, file: !668, line: 95, baseType: !330, size: 16, offset: 8304)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !707, file: !668, line: 108, baseType: !747, size: 64, offset: 6528)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !668, line: 66, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !668, line: 61, size: 128, elements: !750)
!750 = !{!751, !752, !753, !754}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !749, file: !668, line: 62, baseType: !51, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !749, file: !668, line: 63, baseType: !51, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !749, file: !668, line: 64, baseType: !51, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !749, file: !668, line: 65, baseType: !51, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !707, file: !668, line: 109, baseType: !756, size: 64, offset: 6592)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !668, line: 71, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !668, line: 68, size: 64, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !758, file: !668, line: 69, baseType: !51, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !758, file: !668, line: 70, baseType: !51, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !707, file: !668, line: 110, baseType: !763, size: 64, offset: 6656)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !668, line: 81, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !668, line: 73, size: 352, elements: !766)
!766 = !{!767, !768, !769, !770, !771}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !765, file: !668, line: 74, baseType: !581, size: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !765, file: !668, line: 75, baseType: !581, size: 96, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !765, file: !668, line: 76, baseType: !581, size: 96, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !765, file: !668, line: 77, baseType: !51, size: 32, offset: 288)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !765, file: !668, line: 78, baseType: !51, size: 32, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !707, file: !668, line: 113, baseType: !773, size: 512, offset: 6720)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !774, line: 182, baseType: !775)
!774 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !774, line: 180, size: 512, elements: !776)
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !775, file: !774, line: 181, baseType: !346, size: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !677, file: !668, line: 148, baseType: !779, size: 64, offset: 1408)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !561, line: 46, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !677, file: !668, line: 151, baseType: !484, size: 64, offset: 1472)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !677, file: !668, line: 152, baseType: !559, size: 64, offset: 1536)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !677, file: !668, line: 153, baseType: !784, size: 64, offset: 1600)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !786, line: 64, size: 19136, elements: !787)
!786 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!787 = !{!788, !789, !790, !791, !792, !793, !795, !796, !797, !798, !801, !802, !1051, !1052, !1060, !1061, !1062, !1063, !1064}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !785, file: !786, line: 65, baseType: !298, size: 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !785, file: !786, line: 66, baseType: !490, size: 64, offset: 960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !786, line: 68, baseType: !316, size: 8192, offset: 1024)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !785, file: !786, line: 70, baseType: !51, size: 32, offset: 9216)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !785, file: !786, line: 71, baseType: !51, size: 32, offset: 9248)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !785, file: !786, line: 72, baseType: !794, size: 64, offset: 9280)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !435)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !785, file: !786, line: 74, baseType: !366, size: 32, offset: 9344)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !785, file: !786, line: 74, baseType: !366, size: 32, offset: 9376)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !785, file: !786, line: 76, baseType: !739, size: 64, offset: 9408)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !785, file: !786, line: 77, baseType: !799, size: 64, offset: 9472)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !786, line: 77, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !785, file: !786, line: 78, baseType: !612, size: 64, offset: 9536)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !785, file: !786, line: 80, baseType: !803, size: 2624, offset: 9600)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !804, line: 340, size: 2624, elements: !805)
!804 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!805 = !{!806, !834, !852, !853, !854, !872, !930, !931, !1031, !1032, !1033, !1034, !1040}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !803, file: !804, line: 341, baseType: !807, size: 576)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !804, line: 251, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !804, line: 207, size: 576, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !808, file: !804, line: 208, baseType: !51, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !808, file: !804, line: 211, baseType: !330, size: 16, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !808, file: !804, line: 212, baseType: !330, size: 16, offset: 48)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !808, file: !804, line: 213, baseType: !366, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !808, file: !804, line: 214, baseType: !330, size: 16, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !808, file: !804, line: 215, baseType: !330, size: 16, offset: 112)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !808, file: !804, line: 216, baseType: !330, size: 16, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !808, file: !804, line: 217, baseType: !330, size: 16, offset: 144)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !808, file: !804, line: 218, baseType: !330, size: 16, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !808, file: !804, line: 219, baseType: !330, size: 16, offset: 176)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !808, file: !804, line: 220, baseType: !366, size: 32, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !808, file: !804, line: 222, baseType: !330, size: 16, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !808, file: !804, line: 225, baseType: !330, size: 16, offset: 240)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !808, file: !804, line: 228, baseType: !51, size: 32, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !808, file: !804, line: 229, baseType: !51, size: 32, offset: 288)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !808, file: !804, line: 233, baseType: !51, size: 32, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !808, file: !804, line: 236, baseType: !330, size: 16, offset: 352)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !808, file: !804, line: 236, baseType: !330, size: 16, offset: 368)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !808, file: !804, line: 241, baseType: !366, size: 32, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !808, file: !804, line: 244, baseType: !51, size: 32, offset: 416)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !808, file: !804, line: 244, baseType: !51, size: 32, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !808, file: !804, line: 245, baseType: !366, size: 32, offset: 480)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !808, file: !804, line: 248, baseType: !366, size: 32, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !808, file: !804, line: 250, baseType: !51, size: 32, offset: 544)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !803, file: !804, line: 342, baseType: !835, size: 448, offset: 576)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !804, line: 79, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !804, line: 61, size: 448, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !836, file: !804, line: 62, baseType: !296, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !836, file: !804, line: 64, baseType: !330, size: 16, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !836, file: !804, line: 65, baseType: !330, size: 16, offset: 80)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !836, file: !804, line: 67, baseType: !366, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !836, file: !804, line: 68, baseType: !366, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !836, file: !804, line: 69, baseType: !366, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !836, file: !804, line: 70, baseType: !330, size: 16, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !836, file: !804, line: 71, baseType: !330, size: 16, offset: 208)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !836, file: !804, line: 72, baseType: !434, size: 64, offset: 224)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !836, file: !804, line: 75, baseType: !366, size: 32, offset: 288)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !836, file: !804, line: 75, baseType: !366, size: 32, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !836, file: !804, line: 75, baseType: !366, size: 32, offset: 352)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !836, file: !804, line: 78, baseType: !366, size: 32, offset: 384)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !836, file: !804, line: 78, baseType: !366, size: 32, offset: 416)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !803, file: !804, line: 343, baseType: !356, size: 128, offset: 1024)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !803, file: !804, line: 344, baseType: !356, size: 128, offset: 1152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !803, file: !804, line: 345, baseType: !855, size: 192, offset: 1280)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !804, line: 278, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !804, line: 270, size: 192, elements: !857)
!857 = !{!858, !859, !860, !861, !862}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !856, file: !804, line: 271, baseType: !51, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !856, file: !804, line: 273, baseType: !366, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !856, file: !804, line: 275, baseType: !51, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !856, file: !804, line: 276, baseType: !51, size: 32, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !856, file: !804, line: 277, baseType: !863, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !804, line: 55, size: 576, elements: !865)
!865 = !{!866, !867, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !864, file: !804, line: 56, baseType: !51, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !864, file: !804, line: 57, baseType: !366, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !864, file: !804, line: 58, baseType: !869, size: 512, offset: 64)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 512, elements: !870)
!870 = !{!871, !871}
!871 = !DISubrange(count: 4)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !803, file: !804, line: 346, baseType: !873, size: 384, offset: 1472)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !804, line: 268, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !804, line: 253, size: 384, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !924, !925, !926, !927, !928, !929}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !874, file: !804, line: 254, baseType: !51, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !874, file: !804, line: 255, baseType: !51, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !874, file: !804, line: 255, baseType: !51, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !874, file: !804, line: 258, baseType: !366, size: 32, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !874, file: !804, line: 259, baseType: !881, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !804, line: 164, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !804, line: 108, size: 1664, elements: !884)
!884 = !{!885, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !883, file: !804, line: 109, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !883, file: !804, line: 109, baseType: !886, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !883, file: !804, line: 111, baseType: !346, size: 512, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !883, file: !804, line: 119, baseType: !434, size: 64, offset: 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !883, file: !804, line: 119, baseType: !434, size: 64, offset: 704)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !883, file: !804, line: 125, baseType: !434, size: 64, offset: 768)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !883, file: !804, line: 125, baseType: !434, size: 64, offset: 832)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !883, file: !804, line: 127, baseType: !434, size: 64, offset: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !883, file: !804, line: 130, baseType: !51, size: 32, offset: 960)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !883, file: !804, line: 131, baseType: !51, size: 32, offset: 992)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !883, file: !804, line: 132, baseType: !897, size: 64, offset: 1024)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !804, line: 106, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !804, line: 81, size: 512, elements: !900)
!900 = !{!901, !902, !905, !906, !907, !908}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !899, file: !804, line: 82, baseType: !434, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !899, file: !804, line: 97, baseType: !903, size: 256, offset: 64)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 256, elements: !904)
!904 = !{!871, !436}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !899, file: !804, line: 102, baseType: !434, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !899, file: !804, line: 102, baseType: !434, size: 64, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !899, file: !804, line: 104, baseType: !51, size: 32, offset: 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !899, file: !804, line: 105, baseType: !51, size: 32, offset: 480)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !883, file: !804, line: 135, baseType: !581, size: 96, offset: 1088)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !883, file: !804, line: 136, baseType: !366, size: 32, offset: 1184)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !883, file: !804, line: 139, baseType: !51, size: 32, offset: 1216)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !883, file: !804, line: 139, baseType: !51, size: 32, offset: 1248)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !883, file: !804, line: 139, baseType: !51, size: 32, offset: 1280)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !883, file: !804, line: 140, baseType: !581, size: 96, offset: 1312)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !883, file: !804, line: 143, baseType: !330, size: 16, offset: 1408)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !883, file: !804, line: 144, baseType: !330, size: 16, offset: 1424)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !883, file: !804, line: 145, baseType: !330, size: 16, offset: 1440)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !883, file: !804, line: 148, baseType: !330, size: 16, offset: 1456)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !883, file: !804, line: 149, baseType: !51, size: 32, offset: 1472)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !883, file: !804, line: 150, baseType: !366, size: 32, offset: 1504)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !883, file: !804, line: 152, baseType: !612, size: 64, offset: 1536)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !883, file: !804, line: 163, baseType: !366, size: 32, offset: 1600)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !883, file: !804, line: 163, baseType: !366, size: 32, offset: 1632)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !874, file: !804, line: 261, baseType: !366, size: 32, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !874, file: !804, line: 261, baseType: !366, size: 32, offset: 224)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !874, file: !804, line: 261, baseType: !366, size: 32, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !874, file: !804, line: 263, baseType: !51, size: 32, offset: 288)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !874, file: !804, line: 266, baseType: !51, size: 32, offset: 320)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !874, file: !804, line: 267, baseType: !366, size: 32, offset: 352)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !803, file: !804, line: 347, baseType: !881, size: 64, offset: 1856)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !803, file: !804, line: 348, baseType: !932, size: 64, offset: 1920)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !804, line: 205, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !804, line: 186, size: 1024, elements: !935)
!935 = !{!936, !938, !939, !940, !942, !943, !944, !952, !953, !954, !1029, !1030}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !934, file: !804, line: 187, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !934, file: !804, line: 187, baseType: !937, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !934, file: !804, line: 189, baseType: !346, size: 512, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !934, file: !804, line: 191, baseType: !941, size: 64, offset: 640)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !934, file: !804, line: 193, baseType: !51, size: 32, offset: 704)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !934, file: !804, line: 193, baseType: !51, size: 32, offset: 736)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !934, file: !804, line: 195, baseType: !945, size: 64, offset: 768)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !804, line: 184, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !804, line: 166, size: 320, elements: !948)
!948 = !{!949, !950, !951}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !947, file: !804, line: 180, baseType: !903, size: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !947, file: !804, line: 182, baseType: !51, size: 32, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !947, file: !804, line: 183, baseType: !51, size: 32, offset: 288)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !934, file: !804, line: 196, baseType: !51, size: 32, offset: 832)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !934, file: !804, line: 198, baseType: !51, size: 32, offset: 864)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !934, file: !804, line: 200, baseType: !955, size: 64, offset: 896)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !741, line: 77, size: 15424, elements: !957)
!957 = !{!958, !959, !960, !963, !966, !967, !970, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !988, !989, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1015, !1016, !1017, !1018, !1019, !1023}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !956, file: !741, line: 78, baseType: !298, size: 960)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !956, file: !741, line: 80, baseType: !316, size: 8192, offset: 960)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !956, file: !741, line: 82, baseType: !961, size: 64, offset: 9152)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !741, line: 43, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !956, file: !741, line: 83, baseType: !964, size: 64, offset: 9216)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !299, line: 46, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !956, file: !741, line: 86, baseType: !739, size: 64, offset: 9280)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !956, file: !741, line: 87, baseType: !968, size: 64, offset: 9344)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !741, line: 44, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !956, file: !741, line: 89, baseType: !971, size: 512, offset: 9408)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 512, elements: !379)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !956, file: !741, line: 90, baseType: !330, size: 16, offset: 9920)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !956, file: !741, line: 90, baseType: !330, size: 16, offset: 9936)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !956, file: !741, line: 92, baseType: !330, size: 16, offset: 9952)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !956, file: !741, line: 92, baseType: !330, size: 16, offset: 9968)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !956, file: !741, line: 93, baseType: !330, size: 16, offset: 9984)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !956, file: !741, line: 93, baseType: !330, size: 16, offset: 10000)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !956, file: !741, line: 94, baseType: !51, size: 32, offset: 10016)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !956, file: !741, line: 97, baseType: !330, size: 16, offset: 10048)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !956, file: !741, line: 97, baseType: !330, size: 16, offset: 10064)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !956, file: !741, line: 98, baseType: !330, size: 16, offset: 10080)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !956, file: !741, line: 98, baseType: !330, size: 16, offset: 10096)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !956, file: !741, line: 99, baseType: !330, size: 16, offset: 10112)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !956, file: !741, line: 99, baseType: !330, size: 16, offset: 10128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !956, file: !741, line: 100, baseType: !5, size: 32, offset: 10144)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !956, file: !741, line: 101, baseType: !987, size: 64, offset: 10176)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !956, file: !741, line: 103, baseType: !323, size: 64, offset: 10240)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !956, file: !741, line: 104, baseType: !990, size: 64, offset: 10304)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !299, line: 159, size: 448, elements: !992)
!992 = !{!993, !995, !996, !998, !999, !1001}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !991, file: !299, line: 161, baseType: !994, size: 64)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !435)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !991, file: !299, line: 162, baseType: !994, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !991, file: !299, line: 163, baseType: !997, size: 32, offset: 128)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 32, elements: !435)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !991, file: !299, line: 164, baseType: !997, size: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !991, file: !299, line: 165, baseType: !1000, size: 128, offset: 192)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 128, elements: !435)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !991, file: !299, line: 166, baseType: !1002, size: 128, offset: 320)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 128, elements: !435)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !956, file: !741, line: 107, baseType: !366, size: 32, offset: 10368)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !956, file: !741, line: 108, baseType: !51, size: 32, offset: 10400)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !956, file: !741, line: 109, baseType: !330, size: 16, offset: 10432)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !956, file: !741, line: 110, baseType: !330, size: 16, offset: 10448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !956, file: !741, line: 113, baseType: !51, size: 32, offset: 10464)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !956, file: !741, line: 113, baseType: !51, size: 32, offset: 10496)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !956, file: !741, line: 114, baseType: !317, size: 8, offset: 10528)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !956, file: !741, line: 114, baseType: !317, size: 8, offset: 10536)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !956, file: !741, line: 115, baseType: !330, size: 16, offset: 10544)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !956, file: !741, line: 116, baseType: !1013, size: 128, offset: 10560)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 128, elements: !1014)
!1014 = !{!871}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !956, file: !741, line: 119, baseType: !366, size: 32, offset: 10688)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !956, file: !741, line: 119, baseType: !366, size: 32, offset: 10720)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !956, file: !741, line: 122, baseType: !773, size: 512, offset: 10752)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !956, file: !741, line: 123, baseType: !317, size: 8, offset: 11264)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !956, file: !741, line: 125, baseType: !1020, size: 56, offset: 11272)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 56, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 7)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !956, file: !741, line: 126, baseType: !1024, size: 4096, offset: 11328)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 4096, elements: !379)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !741, line: 69, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !741, line: 67, size: 512, elements: !1027)
!1027 = !{!1028}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1026, file: !741, line: 68, baseType: !346, size: 512)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !934, file: !804, line: 201, baseType: !366, size: 32, offset: 960)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !934, file: !804, line: 204, baseType: !51, size: 32, offset: 992)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !803, file: !804, line: 350, baseType: !356, size: 128, offset: 1984)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !803, file: !804, line: 351, baseType: !51, size: 32, offset: 2112)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !803, file: !804, line: 351, baseType: !51, size: 32, offset: 2144)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !803, file: !804, line: 353, baseType: !1035, size: 64, offset: 2176)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !804, line: 297, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !804, line: 295, size: 2048, elements: !1038)
!1038 = !{!1039}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1037, file: !804, line: 296, baseType: !722, size: 2048)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !803, file: !804, line: 355, baseType: !1041, size: 384, offset: 2240)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !804, line: 338, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !804, line: 322, size: 384, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1042, file: !804, line: 323, baseType: !51, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1042, file: !804, line: 325, baseType: !330, size: 16, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1042, file: !804, line: 326, baseType: !330, size: 16, offset: 48)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1042, file: !804, line: 331, baseType: !356, size: 128, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1042, file: !804, line: 334, baseType: !356, size: 128, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1042, file: !804, line: 335, baseType: !51, size: 32, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1042, file: !804, line: 337, baseType: !51, size: 32, offset: 352)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !785, file: !786, line: 81, baseType: !296, size: 64, offset: 12224)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !785, file: !786, line: 85, baseType: !1053, size: 6208, offset: 12288)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !786, line: 55, size: 6208, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1053, file: !786, line: 56, baseType: !728, size: 6144)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1053, file: !786, line: 58, baseType: !330, size: 16, offset: 6144)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1053, file: !786, line: 59, baseType: !330, size: 16, offset: 6160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1053, file: !786, line: 60, baseType: !330, size: 16, offset: 6176)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1053, file: !786, line: 61, baseType: !330, size: 16, offset: 6192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !785, file: !786, line: 86, baseType: !51, size: 32, offset: 18496)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !785, file: !786, line: 88, baseType: !51, size: 32, offset: 18528)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !785, file: !786, line: 90, baseType: !51, size: 32, offset: 18560)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !785, file: !786, line: 94, baseType: !51, size: 32, offset: 18592)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !785, file: !786, line: 100, baseType: !773, size: 512, offset: 18624)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !677, file: !668, line: 154, baseType: !1066, size: 64, offset: 1664)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1068, line: 264, flags: DIFlagFwdDecl)
!1068 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !677, file: !668, line: 156, baseType: !739, size: 64, offset: 1728)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !677, file: !668, line: 158, baseType: !366, size: 32, offset: 1792)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !677, file: !668, line: 159, baseType: !366, size: 32, offset: 1824)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !677, file: !668, line: 162, baseType: !680, size: 64, offset: 1856)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !677, file: !668, line: 162, baseType: !680, size: 64, offset: 1920)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !677, file: !668, line: 162, baseType: !680, size: 64, offset: 1984)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !677, file: !668, line: 164, baseType: !356, size: 128, offset: 2048)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !677, file: !668, line: 166, baseType: !1077, size: 64, offset: 2176)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !668, line: 51, flags: DIFlagFwdDecl)
