; ModuleID = 'zlib/infback.c'
source_filename = "zlib/infback.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.code = type { i8, i8, i16 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque
%struct.inflate_state = type { i32, i32, i32, i32, i32, i32, i64, i64, %struct.gz_header_s*, i32, i32, i32, i32, i8*, i64, i32, i32, i32, i32, %struct.code*, %struct.code*, i32, i32, i32, i32, i32, i32, %struct.code*, [320 x i16], [288 x i16], [1444 x %struct.code], i32, i32, i32 }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }

@.str = private unnamed_addr constant [6 x i8] c"1.2.6\00", align 1
@inflateBack.order = internal constant [19 x i16] [i16 16, i16 17, i16 18, i16 0, i16 8, i16 7, i16 9, i16 6, i16 10, i16 5, i16 11, i16 4, i16 12, i16 3, i16 13, i16 2, i16 14, i16 1, i16 15], align 16, !dbg !0
@.str.1 = private unnamed_addr constant [19 x i8] c"invalid block type\00", align 1
@.str.2 = private unnamed_addr constant [29 x i8] c"invalid stored block lengths\00", align 1
@.str.3 = private unnamed_addr constant [36 x i8] c"too many length or distance symbols\00", align 1
@.str.4 = private unnamed_addr constant [25 x i8] c"invalid code lengths set\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "order", scope: !2, file: !3, line: 269, type: !195, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "inflateBack", scope: !3, file: !3, line: 250, type: !4, scopeLine: 256, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !185)
!3 = !DIFile(filename: "zlib/infback.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !50, !40, !56, !40}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !8, line: 106, baseType: !9)
!8 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !8, line: 104, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !8, line: 85, size: 896, elements: !12)
!12 = !{!13, !19, !22, !25, !26, !27, !28, !31, !34, !41, !46, !47, !48, !49}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !11, file: !8, line: 86, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !16, line: 374, baseType: !17)
!16 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !16, line: 365, baseType: !18)
!18 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !11, file: !8, line: 87, baseType: !20, size: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !16, line: 367, baseType: !21)
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !11, file: !8, line: 88, baseType: !23, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !16, line: 368, baseType: !24)
!24 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !11, file: !8, line: 90, baseType: !14, size: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !11, file: !8, line: 91, baseType: !20, size: 32, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !11, file: !8, line: 92, baseType: !23, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !11, file: !8, line: 94, baseType: !29, size: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !11, file: !8, line: 95, baseType: !32, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !8, line: 83, flags: DIFlagFwdDecl)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !11, file: !8, line: 97, baseType: !35, size: 64, offset: 512)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !8, line: 80, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !39, !20, !20}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !16, line: 383, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !11, file: !8, line: 98, baseType: !42, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !8, line: 81, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !39, !39}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !11, file: !8, line: 99, baseType: !39, size: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !11, file: !8, line: 101, baseType: !6, size: 32, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !11, file: !8, line: 102, baseType: !23, size: 64, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !11, file: !8, line: 103, baseType: !23, size: 64, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_func", file: !8, line: 1007, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!21, !40, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_func", file: !8, line: 1008, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!6, !40, !55, !21}
!60 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !103, globals: !179, splitDebugInlining: false, nameTableKind: None)
!61 = !{!62, !97}
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 20, baseType: !21, size: 32, elements: !64)
!63 = !DIFile(filename: "zlib/inflate.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!65 = !DIEnumerator(name: "HEAD", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "FLAGS", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "TIME", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "OS", value: 3, isUnsigned: true)
!69 = !DIEnumerator(name: "EXLEN", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "EXTRA", value: 5, isUnsigned: true)
!71 = !DIEnumerator(name: "NAME", value: 6, isUnsigned: true)
!72 = !DIEnumerator(name: "COMMENT", value: 7, isUnsigned: true)
!73 = !DIEnumerator(name: "HCRC", value: 8, isUnsigned: true)
!74 = !DIEnumerator(name: "DICTID", value: 9, isUnsigned: true)
!75 = !DIEnumerator(name: "DICT", value: 10, isUnsigned: true)
!76 = !DIEnumerator(name: "TYPE", value: 11, isUnsigned: true)
!77 = !DIEnumerator(name: "TYPEDO", value: 12, isUnsigned: true)
!78 = !DIEnumerator(name: "STORED", value: 13, isUnsigned: true)
!79 = !DIEnumerator(name: "COPY_", value: 14, isUnsigned: true)
!80 = !DIEnumerator(name: "COPY", value: 15, isUnsigned: true)
!81 = !DIEnumerator(name: "TABLE", value: 16, isUnsigned: true)
!82 = !DIEnumerator(name: "LENLENS", value: 17, isUnsigned: true)
!83 = !DIEnumerator(name: "CODELENS", value: 18, isUnsigned: true)
!84 = !DIEnumerator(name: "LEN_", value: 19, isUnsigned: true)
!85 = !DIEnumerator(name: "LEN", value: 20, isUnsigned: true)
!86 = !DIEnumerator(name: "LENEXT", value: 21, isUnsigned: true)
!87 = !DIEnumerator(name: "DIST", value: 22, isUnsigned: true)
!88 = !DIEnumerator(name: "DISTEXT", value: 23, isUnsigned: true)
!89 = !DIEnumerator(name: "MATCH", value: 24, isUnsigned: true)
!90 = !DIEnumerator(name: "LIT", value: 25, isUnsigned: true)
!91 = !DIEnumerator(name: "CHECK", value: 26, isUnsigned: true)
!92 = !DIEnumerator(name: "LENGTH", value: 27, isUnsigned: true)
!93 = !DIEnumerator(name: "DONE", value: 28, isUnsigned: true)
!94 = !DIEnumerator(name: "BAD", value: 29, isUnsigned: true)
!95 = !DIEnumerator(name: "MEM", value: 30, isUnsigned: true)
!96 = !DIEnumerator(name: "SYNC", value: 31, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 54, baseType: !21, size: 32, elements: !99)
!98 = !DIFile(filename: "zlib/inftrees.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!99 = !{!100, !101, !102}
!100 = !DIEnumerator(name: "CODES", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "LENS", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "DISTS", value: 2, isUnsigned: true)
!103 = !{!6, !35, !39, !42, !104, !32, !21, !24, !29, !154, !146, !18}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inflate_state", file: !63, line: 81, size: 57216, elements: !106)
!106 = !{!107, !109, !110, !111, !112, !113, !114, !115, !116, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !155, !156, !157, !158, !159, !160, !161, !162, !164, !168, !172, !176, !177, !178}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !105, file: !63, line: 82, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "inflate_mode", file: !63, line: 53, baseType: !62)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !105, file: !63, line: 83, baseType: !6, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !105, file: !63, line: 84, baseType: !6, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "havedict", scope: !105, file: !63, line: 85, baseType: !6, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !63, line: 86, baseType: !6, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !105, file: !63, line: 87, baseType: !21, size: 32, offset: 160)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !105, file: !63, line: 88, baseType: !24, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !105, file: !63, line: 89, baseType: !24, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !105, file: !63, line: 90, baseType: !117, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !8, line: 129, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !8, line: 127, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !8, line: 112, size: 640, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !120, file: !8, line: 113, baseType: !6, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !120, file: !8, line: 114, baseType: !23, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !120, file: !8, line: 115, baseType: !6, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !120, file: !8, line: 116, baseType: !6, size: 32, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !120, file: !8, line: 117, baseType: !14, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !120, file: !8, line: 118, baseType: !20, size: 32, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !120, file: !8, line: 119, baseType: !20, size: 32, offset: 288)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !8, line: 120, baseType: !14, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !120, file: !8, line: 121, baseType: !20, size: 32, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !120, file: !8, line: 122, baseType: !14, size: 64, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !120, file: !8, line: 123, baseType: !20, size: 32, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !120, file: !8, line: 124, baseType: !6, size: 32, offset: 544)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !120, file: !8, line: 125, baseType: !6, size: 32, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "wbits", scope: !105, file: !63, line: 92, baseType: !21, size: 32, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "wsize", scope: !105, file: !63, line: 93, baseType: !21, size: 32, offset: 416)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "whave", scope: !105, file: !63, line: 94, baseType: !21, size: 32, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "wnext", scope: !105, file: !63, line: 95, baseType: !21, size: 32, offset: 480)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !105, file: !63, line: 96, baseType: !55, size: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "hold", scope: !105, file: !63, line: 98, baseType: !24, size: 64, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !105, file: !63, line: 99, baseType: !21, size: 32, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !105, file: !63, line: 101, baseType: !21, size: 32, offset: 672)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !105, file: !63, line: 102, baseType: !21, size: 32, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !105, file: !63, line: 104, baseType: !21, size: 32, offset: 736)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lencode", scope: !105, file: !63, line: 106, baseType: !146, size: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "code", file: !98, line: 28, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 24, size: 32, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !149, file: !98, line: 25, baseType: !18, size: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !149, file: !98, line: 26, baseType: !18, size: 8, offset: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !149, file: !98, line: 27, baseType: !154, size: 16, offset: 16)
!154 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "distcode", scope: !105, file: !63, line: 107, baseType: !146, size: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "lenbits", scope: !105, file: !63, line: 108, baseType: !21, size: 32, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "distbits", scope: !105, file: !63, line: 109, baseType: !21, size: 32, offset: 928)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ncode", scope: !105, file: !63, line: 111, baseType: !21, size: 32, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nlen", scope: !105, file: !63, line: 112, baseType: !21, size: 32, offset: 992)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ndist", scope: !105, file: !63, line: 113, baseType: !21, size: 32, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !105, file: !63, line: 114, baseType: !21, size: 32, offset: 1056)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !63, line: 115, baseType: !163, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !105, file: !63, line: 116, baseType: !165, size: 5120, offset: 1152)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 5120, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !105, file: !63, line: 117, baseType: !169, size: 4608, offset: 6272)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 4608, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "codes", scope: !105, file: !63, line: 118, baseType: !173, size: 46208, offset: 10880)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 46208, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 1444)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sane", scope: !105, file: !63, line: 119, baseType: !6, size: 32, offset: 57088)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !105, file: !63, line: 120, baseType: !6, size: 32, offset: 57120)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "was", scope: !105, file: !63, line: 121, baseType: !21, size: 32, offset: 57152)
!179 = !{!0, !180, !190}
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "lenfix", scope: !182, file: !186, line: 10, type: !187, isLocal: true, isDefinition: true)
!182 = distinct !DISubprogram(name: "fixedtables", scope: !3, file: !3, line: 82, type: !183, scopeLine: 84, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !60, retainedNodes: !185)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !104}
!185 = !{}
!186 = !DIFile(filename: "zlib/inffixed.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 16384, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 512)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "distfix", scope: !182, file: !186, line: 87, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 1024, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 32)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 304, elements: !197)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!197 = !{!198}
!198 = !DISubrange(count: 19)
!199 = !{i32 7, !"Dwarf Version", i32 4}
!200 = !{i32 2, !"Debug Info Version", i32 3}
!201 = !{i32 1, !"wchar_size", i32 4}
!202 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!203 = distinct !DISubprogram(name: "inflateBackInit_", scope: !3, file: !3, line: 28, type: !204, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !185)
!204 = !DISubroutineType(types: !205)
!205 = !{!6, !7, !6, !55, !206, !6}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!208 = !DILocalVariable(name: "strm", arg: 1, scope: !203, file: !3, line: 29, type: !7)
!209 = !DILocation(line: 29, column: 11, scope: !203)
!210 = !DILocalVariable(name: "windowBits", arg: 2, scope: !203, file: !3, line: 30, type: !6)
!211 = !DILocation(line: 30, column: 5, scope: !203)
!212 = !DILocalVariable(name: "window", arg: 3, scope: !203, file: !3, line: 31, type: !55)
!213 = !DILocation(line: 31, column: 20, scope: !203)
!214 = !DILocalVariable(name: "version", arg: 4, scope: !203, file: !3, line: 32, type: !206)
!215 = !DILocation(line: 32, column: 13, scope: !203)
!216 = !DILocalVariable(name: "stream_size", arg: 5, scope: !203, file: !3, line: 33, type: !6)
!217 = !DILocation(line: 33, column: 5, scope: !203)
!218 = !DILocalVariable(name: "state", scope: !203, file: !3, line: 35, type: !104)
!219 = !DILocation(line: 35, column: 31, scope: !203)
!220 = !DILocation(line: 37, column: 9, scope: !221)
!221 = distinct !DILexicalBlock(scope: !203, file: !3, line: 37, column: 9)
!222 = !DILocation(line: 37, column: 17, scope: !221)
!223 = !DILocation(line: 37, column: 27, scope: !221)
!224 = !DILocation(line: 37, column: 30, scope: !221)
!225 = !DILocation(line: 37, column: 44, scope: !221)
!226 = !DILocation(line: 37, column: 41, scope: !221)
!227 = !DILocation(line: 37, column: 60, scope: !221)
!228 = !DILocation(line: 38, column: 9, scope: !221)
!229 = !DILocation(line: 38, column: 21, scope: !221)
!230 = !DILocation(line: 37, column: 9, scope: !203)
!231 = !DILocation(line: 39, column: 9, scope: !221)
!232 = !DILocation(line: 40, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !203, file: !3, line: 40, column: 9)
!234 = !DILocation(line: 40, column: 14, scope: !233)
!235 = !DILocation(line: 40, column: 24, scope: !233)
!236 = !DILocation(line: 40, column: 27, scope: !233)
!237 = !DILocation(line: 40, column: 34, scope: !233)
