; ModuleID = 'blender/source/blender/editors/space_view3d/view3d_ruler.c'
source_filename = "blender/source/blender/editors/space_view3d/view3d_ruler.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!238 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_BB", value: 1, isUnsigned: true)
!239 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_WIN", value: 2, isUnsigned: true)
!240 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_NEAR", value: 4, isUnsigned: true)
!241 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_ZERO", value: 8, isUnsigned: true)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !243, line: 787, baseType: !5, size: 32, elements: !244)
!243 = !DIFile(filename: "blender/source/blender/editors/include/UI_interface.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!244 = !{!245, !246, !247, !248, !249, !250}
!245 = !DIEnumerator(name: "UI_CNR_TOP_LEFT", value: 1, isUnsigned: true)
!246 = !DIEnumerator(name: "UI_CNR_TOP_RIGHT", value: 2, isUnsigned: true)
!247 = !DIEnumerator(name: "UI_CNR_BOTTOM_RIGHT", value: 4, isUnsigned: true)
!248 = !DIEnumerator(name: "UI_CNR_BOTTOM_LEFT", value: 8, isUnsigned: true)
!249 = !DIEnumerator(name: "UI_CNR_NONE", value: 0, isUnsigned: true)
!250 = !DIEnumerator(name: "UI_CNR_ALL", value: 15, isUnsigned: true)
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 176, baseType: !5, size: 32, elements: !252)
!252 = !{!253}
!253 = !DIEnumerator(name: "RULER_SNAP_OK", value: 1, isUnsigned: true)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 171, baseType: !5, size: 32, elements: !255)
!255 = !{!256, !257}
!256 = !DIEnumerator(name: "RULER_STATE_NORMAL", value: 0, isUnsigned: true)
!257 = !DIEnumerator(name: "RULER_STATE_DRAG", value: 1, isUnsigned: true)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !259, line: 64, baseType: !5, size: 32, elements: !260)
!259 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_unit.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!261 = !DIEnumerator(name: "B_UNIT_NONE", value: 0, isUnsigned: true)
!262 = !DIEnumerator(name: "B_UNIT_LENGTH", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "B_UNIT_AREA", value: 2, isUnsigned: true)
!264 = !DIEnumerator(name: "B_UNIT_VOLUME", value: 3, isUnsigned: true)
!265 = !DIEnumerator(name: "B_UNIT_MASS", value: 4, isUnsigned: true)
!266 = !DIEnumerator(name: "B_UNIT_ROTATION", value: 5, isUnsigned: true)
!267 = !DIEnumerator(name: "B_UNIT_TIME", value: 6, isUnsigned: true)
!268 = !DIEnumerator(name: "B_UNIT_VELOCITY", value: 7, isUnsigned: true)
!269 = !DIEnumerator(name: "B_UNIT_ACCELERATION", value: 8, isUnsigned: true)
!270 = !DIEnumerator(name: "B_UNIT_CAMERA", value: 9, isUnsigned: true)
!271 = !DIEnumerator(name: "B_UNIT_TYPE_TOT", value: 10, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !273, line: 432, baseType: !5, size: 32, elements: !274)
!273 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !{!275, !276, !277, !278, !279, !280, !281}
!275 = !DIEnumerator(name: "OB_BOUNDBOX", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "OB_WIRE", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "OB_SOLID", value: 3, isUnsigned: true)
!278 = !DIEnumerator(name: "OB_MATERIAL", value: 4, isUnsigned: true)
!279 = !DIEnumerator(name: "OB_TEXTURE", value: 5, isUnsigned: true)
!280 = !DIEnumerator(name: "OB_RENDER", value: 6, isUnsigned: true)
!281 = !DIEnumerator(name: "OB_PAINT", value: 100, isUnsigned: true)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SnapMode", file: !283, line: 172, baseType: !5, size: 32, elements: !284)
!283 = !DIFile(filename: "blender/source/blender/editors/include/ED_transform.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!284 = !{!285, !286, !287}
!285 = !DIEnumerator(name: "SNAP_ALL", value: 0, isUnsigned: true)
!286 = !DIEnumerator(name: "SNAP_NOT_SELECTED", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "SNAP_NOT_OBEDIT", value: 2, isUnsigned: true)
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!290 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!291 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!292 = !{i32 7, !"Dwarf Version", i32 4}
!293 = !{i32 2, !"Debug Info Version", i32 3}
!294 = !{i32 1, !"wchar_size", i32 4}
!295 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!296 = distinct !DISubprogram(name: "VIEW3D_OT_ruler", scope: !1, file: !1, line: 1044, type: !297, scopeLine: 1045, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2101)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !301, line: 568, baseType: !302)
!301 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !301, line: 508, size: 1536, elements: !303)
!303 = !{!304, !308, !309, !310, !311, !2027, !2031, !2037, !2041, !2042, !2046, !2047, !2048, !2049, !2053, !2054, !2069, !2070, !2074, !2100}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !301, line: 509, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !302, file: !301, line: 510, baseType: !305, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !302, file: !301, line: 511, baseType: !305, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !302, file: !301, line: 512, baseType: !305, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !302, file: !301, line: 518, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!315, !316, !319}
!315 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !318, line: 44, flags: DIFlagFwdDecl)
!318 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !26, line: 328, size: 1344, elements: !321)
!321 = !{!322, !323, !324, !328, !359, !361, !362, !363, !375, !2020, !2021, !2022, !2025, !2026}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !26, line: 329, baseType: !319, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !320, file: !26, line: 329, baseType: !319, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !320, file: !26, line: 332, baseType: !325, size: 512, offset: 128)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 512, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !320, file: !26, line: 333, baseType: !329, size: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !331, line: 75, baseType: !332)
!331 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !331, line: 62, size: 1024, elements: !333)
!333 = !{!334, !336, !337, !338, !339, !341, !342, !343, !357, !358}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !331, line: 63, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !332, file: !331, line: 63, baseType: !335, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !331, line: 64, baseType: !307, size: 8, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !332, file: !331, line: 64, baseType: !307, size: 8, offset: 136)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !331, line: 65, baseType: !340, size: 16, offset: 144)
!340 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !331, line: 66, baseType: !325, size: 512, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !332, file: !331, line: 67, baseType: !315, size: 32, offset: 672)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !332, file: !331, line: 69, baseType: !344, size: 256, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !331, line: 60, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !331, line: 48, size: 256, elements: !346)
!346 = !{!347, !348, !355, !356}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !345, file: !331, line: 49, baseType: !289, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !345, file: !331, line: 58, baseType: !349, size: 128, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !350, line: 71, baseType: !351)
!350 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !350, line: 69, size: 128, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !351, file: !350, line: 70, baseType: !289, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !351, file: !350, line: 70, baseType: !289, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !345, file: !331, line: 59, baseType: !315, size: 32, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !345, file: !331, line: 59, baseType: !315, size: 32, offset: 224)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !332, file: !331, line: 70, baseType: !315, size: 32, offset: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !332, file: !331, line: 74, baseType: !315, size: 32, offset: 992)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !26, line: 336, baseType: !360, size: 64, offset: 704)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !320, file: !26, line: 337, baseType: !289, size: 64, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !320, file: !26, line: 338, baseType: !289, size: 64, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !320, file: !26, line: 340, baseType: !364, size: 64, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !318, line: 55, size: 192, elements: !366)
!366 = !{!367, !371, !374}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !365, file: !318, line: 58, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !365, file: !318, line: 56, size: 64, elements: !369)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !368, file: !318, line: 57, baseType: !289, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !365, file: !318, line: 60, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !318, line: 41, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !365, file: !318, line: 61, baseType: !289, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !320, file: !26, line: 341, baseType: !376, size: 64, offset: 960)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !26, line: 106, size: 320, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !377, file: !26, line: 107, baseType: !349, size: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !377, file: !26, line: 108, baseType: !315, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !377, file: !26, line: 109, baseType: !315, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !377, file: !26, line: 110, baseType: !315, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !377, file: !26, line: 110, baseType: !315, size: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !377, file: !26, line: 111, baseType: !385, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !301, line: 490, size: 768, elements: !387)
!387 = !{!388, !389, !390, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !386, file: !301, line: 491, baseType: !385, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !386, file: !301, line: 491, baseType: !385, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !386, file: !301, line: 493, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !26, line: 169, size: 2048, elements: !393)
!393 = !{!394, !395, !396, !397, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1986, !1989, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !392, file: !26, line: 170, baseType: !391, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !392, file: !26, line: 170, baseType: !391, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !392, file: !26, line: 172, baseType: !289, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !392, file: !26, line: 174, baseType: !398, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !400, line: 49, size: 1984, elements: !401)
!400 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!401 = !{!402, !438, !439, !440, !441, !442, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !399, file: !400, line: 50, baseType: !403, size: 960)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !331, line: 130, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !331, line: 117, size: 960, elements: !405)
!405 = !{!406, !407, !408, !410, !429, !433, !434, !435, !436, !437}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !331, line: 118, baseType: !289, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !404, file: !331, line: 118, baseType: !289, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !404, file: !331, line: 119, baseType: !409, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !404, file: !331, line: 120, baseType: !411, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !331, line: 136, size: 17600, elements: !413)
!413 = !{!414, !415, !417, !420, !424, !425, !426}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !412, file: !331, line: 137, baseType: !403, size: 960)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !412, file: !331, line: 138, baseType: !416, size: 64, offset: 960)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !412, file: !331, line: 139, baseType: !418, size: 64, offset: 1024)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !331, line: 43, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !331, line: 140, baseType: !421, size: 8192, offset: 1088)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 8192, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 1024)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !412, file: !331, line: 141, baseType: !421, size: 8192, offset: 9280)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !412, file: !331, line: 148, baseType: !411, size: 64, offset: 17472)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !412, file: !331, line: 150, baseType: !427, size: 64, offset: 17536)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !331, line: 45, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !404, file: !331, line: 121, baseType: !430, size: 528, offset: 256)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 528, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 66)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !331, line: 126, baseType: !340, size: 16, offset: 784)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !404, file: !331, line: 127, baseType: !315, size: 32, offset: 800)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !404, file: !331, line: 128, baseType: !315, size: 32, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !404, file: !331, line: 128, baseType: !315, size: 32, offset: 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !404, file: !331, line: 129, baseType: !329, size: 64, offset: 896)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !399, file: !400, line: 52, baseType: !349, size: 128, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !399, file: !400, line: 53, baseType: !349, size: 128, offset: 1088)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !399, file: !400, line: 54, baseType: !349, size: 128, offset: 1216)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !399, file: !400, line: 55, baseType: !349, size: 128, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !399, file: !400, line: 57, baseType: !443, size: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !445, line: 1216, size: 39680, elements: !446)
!445 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!446 = !{!447, !448, !451, !751, !754, !755, !756, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !782, !853, !1281, !1496, !1499, !1787, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1809, !1810, !1811, !1812, !1813, !1821, !1888, !1895, !1896, !1903, !1904, !1905, !1906, !1907, !1908, !1909}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !444, file: !445, line: 1217, baseType: !403, size: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !444, file: !445, line: 1218, baseType: !449, size: 64, offset: 960)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !445, line: 58, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !444, file: !445, line: 1220, baseType: !452, size: 64, offset: 1024)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !273, line: 115, size: 11392, elements: !454)
!454 = !{!455, !456, !457, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !475, !486, !500, !501, !544, !545, !556, !557, !573, !574, !575, !576, !577, !578, !579, !583, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !599, !600, !601, !602, !603, !604, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !664, !665, !666, !667, !668, !669, !670, !671, !672, !675, !678, !682, !683, !684, !685, !686, !689, !692, !695, !696, !702, !703, !704, !705, !706, !707, !709, !712, !715, !719, !739, !740}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !453, file: !273, line: 116, baseType: !403, size: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !453, file: !273, line: 117, baseType: !449, size: 64, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !453, file: !273, line: 119, baseType: !458, size: 64, offset: 1024)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !273, line: 57, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !453, file: !273, line: 121, baseType: !340, size: 16, offset: 1088)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !453, file: !273, line: 121, baseType: !340, size: 16, offset: 1104)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !453, file: !273, line: 122, baseType: !315, size: 32, offset: 1120)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !453, file: !273, line: 122, baseType: !315, size: 32, offset: 1152)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !453, file: !273, line: 122, baseType: !315, size: 32, offset: 1184)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !453, file: !273, line: 123, baseType: !325, size: 512, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !453, file: !273, line: 124, baseType: !452, size: 64, offset: 1728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !453, file: !273, line: 124, baseType: !452, size: 64, offset: 1792)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !453, file: !273, line: 127, baseType: !452, size: 64, offset: 1856)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !453, file: !273, line: 127, baseType: !452, size: 64, offset: 1920)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !453, file: !273, line: 127, baseType: !452, size: 64, offset: 1984)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !453, file: !273, line: 128, baseType: !472, size: 64, offset: 2048)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !474, line: 46, flags: DIFlagFwdDecl)
!474 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !453, file: !273, line: 130, baseType: !476, size: 64, offset: 2112)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !273, line: 97, size: 832, elements: !478)
!478 = !{!479, !484, !485}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !477, file: !273, line: 98, baseType: !480, size: 768)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 768, elements: !481)
!481 = !{!482, !483}
!482 = !DISubrange(count: 8)
!483 = !DISubrange(count: 3)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !477, file: !273, line: 99, baseType: !315, size: 32, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !477, file: !273, line: 99, baseType: !315, size: 32, offset: 800)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !453, file: !273, line: 131, baseType: !487, size: 64, offset: 2176)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !489, line: 486, size: 1600, elements: !490)
!489 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !488, file: !489, line: 487, baseType: !403, size: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !488, file: !489, line: 489, baseType: !349, size: 128, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !488, file: !489, line: 490, baseType: !349, size: 128, offset: 1088)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !488, file: !489, line: 491, baseType: !349, size: 128, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !488, file: !489, line: 492, baseType: !349, size: 128, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !488, file: !489, line: 494, baseType: !315, size: 32, offset: 1472)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !488, file: !489, line: 495, baseType: !315, size: 32, offset: 1504)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !488, file: !489, line: 497, baseType: !315, size: 32, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !488, file: !489, line: 498, baseType: !315, size: 32, offset: 1568)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !453, file: !273, line: 132, baseType: !487, size: 64, offset: 2240)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !453, file: !273, line: 133, baseType: !502, size: 64, offset: 2304)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !489, line: 334, size: 1728, elements: !504)
!504 = !{!505, !506, !509, !510, !511, !512, !513, !514, !517, !518, !519, !520, !521, !522, !523, !543}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !503, file: !489, line: 335, baseType: !349, size: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !503, file: !489, line: 336, baseType: !507, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !489, line: 47, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !503, file: !489, line: 338, baseType: !340, size: 16, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !503, file: !489, line: 338, baseType: !340, size: 16, offset: 208)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !503, file: !489, line: 339, baseType: !5, size: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !503, file: !489, line: 340, baseType: !315, size: 32, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !503, file: !489, line: 342, baseType: !290, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !503, file: !489, line: 343, baseType: !515, size: 96, offset: 320)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 96, elements: !516)
!516 = !{!483}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !503, file: !489, line: 344, baseType: !515, size: 96, offset: 416)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !503, file: !489, line: 347, baseType: !349, size: 128, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !503, file: !489, line: 349, baseType: !315, size: 32, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !503, file: !489, line: 350, baseType: !315, size: 32, offset: 672)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !503, file: !489, line: 351, baseType: !289, size: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !503, file: !489, line: 352, baseType: !289, size: 64, offset: 768)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !503, file: !489, line: 354, baseType: !524, size: 384, offset: 832)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !489, line: 116, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !489, line: 94, size: 384, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !525, file: !489, line: 96, baseType: !315, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !525, file: !489, line: 96, baseType: !315, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !525, file: !489, line: 97, baseType: !315, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !525, file: !489, line: 97, baseType: !315, size: 32, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !525, file: !489, line: 99, baseType: !340, size: 16, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !525, file: !489, line: 100, baseType: !340, size: 16, offset: 144)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !525, file: !489, line: 102, baseType: !340, size: 16, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !525, file: !489, line: 105, baseType: !340, size: 16, offset: 176)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !525, file: !489, line: 108, baseType: !340, size: 16, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !525, file: !489, line: 109, baseType: !340, size: 16, offset: 208)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !525, file: !489, line: 111, baseType: !340, size: 16, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !525, file: !489, line: 112, baseType: !340, size: 16, offset: 240)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !525, file: !489, line: 114, baseType: !315, size: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !525, file: !489, line: 114, baseType: !315, size: 32, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !525, file: !489, line: 115, baseType: !315, size: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !525, file: !489, line: 115, baseType: !315, size: 32, offset: 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !503, file: !489, line: 355, baseType: !325, size: 512, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !453, file: !273, line: 134, baseType: !289, size: 64, offset: 2368)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !453, file: !273, line: 136, baseType: !546, size: 64, offset: 2432)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !548, line: 130, size: 1216, elements: !549)
!548 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!549 = !{!550, !551, !552, !553, !554, !555}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !547, file: !548, line: 131, baseType: !403, size: 960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !547, file: !548, line: 134, baseType: !349, size: 128, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !547, file: !548, line: 135, baseType: !315, size: 32, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !547, file: !548, line: 141, baseType: !340, size: 16, offset: 1120)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !547, file: !548, line: 142, baseType: !340, size: 16, offset: 1136)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !547, file: !548, line: 143, baseType: !289, size: 64, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !453, file: !273, line: 138, baseType: !524, size: 384, offset: 2496)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !453, file: !273, line: 139, baseType: !558, size: 64, offset: 2880)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !489, line: 80, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !489, line: 72, size: 192, elements: !561)
!561 = !{!562, !569, !570, !571, !572}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !560, file: !489, line: 73, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !489, line: 59, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !489, line: 56, size: 128, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !565, file: !489, line: 57, baseType: !515, size: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !565, file: !489, line: 58, baseType: !315, size: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !560, file: !489, line: 74, baseType: !315, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !560, file: !489, line: 76, baseType: !315, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !560, file: !489, line: 77, baseType: !315, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !489, line: 79, baseType: !315, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !453, file: !273, line: 141, baseType: !349, size: 128, offset: 2944)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !453, file: !273, line: 142, baseType: !349, size: 128, offset: 3072)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !453, file: !273, line: 143, baseType: !349, size: 128, offset: 3200)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !453, file: !273, line: 144, baseType: !349, size: 128, offset: 3328)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !453, file: !273, line: 146, baseType: !315, size: 32, offset: 3456)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !453, file: !273, line: 147, baseType: !315, size: 32, offset: 3488)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !453, file: !273, line: 150, baseType: !580, size: 64, offset: 3520)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !445, line: 179, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !453, file: !273, line: 151, baseType: !584, size: 64, offset: 3584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !453, file: !273, line: 152, baseType: !315, size: 32, offset: 3648)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !453, file: !273, line: 153, baseType: !315, size: 32, offset: 3680)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !453, file: !273, line: 156, baseType: !515, size: 96, offset: 3712)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !453, file: !273, line: 156, baseType: !515, size: 96, offset: 3808)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !453, file: !273, line: 156, baseType: !515, size: 96, offset: 3904)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !453, file: !273, line: 157, baseType: !515, size: 96, offset: 4000)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !453, file: !273, line: 158, baseType: !515, size: 96, offset: 4096)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !453, file: !273, line: 159, baseType: !515, size: 96, offset: 4192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !453, file: !273, line: 160, baseType: !515, size: 96, offset: 4288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !453, file: !273, line: 160, baseType: !515, size: 96, offset: 4384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !453, file: !273, line: 161, baseType: !596, size: 128, offset: 4480)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 128, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 4)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !453, file: !273, line: 161, baseType: !596, size: 128, offset: 4608)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !453, file: !273, line: 162, baseType: !515, size: 96, offset: 4736)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !453, file: !273, line: 162, baseType: !515, size: 96, offset: 4832)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !453, file: !273, line: 163, baseType: !290, size: 32, offset: 4928)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !453, file: !273, line: 163, baseType: !290, size: 32, offset: 4960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !453, file: !273, line: 164, baseType: !605, size: 512, offset: 4992)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 512, elements: !606)
!606 = !{!598, !598}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !453, file: !273, line: 165, baseType: !605, size: 512, offset: 5504)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !453, file: !273, line: 166, baseType: !605, size: 512, offset: 6016)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !453, file: !273, line: 167, baseType: !605, size: 512, offset: 6528)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !453, file: !273, line: 176, baseType: !605, size: 512, offset: 7040)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !453, file: !273, line: 178, baseType: !5, size: 32, offset: 7552)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !273, line: 180, baseType: !340, size: 16, offset: 7584)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !453, file: !273, line: 181, baseType: !340, size: 16, offset: 7600)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !453, file: !273, line: 183, baseType: !340, size: 16, offset: 7616)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !453, file: !273, line: 183, baseType: !340, size: 16, offset: 7632)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !453, file: !273, line: 184, baseType: !340, size: 16, offset: 7648)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !453, file: !273, line: 184, baseType: !340, size: 16, offset: 7664)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !453, file: !273, line: 185, baseType: !340, size: 16, offset: 7680)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !453, file: !273, line: 186, baseType: !340, size: 16, offset: 7696)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !453, file: !273, line: 187, baseType: !340, size: 16, offset: 7712)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !453, file: !273, line: 188, baseType: !307, size: 8, offset: 7728)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !453, file: !273, line: 189, baseType: !307, size: 8, offset: 7736)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !453, file: !273, line: 192, baseType: !315, size: 32, offset: 7744)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !453, file: !273, line: 192, baseType: !315, size: 32, offset: 7776)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !453, file: !273, line: 192, baseType: !315, size: 32, offset: 7808)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !453, file: !273, line: 192, baseType: !315, size: 32, offset: 7840)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !453, file: !273, line: 194, baseType: !315, size: 32, offset: 7872)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !453, file: !273, line: 202, baseType: !290, size: 32, offset: 7904)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !453, file: !273, line: 202, baseType: !290, size: 32, offset: 7936)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !453, file: !273, line: 202, baseType: !290, size: 32, offset: 7968)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !453, file: !273, line: 211, baseType: !290, size: 32, offset: 8000)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !453, file: !273, line: 212, baseType: !290, size: 32, offset: 8032)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !453, file: !273, line: 213, baseType: !290, size: 32, offset: 8064)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !453, file: !273, line: 214, baseType: !290, size: 32, offset: 8096)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !453, file: !273, line: 215, baseType: !290, size: 32, offset: 8128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !453, file: !273, line: 216, baseType: !290, size: 32, offset: 8160)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !453, file: !273, line: 219, baseType: !290, size: 32, offset: 8192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !453, file: !273, line: 220, baseType: !290, size: 32, offset: 8224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !453, file: !273, line: 221, baseType: !290, size: 32, offset: 8256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !453, file: !273, line: 224, baseType: !641, size: 16, offset: 8288)
!641 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !453, file: !273, line: 224, baseType: !641, size: 16, offset: 8304)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !453, file: !273, line: 226, baseType: !340, size: 16, offset: 8320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !453, file: !273, line: 228, baseType: !307, size: 8, offset: 8336)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !453, file: !273, line: 229, baseType: !307, size: 8, offset: 8344)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !453, file: !273, line: 231, baseType: !340, size: 16, offset: 8352)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !453, file: !273, line: 232, baseType: !307, size: 8, offset: 8368)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !453, file: !273, line: 233, baseType: !307, size: 8, offset: 8376)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !453, file: !273, line: 234, baseType: !290, size: 32, offset: 8384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !453, file: !273, line: 235, baseType: !290, size: 32, offset: 8416)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !453, file: !273, line: 237, baseType: !349, size: 128, offset: 8448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !453, file: !273, line: 238, baseType: !349, size: 128, offset: 8576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !453, file: !273, line: 239, baseType: !349, size: 128, offset: 8704)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !453, file: !273, line: 240, baseType: !349, size: 128, offset: 8832)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !453, file: !273, line: 242, baseType: !290, size: 32, offset: 8960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !453, file: !273, line: 244, baseType: !340, size: 16, offset: 8992)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !453, file: !273, line: 245, baseType: !641, size: 16, offset: 9008)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !453, file: !273, line: 246, baseType: !596, size: 128, offset: 9024)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !453, file: !273, line: 248, baseType: !315, size: 32, offset: 9152)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !453, file: !273, line: 249, baseType: !315, size: 32, offset: 9184)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !453, file: !273, line: 251, baseType: !662, size: 64, offset: 9216)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !273, line: 251, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !453, file: !273, line: 253, baseType: !307, size: 8, offset: 9280)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !453, file: !273, line: 254, baseType: !307, size: 8, offset: 9288)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !453, file: !273, line: 255, baseType: !340, size: 16, offset: 9296)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !453, file: !273, line: 256, baseType: !515, size: 96, offset: 9312)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !453, file: !273, line: 258, baseType: !349, size: 128, offset: 9408)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !453, file: !273, line: 259, baseType: !349, size: 128, offset: 9536)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !453, file: !273, line: 260, baseType: !349, size: 128, offset: 9664)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !453, file: !273, line: 261, baseType: !349, size: 128, offset: 9792)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !453, file: !273, line: 263, baseType: !673, size: 64, offset: 9920)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !273, line: 52, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !453, file: !273, line: 264, baseType: !676, size: 64, offset: 9984)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !273, line: 53, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !453, file: !273, line: 265, baseType: !679, size: 64, offset: 10048)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !681, line: 43, flags: DIFlagFwdDecl)
!681 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!682 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !453, file: !273, line: 267, baseType: !307, size: 8, offset: 10112)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !453, file: !273, line: 268, baseType: !307, size: 8, offset: 10120)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !453, file: !273, line: 269, baseType: !340, size: 16, offset: 10128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !453, file: !273, line: 270, baseType: !290, size: 32, offset: 10144)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !453, file: !273, line: 272, baseType: !687, size: 64, offset: 10176)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !273, line: 54, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !453, file: !273, line: 275, baseType: !690, size: 64, offset: 10240)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !273, line: 275, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !453, file: !273, line: 277, baseType: !693, size: 64, offset: 10304)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !273, line: 56, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !453, file: !273, line: 277, baseType: !693, size: 64, offset: 10368)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !453, file: !273, line: 278, baseType: !697, size: 64, offset: 10432)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !698, line: 27, baseType: !699)
!698 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !700, line: 45, baseType: !701)
!700 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!701 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !453, file: !273, line: 279, baseType: !697, size: 64, offset: 10496)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !453, file: !273, line: 280, baseType: !5, size: 32, offset: 10560)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !453, file: !273, line: 281, baseType: !5, size: 32, offset: 10592)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !453, file: !273, line: 283, baseType: !349, size: 128, offset: 10624)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !453, file: !273, line: 284, baseType: !349, size: 128, offset: 10752)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !453, file: !273, line: 285, baseType: !708, size: 64, offset: 10880)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !453, file: !273, line: 287, baseType: !710, size: 64, offset: 10944)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !273, line: 59, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !453, file: !273, line: 288, baseType: !713, size: 64, offset: 11008)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !273, line: 288, flags: DIFlagFwdDecl)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !453, file: !273, line: 290, baseType: !716, size: 64, offset: 11072)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 64, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 2)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !453, file: !273, line: 291, baseType: !720, size: 64, offset: 11136)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !722, line: 65, baseType: !723)
!722 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !722, line: 50, size: 320, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !723, file: !722, line: 51, baseType: !443, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !723, file: !722, line: 53, baseType: !315, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !723, file: !722, line: 54, baseType: !315, size: 32, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !723, file: !722, line: 55, baseType: !315, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !723, file: !722, line: 55, baseType: !315, size: 32, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !723, file: !722, line: 56, baseType: !307, size: 8, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !723, file: !722, line: 56, baseType: !307, size: 8, offset: 200)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !723, file: !722, line: 57, baseType: !307, size: 8, offset: 208)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !723, file: !722, line: 57, baseType: !307, size: 8, offset: 216)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !723, file: !722, line: 59, baseType: !340, size: 16, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !723, file: !722, line: 59, baseType: !340, size: 16, offset: 240)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !723, file: !722, line: 59, baseType: !340, size: 16, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !723, file: !722, line: 61, baseType: !340, size: 16, offset: 272)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !723, file: !722, line: 63, baseType: !315, size: 32, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !453, file: !273, line: 293, baseType: !349, size: 128, offset: 11200)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !453, file: !273, line: 294, baseType: !741, size: 64, offset: 11328)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !273, line: 113, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !273, line: 108, size: 256, elements: !744)
!744 = !{!745, !747, !748, !749, !750}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !743, file: !273, line: 109, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !743, file: !273, line: 109, baseType: !746, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !743, file: !273, line: 110, baseType: !452, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !743, file: !273, line: 111, baseType: !315, size: 32, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !743, file: !273, line: 112, baseType: !290, size: 32, offset: 224)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !444, file: !445, line: 1221, baseType: !752, size: 64, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !445, line: 52, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !444, file: !445, line: 1223, baseType: !443, size: 64, offset: 1152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !444, file: !445, line: 1225, baseType: !349, size: 128, offset: 1216)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !444, file: !445, line: 1226, baseType: !757, size: 64, offset: 1344)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !445, line: 69, size: 320, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !758, file: !445, line: 70, baseType: !757, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !758, file: !445, line: 70, baseType: !757, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !758, file: !445, line: 71, baseType: !5, size: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !758, file: !445, line: 71, baseType: !5, size: 32, offset: 160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !758, file: !445, line: 72, baseType: !315, size: 32, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !758, file: !445, line: 73, baseType: !340, size: 16, offset: 224)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !758, file: !445, line: 73, baseType: !340, size: 16, offset: 240)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !758, file: !445, line: 74, baseType: !452, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !444, file: !445, line: 1227, baseType: !452, size: 64, offset: 1408)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !444, file: !445, line: 1229, baseType: !515, size: 96, offset: 1472)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !444, file: !445, line: 1230, baseType: !515, size: 96, offset: 1568)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !444, file: !445, line: 1231, baseType: !515, size: 96, offset: 1664)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !444, file: !445, line: 1231, baseType: !515, size: 96, offset: 1760)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !444, file: !445, line: 1233, baseType: !5, size: 32, offset: 1856)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !444, file: !445, line: 1234, baseType: !315, size: 32, offset: 1888)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !444, file: !445, line: 1235, baseType: !5, size: 32, offset: 1920)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !444, file: !445, line: 1237, baseType: !340, size: 16, offset: 1952)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !444, file: !445, line: 1239, baseType: !307, size: 8, offset: 1968)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !444, file: !445, line: 1240, baseType: !779, size: 8, offset: 1976)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 8, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 1)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !444, file: !445, line: 1242, baseType: !783, size: 64, offset: 1984)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !785, line: 328, size: 3456, elements: !786)
!785 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!786 = !{!787, !788, !789, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !819, !820, !821, !824, !829, !830, !833, !837, !841, !845, !849, !850, !851, !852}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !784, file: !785, line: 329, baseType: !403, size: 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !784, file: !785, line: 330, baseType: !449, size: 64, offset: 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !784, file: !785, line: 332, baseType: !790, size: 64, offset: 1024)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !785, line: 332, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !784, file: !785, line: 333, baseType: !325, size: 512, offset: 1088)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !784, file: !785, line: 335, baseType: !372, size: 64, offset: 1600)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !784, file: !785, line: 337, baseType: !546, size: 64, offset: 1664)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !784, file: !785, line: 338, baseType: !716, size: 64, offset: 1728)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !784, file: !785, line: 340, baseType: !349, size: 128, offset: 1792)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !784, file: !785, line: 340, baseType: !349, size: 128, offset: 1920)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !784, file: !785, line: 342, baseType: !315, size: 32, offset: 2048)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !784, file: !785, line: 342, baseType: !315, size: 32, offset: 2080)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !784, file: !785, line: 343, baseType: !315, size: 32, offset: 2112)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !784, file: !785, line: 345, baseType: !315, size: 32, offset: 2144)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !784, file: !785, line: 346, baseType: !315, size: 32, offset: 2176)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !784, file: !785, line: 347, baseType: !340, size: 16, offset: 2208)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !784, file: !785, line: 348, baseType: !340, size: 16, offset: 2224)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !784, file: !785, line: 349, baseType: !315, size: 32, offset: 2240)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !784, file: !785, line: 351, baseType: !315, size: 32, offset: 2272)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !784, file: !785, line: 353, baseType: !340, size: 16, offset: 2304)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !784, file: !785, line: 354, baseType: !340, size: 16, offset: 2320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !784, file: !785, line: 355, baseType: !315, size: 32, offset: 2336)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !784, file: !785, line: 357, baseType: !811, size: 128, offset: 2368)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !812, line: 95, baseType: !813)
!812 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !812, line: 92, size: 128, elements: !814)
!814 = !{!815, !816, !817, !818}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !813, file: !812, line: 93, baseType: !290, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !813, file: !812, line: 93, baseType: !290, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !813, file: !812, line: 94, baseType: !290, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !813, file: !812, line: 94, baseType: !290, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !784, file: !785, line: 363, baseType: !349, size: 128, offset: 2496)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !784, file: !785, line: 363, baseType: !349, size: 128, offset: 2624)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !784, file: !785, line: 368, baseType: !822, size: 64, offset: 2752)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !785, line: 48, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !784, file: !785, line: 372, baseType: !825, size: 32, offset: 2816)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !785, line: 274, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !785, line: 271, size: 32, elements: !827)
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !826, file: !785, line: 273, baseType: !5, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !784, file: !785, line: 373, baseType: !315, size: 32, offset: 2848)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !784, file: !785, line: 382, baseType: !831, size: 64, offset: 2880)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !785, line: 46, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !784, file: !785, line: 385, baseType: !834, size: 64, offset: 2944)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !289, !290}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !784, file: !785, line: 386, baseType: !838, size: 64, offset: 3008)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !289, !584}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !784, file: !785, line: 387, baseType: !842, size: 64, offset: 3072)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!315, !289}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !784, file: !785, line: 388, baseType: !846, size: 64, offset: 3136)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !289}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !784, file: !785, line: 389, baseType: !289, size: 64, offset: 3200)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !784, file: !785, line: 389, baseType: !289, size: 64, offset: 3264)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !784, file: !785, line: 389, baseType: !289, size: 64, offset: 3328)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !784, file: !785, line: 389, baseType: !289, size: 64, offset: 3392)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !444, file: !445, line: 1244, baseType: !854, size: 64, offset: 2048)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !856, line: 200, size: 17024, elements: !857)
!856 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!857 = !{!858, !859, !860, !861, !1274, !1275, !1276, !1277, !1278, !1279, !1280}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !855, file: !856, line: 201, baseType: !708, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !855, file: !856, line: 202, baseType: !349, size: 128, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !855, file: !856, line: 203, baseType: !349, size: 128, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !855, file: !856, line: 206, baseType: !862, size: 64, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !856, line: 190, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !856, line: 126, size: 2816, elements: !865)
!865 = !{!866, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !964, !965, !966, !967, !1245, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1273}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !864, file: !856, line: 127, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !864, file: !856, line: 127, baseType: !867, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !864, file: !856, line: 128, baseType: !289, size: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !864, file: !856, line: 129, baseType: !289, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !864, file: !856, line: 130, baseType: !325, size: 512, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !864, file: !856, line: 132, baseType: !315, size: 32, offset: 768)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !864, file: !856, line: 132, baseType: !315, size: 32, offset: 800)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !864, file: !856, line: 133, baseType: !315, size: 32, offset: 832)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !864, file: !856, line: 134, baseType: !315, size: 32, offset: 864)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !864, file: !856, line: 134, baseType: !315, size: 32, offset: 896)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !864, file: !856, line: 134, baseType: !315, size: 32, offset: 928)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !864, file: !856, line: 135, baseType: !315, size: 32, offset: 960)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !864, file: !856, line: 135, baseType: !315, size: 32, offset: 992)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !864, file: !856, line: 136, baseType: !315, size: 32, offset: 1024)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !864, file: !856, line: 136, baseType: !315, size: 32, offset: 1056)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !864, file: !856, line: 137, baseType: !315, size: 32, offset: 1088)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !864, file: !856, line: 137, baseType: !315, size: 32, offset: 1120)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !864, file: !856, line: 138, baseType: !290, size: 32, offset: 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !864, file: !856, line: 139, baseType: !290, size: 32, offset: 1184)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !864, file: !856, line: 139, baseType: !290, size: 32, offset: 1216)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !864, file: !856, line: 141, baseType: !340, size: 16, offset: 1248)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !864, file: !856, line: 142, baseType: !340, size: 16, offset: 1264)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !864, file: !856, line: 143, baseType: !315, size: 32, offset: 1280)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !864, file: !856, line: 144, baseType: !315, size: 32, offset: 1312)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !864, file: !856, line: 146, baseType: !892, size: 64, offset: 1344)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !856, line: 114, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !856, line: 99, size: 7232, elements: !895)
!895 = !{!896, !898, !899, !900, !901, !902, !903, !914, !918, !932, !941, !948, !958}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !894, file: !856, line: 100, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !894, file: !856, line: 100, baseType: !897, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !894, file: !856, line: 101, baseType: !315, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !894, file: !856, line: 101, baseType: !315, size: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !894, file: !856, line: 102, baseType: !315, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !894, file: !856, line: 102, baseType: !315, size: 32, offset: 224)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !894, file: !856, line: 103, baseType: !904, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !856, line: 59, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !856, line: 56, size: 2112, elements: !907)
!907 = !{!908, !912, !913}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !906, file: !856, line: 57, baseType: !909, size: 2048)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 2048, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !906, file: !856, line: 58, baseType: !315, size: 32, offset: 2048)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !906, file: !856, line: 58, baseType: !315, size: 32, offset: 2080)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !894, file: !856, line: 106, baseType: !915, size: 6144, offset: 320)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 6144, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 768)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !894, file: !856, line: 107, baseType: !919, size: 64, offset: 6464)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !856, line: 97, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !856, line: 83, size: 8320, elements: !922)
!922 = !{!923, !924, !925, !928, !929, !930, !931}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !921, file: !856, line: 84, baseType: !915, size: 6144)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !921, file: !856, line: 87, baseType: !909, size: 2048, offset: 6144)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !921, file: !856, line: 88, baseType: !926, size: 64, offset: 8192)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !722, line: 41, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !921, file: !856, line: 90, baseType: !340, size: 16, offset: 8256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !921, file: !856, line: 92, baseType: !340, size: 16, offset: 8272)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !921, file: !856, line: 93, baseType: !340, size: 16, offset: 8288)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !921, file: !856, line: 95, baseType: !340, size: 16, offset: 8304)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !894, file: !856, line: 108, baseType: !933, size: 64, offset: 6528)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !856, line: 66, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !856, line: 61, size: 128, elements: !936)
!936 = !{!937, !938, !939, !940}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !935, file: !856, line: 62, baseType: !315, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !935, file: !856, line: 63, baseType: !315, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !935, file: !856, line: 64, baseType: !315, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !935, file: !856, line: 65, baseType: !315, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !894, file: !856, line: 109, baseType: !942, size: 64, offset: 6592)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !856, line: 71, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !856, line: 68, size: 64, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !944, file: !856, line: 69, baseType: !315, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !944, file: !856, line: 70, baseType: !315, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !894, file: !856, line: 110, baseType: !949, size: 64, offset: 6656)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !856, line: 81, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !856, line: 73, size: 352, elements: !952)
!952 = !{!953, !954, !955, !956, !957}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !951, file: !856, line: 74, baseType: !515, size: 96)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !951, file: !856, line: 75, baseType: !515, size: 96, offset: 96)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !951, file: !856, line: 76, baseType: !515, size: 96, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !951, file: !856, line: 77, baseType: !315, size: 32, offset: 288)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !951, file: !856, line: 78, baseType: !315, size: 32, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !894, file: !856, line: 113, baseType: !959, size: 512, offset: 6720)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !960, line: 182, baseType: !961)
!960 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !960, line: 180, size: 512, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !961, file: !960, line: 181, baseType: !325, size: 512)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !864, file: !856, line: 148, baseType: !472, size: 64, offset: 1408)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !864, file: !856, line: 151, baseType: !443, size: 64, offset: 1472)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !864, file: !856, line: 152, baseType: !452, size: 64, offset: 1536)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !864, file: !856, line: 153, baseType: !968, size: 64, offset: 1600)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !970, line: 64, size: 19136, elements: !971)
!970 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!971 = !{!972, !973, !974, !975, !976, !977, !979, !980, !981, !982, !985, !986, !1231, !1232, !1240, !1241, !1242, !1243, !1244}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !969, file: !970, line: 65, baseType: !403, size: 960)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !969, file: !970, line: 66, baseType: !449, size: 64, offset: 960)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !969, file: !970, line: 68, baseType: !421, size: 8192, offset: 1024)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !969, file: !970, line: 70, baseType: !315, size: 32, offset: 9216)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !969, file: !970, line: 71, baseType: !315, size: 32, offset: 9248)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !969, file: !970, line: 72, baseType: !978, size: 64, offset: 9280)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 64, elements: !717)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !969, file: !970, line: 74, baseType: !290, size: 32, offset: 9344)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !969, file: !970, line: 74, baseType: !290, size: 32, offset: 9376)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !969, file: !970, line: 76, baseType: !926, size: 64, offset: 9408)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !969, file: !970, line: 77, baseType: !983, size: 64, offset: 9472)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !970, line: 77, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !969, file: !970, line: 78, baseType: !546, size: 64, offset: 9536)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !969, file: !970, line: 80, baseType: !987, size: 2624, offset: 9600)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !988, line: 340, size: 2624, elements: !989)
!988 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!989 = !{!990, !1018, !1036, !1037, !1038, !1053, !1111, !1112, !1211, !1212, !1213, !1214, !1220}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !987, file: !988, line: 341, baseType: !991, size: 576)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !988, line: 251, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !988, line: 207, size: 576, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !992, file: !988, line: 208, baseType: !315, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !992, file: !988, line: 211, baseType: !340, size: 16, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !992, file: !988, line: 212, baseType: !340, size: 16, offset: 48)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !992, file: !988, line: 213, baseType: !290, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !992, file: !988, line: 214, baseType: !340, size: 16, offset: 96)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !992, file: !988, line: 215, baseType: !340, size: 16, offset: 112)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !992, file: !988, line: 216, baseType: !340, size: 16, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !992, file: !988, line: 217, baseType: !340, size: 16, offset: 144)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !992, file: !988, line: 218, baseType: !340, size: 16, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !992, file: !988, line: 219, baseType: !340, size: 16, offset: 176)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !992, file: !988, line: 220, baseType: !290, size: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !992, file: !988, line: 222, baseType: !340, size: 16, offset: 224)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !992, file: !988, line: 225, baseType: !340, size: 16, offset: 240)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !992, file: !988, line: 228, baseType: !315, size: 32, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !992, file: !988, line: 229, baseType: !315, size: 32, offset: 288)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !992, file: !988, line: 233, baseType: !315, size: 32, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !992, file: !988, line: 236, baseType: !340, size: 16, offset: 352)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !992, file: !988, line: 236, baseType: !340, size: 16, offset: 368)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !992, file: !988, line: 241, baseType: !290, size: 32, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !992, file: !988, line: 244, baseType: !315, size: 32, offset: 416)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !992, file: !988, line: 244, baseType: !315, size: 32, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !992, file: !988, line: 245, baseType: !290, size: 32, offset: 480)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !992, file: !988, line: 248, baseType: !290, size: 32, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !992, file: !988, line: 250, baseType: !315, size: 32, offset: 544)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !987, file: !988, line: 342, baseType: !1019, size: 448, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !988, line: 79, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !988, line: 61, size: 448, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1020, file: !988, line: 62, baseType: !289, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1020, file: !988, line: 64, baseType: !340, size: 16, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1020, file: !988, line: 65, baseType: !340, size: 16, offset: 80)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1020, file: !988, line: 67, baseType: !290, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1020, file: !988, line: 68, baseType: !290, size: 32, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1020, file: !988, line: 69, baseType: !290, size: 32, offset: 160)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1020, file: !988, line: 70, baseType: !340, size: 16, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1020, file: !988, line: 71, baseType: !340, size: 16, offset: 208)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1020, file: !988, line: 72, baseType: !716, size: 64, offset: 224)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1020, file: !988, line: 75, baseType: !290, size: 32, offset: 288)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1020, file: !988, line: 75, baseType: !290, size: 32, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1020, file: !988, line: 75, baseType: !290, size: 32, offset: 352)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1020, file: !988, line: 78, baseType: !290, size: 32, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1020, file: !988, line: 78, baseType: !290, size: 32, offset: 416)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !987, file: !988, line: 343, baseType: !349, size: 128, offset: 1024)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !987, file: !988, line: 344, baseType: !349, size: 128, offset: 1152)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !987, file: !988, line: 345, baseType: !1039, size: 192, offset: 1280)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !988, line: 278, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !988, line: 270, size: 192, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1040, file: !988, line: 271, baseType: !315, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1040, file: !988, line: 273, baseType: !290, size: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1040, file: !988, line: 275, baseType: !315, size: 32, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1040, file: !988, line: 276, baseType: !315, size: 32, offset: 96)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1040, file: !988, line: 277, baseType: !1047, size: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !988, line: 55, size: 576, elements: !1049)
!1049 = !{!1050, !1051, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1048, file: !988, line: 56, baseType: !315, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1048, file: !988, line: 57, baseType: !290, size: 32, offset: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1048, file: !988, line: 58, baseType: !605, size: 512, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !987, file: !988, line: 346, baseType: !1054, size: 384, offset: 1472)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !988, line: 268, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !988, line: 253, size: 384, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1105, !1106, !1107, !1108, !1109, !1110}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1055, file: !988, line: 254, baseType: !315, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1055, file: !988, line: 255, baseType: !315, size: 32, offset: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1055, file: !988, line: 255, baseType: !315, size: 32, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1055, file: !988, line: 258, baseType: !290, size: 32, offset: 96)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1055, file: !988, line: 259, baseType: !1062, size: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !988, line: 164, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !988, line: 108, size: 1664, elements: !1065)
!1065 = !{!1066, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1064, file: !988, line: 109, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1064, file: !988, line: 109, baseType: !1067, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1064, file: !988, line: 111, baseType: !325, size: 512, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1064, file: !988, line: 119, baseType: !716, size: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1064, file: !988, line: 119, baseType: !716, size: 64, offset: 704)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1064, file: !988, line: 125, baseType: !716, size: 64, offset: 768)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1064, file: !988, line: 125, baseType: !716, size: 64, offset: 832)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1064, file: !988, line: 127, baseType: !716, size: 64, offset: 896)
