; ModuleID = 'blender/source/blender/blenkernel/intern/image.c'
source_filename = "blender/source/blender/blenkernel/intern/image.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!114 = !DIEnumerator(name: "COLOR_ROLE_TEXTURE_PAINTING", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_SEQUENCER", value: 3, isUnsigned: true)
!116 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_BYTE", value: 4, isUnsigned: true)
!117 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_FLOAT", value: 5, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eTimecodeStyles", file: !119, line: 774, baseType: !7, size: 32, elements: !120)
!119 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !{!121, !122, !123, !124, !125}
!121 = !DIEnumerator(name: "USER_TIMECODE_MINIMAL", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "USER_TIMECODE_SMPTE_MSF", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "USER_TIMECODE_SMPTE_FULL", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "USER_TIMECODE_MILLISECONDS", value: 3, isUnsigned: true)
!125 = !DIEnumerator(name: "USER_TIMECODE_SECONDS_ONLY", value: 4, isUnsigned: true)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !127, line: 339, baseType: !7, size: 32, elements: !128)
!127 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!129 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!130 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!131 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!132 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!133 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!134 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!135 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!136 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!137 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!138 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!139 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ScenePassType", file: !141, line: 213, baseType: !142, size: 32, elements: !143)
!141 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!144 = !DIEnumerator(name: "SCE_PASS_COMBINED", value: 1)
!145 = !DIEnumerator(name: "SCE_PASS_Z", value: 2)
!146 = !DIEnumerator(name: "SCE_PASS_RGBA", value: 4)
!147 = !DIEnumerator(name: "SCE_PASS_DIFFUSE", value: 8)
!148 = !DIEnumerator(name: "SCE_PASS_SPEC", value: 16)
!149 = !DIEnumerator(name: "SCE_PASS_SHADOW", value: 32)
!150 = !DIEnumerator(name: "SCE_PASS_AO", value: 64)
!151 = !DIEnumerator(name: "SCE_PASS_REFLECT", value: 128)
!152 = !DIEnumerator(name: "SCE_PASS_NORMAL", value: 256)
!153 = !DIEnumerator(name: "SCE_PASS_VECTOR", value: 512)
!154 = !DIEnumerator(name: "SCE_PASS_REFRACT", value: 1024)
!155 = !DIEnumerator(name: "SCE_PASS_INDEXOB", value: 2048)
!156 = !DIEnumerator(name: "SCE_PASS_UV", value: 4096)
!157 = !DIEnumerator(name: "SCE_PASS_INDIRECT", value: 8192)
!158 = !DIEnumerator(name: "SCE_PASS_MIST", value: 16384)
!159 = !DIEnumerator(name: "SCE_PASS_RAYHITS", value: 32768)
!160 = !DIEnumerator(name: "SCE_PASS_EMIT", value: 65536)
!161 = !DIEnumerator(name: "SCE_PASS_ENVIRONMENT", value: 131072)
!162 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!163 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!164 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!165 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!166 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!167 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!168 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!169 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!170 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!171 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!172 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!173 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!174 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!175 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!176 = !{!177, !178, !2927, !208, !142, !1239, !1269, !2937, !185, !1231, !2939, !291, !2944, !857}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "MTFace", file: !180, line: 165, baseType: !181)
!180 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !180, line: 160, size: 384, elements: !182)
!182 = !{!183, !189, !2922, !2923, !2924, !2925, !2926}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !181, file: !180, line: 161, baseType: !184, size: 256)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 256, elements: !186)
!185 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!186 = !{!187, !188}
!187 = !DISubrange(count: 4)
!188 = !DISubrange(count: 2)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !181, file: !180, line: 162, baseType: !190, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !51, line: 77, size: 15424, elements: !192)
!192 = !{!193, !268, !269, !273, !276, !279, !2882, !2884, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !191, file: !51, line: 78, baseType: !194, size: 960)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !195, line: 130, baseType: !196)
!195 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !195, line: 117, size: 960, elements: !197)
!197 = !{!198, !199, !200, !202, !227, !231, !233, !234, !235, !236}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !195, line: 118, baseType: !177, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !196, file: !195, line: 118, baseType: !177, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !196, file: !195, line: 119, baseType: !201, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !196, file: !195, line: 120, baseType: !203, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !195, line: 136, size: 17600, elements: !205)
!205 = !{!206, !207, !209, !212, !217, !218, !219}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !204, file: !195, line: 137, baseType: !194, size: 960)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !204, file: !195, line: 138, baseType: !208, size: 64, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !204, file: !195, line: 139, baseType: !210, size: 64, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !195, line: 43, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !204, file: !195, line: 140, baseType: !213, size: 8192, offset: 1088)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 8192, elements: !215)
!214 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!215 = !{!216}
!216 = !DISubrange(count: 1024)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !204, file: !195, line: 141, baseType: !213, size: 8192, offset: 9280)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !204, file: !195, line: 148, baseType: !203, size: 64, offset: 17472)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !204, file: !195, line: 150, baseType: !220, size: 64, offset: 17536)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !222, line: 37, size: 128, elements: !223)
!222 = !DIFile(filename: "blender/source/blender/makesdna/DNA_packedFile_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !221, file: !222, line: 38, baseType: !142, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !221, file: !222, line: 39, baseType: !142, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !221, file: !222, line: 40, baseType: !177, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !195, line: 121, baseType: !228, size: 528, offset: 256)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 528, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 66)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !196, file: !195, line: 126, baseType: !232, size: 16, offset: 784)
!232 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !196, file: !195, line: 127, baseType: !142, size: 32, offset: 800)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !196, file: !195, line: 128, baseType: !142, size: 32, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !196, file: !195, line: 128, baseType: !142, size: 32, offset: 864)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !196, file: !195, line: 129, baseType: !237, size: 64, offset: 896)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !195, line: 75, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !195, line: 62, size: 1024, elements: !240)
!240 = !{!241, !243, !244, !245, !246, !247, !251, !252, !266, !267}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !195, line: 63, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !239, file: !195, line: 63, baseType: !242, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !239, file: !195, line: 64, baseType: !214, size: 8, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !239, file: !195, line: 64, baseType: !214, size: 8, offset: 136)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !239, file: !195, line: 65, baseType: !232, size: 16, offset: 144)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !195, line: 66, baseType: !248, size: 512, offset: 160)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 512, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !239, file: !195, line: 67, baseType: !142, size: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !239, file: !195, line: 69, baseType: !253, size: 256, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !195, line: 60, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !195, line: 48, size: 256, elements: !255)
!255 = !{!256, !257, !264, !265}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !254, file: !195, line: 49, baseType: !177, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !254, file: !195, line: 58, baseType: !258, size: 128, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !259, line: 71, baseType: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !259, line: 69, size: 128, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !260, file: !259, line: 70, baseType: !177, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !260, file: !259, line: 70, baseType: !177, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !254, file: !195, line: 59, baseType: !142, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !254, file: !195, line: 59, baseType: !142, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !239, file: !195, line: 70, baseType: !142, size: 32, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !239, file: !195, line: 74, baseType: !142, size: 32, offset: 992)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !51, line: 80, baseType: !213, size: 8192, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !191, file: !51, line: 82, baseType: !270, size: 64, offset: 9152)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !272, line: 43, flags: DIFlagFwdDecl)
!272 = !DIFile(filename: "blender/source/blender/imbuf/IMB_moviecache.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !191, file: !51, line: 83, baseType: !274, size: 64, offset: 9216)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !195, line: 46, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !191, file: !51, line: 86, baseType: !277, size: 64, offset: 9280)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !56, line: 85, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !191, file: !51, line: 87, baseType: !280, size: 64, offset: 9344)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !282, line: 110, size: 1152, elements: !283)
!282 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!283 = !{!284, !285, !286, !287, !288, !289, !290, !292, !294, !295, !304, !305, !306, !307, !309, !2878, !2879, !2880, !2881}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !282, line: 111, baseType: !280, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !281, file: !282, line: 111, baseType: !280, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !281, file: !282, line: 114, baseType: !142, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !281, file: !282, line: 114, baseType: !142, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !281, file: !282, line: 115, baseType: !232, size: 16, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !281, file: !282, line: 115, baseType: !232, size: 16, offset: 208)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !281, file: !282, line: 118, baseType: !291, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !281, file: !282, line: 120, baseType: !293, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !281, file: !282, line: 122, baseType: !293, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !281, file: !282, line: 125, baseType: !296, size: 128, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !297, line: 89, baseType: !298)
!297 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !297, line: 86, size: 128, elements: !299)
!299 = !{!300, !301, !302, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !298, file: !297, line: 87, baseType: !142, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !298, file: !297, line: 87, baseType: !142, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !298, file: !297, line: 88, baseType: !142, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !298, file: !297, line: 88, baseType: !142, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !281, file: !282, line: 127, baseType: !142, size: 32, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !281, file: !282, line: 127, baseType: !142, size: 32, offset: 608)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !281, file: !282, line: 130, baseType: !258, size: 128, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !281, file: !282, line: 133, baseType: !308, size: 128, offset: 768)
!308 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !296)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !281, file: !282, line: 134, baseType: !310, size: 64, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !282, line: 108, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !282, line: 85, size: 1600, elements: !314)
!314 = !{!315, !317, !318, !322, !323, !324, !325, !326, !327, !328, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !282, line: 86, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !282, line: 86, baseType: !316, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !282, line: 89, baseType: !319, size: 592, offset: 128)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 592, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 74)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !313, file: !282, line: 90, baseType: !7, size: 32, offset: 736)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !313, file: !282, line: 90, baseType: !7, size: 32, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !313, file: !282, line: 90, baseType: !7, size: 32, offset: 800)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !313, file: !282, line: 91, baseType: !142, size: 32, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !313, file: !282, line: 91, baseType: !142, size: 32, offset: 864)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !313, file: !282, line: 91, baseType: !142, size: 32, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !313, file: !282, line: 93, baseType: !329, size: 64, offset: 960)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !331, line: 93, size: 7552, elements: !332)
!331 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = !{!333, !334, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !386, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !454, !455, !456, !457, !458, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2868}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !330, file: !331, line: 94, baseType: !194, size: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !330, file: !331, line: 95, baseType: !335, size: 64, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !141, line: 58, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !330, file: !331, line: 97, baseType: !232, size: 16, offset: 1024)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !331, line: 97, baseType: !232, size: 16, offset: 1040)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !330, file: !331, line: 99, baseType: !185, size: 32, offset: 1056)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !330, file: !331, line: 99, baseType: !185, size: 32, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !330, file: !331, line: 99, baseType: !185, size: 32, offset: 1120)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !330, file: !331, line: 100, baseType: !185, size: 32, offset: 1152)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !330, file: !331, line: 100, baseType: !185, size: 32, offset: 1184)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !330, file: !331, line: 100, baseType: !185, size: 32, offset: 1216)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !330, file: !331, line: 101, baseType: !185, size: 32, offset: 1248)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !330, file: !331, line: 101, baseType: !185, size: 32, offset: 1280)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !330, file: !331, line: 101, baseType: !185, size: 32, offset: 1312)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !330, file: !331, line: 102, baseType: !185, size: 32, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !330, file: !331, line: 102, baseType: !185, size: 32, offset: 1376)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !330, file: !331, line: 102, baseType: !185, size: 32, offset: 1408)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !330, file: !331, line: 103, baseType: !185, size: 32, offset: 1440)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !330, file: !331, line: 103, baseType: !185, size: 32, offset: 1472)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !330, file: !331, line: 103, baseType: !185, size: 32, offset: 1504)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !330, file: !331, line: 103, baseType: !185, size: 32, offset: 1536)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !330, file: !331, line: 103, baseType: !185, size: 32, offset: 1568)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !330, file: !331, line: 104, baseType: !185, size: 32, offset: 1600)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !330, file: !331, line: 104, baseType: !185, size: 32, offset: 1632)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !330, file: !331, line: 104, baseType: !185, size: 32, offset: 1664)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !330, file: !331, line: 104, baseType: !185, size: 32, offset: 1696)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !330, file: !331, line: 104, baseType: !185, size: 32, offset: 1728)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !330, file: !331, line: 105, baseType: !185, size: 32, offset: 1760)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !330, file: !331, line: 108, baseType: !363, size: 704, offset: 1792)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !331, line: 53, size: 704, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !363, file: !331, line: 54, baseType: !185, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !363, file: !331, line: 55, baseType: !185, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !363, file: !331, line: 56, baseType: !185, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !363, file: !331, line: 57, baseType: !185, size: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !363, file: !331, line: 59, baseType: !370, size: 96, offset: 128)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 96, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 3)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !363, file: !331, line: 60, baseType: !370, size: 96, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !363, file: !331, line: 61, baseType: !370, size: 96, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !363, file: !331, line: 63, baseType: !185, size: 32, offset: 416)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !363, file: !331, line: 64, baseType: !185, size: 32, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !363, file: !331, line: 65, baseType: !185, size: 32, offset: 480)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !363, file: !331, line: 67, baseType: !232, size: 16, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !363, file: !331, line: 68, baseType: !232, size: 16, offset: 528)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !363, file: !331, line: 69, baseType: !232, size: 16, offset: 544)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !363, file: !331, line: 70, baseType: !232, size: 16, offset: 560)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !363, file: !331, line: 72, baseType: !185, size: 32, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !363, file: !331, line: 73, baseType: !185, size: 32, offset: 608)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !363, file: !331, line: 74, baseType: !185, size: 32, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !363, file: !331, line: 75, baseType: !185, size: 32, offset: 672)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !330, file: !331, line: 109, baseType: !387, size: 128, offset: 2496)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !331, line: 79, size: 128, elements: !388)
!388 = !{!389, !390, !391, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !387, file: !331, line: 80, baseType: !142, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !387, file: !331, line: 81, baseType: !142, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !387, file: !331, line: 82, baseType: !142, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !387, file: !331, line: 83, baseType: !142, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !330, file: !331, line: 111, baseType: !185, size: 32, offset: 2624)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !330, file: !331, line: 111, baseType: !185, size: 32, offset: 2656)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !330, file: !331, line: 112, baseType: !185, size: 32, offset: 2688)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !330, file: !331, line: 112, baseType: !185, size: 32, offset: 2720)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !330, file: !331, line: 113, baseType: !185, size: 32, offset: 2752)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !330, file: !331, line: 114, baseType: !185, size: 32, offset: 2784)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !330, file: !331, line: 114, baseType: !185, size: 32, offset: 2816)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !330, file: !331, line: 115, baseType: !232, size: 16, offset: 2848)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !330, file: !331, line: 115, baseType: !232, size: 16, offset: 2864)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !330, file: !331, line: 116, baseType: !232, size: 16, offset: 2880)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !330, file: !331, line: 117, baseType: !214, size: 8, offset: 2896)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !330, file: !331, line: 117, baseType: !214, size: 8, offset: 2904)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !330, file: !331, line: 119, baseType: !185, size: 32, offset: 2912)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !330, file: !331, line: 119, baseType: !185, size: 32, offset: 2944)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !330, file: !331, line: 120, baseType: !232, size: 16, offset: 2976)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !330, file: !331, line: 120, baseType: !232, size: 16, offset: 2992)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !330, file: !331, line: 121, baseType: !185, size: 32, offset: 3008)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !330, file: !331, line: 121, baseType: !185, size: 32, offset: 3040)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !330, file: !331, line: 122, baseType: !185, size: 32, offset: 3072)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !330, file: !331, line: 123, baseType: !185, size: 32, offset: 3104)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !330, file: !331, line: 124, baseType: !232, size: 16, offset: 3136)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !330, file: !331, line: 125, baseType: !232, size: 16, offset: 3152)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !330, file: !331, line: 127, baseType: !142, size: 32, offset: 3168)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !330, file: !331, line: 127, baseType: !142, size: 32, offset: 3200)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !330, file: !331, line: 128, baseType: !142, size: 32, offset: 3232)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !330, file: !331, line: 128, baseType: !142, size: 32, offset: 3264)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !330, file: !331, line: 129, baseType: !232, size: 16, offset: 3296)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !330, file: !331, line: 129, baseType: !232, size: 16, offset: 3312)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !330, file: !331, line: 129, baseType: !232, size: 16, offset: 3328)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !330, file: !331, line: 129, baseType: !232, size: 16, offset: 3344)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !330, file: !331, line: 130, baseType: !185, size: 32, offset: 3360)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !330, file: !331, line: 130, baseType: !185, size: 32, offset: 3392)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !330, file: !331, line: 130, baseType: !185, size: 32, offset: 3424)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !330, file: !331, line: 130, baseType: !185, size: 32, offset: 3456)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !330, file: !331, line: 131, baseType: !185, size: 32, offset: 3488)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !330, file: !331, line: 131, baseType: !185, size: 32, offset: 3520)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !330, file: !331, line: 131, baseType: !185, size: 32, offset: 3552)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !330, file: !331, line: 131, baseType: !185, size: 32, offset: 3584)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !330, file: !331, line: 132, baseType: !185, size: 32, offset: 3616)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !330, file: !331, line: 132, baseType: !185, size: 32, offset: 3648)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !330, file: !331, line: 133, baseType: !248, size: 512, offset: 3680)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !330, file: !331, line: 135, baseType: !185, size: 32, offset: 4192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !330, file: !331, line: 136, baseType: !185, size: 32, offset: 4224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !330, file: !331, line: 137, baseType: !185, size: 32, offset: 4256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !330, file: !331, line: 138, baseType: !142, size: 32, offset: 4288)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !330, file: !331, line: 141, baseType: !214, size: 8, offset: 4320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !330, file: !331, line: 141, baseType: !214, size: 8, offset: 4328)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !330, file: !331, line: 141, baseType: !214, size: 8, offset: 4336)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !330, file: !331, line: 141, baseType: !214, size: 8, offset: 4344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !330, file: !331, line: 142, baseType: !232, size: 16, offset: 4352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !330, file: !331, line: 142, baseType: !232, size: 16, offset: 4368)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !330, file: !331, line: 142, baseType: !232, size: 16, offset: 4384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !330, file: !331, line: 145, baseType: !214, size: 8, offset: 4400)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !330, file: !331, line: 145, baseType: !214, size: 8, offset: 4408)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !330, file: !331, line: 148, baseType: !232, size: 16, offset: 4416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !330, file: !331, line: 148, baseType: !232, size: 16, offset: 4432)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !330, file: !331, line: 149, baseType: !185, size: 32, offset: 4448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !330, file: !331, line: 149, baseType: !185, size: 32, offset: 4480)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !330, file: !331, line: 152, baseType: !452, size: 128, offset: 4512)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 128, elements: !453)
!453 = !{!187}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !330, file: !331, line: 153, baseType: !185, size: 32, offset: 4640)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !330, file: !331, line: 154, baseType: !185, size: 32, offset: 4672)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !330, file: !331, line: 157, baseType: !232, size: 16, offset: 4704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !330, file: !331, line: 157, baseType: !232, size: 16, offset: 4720)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !330, file: !331, line: 160, baseType: !459, size: 64, offset: 4736)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !461, line: 113, size: 6208, elements: !462)
!461 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!462 = !{!463, !464, !465, !466, !467, !468, !472}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !460, file: !461, line: 114, baseType: !232, size: 16)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !460, file: !461, line: 114, baseType: !232, size: 16, offset: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !460, file: !461, line: 115, baseType: !214, size: 8, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !460, file: !461, line: 115, baseType: !214, size: 8, offset: 40)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !460, file: !461, line: 116, baseType: !214, size: 8, offset: 48)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !460, file: !461, line: 117, baseType: !469, size: 8, offset: 56)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 8, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 1)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !460, file: !461, line: 119, baseType: !473, size: 6144, offset: 64)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 6144, elements: !483)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !461, line: 109, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !461, line: 106, size: 192, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !475, file: !461, line: 107, baseType: !185, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !475, file: !461, line: 107, baseType: !185, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !475, file: !461, line: 107, baseType: !185, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !475, file: !461, line: 107, baseType: !185, size: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !475, file: !461, line: 107, baseType: !185, size: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !475, file: !461, line: 108, baseType: !142, size: 32, offset: 160)
!483 = !{!484}
!484 = !DISubrange(count: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !330, file: !331, line: 161, baseType: !459, size: 64, offset: 4800)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !330, file: !331, line: 162, baseType: !214, size: 8, offset: 4864)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !330, file: !331, line: 162, baseType: !214, size: 8, offset: 4872)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !330, file: !331, line: 163, baseType: !214, size: 8, offset: 4880)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !330, file: !331, line: 163, baseType: !214, size: 8, offset: 4888)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !330, file: !331, line: 164, baseType: !232, size: 16, offset: 4896)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !330, file: !331, line: 164, baseType: !232, size: 16, offset: 4912)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !330, file: !331, line: 165, baseType: !185, size: 32, offset: 4928)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !330, file: !331, line: 165, baseType: !185, size: 32, offset: 4960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !330, file: !331, line: 167, baseType: !495, size: 1152, offset: 4992)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 1152, elements: !2826)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !461, line: 57, size: 2496, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !2625, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786, !2787, !2788, !2789, !2790, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !497, file: !461, line: 59, baseType: !232, size: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !497, file: !461, line: 59, baseType: !232, size: 16, offset: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !497, file: !461, line: 59, baseType: !232, size: 16, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !497, file: !461, line: 59, baseType: !232, size: 16, offset: 48)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !497, file: !461, line: 60, baseType: !504, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !127, line: 115, size: 11392, elements: !506)
!506 = !{!507, !508, !509, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !526, !536, !550, !551, !593, !594, !597, !598, !614, !615, !616, !617, !618, !619, !620, !622, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !700, !701, !702, !703, !704, !705, !706, !707, !708, !711, !714, !718, !719, !720, !721, !722, !725, !728, !731, !732, !738, !739, !740, !741, !742, !743, !745, !748, !751, !754, !2613, !2614}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !505, file: !127, line: 116, baseType: !194, size: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !505, file: !127, line: 117, baseType: !335, size: 64, offset: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !505, file: !127, line: 119, baseType: !510, size: 64, offset: 1024)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !127, line: 57, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !505, file: !127, line: 121, baseType: !232, size: 16, offset: 1088)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !505, file: !127, line: 121, baseType: !232, size: 16, offset: 1104)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !505, file: !127, line: 122, baseType: !142, size: 32, offset: 1120)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !505, file: !127, line: 122, baseType: !142, size: 32, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !505, file: !127, line: 122, baseType: !142, size: 32, offset: 1184)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !505, file: !127, line: 123, baseType: !248, size: 512, offset: 1216)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !505, file: !127, line: 124, baseType: !504, size: 64, offset: 1728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !505, file: !127, line: 124, baseType: !504, size: 64, offset: 1792)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !505, file: !127, line: 127, baseType: !504, size: 64, offset: 1856)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !505, file: !127, line: 127, baseType: !504, size: 64, offset: 1920)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !505, file: !127, line: 127, baseType: !504, size: 64, offset: 1984)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !505, file: !127, line: 128, baseType: !524, size: 64, offset: 2048)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !461, line: 46, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !505, file: !127, line: 130, baseType: !527, size: 64, offset: 2112)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !127, line: 97, size: 832, elements: !529)
!529 = !{!530, !534, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !528, file: !127, line: 98, baseType: !531, size: 768)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 768, elements: !532)
!532 = !{!533, !372}
!533 = !DISubrange(count: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !528, file: !127, line: 99, baseType: !142, size: 32, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !528, file: !127, line: 99, baseType: !142, size: 32, offset: 800)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !505, file: !127, line: 131, baseType: !537, size: 64, offset: 2176)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !539, line: 486, size: 1600, elements: !540)
!539 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !538, file: !539, line: 487, baseType: !194, size: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !538, file: !539, line: 489, baseType: !258, size: 128, offset: 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !538, file: !539, line: 490, baseType: !258, size: 128, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !538, file: !539, line: 491, baseType: !258, size: 128, offset: 1216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !538, file: !539, line: 492, baseType: !258, size: 128, offset: 1344)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !539, line: 494, baseType: !142, size: 32, offset: 1472)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !538, file: !539, line: 495, baseType: !142, size: 32, offset: 1504)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !538, file: !539, line: 497, baseType: !142, size: 32, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !538, file: !539, line: 498, baseType: !142, size: 32, offset: 1568)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !505, file: !127, line: 132, baseType: !537, size: 64, offset: 2240)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !505, file: !127, line: 133, baseType: !552, size: 64, offset: 2304)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !539, line: 334, size: 1728, elements: !554)
!554 = !{!555, !556, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !592}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !553, file: !539, line: 335, baseType: !258, size: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !553, file: !539, line: 336, baseType: !557, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !559, line: 48, flags: DIFlagFwdDecl)
!559 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !553, file: !539, line: 338, baseType: !232, size: 16, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !553, file: !539, line: 338, baseType: !232, size: 16, offset: 208)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !553, file: !539, line: 339, baseType: !7, size: 32, offset: 224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !553, file: !539, line: 340, baseType: !142, size: 32, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !553, file: !539, line: 342, baseType: !185, size: 32, offset: 288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !553, file: !539, line: 343, baseType: !370, size: 96, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !553, file: !539, line: 344, baseType: !370, size: 96, offset: 416)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !553, file: !539, line: 347, baseType: !258, size: 128, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !553, file: !539, line: 349, baseType: !142, size: 32, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !553, file: !539, line: 350, baseType: !142, size: 32, offset: 672)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !553, file: !539, line: 351, baseType: !177, size: 64, offset: 704)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !553, file: !539, line: 352, baseType: !177, size: 64, offset: 768)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !553, file: !539, line: 354, baseType: !573, size: 384, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !539, line: 116, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !539, line: 94, size: 384, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !574, file: !539, line: 96, baseType: !142, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !574, file: !539, line: 96, baseType: !142, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !574, file: !539, line: 97, baseType: !142, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !574, file: !539, line: 97, baseType: !142, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !574, file: !539, line: 99, baseType: !232, size: 16, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !574, file: !539, line: 100, baseType: !232, size: 16, offset: 144)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !574, file: !539, line: 102, baseType: !232, size: 16, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !574, file: !539, line: 105, baseType: !232, size: 16, offset: 176)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !574, file: !539, line: 108, baseType: !232, size: 16, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !574, file: !539, line: 109, baseType: !232, size: 16, offset: 208)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !574, file: !539, line: 111, baseType: !232, size: 16, offset: 224)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !574, file: !539, line: 112, baseType: !232, size: 16, offset: 240)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !574, file: !539, line: 114, baseType: !142, size: 32, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !574, file: !539, line: 114, baseType: !142, size: 32, offset: 288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !574, file: !539, line: 115, baseType: !142, size: 32, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !574, file: !539, line: 115, baseType: !142, size: 32, offset: 352)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !553, file: !539, line: 355, baseType: !248, size: 512, offset: 1216)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !505, file: !127, line: 134, baseType: !177, size: 64, offset: 2368)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !505, file: !127, line: 136, baseType: !595, size: 64, offset: 2432)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !141, line: 61, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !505, file: !127, line: 138, baseType: !573, size: 384, offset: 2496)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !505, file: !127, line: 139, baseType: !599, size: 64, offset: 2880)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !539, line: 80, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !539, line: 72, size: 192, elements: !602)
!602 = !{!603, !610, !611, !612, !613}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !601, file: !539, line: 73, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !539, line: 59, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !539, line: 56, size: 128, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !606, file: !539, line: 57, baseType: !370, size: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !606, file: !539, line: 58, baseType: !142, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !601, file: !539, line: 74, baseType: !142, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !601, file: !539, line: 76, baseType: !142, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !601, file: !539, line: 77, baseType: !142, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !539, line: 79, baseType: !142, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !505, file: !127, line: 141, baseType: !258, size: 128, offset: 2944)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !505, file: !127, line: 142, baseType: !258, size: 128, offset: 3072)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !505, file: !127, line: 143, baseType: !258, size: 128, offset: 3200)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !505, file: !127, line: 144, baseType: !258, size: 128, offset: 3328)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !505, file: !127, line: 146, baseType: !142, size: 32, offset: 3456)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !505, file: !127, line: 147, baseType: !142, size: 32, offset: 3488)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !505, file: !127, line: 150, baseType: !621, size: 64, offset: 3520)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !505, file: !127, line: 151, baseType: !623, size: 64, offset: 3584)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !505, file: !127, line: 152, baseType: !142, size: 32, offset: 3648)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !505, file: !127, line: 153, baseType: !142, size: 32, offset: 3680)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !505, file: !127, line: 156, baseType: !370, size: 96, offset: 3712)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !505, file: !127, line: 156, baseType: !370, size: 96, offset: 3808)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !505, file: !127, line: 156, baseType: !370, size: 96, offset: 3904)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !505, file: !127, line: 157, baseType: !370, size: 96, offset: 4000)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !505, file: !127, line: 158, baseType: !370, size: 96, offset: 4096)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !505, file: !127, line: 159, baseType: !370, size: 96, offset: 4192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !505, file: !127, line: 160, baseType: !370, size: 96, offset: 4288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !505, file: !127, line: 160, baseType: !370, size: 96, offset: 4384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !505, file: !127, line: 161, baseType: !452, size: 128, offset: 4480)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !505, file: !127, line: 161, baseType: !452, size: 128, offset: 4608)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !505, file: !127, line: 162, baseType: !370, size: 96, offset: 4736)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !505, file: !127, line: 162, baseType: !370, size: 96, offset: 4832)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !505, file: !127, line: 163, baseType: !185, size: 32, offset: 4928)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !505, file: !127, line: 163, baseType: !185, size: 32, offset: 4960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !505, file: !127, line: 164, baseType: !641, size: 512, offset: 4992)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 512, elements: !642)
!642 = !{!187, !187}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !505, file: !127, line: 165, baseType: !641, size: 512, offset: 5504)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !505, file: !127, line: 166, baseType: !641, size: 512, offset: 6016)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !505, file: !127, line: 167, baseType: !641, size: 512, offset: 6528)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !505, file: !127, line: 176, baseType: !641, size: 512, offset: 7040)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !505, file: !127, line: 178, baseType: !7, size: 32, offset: 7552)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !505, file: !127, line: 180, baseType: !232, size: 16, offset: 7584)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !505, file: !127, line: 181, baseType: !232, size: 16, offset: 7600)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !505, file: !127, line: 183, baseType: !232, size: 16, offset: 7616)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !505, file: !127, line: 183, baseType: !232, size: 16, offset: 7632)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !505, file: !127, line: 184, baseType: !232, size: 16, offset: 7648)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !505, file: !127, line: 184, baseType: !232, size: 16, offset: 7664)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !505, file: !127, line: 185, baseType: !232, size: 16, offset: 7680)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !505, file: !127, line: 186, baseType: !232, size: 16, offset: 7696)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !505, file: !127, line: 187, baseType: !232, size: 16, offset: 7712)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !505, file: !127, line: 188, baseType: !214, size: 8, offset: 7728)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !505, file: !127, line: 189, baseType: !214, size: 8, offset: 7736)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !505, file: !127, line: 192, baseType: !142, size: 32, offset: 7744)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !505, file: !127, line: 192, baseType: !142, size: 32, offset: 7776)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !505, file: !127, line: 192, baseType: !142, size: 32, offset: 7808)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !505, file: !127, line: 192, baseType: !142, size: 32, offset: 7840)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !505, file: !127, line: 194, baseType: !142, size: 32, offset: 7872)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !505, file: !127, line: 202, baseType: !185, size: 32, offset: 7904)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !505, file: !127, line: 202, baseType: !185, size: 32, offset: 7936)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !505, file: !127, line: 202, baseType: !185, size: 32, offset: 7968)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !505, file: !127, line: 211, baseType: !185, size: 32, offset: 8000)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !505, file: !127, line: 212, baseType: !185, size: 32, offset: 8032)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !505, file: !127, line: 213, baseType: !185, size: 32, offset: 8064)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !505, file: !127, line: 214, baseType: !185, size: 32, offset: 8096)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !505, file: !127, line: 215, baseType: !185, size: 32, offset: 8128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !505, file: !127, line: 216, baseType: !185, size: 32, offset: 8160)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !505, file: !127, line: 219, baseType: !185, size: 32, offset: 8192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !505, file: !127, line: 220, baseType: !185, size: 32, offset: 8224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !505, file: !127, line: 221, baseType: !185, size: 32, offset: 8256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !505, file: !127, line: 224, baseType: !677, size: 16, offset: 8288)
!677 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !505, file: !127, line: 224, baseType: !677, size: 16, offset: 8304)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !505, file: !127, line: 226, baseType: !232, size: 16, offset: 8320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !505, file: !127, line: 228, baseType: !214, size: 8, offset: 8336)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !505, file: !127, line: 229, baseType: !214, size: 8, offset: 8344)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !505, file: !127, line: 231, baseType: !232, size: 16, offset: 8352)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !505, file: !127, line: 232, baseType: !214, size: 8, offset: 8368)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !505, file: !127, line: 233, baseType: !214, size: 8, offset: 8376)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !505, file: !127, line: 234, baseType: !185, size: 32, offset: 8384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !505, file: !127, line: 235, baseType: !185, size: 32, offset: 8416)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !505, file: !127, line: 237, baseType: !258, size: 128, offset: 8448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !505, file: !127, line: 238, baseType: !258, size: 128, offset: 8576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !505, file: !127, line: 239, baseType: !258, size: 128, offset: 8704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !505, file: !127, line: 240, baseType: !258, size: 128, offset: 8832)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !505, file: !127, line: 242, baseType: !185, size: 32, offset: 8960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !505, file: !127, line: 244, baseType: !232, size: 16, offset: 8992)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !505, file: !127, line: 245, baseType: !677, size: 16, offset: 9008)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !505, file: !127, line: 246, baseType: !452, size: 128, offset: 9024)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !505, file: !127, line: 248, baseType: !142, size: 32, offset: 9152)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !505, file: !127, line: 249, baseType: !142, size: 32, offset: 9184)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !505, file: !127, line: 251, baseType: !698, size: 64, offset: 9216)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !127, line: 251, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !505, file: !127, line: 253, baseType: !214, size: 8, offset: 9280)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !505, file: !127, line: 254, baseType: !214, size: 8, offset: 9288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !505, file: !127, line: 255, baseType: !232, size: 16, offset: 9296)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !505, file: !127, line: 256, baseType: !370, size: 96, offset: 9312)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !505, file: !127, line: 258, baseType: !258, size: 128, offset: 9408)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !505, file: !127, line: 259, baseType: !258, size: 128, offset: 9536)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !505, file: !127, line: 260, baseType: !258, size: 128, offset: 9664)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !505, file: !127, line: 261, baseType: !258, size: 128, offset: 9792)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !505, file: !127, line: 263, baseType: !709, size: 64, offset: 9920)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !127, line: 52, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !505, file: !127, line: 264, baseType: !712, size: 64, offset: 9984)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !127, line: 53, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !505, file: !127, line: 265, baseType: !715, size: 64, offset: 10048)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !717, line: 43, flags: DIFlagFwdDecl)
!717 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!718 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !505, file: !127, line: 267, baseType: !214, size: 8, offset: 10112)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !505, file: !127, line: 268, baseType: !214, size: 8, offset: 10120)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !505, file: !127, line: 269, baseType: !232, size: 16, offset: 10128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !505, file: !127, line: 270, baseType: !185, size: 32, offset: 10144)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !505, file: !127, line: 272, baseType: !723, size: 64, offset: 10176)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !127, line: 54, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !505, file: !127, line: 275, baseType: !726, size: 64, offset: 10240)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !127, line: 275, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !505, file: !127, line: 277, baseType: !729, size: 64, offset: 10304)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !127, line: 56, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !505, file: !127, line: 277, baseType: !729, size: 64, offset: 10368)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !505, file: !127, line: 278, baseType: !733, size: 64, offset: 10432)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !734, line: 27, baseType: !735)
!734 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !736, line: 45, baseType: !737)
!736 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!737 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !505, file: !127, line: 279, baseType: !733, size: 64, offset: 10496)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !505, file: !127, line: 280, baseType: !7, size: 32, offset: 10560)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !505, file: !127, line: 281, baseType: !7, size: 32, offset: 10592)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !505, file: !127, line: 283, baseType: !258, size: 128, offset: 10624)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !505, file: !127, line: 284, baseType: !258, size: 128, offset: 10752)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !505, file: !127, line: 285, baseType: !744, size: 64, offset: 10880)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !505, file: !127, line: 287, baseType: !746, size: 64, offset: 10944)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !127, line: 59, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !505, file: !127, line: 288, baseType: !749, size: 64, offset: 11008)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !127, line: 288, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !505, file: !127, line: 290, baseType: !752, size: 64, offset: 11072)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 64, elements: !753)
!753 = !{!188}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !505, file: !127, line: 291, baseType: !755, size: 64, offset: 11136)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !51, line: 65, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !51, line: 50, size: 320, elements: !758)
!758 = !{!759, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2612}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !757, file: !51, line: 51, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !141, line: 1216, size: 39680, elements: !762)
!762 = !{!763, !764, !765, !766, !1487, !1488, !1489, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1860, !2231, !2234, !2475, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2497, !2498, !2499, !2500, !2501, !2509, !2576, !2583, !2584, !2591, !2592, !2593, !2594, !2595, !2596, !2597}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !761, file: !141, line: 1217, baseType: !194, size: 960)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !761, file: !141, line: 1218, baseType: !335, size: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !761, file: !141, line: 1220, baseType: !504, size: 64, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !761, file: !141, line: 1221, baseType: !767, size: 64, offset: 1088)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !769, line: 52, size: 4224, elements: !770)
!769 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !846, !860}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !768, file: !769, line: 53, baseType: !194, size: 960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !768, file: !769, line: 54, baseType: !335, size: 64, offset: 960)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !768, file: !769, line: 56, baseType: !232, size: 16, offset: 1024)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !768, file: !769, line: 56, baseType: !232, size: 16, offset: 1040)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !768, file: !769, line: 57, baseType: !232, size: 16, offset: 1056)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !768, file: !769, line: 57, baseType: !232, size: 16, offset: 1072)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !768, file: !769, line: 59, baseType: !185, size: 32, offset: 1088)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !768, file: !769, line: 59, baseType: !185, size: 32, offset: 1120)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !768, file: !769, line: 59, baseType: !185, size: 32, offset: 1152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !768, file: !769, line: 60, baseType: !185, size: 32, offset: 1184)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !768, file: !769, line: 60, baseType: !185, size: 32, offset: 1216)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !768, file: !769, line: 60, baseType: !185, size: 32, offset: 1248)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !768, file: !769, line: 61, baseType: !185, size: 32, offset: 1280)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !768, file: !769, line: 61, baseType: !185, size: 32, offset: 1312)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !768, file: !769, line: 61, baseType: !185, size: 32, offset: 1344)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !768, file: !769, line: 68, baseType: !185, size: 32, offset: 1376)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !768, file: !769, line: 68, baseType: !185, size: 32, offset: 1408)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !768, file: !769, line: 68, baseType: !185, size: 32, offset: 1440)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !768, file: !769, line: 69, baseType: !185, size: 32, offset: 1472)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !768, file: !769, line: 69, baseType: !185, size: 32, offset: 1504)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !768, file: !769, line: 74, baseType: !185, size: 32, offset: 1536)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !768, file: !769, line: 79, baseType: !185, size: 32, offset: 1568)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !768, file: !769, line: 81, baseType: !232, size: 16, offset: 1600)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !768, file: !769, line: 91, baseType: !232, size: 16, offset: 1616)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !768, file: !769, line: 92, baseType: !232, size: 16, offset: 1632)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !768, file: !769, line: 93, baseType: !232, size: 16, offset: 1648)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !768, file: !769, line: 94, baseType: !232, size: 16, offset: 1664)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !768, file: !769, line: 94, baseType: !232, size: 16, offset: 1680)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !768, file: !769, line: 94, baseType: !232, size: 16, offset: 1696)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !768, file: !769, line: 94, baseType: !232, size: 16, offset: 1712)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !768, file: !769, line: 96, baseType: !185, size: 32, offset: 1728)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !768, file: !769, line: 96, baseType: !185, size: 32, offset: 1760)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !768, file: !769, line: 96, baseType: !185, size: 32, offset: 1792)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !768, file: !769, line: 96, baseType: !185, size: 32, offset: 1824)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !768, file: !769, line: 98, baseType: !185, size: 32, offset: 1856)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !768, file: !769, line: 98, baseType: !185, size: 32, offset: 1888)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !768, file: !769, line: 98, baseType: !185, size: 32, offset: 1920)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !768, file: !769, line: 98, baseType: !185, size: 32, offset: 1952)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !768, file: !769, line: 99, baseType: !185, size: 32, offset: 1984)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !768, file: !769, line: 99, baseType: !185, size: 32, offset: 2016)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !768, file: !769, line: 100, baseType: !185, size: 32, offset: 2048)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !768, file: !769, line: 100, baseType: !185, size: 32, offset: 2080)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !768, file: !769, line: 103, baseType: !232, size: 16, offset: 2112)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !768, file: !769, line: 103, baseType: !232, size: 16, offset: 2128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !768, file: !769, line: 103, baseType: !232, size: 16, offset: 2144)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !768, file: !769, line: 103, baseType: !232, size: 16, offset: 2160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !768, file: !769, line: 106, baseType: !185, size: 32, offset: 2176)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !768, file: !769, line: 106, baseType: !185, size: 32, offset: 2208)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !768, file: !769, line: 106, baseType: !185, size: 32, offset: 2240)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !768, file: !769, line: 106, baseType: !185, size: 32, offset: 2272)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !768, file: !769, line: 107, baseType: !232, size: 16, offset: 2304)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !768, file: !769, line: 107, baseType: !232, size: 16, offset: 2320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !768, file: !769, line: 107, baseType: !232, size: 16, offset: 2336)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !768, file: !769, line: 107, baseType: !232, size: 16, offset: 2352)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !768, file: !769, line: 108, baseType: !185, size: 32, offset: 2368)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !768, file: !769, line: 108, baseType: !185, size: 32, offset: 2400)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !768, file: !769, line: 109, baseType: !185, size: 32, offset: 2432)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !768, file: !769, line: 109, baseType: !185, size: 32, offset: 2464)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !768, file: !769, line: 110, baseType: !185, size: 32, offset: 2496)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !768, file: !769, line: 110, baseType: !185, size: 32, offset: 2528)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !768, file: !769, line: 110, baseType: !185, size: 32, offset: 2560)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !768, file: !769, line: 111, baseType: !232, size: 16, offset: 2592)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !768, file: !769, line: 111, baseType: !232, size: 16, offset: 2608)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !768, file: !769, line: 112, baseType: !232, size: 16, offset: 2624)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !768, file: !769, line: 112, baseType: !232, size: 16, offset: 2640)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !768, file: !769, line: 112, baseType: !232, size: 16, offset: 2656)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !768, file: !769, line: 115, baseType: !232, size: 16, offset: 2672)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !768, file: !769, line: 118, baseType: !293, size: 64, offset: 2688)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !768, file: !769, line: 118, baseType: !293, size: 64, offset: 2752)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !768, file: !769, line: 121, baseType: !524, size: 64, offset: 2816)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !768, file: !769, line: 122, baseType: !495, size: 1152, offset: 2880)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !768, file: !769, line: 123, baseType: !232, size: 16, offset: 4032)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !768, file: !769, line: 123, baseType: !232, size: 16, offset: 4048)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !768, file: !769, line: 123, baseType: !845, size: 32, offset: 4064)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 32, elements: !753)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !768, file: !769, line: 126, baseType: !847, size: 64, offset: 4096)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !195, line: 159, size: 448, elements: !849)
!849 = !{!850, !852, !853, !854, !855, !858}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !848, file: !195, line: 161, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !753)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !848, file: !195, line: 162, baseType: !851, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !848, file: !195, line: 163, baseType: !845, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !848, file: !195, line: 164, baseType: !845, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !848, file: !195, line: 165, baseType: !856, size: 128, offset: 192)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !857, size: 128, elements: !753)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !848, file: !195, line: 166, baseType: !859, size: 128, offset: 320)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, elements: !753)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !768, file: !769, line: 129, baseType: !861, size: 64, offset: 4160)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !863, line: 328, size: 3456, elements: !864)
!863 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!864 = !{!865, !866, !867, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1465, !1466, !1467, !1470, !1474, !1478, !1482, !1483, !1484, !1485, !1486}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !862, file: !863, line: 329, baseType: !194, size: 960)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !862, file: !863, line: 330, baseType: !335, size: 64, offset: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !862, file: !863, line: 332, baseType: !868, size: 64, offset: 1024)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !870, line: 283, size: 4096, elements: !871)
!870 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!871 = !{!872, !873, !874, !875, !879, !880, !884, !1406, !1414, !1418, !1424, !1428, !1429, !1430, !1431, !1435, !1436}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !869, file: !870, line: 284, baseType: !142, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !869, file: !870, line: 285, baseType: !248, size: 512, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !869, file: !870, line: 287, baseType: !248, size: 512, offset: 544)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !869, file: !870, line: 288, baseType: !876, size: 2048, offset: 1056)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 2048, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !869, file: !870, line: 289, baseType: !142, size: 32, offset: 3104)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !869, file: !870, line: 292, baseType: !881, size: 64, offset: 3136)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !861}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !869, file: !870, line: 293, baseType: !885, size: 64, offset: 3200)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !861, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !863, line: 167, size: 3712, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !889, file: !863, line: 168, baseType: !888, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !889, file: !863, line: 168, baseType: !888, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !889, file: !863, line: 168, baseType: !888, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !889, file: !863, line: 170, baseType: !237, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !889, file: !863, line: 172, baseType: !896, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !870, line: 144, size: 6016, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !1074, !1075, !1076, !1209, !1213, !1217, !1218, !1289, !1293, !1297, !1298, !1299, !1300, !1304, !1305, !1309, !1313, !1317, !1321, !1325, !1329, !1333, !1334, !1341, !1343, !1352, !1361}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !897, file: !870, line: 145, baseType: !177, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !897, file: !870, line: 145, baseType: !177, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !897, file: !870, line: 146, baseType: !232, size: 16, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !897, file: !870, line: 148, baseType: !248, size: 512, offset: 144)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !897, file: !870, line: 149, baseType: !142, size: 32, offset: 672)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !897, file: !870, line: 151, baseType: !248, size: 512, offset: 704)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !897, file: !870, line: 152, baseType: !876, size: 2048, offset: 1216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !897, file: !870, line: 153, baseType: !142, size: 32, offset: 3264)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !897, file: !870, line: 155, baseType: !185, size: 32, offset: 3296)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !897, file: !870, line: 155, baseType: !185, size: 32, offset: 3328)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !897, file: !870, line: 155, baseType: !185, size: 32, offset: 3360)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !897, file: !870, line: 156, baseType: !185, size: 32, offset: 3392)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !897, file: !870, line: 156, baseType: !185, size: 32, offset: 3424)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !897, file: !870, line: 156, baseType: !185, size: 32, offset: 3456)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !897, file: !870, line: 157, baseType: !232, size: 16, offset: 3488)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !897, file: !870, line: 157, baseType: !232, size: 16, offset: 3504)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !897, file: !870, line: 157, baseType: !232, size: 16, offset: 3520)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !897, file: !870, line: 160, baseType: !917, size: 64, offset: 3584)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !870, line: 109, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !870, line: 98, size: 1408, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !1073}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !919, file: !870, line: 99, baseType: !142, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !919, file: !870, line: 99, baseType: !142, size: 32, offset: 32)
