; ModuleID = 'blender/source/blender/blenkernel/intern/scene.c'
source_filename = "blender/source/blender/blenkernel/intern/scene.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!195 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!196 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!197 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRigidBodyWorld_Flag", file: !199, line: 77, baseType: !7, size: 32, elements: !200)
!199 = !DIFile(filename: "blender/source/blender/makesdna/DNA_rigidbody_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!200 = !{!201, !202, !203}
!201 = !DIEnumerator(name: "RBW_FLAG_MUTED", value: 1, isUnsigned: true)
!202 = !DIEnumerator(name: "RBW_FLAG_NEEDS_REBUILD", value: 2, isUnsigned: true)
!203 = !DIEnumerator(name: "RBW_FLAG_USE_SPLIT_IMPULSE", value: 4, isUnsigned: true)
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !205, line: 1163, baseType: !7, size: 32, elements: !206)
!205 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!207 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!208 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!209 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!210 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!211 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!212 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!213 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!214 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!215 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!216 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!217 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!218 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!219 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!220 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!221 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!222 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!223 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!224 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!225 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!226 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!227 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!228 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !230, line: 123, baseType: !7, size: 32, elements: !231)
!230 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240}
!232 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!233 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!234 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!235 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!236 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!237 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!238 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!239 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!240 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TaskPriority", file: !242, line: 70, baseType: !7, size: 32, elements: !243)
!242 = !DIFile(filename: "blender/source/blender/blenlib/BLI_task.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!243 = !{!244, !245}
!244 = !DIEnumerator(name: "TASK_PRIORITY_LOW", value: 0, isUnsigned: true)
!245 = !DIEnumerator(name: "TASK_PRIORITY_HIGH", value: 1, isUnsigned: true)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 519, baseType: !7, size: 32, elements: !247)
!247 = !{!248, !249, !250, !251}
!248 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!249 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!250 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!251 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 592, baseType: !7, size: 32, elements: !253)
!253 = !{!254, !255}
!254 = !DIEnumerator(name: "OB_DEPS_EXTRA_OB_RECALC", value: 1, isUnsigned: true)
!255 = !DIEnumerator(name: "OB_DEPS_EXTRA_DATA_RECALC", value: 2, isUnsigned: true)
!256 = !{!257, !258, !327, !328, !3253, !3255, !164, !3281, !3283, !3284}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !260, line: 130, baseType: !261)
!260 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !260, line: 117, size: 960, elements: !262)
!262 = !{!263, !264, !265, !267, !286, !290, !292, !293, !294, !295}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !260, line: 118, baseType: !257, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !261, file: !260, line: 118, baseType: !257, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !261, file: !260, line: 119, baseType: !266, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !261, file: !260, line: 120, baseType: !268, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !260, line: 136, size: 17600, elements: !270)
!270 = !{!271, !272, !273, !276, !281, !282, !283}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !269, file: !260, line: 137, baseType: !259, size: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !269, file: !260, line: 138, baseType: !258, size: 64, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !269, file: !260, line: 139, baseType: !274, size: 64, offset: 1024)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !260, line: 43, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !260, line: 140, baseType: !277, size: 8192, offset: 1088)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 8192, elements: !279)
!278 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!279 = !{!280}
!280 = !DISubrange(count: 1024)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !269, file: !260, line: 141, baseType: !277, size: 8192, offset: 9280)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !269, file: !260, line: 148, baseType: !268, size: 64, offset: 17472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !269, file: !260, line: 150, baseType: !284, size: 64, offset: 17536)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !260, line: 45, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !260, line: 121, baseType: !287, size: 528, offset: 256)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 528, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 66)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !260, line: 126, baseType: !291, size: 16, offset: 784)
!291 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !261, file: !260, line: 127, baseType: !164, size: 32, offset: 800)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !261, file: !260, line: 128, baseType: !164, size: 32, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !261, file: !260, line: 128, baseType: !164, size: 32, offset: 864)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !261, file: !260, line: 129, baseType: !296, size: 64, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !260, line: 75, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !260, line: 62, size: 1024, elements: !299)
!299 = !{!300, !302, !303, !304, !305, !306, !310, !311, !325, !326}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !260, line: 63, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !298, file: !260, line: 63, baseType: !301, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !260, line: 64, baseType: !278, size: 8, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !298, file: !260, line: 64, baseType: !278, size: 8, offset: 136)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !260, line: 65, baseType: !291, size: 16, offset: 144)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !260, line: 66, baseType: !307, size: 512, offset: 160)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 512, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !298, file: !260, line: 67, baseType: !164, size: 32, offset: 672)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !260, line: 69, baseType: !312, size: 256, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !260, line: 60, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !260, line: 48, size: 256, elements: !314)
!314 = !{!315, !316, !323, !324}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !313, file: !260, line: 49, baseType: !257, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !313, file: !260, line: 58, baseType: !317, size: 128, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !318, line: 71, baseType: !319)
!318 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !318, line: 69, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !319, file: !318, line: 70, baseType: !257, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !319, file: !318, line: 70, baseType: !257, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !313, file: !260, line: 59, baseType: !164, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !313, file: !260, line: 59, baseType: !164, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !298, file: !260, line: 70, baseType: !164, size: 32, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !298, file: !260, line: 74, baseType: !164, size: 32, offset: 992)
!327 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !45, line: 1299, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !45, line: 1216, size: 39680, elements: !331)
!331 = !{!332, !333, !402, !2096, !2177, !2178, !2179, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2547, !2867, !2870, !3109, !3121, !3122, !3123, !3124, !3125, !3126, !3127, !3128, !3131, !3132, !3133, !3134, !3135, !3143, !3209, !3216, !3217, !3224, !3225, !3226, !3227, !3228, !3229, !3230}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !330, file: !45, line: 1217, baseType: !259, size: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !330, file: !45, line: 1218, baseType: !334, size: 64, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !158, line: 838, size: 768, elements: !336)
!336 = !{!337, !352, !353, !363, !364, !395, !396, !397, !398, !399, !400, !401}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !335, file: !158, line: 840, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !340, line: 499, baseType: !341)
!340 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !340, line: 486, size: 1600, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !341, file: !340, line: 487, baseType: !259, size: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !341, file: !340, line: 489, baseType: !317, size: 128, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !341, file: !340, line: 490, baseType: !317, size: 128, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !341, file: !340, line: 491, baseType: !317, size: 128, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !341, file: !340, line: 492, baseType: !317, size: 128, offset: 1344)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !340, line: 494, baseType: !164, size: 32, offset: 1472)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !341, file: !340, line: 495, baseType: !164, size: 32, offset: 1504)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !341, file: !340, line: 497, baseType: !164, size: 32, offset: 1536)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !341, file: !340, line: 498, baseType: !164, size: 32, offset: 1568)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !335, file: !158, line: 844, baseType: !338, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !335, file: !158, line: 848, baseType: !354, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !158, line: 549, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !158, line: 544, size: 320, elements: !357)
!357 = !{!358, !360, !361, !362}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !158, line: 545, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !356, file: !158, line: 545, baseType: !359, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !356, file: !158, line: 547, baseType: !338, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !356, file: !158, line: 548, baseType: !317, size: 128, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !335, file: !158, line: 851, baseType: !317, size: 128, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !335, file: !158, line: 853, baseType: !365, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !158, line: 594, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !158, line: 561, size: 1664, elements: !368)
!368 = !{!369, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !158, line: 562, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !367, file: !158, line: 562, baseType: !370, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !367, file: !158, line: 564, baseType: !317, size: 128, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !367, file: !158, line: 565, baseType: !338, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !367, file: !158, line: 566, baseType: !354, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !367, file: !158, line: 568, baseType: !317, size: 128, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !367, file: !158, line: 569, baseType: !317, size: 128, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !158, line: 571, baseType: !307, size: 512, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !367, file: !158, line: 573, baseType: !327, size: 32, offset: 1152)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !367, file: !158, line: 574, baseType: !327, size: 32, offset: 1184)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !367, file: !158, line: 576, baseType: !327, size: 32, offset: 1216)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !367, file: !158, line: 576, baseType: !327, size: 32, offset: 1248)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !367, file: !158, line: 577, baseType: !327, size: 32, offset: 1280)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !367, file: !158, line: 577, baseType: !327, size: 32, offset: 1312)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !367, file: !158, line: 579, baseType: !327, size: 32, offset: 1344)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !367, file: !158, line: 580, baseType: !327, size: 32, offset: 1376)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !367, file: !158, line: 582, baseType: !327, size: 32, offset: 1408)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !367, file: !158, line: 582, baseType: !327, size: 32, offset: 1440)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !367, file: !158, line: 583, baseType: !291, size: 16, offset: 1472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !367, file: !158, line: 585, baseType: !291, size: 16, offset: 1488)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !367, file: !158, line: 586, baseType: !291, size: 16, offset: 1504)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !158, line: 588, baseType: !291, size: 16, offset: 1520)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !367, file: !158, line: 590, baseType: !257, size: 64, offset: 1536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !158, line: 592, baseType: !164, size: 32, offset: 1600)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !367, file: !158, line: 593, baseType: !164, size: 32, offset: 1632)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !335, file: !158, line: 858, baseType: !317, size: 128, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !335, file: !158, line: 859, baseType: !317, size: 128, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !335, file: !158, line: 862, baseType: !164, size: 32, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !335, file: !158, line: 863, baseType: !164, size: 32, offset: 672)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !335, file: !158, line: 866, baseType: !291, size: 16, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !335, file: !158, line: 867, baseType: !291, size: 16, offset: 720)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !335, file: !158, line: 868, baseType: !327, size: 32, offset: 736)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !330, file: !45, line: 1220, baseType: !403, size: 64, offset: 1024)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !57, line: 115, size: 11392, elements: !405)
!405 = !{!406, !407, !408, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !692, !702, !704, !705, !745, !746, !749, !750, !766, !767, !768, !769, !770, !771, !772, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1992, !1995, !1996, !1997, !1998, !1999, !2000, !2003, !2006, !2009, !2010, !2016, !2017, !2018, !2019, !2020, !2021, !2023, !2046, !2080, !2081, !2084, !2085}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !404, file: !57, line: 116, baseType: !259, size: 960)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !404, file: !57, line: 117, baseType: !334, size: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !404, file: !57, line: 119, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !411, line: 155, size: 1856, elements: !412)
!411 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!412 = !{!413, !416, !420, !423, !426, !427, !428, !433, !437, !439, !443, !638, !639, !640, !642, !646, !649, !650, !651, !652, !653, !657, !658, !659, !661, !662, !666, !667, !670, !673, !674, !675, !676}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !410, file: !411, line: 157, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !411, line: 157, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !410, file: !411, line: 158, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !419, line: 52, flags: DIFlagFwdDecl)
!419 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !410, file: !411, line: 159, baseType: !421, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !419, line: 49, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !410, file: !411, line: 160, baseType: !424, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !419, line: 46, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !410, file: !411, line: 161, baseType: !164, size: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !410, file: !411, line: 161, baseType: !164, size: 32, offset: 288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !410, file: !411, line: 162, baseType: !429, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 96, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 3)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !410, file: !411, line: 163, baseType: !434, size: 64, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !436, line: 184, flags: DIFlagFwdDecl)
!436 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_object.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !410, file: !411, line: 164, baseType: !438, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !410, file: !411, line: 167, baseType: !440, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !411, line: 44, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !410, file: !411, line: 170, baseType: !444, size: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !446, line: 186, size: 8064, elements: !447)
!446 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !461, !462, !463, !464, !525, !529, !533, !534, !535, !536, !537, !538, !539, !540, !594, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !445, file: !446, line: 187, baseType: !164, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !445, file: !446, line: 187, baseType: !164, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !445, file: !446, line: 187, baseType: !164, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !445, file: !446, line: 187, baseType: !164, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !445, file: !446, line: 188, baseType: !164, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !445, file: !446, line: 188, baseType: !164, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !445, file: !446, line: 188, baseType: !164, size: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !445, file: !446, line: 193, baseType: !278, size: 8, offset: 224)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !445, file: !446, line: 197, baseType: !278, size: 8, offset: 232)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !445, file: !446, line: 201, baseType: !458, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !460, line: 71, flags: DIFlagFwdDecl)
!460 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!461 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !445, file: !446, line: 201, baseType: !458, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !445, file: !446, line: 201, baseType: !458, size: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !445, file: !446, line: 201, baseType: !458, size: 64, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !445, file: !446, line: 208, baseType: !465, size: 64, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !446, line: 103, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !446, line: 90, size: 448, elements: !469)
!469 = !{!470, !479, !484, !485, !486}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !468, file: !446, line: 91, baseType: !471, size: 128)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !446, line: 82, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !446, line: 64, size: 128, elements: !473)
!473 = !{!474, !475, !476, !477, !478}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !472, file: !446, line: 65, baseType: !257, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !472, file: !446, line: 66, baseType: !164, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !472, file: !446, line: 73, baseType: !278, size: 8, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !472, file: !446, line: 74, baseType: !278, size: 8, offset: 104)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !472, file: !446, line: 80, baseType: !278, size: 8, offset: 112)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !468, file: !446, line: 92, baseType: !480, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !446, line: 180, size: 16, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !481, file: !446, line: 181, baseType: !291, size: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !468, file: !446, line: 94, baseType: !430, size: 96, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !468, file: !446, line: 95, baseType: !430, size: 96, offset: 288)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !468, file: !446, line: 102, baseType: !487, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !446, line: 110, size: 640, elements: !489)
!489 = !{!490, !491, !492, !494, !495, !518, !524}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !488, file: !446, line: 111, baseType: !471, size: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !488, file: !446, line: 112, baseType: !480, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !488, file: !446, line: 114, baseType: !493, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !488, file: !446, line: 114, baseType: !493, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !488, file: !446, line: 118, baseType: !496, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !446, line: 125, size: 576, elements: !498)
!498 = !{!499, !500, !501, !502, !514, !515, !516, !517}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !497, file: !446, line: 126, baseType: !471, size: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !497, file: !446, line: 129, baseType: !493, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !497, file: !446, line: 130, baseType: !487, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !497, file: !446, line: 131, baseType: !503, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !446, line: 164, size: 448, elements: !505)
!505 = !{!506, !507, !508, !511, !512, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !504, file: !446, line: 165, baseType: !471, size: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !504, file: !446, line: 166, baseType: !480, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !504, file: !446, line: 172, baseType: !509, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !446, line: 140, baseType: !497)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !504, file: !446, line: 174, baseType: !164, size: 32, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !504, file: !446, line: 175, baseType: !430, size: 96, offset: 288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !504, file: !446, line: 176, baseType: !291, size: 16, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !497, file: !446, line: 135, baseType: !496, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !497, file: !446, line: 135, baseType: !496, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !446, line: 139, baseType: !496, size: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !497, file: !446, line: 139, baseType: !496, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !488, file: !446, line: 122, baseType: !519, size: 128, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !446, line: 108, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !446, line: 106, size: 128, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !446, line: 107, baseType: !487, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !520, file: !446, line: 107, baseType: !487, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !488, file: !446, line: 122, baseType: !519, size: 128, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !445, file: !446, line: 209, baseType: !526, size: 64, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !446, line: 123, baseType: !488)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !445, file: !446, line: 210, baseType: !530, size: 64, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !446, line: 178, baseType: !504)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !445, file: !446, line: 213, baseType: !164, size: 32, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !445, file: !446, line: 214, baseType: !164, size: 32, offset: 736)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !445, file: !446, line: 215, baseType: !164, size: 32, offset: 768)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !445, file: !446, line: 218, baseType: !458, size: 64, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !445, file: !446, line: 218, baseType: !458, size: 64, offset: 896)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !445, file: !446, line: 218, baseType: !458, size: 64, offset: 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !445, file: !446, line: 220, baseType: !164, size: 32, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !445, file: !446, line: 221, baseType: !541, size: 64, offset: 1088)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !543)
!543 = !{!544, !580, !581, !587, !590, !591, !593}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !542, file: !6, line: 191, baseType: !545, size: 5120)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 5120, elements: !578)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !547)
!547 = !{!548, !551, !553, !563, !564}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !546, file: !6, line: 148, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !546, file: !6, line: 149, baseType: !552, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !546, file: !6, line: 150, baseType: !554, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !556)
!556 = !{!557, !559, !561}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !555, file: !6, line: 139, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !555, file: !6, line: 140, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !555, file: !6, line: 141, baseType: !562, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !546, file: !6, line: 152, baseType: !164, size: 32, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !546, file: !6, line: 162, baseType: !565, size: 128, offset: 192)
!565 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !546, file: !6, line: 155, size: 128, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !573}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !565, file: !6, line: 156, baseType: !164, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !565, file: !6, line: 157, baseType: !327, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !565, file: !6, line: 158, baseType: !257, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !565, file: !6, line: 159, baseType: !430, size: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !565, file: !6, line: 160, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !565, file: !6, line: 161, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !576, line: 48, baseType: !577)
!576 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !340, line: 47, flags: DIFlagFwdDecl)
!578 = !{!579}
!579 = !DISubrange(count: 16)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !542, file: !6, line: 192, baseType: !545, size: 5120, offset: 5120)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !542, file: !6, line: 193, baseType: !582, size: 64, offset: 10240)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !585, !541}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !446, line: 246, baseType: !445)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !542, file: !6, line: 194, baseType: !588, size: 64, offset: 10304)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !6, line: 194, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !542, file: !6, line: 195, baseType: !164, size: 32, offset: 10368)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !542, file: !6, line: 196, baseType: !592, size: 32, offset: 10400)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !542, file: !6, line: 197, baseType: !164, size: 32, offset: 10432)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !445, file: !446, line: 223, baseType: !595, size: 1600, offset: 1152)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !460, line: 73, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !460, line: 64, size: 1600, elements: !597)
!597 = !{!598, !613, !617, !618, !619, !620, !621}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !596, file: !460, line: 65, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !460, line: 53, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !460, line: 42, size: 832, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !460, line: 43, baseType: !164, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !601, file: !460, line: 44, baseType: !164, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !460, line: 45, baseType: !164, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !601, file: !460, line: 46, baseType: !164, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !601, file: !460, line: 47, baseType: !164, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !601, file: !460, line: 48, baseType: !164, size: 32, offset: 160)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !601, file: !460, line: 49, baseType: !164, size: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !601, file: !460, line: 50, baseType: !164, size: 32, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !601, file: !460, line: 51, baseType: !307, size: 512, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !601, file: !460, line: 52, baseType: !257, size: 64, offset: 768)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !596, file: !460, line: 66, baseType: !614, size: 1312, offset: 64)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1312, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 41)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !596, file: !460, line: 69, baseType: !164, size: 32, offset: 1376)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !596, file: !460, line: 69, baseType: !164, size: 32, offset: 1408)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !596, file: !460, line: 70, baseType: !164, size: 32, offset: 1440)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !596, file: !460, line: 71, baseType: !458, size: 64, offset: 1472)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !596, file: !460, line: 72, baseType: !622, size: 64, offset: 1536)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !460, line: 59, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !460, line: 57, size: 8192, elements: !625)
!625 = !{!626}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !624, file: !460, line: 58, baseType: !277, size: 8192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !445, file: !446, line: 223, baseType: !595, size: 1600, offset: 2752)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !445, file: !446, line: 223, baseType: !595, size: 1600, offset: 4352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !445, file: !446, line: 223, baseType: !595, size: 1600, offset: 5952)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !445, file: !446, line: 233, baseType: !291, size: 16, offset: 7552)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !445, file: !446, line: 236, baseType: !164, size: 32, offset: 7584)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !445, file: !446, line: 238, baseType: !164, size: 32, offset: 7616)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !445, file: !446, line: 238, baseType: !164, size: 32, offset: 7648)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !445, file: !446, line: 239, baseType: !317, size: 128, offset: 7680)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !445, file: !446, line: 241, baseType: !531, size: 64, offset: 7808)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !445, file: !446, line: 243, baseType: !317, size: 128, offset: 7872)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !445, file: !446, line: 245, baseType: !257, size: 64, offset: 8000)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !410, file: !411, line: 171, baseType: !164, size: 32, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !410, file: !411, line: 172, baseType: !164, size: 32, offset: 672)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !410, file: !411, line: 173, baseType: !641, size: 8, offset: 704)
!641 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !410, file: !411, line: 175, baseType: !643, size: 64, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !645, line: 33, flags: DIFlagFwdDecl)
!645 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !410, file: !411, line: 178, baseType: !647, size: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !411, line: 55, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !410, file: !411, line: 179, baseType: !641, size: 8, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !410, file: !411, line: 182, baseType: !641, size: 8, offset: 904)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !410, file: !411, line: 183, baseType: !429, size: 64, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !410, file: !411, line: 184, baseType: !429, size: 64, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !410, file: !411, line: 185, baseType: !654, size: 64, offset: 1088)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 288, elements: !656)
!656 = !{!432, !432}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !410, file: !411, line: 188, baseType: !641, size: 8, offset: 1152)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !410, file: !411, line: 191, baseType: !7, size: 32, offset: 1184)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !410, file: !411, line: 191, baseType: !660, size: 64, offset: 1216)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !410, file: !411, line: 191, baseType: !7, size: 32, offset: 1280)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !410, file: !411, line: 192, baseType: !663, size: 64, offset: 1344)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !665, line: 47, flags: DIFlagFwdDecl)
!665 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!666 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !410, file: !411, line: 195, baseType: !429, size: 64, offset: 1408)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !410, file: !411, line: 197, baseType: !668, size: 64, offset: 1472)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !411, line: 197, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !410, file: !411, line: 198, baseType: !671, size: 64, offset: 1536)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !411, line: 59, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !410, file: !411, line: 201, baseType: !641, size: 8, offset: 1600)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !410, file: !411, line: 202, baseType: !430, size: 96, offset: 1632)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !410, file: !411, line: 204, baseType: !430, size: 96, offset: 1728)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !410, file: !411, line: 205, baseType: !164, size: 32, offset: 1824)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !404, file: !57, line: 121, baseType: !291, size: 16, offset: 1088)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !404, file: !57, line: 121, baseType: !291, size: 16, offset: 1104)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !404, file: !57, line: 122, baseType: !164, size: 32, offset: 1120)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !404, file: !57, line: 122, baseType: !164, size: 32, offset: 1152)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !404, file: !57, line: 122, baseType: !164, size: 32, offset: 1184)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !404, file: !57, line: 123, baseType: !307, size: 512, offset: 1216)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !404, file: !57, line: 124, baseType: !403, size: 64, offset: 1728)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !404, file: !57, line: 124, baseType: !403, size: 64, offset: 1792)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !404, file: !57, line: 127, baseType: !403, size: 64, offset: 1856)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !404, file: !57, line: 127, baseType: !403, size: 64, offset: 1920)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !404, file: !57, line: 127, baseType: !403, size: 64, offset: 1984)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !404, file: !57, line: 128, baseType: !689, size: 64, offset: 2048)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !691, line: 46, flags: DIFlagFwdDecl)
!691 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !404, file: !57, line: 130, baseType: !693, size: 64, offset: 2112)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !57, line: 97, size: 832, elements: !695)
!695 = !{!696, !700, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !694, file: !57, line: 98, baseType: !697, size: 768)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 768, elements: !698)
!698 = !{!699, !432}
!699 = !DISubrange(count: 8)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !694, file: !57, line: 99, baseType: !164, size: 32, offset: 768)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !694, file: !57, line: 99, baseType: !164, size: 32, offset: 800)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !404, file: !57, line: 131, baseType: !703, size: 64, offset: 2176)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !404, file: !57, line: 132, baseType: !703, size: 64, offset: 2240)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !404, file: !57, line: 133, baseType: !706, size: 64, offset: 2304)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !340, line: 334, size: 1728, elements: !708)
!708 = !{!709, !710, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !744}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !707, file: !340, line: 335, baseType: !317, size: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !707, file: !340, line: 336, baseType: !711, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !707, file: !340, line: 338, baseType: !291, size: 16, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !707, file: !340, line: 338, baseType: !291, size: 16, offset: 208)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !707, file: !340, line: 339, baseType: !7, size: 32, offset: 224)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !707, file: !340, line: 340, baseType: !164, size: 32, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !707, file: !340, line: 342, baseType: !327, size: 32, offset: 288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !707, file: !340, line: 343, baseType: !430, size: 96, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !707, file: !340, line: 344, baseType: !430, size: 96, offset: 416)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !707, file: !340, line: 347, baseType: !317, size: 128, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !707, file: !340, line: 349, baseType: !164, size: 32, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !707, file: !340, line: 350, baseType: !164, size: 32, offset: 672)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !707, file: !340, line: 351, baseType: !257, size: 64, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !707, file: !340, line: 352, baseType: !257, size: 64, offset: 768)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !707, file: !340, line: 354, baseType: !725, size: 384, offset: 832)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !340, line: 116, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !340, line: 94, size: 384, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !726, file: !340, line: 96, baseType: !164, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !726, file: !340, line: 96, baseType: !164, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !726, file: !340, line: 97, baseType: !164, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !726, file: !340, line: 97, baseType: !164, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !726, file: !340, line: 99, baseType: !291, size: 16, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !726, file: !340, line: 100, baseType: !291, size: 16, offset: 144)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !726, file: !340, line: 102, baseType: !291, size: 16, offset: 160)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !726, file: !340, line: 105, baseType: !291, size: 16, offset: 176)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !726, file: !340, line: 108, baseType: !291, size: 16, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !726, file: !340, line: 109, baseType: !291, size: 16, offset: 208)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !726, file: !340, line: 111, baseType: !291, size: 16, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !726, file: !340, line: 112, baseType: !291, size: 16, offset: 240)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !726, file: !340, line: 114, baseType: !164, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !726, file: !340, line: 114, baseType: !164, size: 32, offset: 288)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !726, file: !340, line: 115, baseType: !164, size: 32, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !726, file: !340, line: 115, baseType: !164, size: 32, offset: 352)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !707, file: !340, line: 355, baseType: !307, size: 512, offset: 1216)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !57, line: 134, baseType: !257, size: 64, offset: 2368)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !404, file: !57, line: 136, baseType: !747, size: 64, offset: 2432)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !45, line: 61, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !404, file: !57, line: 138, baseType: !725, size: 384, offset: 2496)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !404, file: !57, line: 139, baseType: !751, size: 64, offset: 2880)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !340, line: 80, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !340, line: 72, size: 192, elements: !754)
!754 = !{!755, !762, !763, !764, !765}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !753, file: !340, line: 73, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !340, line: 59, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !340, line: 56, size: 128, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !758, file: !340, line: 57, baseType: !430, size: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !758, file: !340, line: 58, baseType: !164, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !753, file: !340, line: 74, baseType: !164, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !753, file: !340, line: 76, baseType: !164, size: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !753, file: !340, line: 77, baseType: !164, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !753, file: !340, line: 79, baseType: !164, size: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !404, file: !57, line: 141, baseType: !317, size: 128, offset: 2944)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !404, file: !57, line: 142, baseType: !317, size: 128, offset: 3072)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !404, file: !57, line: 143, baseType: !317, size: 128, offset: 3200)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !404, file: !57, line: 144, baseType: !317, size: 128, offset: 3328)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !404, file: !57, line: 146, baseType: !164, size: 32, offset: 3456)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !404, file: !57, line: 147, baseType: !164, size: 32, offset: 3488)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !404, file: !57, line: 150, baseType: !773, size: 64, offset: 3520)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !776, line: 93, size: 7552, elements: !777)
!776 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !826, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !895, !896, !897, !898, !899, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !1857, !1858, !1859, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1905}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !775, file: !776, line: 94, baseType: !259, size: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !775, file: !776, line: 95, baseType: !334, size: 64, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !775, file: !776, line: 97, baseType: !291, size: 16, offset: 1024)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !775, file: !776, line: 97, baseType: !291, size: 16, offset: 1040)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !775, file: !776, line: 99, baseType: !327, size: 32, offset: 1056)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !775, file: !776, line: 99, baseType: !327, size: 32, offset: 1088)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !775, file: !776, line: 99, baseType: !327, size: 32, offset: 1120)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !775, file: !776, line: 100, baseType: !327, size: 32, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !775, file: !776, line: 100, baseType: !327, size: 32, offset: 1184)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !775, file: !776, line: 100, baseType: !327, size: 32, offset: 1216)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !775, file: !776, line: 101, baseType: !327, size: 32, offset: 1248)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !775, file: !776, line: 101, baseType: !327, size: 32, offset: 1280)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !775, file: !776, line: 101, baseType: !327, size: 32, offset: 1312)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !775, file: !776, line: 102, baseType: !327, size: 32, offset: 1344)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !775, file: !776, line: 102, baseType: !327, size: 32, offset: 1376)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !775, file: !776, line: 102, baseType: !327, size: 32, offset: 1408)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !775, file: !776, line: 103, baseType: !327, size: 32, offset: 1440)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !775, file: !776, line: 103, baseType: !327, size: 32, offset: 1472)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !775, file: !776, line: 103, baseType: !327, size: 32, offset: 1504)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !775, file: !776, line: 103, baseType: !327, size: 32, offset: 1536)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !775, file: !776, line: 103, baseType: !327, size: 32, offset: 1568)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !775, file: !776, line: 104, baseType: !327, size: 32, offset: 1600)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !775, file: !776, line: 104, baseType: !327, size: 32, offset: 1632)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !775, file: !776, line: 104, baseType: !327, size: 32, offset: 1664)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !775, file: !776, line: 104, baseType: !327, size: 32, offset: 1696)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !775, file: !776, line: 104, baseType: !327, size: 32, offset: 1728)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !775, file: !776, line: 105, baseType: !327, size: 32, offset: 1760)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !775, file: !776, line: 108, baseType: !806, size: 704, offset: 1792)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !776, line: 53, size: 704, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !806, file: !776, line: 54, baseType: !327, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !806, file: !776, line: 55, baseType: !327, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !806, file: !776, line: 56, baseType: !327, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !806, file: !776, line: 57, baseType: !327, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !806, file: !776, line: 59, baseType: !430, size: 96, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !806, file: !776, line: 60, baseType: !430, size: 96, offset: 224)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !806, file: !776, line: 61, baseType: !430, size: 96, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !806, file: !776, line: 63, baseType: !327, size: 32, offset: 416)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !806, file: !776, line: 64, baseType: !327, size: 32, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !806, file: !776, line: 65, baseType: !327, size: 32, offset: 480)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !806, file: !776, line: 67, baseType: !291, size: 16, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !806, file: !776, line: 68, baseType: !291, size: 16, offset: 528)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !806, file: !776, line: 69, baseType: !291, size: 16, offset: 544)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !806, file: !776, line: 70, baseType: !291, size: 16, offset: 560)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !806, file: !776, line: 72, baseType: !327, size: 32, offset: 576)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !806, file: !776, line: 73, baseType: !327, size: 32, offset: 608)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !806, file: !776, line: 74, baseType: !327, size: 32, offset: 640)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !806, file: !776, line: 75, baseType: !327, size: 32, offset: 672)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !775, file: !776, line: 109, baseType: !827, size: 128, offset: 2496)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !776, line: 79, size: 128, elements: !828)
!828 = !{!829, !830, !831, !832}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !827, file: !776, line: 80, baseType: !164, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !827, file: !776, line: 81, baseType: !164, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !827, file: !776, line: 82, baseType: !164, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !827, file: !776, line: 83, baseType: !164, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !775, file: !776, line: 111, baseType: !327, size: 32, offset: 2624)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !775, file: !776, line: 111, baseType: !327, size: 32, offset: 2656)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !775, file: !776, line: 112, baseType: !327, size: 32, offset: 2688)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !775, file: !776, line: 112, baseType: !327, size: 32, offset: 2720)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !775, file: !776, line: 113, baseType: !327, size: 32, offset: 2752)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !775, file: !776, line: 114, baseType: !327, size: 32, offset: 2784)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !775, file: !776, line: 114, baseType: !327, size: 32, offset: 2816)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !775, file: !776, line: 115, baseType: !291, size: 16, offset: 2848)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !775, file: !776, line: 115, baseType: !291, size: 16, offset: 2864)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !775, file: !776, line: 116, baseType: !291, size: 16, offset: 2880)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !775, file: !776, line: 117, baseType: !278, size: 8, offset: 2896)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !775, file: !776, line: 117, baseType: !278, size: 8, offset: 2904)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !775, file: !776, line: 119, baseType: !327, size: 32, offset: 2912)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !775, file: !776, line: 119, baseType: !327, size: 32, offset: 2944)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !775, file: !776, line: 120, baseType: !291, size: 16, offset: 2976)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !775, file: !776, line: 120, baseType: !291, size: 16, offset: 2992)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !775, file: !776, line: 121, baseType: !327, size: 32, offset: 3008)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !775, file: !776, line: 121, baseType: !327, size: 32, offset: 3040)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !775, file: !776, line: 122, baseType: !327, size: 32, offset: 3072)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !775, file: !776, line: 123, baseType: !327, size: 32, offset: 3104)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !775, file: !776, line: 124, baseType: !291, size: 16, offset: 3136)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !775, file: !776, line: 125, baseType: !291, size: 16, offset: 3152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !775, file: !776, line: 127, baseType: !164, size: 32, offset: 3168)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !775, file: !776, line: 127, baseType: !164, size: 32, offset: 3200)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !775, file: !776, line: 128, baseType: !164, size: 32, offset: 3232)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !775, file: !776, line: 128, baseType: !164, size: 32, offset: 3264)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !775, file: !776, line: 129, baseType: !291, size: 16, offset: 3296)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !775, file: !776, line: 129, baseType: !291, size: 16, offset: 3312)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !775, file: !776, line: 129, baseType: !291, size: 16, offset: 3328)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !775, file: !776, line: 129, baseType: !291, size: 16, offset: 3344)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !775, file: !776, line: 130, baseType: !327, size: 32, offset: 3360)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !775, file: !776, line: 130, baseType: !327, size: 32, offset: 3392)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !775, file: !776, line: 130, baseType: !327, size: 32, offset: 3424)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !775, file: !776, line: 130, baseType: !327, size: 32, offset: 3456)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !775, file: !776, line: 131, baseType: !327, size: 32, offset: 3488)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !775, file: !776, line: 131, baseType: !327, size: 32, offset: 3520)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !775, file: !776, line: 131, baseType: !327, size: 32, offset: 3552)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !775, file: !776, line: 131, baseType: !327, size: 32, offset: 3584)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !775, file: !776, line: 132, baseType: !327, size: 32, offset: 3616)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !775, file: !776, line: 132, baseType: !327, size: 32, offset: 3648)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !775, file: !776, line: 133, baseType: !307, size: 512, offset: 3680)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !775, file: !776, line: 135, baseType: !327, size: 32, offset: 4192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !775, file: !776, line: 136, baseType: !327, size: 32, offset: 4224)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !775, file: !776, line: 137, baseType: !327, size: 32, offset: 4256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !775, file: !776, line: 138, baseType: !164, size: 32, offset: 4288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !775, file: !776, line: 141, baseType: !278, size: 8, offset: 4320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !775, file: !776, line: 141, baseType: !278, size: 8, offset: 4328)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !775, file: !776, line: 141, baseType: !278, size: 8, offset: 4336)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !775, file: !776, line: 141, baseType: !278, size: 8, offset: 4344)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !775, file: !776, line: 142, baseType: !291, size: 16, offset: 4352)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !775, file: !776, line: 142, baseType: !291, size: 16, offset: 4368)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !775, file: !776, line: 142, baseType: !291, size: 16, offset: 4384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !775, file: !776, line: 145, baseType: !278, size: 8, offset: 4400)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !775, file: !776, line: 145, baseType: !278, size: 8, offset: 4408)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !775, file: !776, line: 148, baseType: !291, size: 16, offset: 4416)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !775, file: !776, line: 148, baseType: !291, size: 16, offset: 4432)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !775, file: !776, line: 149, baseType: !327, size: 32, offset: 4448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !775, file: !776, line: 149, baseType: !327, size: 32, offset: 4480)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !775, file: !776, line: 152, baseType: !892, size: 128, offset: 4512)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 128, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 4)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !775, file: !776, line: 153, baseType: !327, size: 32, offset: 4640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !775, file: !776, line: 154, baseType: !327, size: 32, offset: 4672)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !775, file: !776, line: 157, baseType: !291, size: 16, offset: 4704)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !775, file: !776, line: 157, baseType: !291, size: 16, offset: 4720)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !775, file: !776, line: 160, baseType: !900, size: 64, offset: 4736)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !691, line: 113, size: 6208, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908, !912}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !901, file: !691, line: 114, baseType: !291, size: 16)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !901, file: !691, line: 114, baseType: !291, size: 16, offset: 16)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !901, file: !691, line: 115, baseType: !278, size: 8, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !901, file: !691, line: 115, baseType: !278, size: 8, offset: 40)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !901, file: !691, line: 116, baseType: !278, size: 8, offset: 48)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !901, file: !691, line: 117, baseType: !909, size: 8, offset: 56)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 8, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 1)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !901, file: !691, line: 119, baseType: !913, size: 6144, offset: 64)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 6144, elements: !923)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !691, line: 109, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !691, line: 106, size: 192, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !922}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !915, file: !691, line: 107, baseType: !327, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !915, file: !691, line: 107, baseType: !327, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !915, file: !691, line: 107, baseType: !327, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !915, file: !691, line: 107, baseType: !327, size: 32, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !915, file: !691, line: 107, baseType: !327, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !915, file: !691, line: 108, baseType: !164, size: 32, offset: 160)
!923 = !{!924}
!924 = !DISubrange(count: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !775, file: !776, line: 161, baseType: !900, size: 64, offset: 4800)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !775, file: !776, line: 162, baseType: !278, size: 8, offset: 4864)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !775, file: !776, line: 162, baseType: !278, size: 8, offset: 4872)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !775, file: !776, line: 163, baseType: !278, size: 8, offset: 4880)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !775, file: !776, line: 163, baseType: !278, size: 8, offset: 4888)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !775, file: !776, line: 164, baseType: !291, size: 16, offset: 4896)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !775, file: !776, line: 164, baseType: !291, size: 16, offset: 4912)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !775, file: !776, line: 165, baseType: !327, size: 32, offset: 4928)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !775, file: !776, line: 165, baseType: !327, size: 32, offset: 4960)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !775, file: !776, line: 167, baseType: !935, size: 1152, offset: 4992)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 1152, elements: !1855)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !691, line: 57, size: 2496, elements: !938)
!938 = !{!939, !940, !941, !942, !943, !944, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !937, file: !691, line: 59, baseType: !291, size: 16)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !937, file: !691, line: 59, baseType: !291, size: 16, offset: 16)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !937, file: !691, line: 59, baseType: !291, size: 16, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !937, file: !691, line: 59, baseType: !291, size: 16, offset: 48)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !937, file: !691, line: 60, baseType: !403, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !937, file: !691, line: 61, baseType: !945, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !691, line: 202, size: 3328, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1018, !1591, !1592, !1669, !1670, !1696, !1697, !1765, !1786, !1794, !1795}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !946, file: !691, line: 203, baseType: !259, size: 960)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !946, file: !691, line: 204, baseType: !334, size: 64, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !946, file: !691, line: 206, baseType: !327, size: 32, offset: 1024)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !946, file: !691, line: 206, baseType: !327, size: 32, offset: 1056)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !946, file: !691, line: 207, baseType: !327, size: 32, offset: 1088)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !946, file: !691, line: 207, baseType: !327, size: 32, offset: 1120)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !946, file: !691, line: 207, baseType: !327, size: 32, offset: 1152)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !946, file: !691, line: 207, baseType: !327, size: 32, offset: 1184)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !946, file: !691, line: 207, baseType: !327, size: 32, offset: 1216)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !946, file: !691, line: 207, baseType: !327, size: 32, offset: 1248)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !946, file: !691, line: 208, baseType: !327, size: 32, offset: 1280)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !946, file: !691, line: 208, baseType: !327, size: 32, offset: 1312)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !946, file: !691, line: 211, baseType: !327, size: 32, offset: 1344)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !946, file: !691, line: 211, baseType: !327, size: 32, offset: 1376)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !946, file: !691, line: 211, baseType: !327, size: 32, offset: 1408)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !946, file: !691, line: 211, baseType: !327, size: 32, offset: 1440)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !946, file: !691, line: 211, baseType: !327, size: 32, offset: 1472)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !946, file: !691, line: 214, baseType: !327, size: 32, offset: 1504)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !946, file: !691, line: 214, baseType: !327, size: 32, offset: 1536)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !946, file: !691, line: 217, baseType: !327, size: 32, offset: 1568)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !946, file: !691, line: 218, baseType: !327, size: 32, offset: 1600)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !946, file: !691, line: 219, baseType: !327, size: 32, offset: 1632)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !946, file: !691, line: 220, baseType: !327, size: 32, offset: 1664)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !946, file: !691, line: 221, baseType: !327, size: 32, offset: 1696)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !946, file: !691, line: 222, baseType: !291, size: 16, offset: 1728)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !946, file: !691, line: 222, baseType: !291, size: 16, offset: 1744)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !946, file: !691, line: 224, baseType: !291, size: 16, offset: 1760)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !946, file: !691, line: 224, baseType: !291, size: 16, offset: 1776)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !946, file: !691, line: 227, baseType: !291, size: 16, offset: 1792)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !946, file: !691, line: 227, baseType: !291, size: 16, offset: 1808)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !946, file: !691, line: 229, baseType: !291, size: 16, offset: 1824)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !946, file: !691, line: 229, baseType: !291, size: 16, offset: 1840)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !946, file: !691, line: 230, baseType: !291, size: 16, offset: 1856)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !946, file: !691, line: 230, baseType: !291, size: 16, offset: 1872)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !946, file: !691, line: 232, baseType: !327, size: 32, offset: 1888)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !946, file: !691, line: 232, baseType: !327, size: 32, offset: 1920)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !946, file: !691, line: 232, baseType: !327, size: 32, offset: 1952)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !946, file: !691, line: 232, baseType: !327, size: 32, offset: 1984)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !946, file: !691, line: 233, baseType: !164, size: 32, offset: 2016)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !946, file: !691, line: 234, baseType: !164, size: 32, offset: 2048)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !946, file: !691, line: 235, baseType: !291, size: 16, offset: 2080)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !946, file: !691, line: 235, baseType: !291, size: 16, offset: 2096)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !946, file: !691, line: 236, baseType: !291, size: 16, offset: 2112)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !946, file: !691, line: 239, baseType: !291, size: 16, offset: 2128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !946, file: !691, line: 240, baseType: !164, size: 32, offset: 2144)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !946, file: !691, line: 241, baseType: !164, size: 32, offset: 2176)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !946, file: !691, line: 241, baseType: !164, size: 32, offset: 2208)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !946, file: !691, line: 241, baseType: !164, size: 32, offset: 2240)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !946, file: !691, line: 243, baseType: !327, size: 32, offset: 2272)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !946, file: !691, line: 243, baseType: !327, size: 32, offset: 2304)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !946, file: !691, line: 244, baseType: !327, size: 32, offset: 2336)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !946, file: !691, line: 246, baseType: !1000, size: 320, offset: 2368)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1001, line: 50, size: 320, elements: !1002)
!1001 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1002 = !{!1003, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1000, file: !1001, line: 51, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1000, file: !1001, line: 53, baseType: !164, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1000, file: !1001, line: 54, baseType: !164, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1000, file: !1001, line: 55, baseType: !164, size: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1000, file: !1001, line: 55, baseType: !164, size: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1000, file: !1001, line: 56, baseType: !278, size: 8, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1000, file: !1001, line: 56, baseType: !278, size: 8, offset: 200)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1000, file: !1001, line: 57, baseType: !278, size: 8, offset: 208)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1000, file: !1001, line: 57, baseType: !278, size: 8, offset: 216)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1000, file: !1001, line: 59, baseType: !291, size: 16, offset: 224)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1000, file: !1001, line: 59, baseType: !291, size: 16, offset: 240)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1000, file: !1001, line: 59, baseType: !291, size: 16, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1000, file: !1001, line: 61, baseType: !291, size: 16, offset: 272)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1000, file: !1001, line: 63, baseType: !164, size: 32, offset: 288)
