; ModuleID = 'blender/source/blender/editors/render/render_view.c'
source_filename = "blender/source/blender/editors/render/render_view.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!1 = !DIFile(filename: "blender/source/blender/editors/render/render_view.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !29, !50, !59}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !4, line: 1163, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!7 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!22 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!23 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!24 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!26 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!27 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!28 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceImage_Flag", file: !4, line: 777, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!31 = !DIEnumerator(name: "SI_EDITTILE", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "SI_CLIP_UV", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "SI_NO_DRAWFACES", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "SI_DRAWSHADOW", value: 32, isUnsigned: true)
!35 = !DIEnumerator(name: "SI_COORDFLOATS", value: 512, isUnsigned: true)
!36 = !DIEnumerator(name: "SI_PIXELSNAP", value: 1024, isUnsigned: true)
!37 = !DIEnumerator(name: "SI_LIVE_UNWRAP", value: 2048, isUnsigned: true)
!38 = !DIEnumerator(name: "SI_USE_ALPHA", value: 4096, isUnsigned: true)
!39 = !DIEnumerator(name: "SI_SHOW_ALPHA", value: 8192, isUnsigned: true)
!40 = !DIEnumerator(name: "SI_SHOW_ZBUF", value: 16384, isUnsigned: true)
!41 = !DIEnumerator(name: "SI_PREVSPACE", value: 32768, isUnsigned: true)
!42 = !DIEnumerator(name: "SI_FULLWINDOW", value: 65536, isUnsigned: true)
!43 = !DIEnumerator(name: "SI_DRAW_TILE", value: 524288, isUnsigned: true)
!44 = !DIEnumerator(name: "SI_SMOOTH_UV", value: 1048576, isUnsigned: true)
!45 = !DIEnumerator(name: "SI_DRAW_STRETCH", value: 2097152, isUnsigned: true)
!46 = !DIEnumerator(name: "SI_SHOW_GPENCIL", value: 4194304, isUnsigned: true)
!47 = !DIEnumerator(name: "SI_DRAW_OTHER", value: 8388608, isUnsigned: true)
!48 = !DIEnumerator(name: "SI_COLOR_CORRECTION", value: 16777216, isUnsigned: true)
!49 = !DIEnumerator(name: "SI_NO_DRAW_TEXPAINT", value: 33554432, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 351, baseType: !5, size: 32, elements: !52)
!51 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = !{!53, !54, !55, !56, !57, !58}
!53 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!57 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!58 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 292, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "SCREENNORMAL", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "SCREENMAXIMIZED", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "SCREENFULL", value: 2, isUnsigned: true)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrArea", file: !60, line: 228, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrArea", file: !60, line: 203, size: 1280, elements: !70)
!70 = !{!71, !73, !74, !93, !94, !95, !96, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1635, !1636, !1637, !1638}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !69, file: !60, line: 204, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !69, file: !60, line: 204, baseType: !72, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !69, file: !60, line: 206, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrVert", file: !60, line: 87, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrVert", file: !60, line: 82, size: 256, elements: !78)
!78 = !{!79, !81, !82, !83, !91, !92}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !60, line: 83, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !60, line: 83, baseType: !80, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "newv", scope: !77, file: !60, line: 83, baseType: !80, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !77, file: !60, line: 84, baseType: !84, size: 32, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec2s", file: !85, line: 43, baseType: !86)
!85 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec2s", file: !85, line: 41, size: 32, elements: !87)
!87 = !{!88, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !86, file: !85, line: 42, baseType: !89, size: 16)
!89 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !86, file: !85, line: 42, baseType: !89, size: 16, offset: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !77, file: !60, line: 86, baseType: !89, size: 16, offset: 224)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !77, file: !60, line: 86, baseType: !89, size: 16, offset: 240)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !69, file: !60, line: 206, baseType: !75, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !69, file: !60, line: 206, baseType: !75, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !69, file: !60, line: 206, baseType: !75, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !69, file: !60, line: 207, baseType: !97, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "bScreen", file: !60, line: 80, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !60, line: 49, size: 1984, elements: !100)
!100 = !{!101, !171, !172, !173, !174, !175, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1502}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !99, file: !60, line: 50, baseType: !102, size: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !103, line: 130, baseType: !104)
!103 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !103, line: 117, size: 960, elements: !105)
!105 = !{!106, !107, !108, !110, !130, !134, !135, !137, !138, !139}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !103, line: 118, baseType: !66, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !103, line: 118, baseType: !66, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !104, file: !103, line: 119, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !104, file: !103, line: 120, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !103, line: 136, size: 17600, elements: !113)
!113 = !{!114, !115, !117, !120, !125, !126, !127}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !103, line: 137, baseType: !102, size: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !112, file: !103, line: 138, baseType: !116, size: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !112, file: !103, line: 139, baseType: !118, size: 64, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !103, line: 43, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !103, line: 140, baseType: !121, size: 8192, offset: 1088)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 8192, elements: !123)
!122 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!123 = !{!124}
!124 = !DISubrange(count: 1024)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !112, file: !103, line: 141, baseType: !121, size: 8192, offset: 9280)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !112, file: !103, line: 148, baseType: !111, size: 64, offset: 17472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !112, file: !103, line: 150, baseType: !128, size: 64, offset: 17536)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !103, line: 45, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !103, line: 121, baseType: !131, size: 528, offset: 256)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 528, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 66)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !104, file: !103, line: 126, baseType: !89, size: 16, offset: 784)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !104, file: !103, line: 127, baseType: !136, size: 32, offset: 800)
!136 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !104, file: !103, line: 128, baseType: !136, size: 32, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !104, file: !103, line: 128, baseType: !136, size: 32, offset: 864)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !104, file: !103, line: 129, baseType: !140, size: 64, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !103, line: 75, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !103, line: 62, size: 1024, elements: !143)
!143 = !{!144, !146, !147, !148, !149, !150, !154, !155, !169, !170}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !103, line: 63, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !142, file: !103, line: 63, baseType: !145, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !103, line: 64, baseType: !122, size: 8, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !142, file: !103, line: 64, baseType: !122, size: 8, offset: 136)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !142, file: !103, line: 65, baseType: !89, size: 16, offset: 144)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !103, line: 66, baseType: !151, size: 512, offset: 160)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 512, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !142, file: !103, line: 67, baseType: !136, size: 32, offset: 672)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !103, line: 69, baseType: !156, size: 256, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !103, line: 60, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !103, line: 48, size: 256, elements: !158)
!158 = !{!159, !160, !167, !168}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !157, file: !103, line: 49, baseType: !66, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !157, file: !103, line: 58, baseType: !161, size: 128, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !162, line: 71, baseType: !163)
!162 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !162, line: 69, size: 128, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !163, file: !162, line: 70, baseType: !66, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !163, file: !162, line: 70, baseType: !66, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !157, file: !103, line: 59, baseType: !136, size: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !157, file: !103, line: 59, baseType: !136, size: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !142, file: !103, line: 70, baseType: !136, size: 32, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !142, file: !103, line: 74, baseType: !136, size: 32, offset: 992)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !99, file: !60, line: 52, baseType: !161, size: 128, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !99, file: !60, line: 53, baseType: !161, size: 128, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !99, file: !60, line: 54, baseType: !161, size: 128, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !99, file: !60, line: 55, baseType: !161, size: 128, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !99, file: !60, line: 57, baseType: !176, size: 64, offset: 1472)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !178, line: 1216, size: 39680, elements: !179)
!178 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!179 = !{!180, !181, !184, !187, !190, !191, !192, !204, !205, !210, !211, !212, !213, !214, !215, !216, !217, !218, !222, !301, !740, !955, !958, !1247, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1269, !1270, !1271, !1272, !1273, !1281, !1348, !1355, !1356, !1363, !1364, !1370, !1371, !1372, !1373, !1374}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !177, file: !178, line: 1217, baseType: !102, size: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !177, file: !178, line: 1218, baseType: !182, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !178, line: 58, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !177, file: !178, line: 1220, baseType: !185, size: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !178, line: 50, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !177, file: !178, line: 1221, baseType: !188, size: 64, offset: 1088)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !178, line: 52, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !177, file: !178, line: 1223, baseType: !176, size: 64, offset: 1152)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !177, file: !178, line: 1225, baseType: !161, size: 128, offset: 1216)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !177, file: !178, line: 1226, baseType: !193, size: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !178, line: 69, size: 320, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !178, line: 70, baseType: !193, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !194, file: !178, line: 70, baseType: !193, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !194, file: !178, line: 71, baseType: !5, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !194, file: !178, line: 71, baseType: !5, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !194, file: !178, line: 72, baseType: !136, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !194, file: !178, line: 73, baseType: !89, size: 16, offset: 224)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !194, file: !178, line: 73, baseType: !89, size: 16, offset: 240)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !194, file: !178, line: 74, baseType: !185, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !177, file: !178, line: 1227, baseType: !185, size: 64, offset: 1408)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !177, file: !178, line: 1229, baseType: !206, size: 96, offset: 1472)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !208)
!207 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!208 = !{!209}
!209 = !DISubrange(count: 3)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !177, file: !178, line: 1230, baseType: !206, size: 96, offset: 1568)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !177, file: !178, line: 1231, baseType: !206, size: 96, offset: 1664)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !177, file: !178, line: 1231, baseType: !206, size: 96, offset: 1760)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !177, file: !178, line: 1233, baseType: !5, size: 32, offset: 1856)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !177, file: !178, line: 1234, baseType: !136, size: 32, offset: 1888)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !177, file: !178, line: 1235, baseType: !5, size: 32, offset: 1920)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !178, line: 1237, baseType: !89, size: 16, offset: 1952)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !177, file: !178, line: 1239, baseType: !122, size: 8, offset: 1968)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !177, file: !178, line: 1240, baseType: !219, size: 8, offset: 1976)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 8, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 1)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !177, file: !178, line: 1242, baseType: !223, size: 64, offset: 1984)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !225, line: 328, size: 3456, elements: !226)
!225 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!226 = !{!227, !228, !229, !232, !233, !237, !240, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !266, !267, !268, !271, !276, !277, !280, !284, !289, !293, !297, !298, !299, !300}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !224, file: !225, line: 329, baseType: !102, size: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !224, file: !225, line: 330, baseType: !182, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !224, file: !225, line: 332, baseType: !230, size: 64, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !225, line: 332, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !224, file: !225, line: 333, baseType: !151, size: 512, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !224, file: !225, line: 335, baseType: !234, size: 64, offset: 1600)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !236, line: 41, flags: DIFlagFwdDecl)
!236 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !224, file: !225, line: 337, baseType: !238, size: 64, offset: 1664)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !178, line: 61, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !224, file: !225, line: 338, baseType: !241, size: 64, offset: 1728)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !224, file: !225, line: 340, baseType: !161, size: 128, offset: 1792)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !224, file: !225, line: 340, baseType: !161, size: 128, offset: 1920)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !224, file: !225, line: 342, baseType: !136, size: 32, offset: 2048)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !224, file: !225, line: 342, baseType: !136, size: 32, offset: 2080)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !224, file: !225, line: 343, baseType: !136, size: 32, offset: 2112)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !224, file: !225, line: 345, baseType: !136, size: 32, offset: 2144)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !224, file: !225, line: 346, baseType: !136, size: 32, offset: 2176)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !224, file: !225, line: 347, baseType: !89, size: 16, offset: 2208)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !224, file: !225, line: 348, baseType: !89, size: 16, offset: 2224)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !224, file: !225, line: 349, baseType: !136, size: 32, offset: 2240)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !224, file: !225, line: 351, baseType: !136, size: 32, offset: 2272)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !224, file: !225, line: 353, baseType: !89, size: 16, offset: 2304)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !224, file: !225, line: 354, baseType: !89, size: 16, offset: 2320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !224, file: !225, line: 355, baseType: !136, size: 32, offset: 2336)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !224, file: !225, line: 357, baseType: !259, size: 128, offset: 2368)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !85, line: 95, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !85, line: 92, size: 128, elements: !261)
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !260, file: !85, line: 93, baseType: !207, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !260, file: !85, line: 93, baseType: !207, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !260, file: !85, line: 94, baseType: !207, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !260, file: !85, line: 94, baseType: !207, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !224, file: !225, line: 363, baseType: !161, size: 128, offset: 2496)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !224, file: !225, line: 363, baseType: !161, size: 128, offset: 2624)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !224, file: !225, line: 368, baseType: !269, size: 64, offset: 2752)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !225, line: 48, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !224, file: !225, line: 372, baseType: !272, size: 32, offset: 2816)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !225, line: 274, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !225, line: 271, size: 32, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !273, file: !225, line: 273, baseType: !5, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !224, file: !225, line: 373, baseType: !136, size: 32, offset: 2848)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !224, file: !225, line: 382, baseType: !278, size: 64, offset: 2880)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !225, line: 46, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !224, file: !225, line: 385, baseType: !281, size: 64, offset: 2944)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !66, !207}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !224, file: !225, line: 386, baseType: !285, size: 64, offset: 3008)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !66, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !224, file: !225, line: 387, baseType: !290, size: 64, offset: 3072)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!136, !66}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !224, file: !225, line: 388, baseType: !294, size: 64, offset: 3136)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !66}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !224, file: !225, line: 389, baseType: !66, size: 64, offset: 3200)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !224, file: !225, line: 389, baseType: !66, size: 64, offset: 3264)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !224, file: !225, line: 389, baseType: !66, size: 64, offset: 3328)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !224, file: !225, line: 389, baseType: !66, size: 64, offset: 3392)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !177, file: !178, line: 1244, baseType: !302, size: 64, offset: 2048)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !304, line: 200, size: 17024, elements: !305)
!304 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = !{!306, !308, !309, !310, !733, !734, !735, !736, !737, !738, !739}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !303, file: !304, line: 201, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !303, file: !304, line: 202, baseType: !161, size: 128, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !303, file: !304, line: 203, baseType: !161, size: 128, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !303, file: !304, line: 206, baseType: !311, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !304, line: 190, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !304, line: 126, size: 2816, elements: !314)
!314 = !{!315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !414, !418, !419, !420, !704, !708, !709, !710, !711, !712, !713, !714, !715, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !732}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !304, line: 127, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !304, line: 127, baseType: !316, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !313, file: !304, line: 128, baseType: !66, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !313, file: !304, line: 129, baseType: !66, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !304, line: 130, baseType: !151, size: 512, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !313, file: !304, line: 132, baseType: !136, size: 32, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !313, file: !304, line: 132, baseType: !136, size: 32, offset: 800)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !313, file: !304, line: 133, baseType: !136, size: 32, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !313, file: !304, line: 134, baseType: !136, size: 32, offset: 864)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !313, file: !304, line: 134, baseType: !136, size: 32, offset: 896)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !313, file: !304, line: 134, baseType: !136, size: 32, offset: 928)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !313, file: !304, line: 135, baseType: !136, size: 32, offset: 960)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !313, file: !304, line: 135, baseType: !136, size: 32, offset: 992)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !313, file: !304, line: 136, baseType: !136, size: 32, offset: 1024)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !313, file: !304, line: 136, baseType: !136, size: 32, offset: 1056)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !313, file: !304, line: 137, baseType: !136, size: 32, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !313, file: !304, line: 137, baseType: !136, size: 32, offset: 1120)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !313, file: !304, line: 138, baseType: !207, size: 32, offset: 1152)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !313, file: !304, line: 139, baseType: !207, size: 32, offset: 1184)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !313, file: !304, line: 139, baseType: !207, size: 32, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !313, file: !304, line: 141, baseType: !89, size: 16, offset: 1248)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !313, file: !304, line: 142, baseType: !89, size: 16, offset: 1264)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !313, file: !304, line: 143, baseType: !136, size: 32, offset: 1280)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !313, file: !304, line: 144, baseType: !136, size: 32, offset: 1312)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !313, file: !304, line: 146, baseType: !341, size: 64, offset: 1344)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !304, line: 114, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !304, line: 99, size: 7232, elements: !344)
!344 = !{!345, !347, !348, !349, !350, !351, !352, !363, !367, !382, !391, !398, !408}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !304, line: 100, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !343, file: !304, line: 100, baseType: !346, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !343, file: !304, line: 101, baseType: !136, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !343, file: !304, line: 101, baseType: !136, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !343, file: !304, line: 102, baseType: !136, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !343, file: !304, line: 102, baseType: !136, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !343, file: !304, line: 103, baseType: !353, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !304, line: 59, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !304, line: 56, size: 2112, elements: !356)
!356 = !{!357, !361, !362}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !355, file: !304, line: 57, baseType: !358, size: 2048)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 2048, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !355, file: !304, line: 58, baseType: !136, size: 32, offset: 2048)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !355, file: !304, line: 58, baseType: !136, size: 32, offset: 2080)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !343, file: !304, line: 106, baseType: !364, size: 6144, offset: 320)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 6144, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 768)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !343, file: !304, line: 107, baseType: !368, size: 64, offset: 6464)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !304, line: 97, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !304, line: 83, size: 8320, elements: !371)
!371 = !{!372, !373, !374, !378, !379, !380, !381}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !370, file: !304, line: 84, baseType: !364, size: 6144)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !370, file: !304, line: 87, baseType: !358, size: 2048, offset: 6144)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !370, file: !304, line: 88, baseType: !375, size: 64, offset: 8192)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !377, line: 41, flags: DIFlagFwdDecl)
!377 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !370, file: !304, line: 90, baseType: !89, size: 16, offset: 8256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !370, file: !304, line: 92, baseType: !89, size: 16, offset: 8272)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !370, file: !304, line: 93, baseType: !89, size: 16, offset: 8288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !370, file: !304, line: 95, baseType: !89, size: 16, offset: 8304)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !343, file: !304, line: 108, baseType: !383, size: 64, offset: 6528)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !304, line: 66, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !304, line: 61, size: 128, elements: !386)
!386 = !{!387, !388, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !385, file: !304, line: 62, baseType: !136, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !385, file: !304, line: 63, baseType: !136, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !385, file: !304, line: 64, baseType: !136, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !385, file: !304, line: 65, baseType: !136, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !343, file: !304, line: 109, baseType: !392, size: 64, offset: 6592)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !304, line: 71, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !304, line: 68, size: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !394, file: !304, line: 69, baseType: !136, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !394, file: !304, line: 70, baseType: !136, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !343, file: !304, line: 110, baseType: !399, size: 64, offset: 6656)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !304, line: 81, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !304, line: 73, size: 352, elements: !402)
!402 = !{!403, !404, !405, !406, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !401, file: !304, line: 74, baseType: !206, size: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !401, file: !304, line: 75, baseType: !206, size: 96, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !401, file: !304, line: 76, baseType: !206, size: 96, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !304, line: 77, baseType: !136, size: 32, offset: 288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !401, file: !304, line: 78, baseType: !136, size: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !343, file: !304, line: 113, baseType: !409, size: 512, offset: 6720)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !410, line: 182, baseType: !411)
!410 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !410, line: 180, size: 512, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !410, line: 181, baseType: !151, size: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !313, file: !304, line: 148, baseType: !415, size: 64, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !417, line: 46, flags: DIFlagFwdDecl)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !313, file: !304, line: 151, baseType: !176, size: 64, offset: 1472)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !313, file: !304, line: 152, baseType: !185, size: 64, offset: 1536)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !313, file: !304, line: 153, baseType: !421, size: 64, offset: 1600)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !423, line: 64, size: 19136, elements: !424)
!423 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = !{!425, !426, !427, !428, !429, !430, !432, !433, !434, !435, !438, !439, !690, !691, !699, !700, !701, !702, !703}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !422, file: !423, line: 65, baseType: !102, size: 960)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !422, file: !423, line: 66, baseType: !182, size: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !422, file: !423, line: 68, baseType: !121, size: 8192, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !422, file: !423, line: 70, baseType: !136, size: 32, offset: 9216)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !422, file: !423, line: 71, baseType: !136, size: 32, offset: 9248)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !422, file: !423, line: 72, baseType: !431, size: 64, offset: 9280)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 64, elements: !242)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !422, file: !423, line: 74, baseType: !207, size: 32, offset: 9344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !422, file: !423, line: 74, baseType: !207, size: 32, offset: 9376)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !422, file: !423, line: 76, baseType: !375, size: 64, offset: 9408)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !422, file: !423, line: 77, baseType: !436, size: 64, offset: 9472)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !423, line: 77, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !422, file: !423, line: 78, baseType: !238, size: 64, offset: 9536)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !422, file: !423, line: 80, baseType: !440, size: 2624, offset: 9600)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !441, line: 340, size: 2624, elements: !442)
!441 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!442 = !{!443, !471, !489, !490, !491, !509, !567, !568, !670, !671, !672, !673, !679}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !440, file: !441, line: 341, baseType: !444, size: 576)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !441, line: 251, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !441, line: 207, size: 576, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !441, line: 208, baseType: !136, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !445, file: !441, line: 211, baseType: !89, size: 16, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !445, file: !441, line: 212, baseType: !89, size: 16, offset: 48)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !445, file: !441, line: 213, baseType: !207, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !445, file: !441, line: 214, baseType: !89, size: 16, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !445, file: !441, line: 215, baseType: !89, size: 16, offset: 112)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !445, file: !441, line: 216, baseType: !89, size: 16, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !445, file: !441, line: 217, baseType: !89, size: 16, offset: 144)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !445, file: !441, line: 218, baseType: !89, size: 16, offset: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !445, file: !441, line: 219, baseType: !89, size: 16, offset: 176)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !445, file: !441, line: 220, baseType: !207, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !445, file: !441, line: 222, baseType: !89, size: 16, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !445, file: !441, line: 225, baseType: !89, size: 16, offset: 240)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !445, file: !441, line: 228, baseType: !136, size: 32, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !445, file: !441, line: 229, baseType: !136, size: 32, offset: 288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !445, file: !441, line: 233, baseType: !136, size: 32, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !445, file: !441, line: 236, baseType: !89, size: 16, offset: 352)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !445, file: !441, line: 236, baseType: !89, size: 16, offset: 368)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !445, file: !441, line: 241, baseType: !207, size: 32, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !445, file: !441, line: 244, baseType: !136, size: 32, offset: 416)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !445, file: !441, line: 244, baseType: !136, size: 32, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !445, file: !441, line: 245, baseType: !207, size: 32, offset: 480)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !445, file: !441, line: 248, baseType: !207, size: 32, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !445, file: !441, line: 250, baseType: !136, size: 32, offset: 544)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !440, file: !441, line: 342, baseType: !472, size: 448, offset: 576)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !441, line: 79, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !441, line: 61, size: 448, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !473, file: !441, line: 62, baseType: !66, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !473, file: !441, line: 64, baseType: !89, size: 16, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !473, file: !441, line: 65, baseType: !89, size: 16, offset: 80)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !473, file: !441, line: 67, baseType: !207, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !473, file: !441, line: 68, baseType: !207, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !473, file: !441, line: 69, baseType: !207, size: 32, offset: 160)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !473, file: !441, line: 70, baseType: !89, size: 16, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !473, file: !441, line: 71, baseType: !89, size: 16, offset: 208)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !473, file: !441, line: 72, baseType: !241, size: 64, offset: 224)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !473, file: !441, line: 75, baseType: !207, size: 32, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !473, file: !441, line: 75, baseType: !207, size: 32, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !473, file: !441, line: 75, baseType: !207, size: 32, offset: 352)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !473, file: !441, line: 78, baseType: !207, size: 32, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !473, file: !441, line: 78, baseType: !207, size: 32, offset: 416)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !440, file: !441, line: 343, baseType: !161, size: 128, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !440, file: !441, line: 344, baseType: !161, size: 128, offset: 1152)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !440, file: !441, line: 345, baseType: !492, size: 192, offset: 1280)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !441, line: 278, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !441, line: 270, size: 192, elements: !494)
!494 = !{!495, !496, !497, !498, !499}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !493, file: !441, line: 271, baseType: !136, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !493, file: !441, line: 273, baseType: !207, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !493, file: !441, line: 275, baseType: !136, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !493, file: !441, line: 276, baseType: !136, size: 32, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !493, file: !441, line: 277, baseType: !500, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !441, line: 55, size: 576, elements: !502)
!502 = !{!503, !504, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !501, file: !441, line: 56, baseType: !136, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !501, file: !441, line: 57, baseType: !207, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !501, file: !441, line: 58, baseType: !506, size: 512, offset: 64)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 512, elements: !507)
!507 = !{!508, !508}
!508 = !DISubrange(count: 4)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !440, file: !441, line: 346, baseType: !510, size: 384, offset: 1472)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !441, line: 268, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !441, line: 253, size: 384, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !561, !562, !563, !564, !565, !566}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !511, file: !441, line: 254, baseType: !136, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !511, file: !441, line: 255, baseType: !136, size: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !511, file: !441, line: 255, baseType: !136, size: 32, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !511, file: !441, line: 258, baseType: !207, size: 32, offset: 96)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !511, file: !441, line: 259, baseType: !518, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !441, line: 164, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !441, line: 108, size: 1664, elements: !521)
!521 = !{!522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !441, line: 109, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !520, file: !441, line: 109, baseType: !523, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !520, file: !441, line: 111, baseType: !151, size: 512, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !520, file: !441, line: 119, baseType: !241, size: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !520, file: !441, line: 119, baseType: !241, size: 64, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !520, file: !441, line: 125, baseType: !241, size: 64, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !520, file: !441, line: 125, baseType: !241, size: 64, offset: 832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !520, file: !441, line: 127, baseType: !241, size: 64, offset: 896)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !520, file: !441, line: 130, baseType: !136, size: 32, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !520, file: !441, line: 131, baseType: !136, size: 32, offset: 992)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !520, file: !441, line: 132, baseType: !534, size: 64, offset: 1024)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !441, line: 106, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !441, line: 81, size: 512, elements: !537)
!537 = !{!538, !539, !542, !543, !544, !545}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !536, file: !441, line: 82, baseType: !241, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !536, file: !441, line: 97, baseType: !540, size: 256, offset: 64)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 256, elements: !541)
!541 = !{!508, !243}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !536, file: !441, line: 102, baseType: !241, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !536, file: !441, line: 102, baseType: !241, size: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !536, file: !441, line: 104, baseType: !136, size: 32, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !536, file: !441, line: 105, baseType: !136, size: 32, offset: 480)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !520, file: !441, line: 135, baseType: !206, size: 96, offset: 1088)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !520, file: !441, line: 136, baseType: !207, size: 32, offset: 1184)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !520, file: !441, line: 139, baseType: !136, size: 32, offset: 1216)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !520, file: !441, line: 139, baseType: !136, size: 32, offset: 1248)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !520, file: !441, line: 139, baseType: !136, size: 32, offset: 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !520, file: !441, line: 140, baseType: !206, size: 96, offset: 1312)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !520, file: !441, line: 143, baseType: !89, size: 16, offset: 1408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !520, file: !441, line: 144, baseType: !89, size: 16, offset: 1424)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !520, file: !441, line: 145, baseType: !89, size: 16, offset: 1440)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !520, file: !441, line: 148, baseType: !89, size: 16, offset: 1456)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !520, file: !441, line: 149, baseType: !136, size: 32, offset: 1472)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !520, file: !441, line: 150, baseType: !207, size: 32, offset: 1504)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !520, file: !441, line: 152, baseType: !238, size: 64, offset: 1536)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !520, file: !441, line: 163, baseType: !207, size: 32, offset: 1600)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !520, file: !441, line: 163, baseType: !207, size: 32, offset: 1632)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !511, file: !441, line: 261, baseType: !207, size: 32, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !511, file: !441, line: 261, baseType: !207, size: 32, offset: 224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !511, file: !441, line: 261, baseType: !207, size: 32, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !511, file: !441, line: 263, baseType: !136, size: 32, offset: 288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !511, file: !441, line: 266, baseType: !136, size: 32, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !511, file: !441, line: 267, baseType: !207, size: 32, offset: 352)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !440, file: !441, line: 347, baseType: !518, size: 64, offset: 1856)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !440, file: !441, line: 348, baseType: !569, size: 64, offset: 1920)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !441, line: 205, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !441, line: 186, size: 1024, elements: !572)
!572 = !{!573, !575, !576, !577, !579, !580, !581, !589, !590, !591, !668, !669}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !571, file: !441, line: 187, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !571, file: !441, line: 187, baseType: !574, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !571, file: !441, line: 189, baseType: !151, size: 512, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !571, file: !441, line: 191, baseType: !578, size: 64, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !571, file: !441, line: 193, baseType: !136, size: 32, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !571, file: !441, line: 193, baseType: !136, size: 32, offset: 736)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !571, file: !441, line: 195, baseType: !582, size: 64, offset: 768)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !441, line: 184, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !441, line: 166, size: 320, elements: !585)
!585 = !{!586, !587, !588}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !584, file: !441, line: 180, baseType: !540, size: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !584, file: !441, line: 182, baseType: !136, size: 32, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !584, file: !441, line: 183, baseType: !136, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !571, file: !441, line: 196, baseType: !136, size: 32, offset: 832)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !441, line: 198, baseType: !136, size: 32, offset: 864)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !571, file: !441, line: 200, baseType: !592, size: 64, offset: 896)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !377, line: 77, size: 15424, elements: !594)
!594 = !{!595, !596, !597, !600, !603, !604, !607, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !627, !628, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !654, !655, !656, !657, !658, !662}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !593, file: !377, line: 78, baseType: !102, size: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !593, file: !377, line: 80, baseType: !121, size: 8192, offset: 960)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !593, file: !377, line: 82, baseType: !598, size: 64, offset: 9152)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !377, line: 43, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !593, file: !377, line: 83, baseType: !601, size: 64, offset: 9216)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !103, line: 46, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !593, file: !377, line: 86, baseType: !375, size: 64, offset: 9280)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !593, file: !377, line: 87, baseType: !605, size: 64, offset: 9344)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !377, line: 44, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !593, file: !377, line: 89, baseType: !608, size: 512, offset: 9408)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 512, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 8)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !593, file: !377, line: 90, baseType: !89, size: 16, offset: 9920)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !593, file: !377, line: 90, baseType: !89, size: 16, offset: 9936)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !593, file: !377, line: 92, baseType: !89, size: 16, offset: 9952)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !593, file: !377, line: 92, baseType: !89, size: 16, offset: 9968)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !593, file: !377, line: 93, baseType: !89, size: 16, offset: 9984)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !593, file: !377, line: 93, baseType: !89, size: 16, offset: 10000)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !593, file: !377, line: 94, baseType: !136, size: 32, offset: 10016)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !593, file: !377, line: 97, baseType: !89, size: 16, offset: 10048)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !593, file: !377, line: 97, baseType: !89, size: 16, offset: 10064)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !593, file: !377, line: 98, baseType: !89, size: 16, offset: 10080)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !593, file: !377, line: 98, baseType: !89, size: 16, offset: 10096)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !593, file: !377, line: 99, baseType: !89, size: 16, offset: 10112)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !593, file: !377, line: 99, baseType: !89, size: 16, offset: 10128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !593, file: !377, line: 100, baseType: !5, size: 32, offset: 10144)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !593, file: !377, line: 101, baseType: !626, size: 64, offset: 10176)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !593, file: !377, line: 103, baseType: !128, size: 64, offset: 10240)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !593, file: !377, line: 104, baseType: !629, size: 64, offset: 10304)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !103, line: 159, size: 448, elements: !631)
!631 = !{!632, !634, !635, !637, !638, !640}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !630, file: !103, line: 161, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !242)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !630, file: !103, line: 162, baseType: !633, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !630, file: !103, line: 163, baseType: !636, size: 32, offset: 128)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 32, elements: !242)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !630, file: !103, line: 164, baseType: !636, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !630, file: !103, line: 165, baseType: !639, size: 128, offset: 192)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 128, elements: !242)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !630, file: !103, line: 166, baseType: !641, size: 128, offset: 320)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 128, elements: !242)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !593, file: !377, line: 107, baseType: !207, size: 32, offset: 10368)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !593, file: !377, line: 108, baseType: !136, size: 32, offset: 10400)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !593, file: !377, line: 109, baseType: !89, size: 16, offset: 10432)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !593, file: !377, line: 110, baseType: !89, size: 16, offset: 10448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !593, file: !377, line: 113, baseType: !136, size: 32, offset: 10464)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !593, file: !377, line: 113, baseType: !136, size: 32, offset: 10496)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !593, file: !377, line: 114, baseType: !122, size: 8, offset: 10528)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !593, file: !377, line: 114, baseType: !122, size: 8, offset: 10536)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !593, file: !377, line: 115, baseType: !89, size: 16, offset: 10544)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !593, file: !377, line: 116, baseType: !652, size: 128, offset: 10560)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 128, elements: !653)
!653 = !{!508}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !593, file: !377, line: 119, baseType: !207, size: 32, offset: 10688)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !593, file: !377, line: 119, baseType: !207, size: 32, offset: 10720)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !593, file: !377, line: 122, baseType: !409, size: 512, offset: 10752)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !593, file: !377, line: 123, baseType: !122, size: 8, offset: 11264)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !593, file: !377, line: 125, baseType: !659, size: 56, offset: 11272)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 56, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 7)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !593, file: !377, line: 126, baseType: !663, size: 4096, offset: 11328)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 4096, elements: !609)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !377, line: 69, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !377, line: 67, size: 512, elements: !666)
!666 = !{!667}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !665, file: !377, line: 68, baseType: !151, size: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !571, file: !441, line: 201, baseType: !207, size: 32, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !571, file: !441, line: 204, baseType: !136, size: 32, offset: 992)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !440, file: !441, line: 350, baseType: !161, size: 128, offset: 1984)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !440, file: !441, line: 351, baseType: !136, size: 32, offset: 2112)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !440, file: !441, line: 351, baseType: !136, size: 32, offset: 2144)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !440, file: !441, line: 353, baseType: !674, size: 64, offset: 2176)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !441, line: 297, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !441, line: 295, size: 2048, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !676, file: !441, line: 296, baseType: !358, size: 2048)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !440, file: !441, line: 355, baseType: !680, size: 384, offset: 2240)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !441, line: 338, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !441, line: 322, size: 384, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !681, file: !441, line: 323, baseType: !136, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !681, file: !441, line: 325, baseType: !89, size: 16, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !681, file: !441, line: 326, baseType: !89, size: 16, offset: 48)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !681, file: !441, line: 331, baseType: !161, size: 128, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !681, file: !441, line: 334, baseType: !161, size: 128, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !681, file: !441, line: 335, baseType: !136, size: 32, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !681, file: !441, line: 337, baseType: !136, size: 32, offset: 352)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !422, file: !423, line: 81, baseType: !66, size: 64, offset: 12224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !422, file: !423, line: 85, baseType: !692, size: 6208, offset: 12288)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !423, line: 55, size: 6208, elements: !693)
!693 = !{!694, !695, !696, !697, !698}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !692, file: !423, line: 56, baseType: !364, size: 6144)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !692, file: !423, line: 58, baseType: !89, size: 16, offset: 6144)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !692, file: !423, line: 59, baseType: !89, size: 16, offset: 6160)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !692, file: !423, line: 60, baseType: !89, size: 16, offset: 6176)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !692, file: !423, line: 61, baseType: !89, size: 16, offset: 6192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !422, file: !423, line: 86, baseType: !136, size: 32, offset: 18496)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !422, file: !423, line: 88, baseType: !136, size: 32, offset: 18528)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !422, file: !423, line: 90, baseType: !136, size: 32, offset: 18560)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !422, file: !423, line: 94, baseType: !136, size: 32, offset: 18592)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !422, file: !423, line: 100, baseType: !409, size: 512, offset: 18624)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !313, file: !304, line: 154, baseType: !705, size: 64, offset: 1664)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !707, line: 264, flags: DIFlagFwdDecl)
!707 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!708 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !313, file: !304, line: 156, baseType: !375, size: 64, offset: 1728)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !313, file: !304, line: 158, baseType: !207, size: 32, offset: 1792)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !313, file: !304, line: 159, baseType: !207, size: 32, offset: 1824)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !313, file: !304, line: 162, baseType: !316, size: 64, offset: 1856)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !313, file: !304, line: 162, baseType: !316, size: 64, offset: 1920)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !313, file: !304, line: 162, baseType: !316, size: 64, offset: 1984)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !313, file: !304, line: 164, baseType: !161, size: 128, offset: 2048)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !313, file: !304, line: 166, baseType: !716, size: 64, offset: 2176)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !304, line: 51, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !313, file: !304, line: 167, baseType: !66, size: 64, offset: 2240)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !313, file: !304, line: 168, baseType: !207, size: 32, offset: 2304)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !313, file: !304, line: 170, baseType: !207, size: 32, offset: 2336)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !313, file: !304, line: 170, baseType: !207, size: 32, offset: 2368)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !313, file: !304, line: 171, baseType: !207, size: 32, offset: 2400)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !313, file: !304, line: 173, baseType: !66, size: 64, offset: 2432)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !313, file: !304, line: 175, baseType: !136, size: 32, offset: 2496)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !313, file: !304, line: 176, baseType: !136, size: 32, offset: 2528)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !313, file: !304, line: 179, baseType: !136, size: 32, offset: 2560)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !313, file: !304, line: 180, baseType: !207, size: 32, offset: 2592)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !313, file: !304, line: 183, baseType: !136, size: 32, offset: 2624)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !313, file: !304, line: 185, baseType: !122, size: 8, offset: 2656)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !313, file: !304, line: 186, baseType: !731, size: 24, offset: 2664)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 24, elements: !208)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !313, file: !304, line: 189, baseType: !161, size: 128, offset: 2688)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !303, file: !304, line: 207, baseType: !121, size: 8192, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !303, file: !304, line: 208, baseType: !121, size: 8192, offset: 8576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !303, file: !304, line: 210, baseType: !136, size: 32, offset: 16768)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !303, file: !304, line: 210, baseType: !136, size: 32, offset: 16800)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !303, file: !304, line: 211, baseType: !136, size: 32, offset: 16832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !303, file: !304, line: 211, baseType: !136, size: 32, offset: 16864)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !303, file: !304, line: 212, baseType: !259, size: 128, offset: 16896)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !177, file: !178, line: 1246, baseType: !741, size: 64, offset: 2112)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !178, line: 1067, size: 5184, elements: !743)
!743 = !{!744, !774, !775, !790, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !812, !828, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !938}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !742, file: !178, line: 1068, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !178, line: 934, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !178, line: 925, size: 576, elements: !748)
!748 = !{!749, !766, !767, !768, !769, !770, !773}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !747, file: !178, line: 926, baseType: !750, size: 320)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !178, line: 830, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !178, line: 813, size: 320, elements: !752)
!752 = !{!753, !756, !759, !760, !763, !764, !765}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !751, file: !178, line: 814, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !178, line: 51, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !751, file: !178, line: 815, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !178, line: 815, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !751, file: !178, line: 818, baseType: !66, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !751, file: !178, line: 819, baseType: !761, size: 32, offset: 192)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 32, elements: !653)
!762 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !751, file: !178, line: 822, baseType: !136, size: 32, offset: 224)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !751, file: !178, line: 826, baseType: !136, size: 32, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !751, file: !178, line: 829, baseType: !136, size: 32, offset: 288)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !747, file: !178, line: 928, baseType: !89, size: 16, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !747, file: !178, line: 928, baseType: !89, size: 16, offset: 336)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !747, file: !178, line: 929, baseType: !136, size: 32, offset: 352)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !747, file: !178, line: 930, baseType: !626, size: 64, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !747, file: !178, line: 931, baseType: !771, size: 64, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !178, line: 931, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !747, file: !178, line: 933, baseType: !66, size: 64, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !742, file: !178, line: 1069, baseType: !745, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !742, file: !178, line: 1070, baseType: !776, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !178, line: 916, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !178, line: 891, size: 704, elements: !779)
!779 = !{!780, !781, !782, !784, !785, !786, !787, !788, !789}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !778, file: !178, line: 892, baseType: !750, size: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !778, file: !178, line: 896, baseType: !136, size: 32, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !778, file: !178, line: 900, baseType: !783, size: 96, offset: 352)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 96, elements: !208)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !778, file: !178, line: 903, baseType: !207, size: 32, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !778, file: !178, line: 906, baseType: !136, size: 32, offset: 480)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !778, file: !178, line: 909, baseType: !207, size: 32, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !778, file: !178, line: 912, baseType: !207, size: 32, offset: 544)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !778, file: !178, line: 914, baseType: !185, size: 64, offset: 576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !778, file: !178, line: 915, baseType: !66, size: 64, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !742, file: !178, line: 1071, baseType: !791, size: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !178, line: 920, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !178, line: 918, size: 320, elements: !794)
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !793, file: !178, line: 919, baseType: !750, size: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !742, file: !178, line: 1075, baseType: !207, size: 32, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !742, file: !178, line: 1077, baseType: !207, size: 32, offset: 288)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !742, file: !178, line: 1078, baseType: !207, size: 32, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !742, file: !178, line: 1079, baseType: !89, size: 16, offset: 352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !742, file: !178, line: 1082, baseType: !89, size: 16, offset: 368)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !742, file: !178, line: 1085, baseType: !122, size: 8, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !742, file: !178, line: 1086, baseType: !122, size: 8, offset: 392)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !742, file: !178, line: 1087, baseType: !122, size: 8, offset: 400)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !742, file: !178, line: 1088, baseType: !122, size: 8, offset: 408)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !742, file: !178, line: 1090, baseType: !207, size: 32, offset: 416)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !742, file: !178, line: 1093, baseType: !89, size: 16, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !742, file: !178, line: 1096, baseType: !122, size: 8, offset: 464)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !742, file: !178, line: 1098, baseType: !809, size: 40, offset: 472)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 40, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 5)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !742, file: !178, line: 1101, baseType: !813, size: 832, offset: 512)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !178, line: 836, size: 832, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !813, file: !178, line: 837, baseType: !750, size: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !813, file: !178, line: 839, baseType: !89, size: 16, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !813, file: !178, line: 839, baseType: !89, size: 16, offset: 336)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !813, file: !178, line: 842, baseType: !89, size: 16, offset: 352)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !813, file: !178, line: 842, baseType: !89, size: 16, offset: 368)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !813, file: !178, line: 843, baseType: !636, size: 32, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !813, file: !178, line: 845, baseType: !136, size: 32, offset: 416)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !813, file: !178, line: 847, baseType: !66, size: 64, offset: 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !813, file: !178, line: 848, baseType: !592, size: 64, offset: 512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !813, file: !178, line: 849, baseType: !592, size: 64, offset: 576)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !813, file: !178, line: 850, baseType: !592, size: 64, offset: 640)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !813, file: !178, line: 851, baseType: !206, size: 96, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !813, file: !178, line: 852, baseType: !207, size: 32, offset: 800)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !742, file: !178, line: 1104, baseType: !829, size: 1344, offset: 1344)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !178, line: 867, size: 1344, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !829, file: !178, line: 868, baseType: !89, size: 16)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !829, file: !178, line: 869, baseType: !89, size: 16, offset: 16)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !829, file: !178, line: 870, baseType: !89, size: 16, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !829, file: !178, line: 871, baseType: !89, size: 16, offset: 48)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !829, file: !178, line: 873, baseType: !836, size: 896, offset: 64)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !837, size: 896, elements: !660)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !178, line: 864, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !178, line: 859, size: 128, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !838, file: !178, line: 860, baseType: !89, size: 16)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !838, file: !178, line: 861, baseType: !89, size: 16, offset: 16)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !838, file: !178, line: 861, baseType: !89, size: 16, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !838, file: !178, line: 861, baseType: !89, size: 16, offset: 48)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !838, file: !178, line: 862, baseType: !136, size: 32, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !838, file: !178, line: 863, baseType: !207, size: 32, offset: 96)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !829, file: !178, line: 874, baseType: !66, size: 64, offset: 960)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !829, file: !178, line: 876, baseType: !207, size: 32, offset: 1024)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !829, file: !178, line: 876, baseType: !207, size: 32, offset: 1056)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !829, file: !178, line: 878, baseType: !136, size: 32, offset: 1088)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !829, file: !178, line: 879, baseType: !136, size: 32, offset: 1120)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !829, file: !178, line: 881, baseType: !136, size: 32, offset: 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !829, file: !178, line: 881, baseType: !136, size: 32, offset: 1184)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !829, file: !178, line: 883, baseType: !176, size: 64, offset: 1216)
