; ModuleID = 'blender/source/blender/editors/space_script/script_edit.c'
source_filename = "blender/source/blender/editors/space_script/script_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/space_script/script_edit.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 351, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!13 = !{i32 7, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{i32 1, !"wchar_size", i32 4}
!16 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!17 = distinct !DISubprogram(name: "SCRIPT_OT_python_file_run", scope: !1, file: !1, line: 74, type: !18, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1552)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !22, line: 568, baseType: !23)
!22 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !22, line: 508, size: 1536, elements: !24)
!24 = !{!25, !29, !30, !31, !32, !1478, !1482, !1488, !1492, !1493, !1497, !1498, !1499, !1500, !1504, !1505, !1520, !1521, !1525, !1551}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !22, line: 509, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !23, file: !22, line: 510, baseType: !26, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !23, file: !22, line: 511, baseType: !26, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !23, file: !22, line: 512, baseType: !26, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !23, file: !22, line: 518, baseType: !33, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !37, !40}
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !39, line: 44, flags: DIFlagFwdDecl)
!39 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !4, line: 328, size: 1344, elements: !42)
!42 = !{!43, !44, !45, !49, !81, !83, !84, !85, !97, !1471, !1472, !1473, !1476, !1477}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !4, line: 329, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !41, file: !4, line: 329, baseType: !40, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !41, file: !4, line: 332, baseType: !46, size: 512, offset: 128)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 512, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !41, file: !4, line: 333, baseType: !50, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !52, line: 75, baseType: !53)
!52 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !52, line: 62, size: 1024, elements: !54)
!54 = !{!55, !57, !58, !59, !60, !62, !63, !64, !79, !80}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !53, file: !52, line: 63, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !53, file: !52, line: 63, baseType: !56, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !52, line: 64, baseType: !28, size: 8, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !53, file: !52, line: 64, baseType: !28, size: 8, offset: 136)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !53, file: !52, line: 65, baseType: !61, size: 16, offset: 144)
!61 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !53, file: !52, line: 66, baseType: !46, size: 512, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !53, file: !52, line: 67, baseType: !36, size: 32, offset: 672)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !52, line: 69, baseType: !65, size: 256, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !52, line: 60, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !52, line: 48, size: 256, elements: !67)
!67 = !{!68, !70, !77, !78}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !66, file: !52, line: 49, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !66, file: !52, line: 58, baseType: !71, size: 128, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !72, line: 71, baseType: !73)
!72 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !72, line: 69, size: 128, elements: !74)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !73, file: !72, line: 70, baseType: !69, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !73, file: !72, line: 70, baseType: !69, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !66, file: !52, line: 59, baseType: !36, size: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !66, file: !52, line: 59, baseType: !36, size: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !53, file: !52, line: 70, baseType: !36, size: 32, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !53, file: !52, line: 74, baseType: !36, size: 32, offset: 992)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !4, line: 336, baseType: !82, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !41, file: !4, line: 337, baseType: !69, size: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !41, file: !4, line: 338, baseType: !69, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !41, file: !4, line: 340, baseType: !86, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !39, line: 55, size: 192, elements: !88)
!88 = !{!89, !93, !96}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !87, file: !39, line: 58, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !39, line: 56, size: 64, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !39, line: 57, baseType: !69, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !39, line: 60, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !39, line: 41, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !39, line: 61, baseType: !69, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !41, file: !4, line: 341, baseType: !98, size: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !4, line: 106, size: 320, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !99, file: !4, line: 107, baseType: !71, size: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !99, file: !4, line: 108, baseType: !36, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !99, file: !4, line: 109, baseType: !36, size: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !99, file: !4, line: 110, baseType: !36, size: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !99, file: !4, line: 110, baseType: !36, size: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !99, file: !4, line: 111, baseType: !107, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !22, line: 490, size: 768, elements: !109)
!109 = !{!110, !111, !112, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !108, file: !22, line: 491, baseType: !107, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !108, file: !22, line: 491, baseType: !107, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !108, file: !22, line: 493, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !4, line: 169, size: 2048, elements: !115)
!115 = !{!116, !117, !118, !119, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1437, !1440, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !4, line: 170, baseType: !113, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !4, line: 170, baseType: !113, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !114, file: !4, line: 172, baseType: !69, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !114, file: !4, line: 174, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !122, line: 49, size: 1984, elements: !123)
!122 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!123 = !{!124, !160, !161, !162, !163, !164, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !122, line: 50, baseType: !125, size: 960)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !52, line: 130, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !52, line: 117, size: 960, elements: !127)
!127 = !{!128, !129, !130, !132, !151, !155, !156, !157, !158, !159}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !52, line: 118, baseType: !69, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !52, line: 118, baseType: !69, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !126, file: !52, line: 119, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !126, file: !52, line: 120, baseType: !133, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !52, line: 136, size: 17600, elements: !135)
!135 = !{!136, !137, !139, !142, !146, !147, !148}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !134, file: !52, line: 137, baseType: !125, size: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !134, file: !52, line: 138, baseType: !138, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !134, file: !52, line: 139, baseType: !140, size: 64, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !52, line: 43, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !52, line: 140, baseType: !143, size: 8192, offset: 1088)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 1024)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !134, file: !52, line: 141, baseType: !143, size: 8192, offset: 9280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !134, file: !52, line: 148, baseType: !133, size: 64, offset: 17472)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !134, file: !52, line: 150, baseType: !149, size: 64, offset: 17536)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !52, line: 45, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !52, line: 121, baseType: !152, size: 528, offset: 256)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 528, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 66)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !52, line: 126, baseType: !61, size: 16, offset: 784)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !126, file: !52, line: 127, baseType: !36, size: 32, offset: 800)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !126, file: !52, line: 128, baseType: !36, size: 32, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !126, file: !52, line: 128, baseType: !36, size: 32, offset: 864)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !126, file: !52, line: 129, baseType: !50, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !121, file: !122, line: 52, baseType: !71, size: 128, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !121, file: !122, line: 53, baseType: !71, size: 128, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !121, file: !122, line: 54, baseType: !71, size: 128, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !121, file: !122, line: 55, baseType: !71, size: 128, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !121, file: !122, line: 57, baseType: !165, size: 64, offset: 1472)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !167, line: 1216, size: 39680, elements: !168)
!167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = !{!169, !170, !174, !178, !181, !182, !183, !195, !196, !201, !202, !203, !204, !205, !206, !207, !208, !209, !213, !291, !726, !941, !944, !1232, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1254, !1255, !1256, !1257, !1258, !1266, !1333, !1340, !1341, !1348, !1349, !1355, !1356, !1357, !1358, !1359}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !167, line: 1217, baseType: !125, size: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !166, file: !167, line: 1218, baseType: !171, size: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !173, line: 43, flags: DIFlagFwdDecl)
!173 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!174 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !166, file: !167, line: 1220, baseType: !175, size: 64, offset: 1024)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !177, line: 44, flags: DIFlagFwdDecl)
!177 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !166, file: !167, line: 1221, baseType: !179, size: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !167, line: 52, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !166, file: !167, line: 1223, baseType: !165, size: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !166, file: !167, line: 1225, baseType: !71, size: 128, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !166, file: !167, line: 1226, baseType: !184, size: 64, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !167, line: 69, size: 320, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !167, line: 70, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !185, file: !167, line: 70, baseType: !184, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !185, file: !167, line: 71, baseType: !5, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !185, file: !167, line: 71, baseType: !5, size: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !185, file: !167, line: 72, baseType: !36, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !185, file: !167, line: 73, baseType: !61, size: 16, offset: 224)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !185, file: !167, line: 73, baseType: !61, size: 16, offset: 240)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !185, file: !167, line: 74, baseType: !175, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !166, file: !167, line: 1227, baseType: !175, size: 64, offset: 1408)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !166, file: !167, line: 1229, baseType: !197, size: 96, offset: 1472)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 96, elements: !199)
!198 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!199 = !{!200}
!200 = !DISubrange(count: 3)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !166, file: !167, line: 1230, baseType: !197, size: 96, offset: 1568)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !166, file: !167, line: 1231, baseType: !197, size: 96, offset: 1664)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !166, file: !167, line: 1231, baseType: !197, size: 96, offset: 1760)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !166, file: !167, line: 1233, baseType: !5, size: 32, offset: 1856)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !166, file: !167, line: 1234, baseType: !36, size: 32, offset: 1888)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !166, file: !167, line: 1235, baseType: !5, size: 32, offset: 1920)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !167, line: 1237, baseType: !61, size: 16, offset: 1952)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !166, file: !167, line: 1239, baseType: !28, size: 8, offset: 1968)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !166, file: !167, line: 1240, baseType: !210, size: 8, offset: 1976)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 1)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !166, file: !167, line: 1242, baseType: !214, size: 64, offset: 1984)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !216, line: 328, size: 3456, elements: !217)
!216 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!217 = !{!218, !219, !220, !223, !224, !225, !229, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !256, !257, !258, !261, !266, !267, !270, !274, !279, !283, !287, !288, !289, !290}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !215, file: !216, line: 329, baseType: !125, size: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !215, file: !216, line: 330, baseType: !171, size: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !215, file: !216, line: 332, baseType: !221, size: 64, offset: 1024)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !216, line: 332, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !215, file: !216, line: 333, baseType: !46, size: 512, offset: 1088)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !215, file: !216, line: 335, baseType: !94, size: 64, offset: 1600)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !215, file: !216, line: 337, baseType: !226, size: 64, offset: 1664)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !228, line: 45, flags: DIFlagFwdDecl)
!228 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!229 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !215, file: !216, line: 338, baseType: !230, size: 64, offset: 1728)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 64, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 2)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !215, file: !216, line: 340, baseType: !71, size: 128, offset: 1792)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !215, file: !216, line: 340, baseType: !71, size: 128, offset: 1920)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !216, line: 342, baseType: !36, size: 32, offset: 2048)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !215, file: !216, line: 342, baseType: !36, size: 32, offset: 2080)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !215, file: !216, line: 343, baseType: !36, size: 32, offset: 2112)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !216, line: 345, baseType: !36, size: 32, offset: 2144)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !215, file: !216, line: 346, baseType: !36, size: 32, offset: 2176)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !215, file: !216, line: 347, baseType: !61, size: 16, offset: 2208)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !215, file: !216, line: 348, baseType: !61, size: 16, offset: 2224)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !215, file: !216, line: 349, baseType: !36, size: 32, offset: 2240)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !215, file: !216, line: 351, baseType: !36, size: 32, offset: 2272)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !215, file: !216, line: 353, baseType: !61, size: 16, offset: 2304)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !215, file: !216, line: 354, baseType: !61, size: 16, offset: 2320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !215, file: !216, line: 355, baseType: !36, size: 32, offset: 2336)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !215, file: !216, line: 357, baseType: !248, size: 128, offset: 2368)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !249, line: 95, baseType: !250)
!249 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !249, line: 92, size: 128, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !250, file: !249, line: 93, baseType: !198, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !250, file: !249, line: 93, baseType: !198, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !250, file: !249, line: 94, baseType: !198, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !250, file: !249, line: 94, baseType: !198, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !215, file: !216, line: 363, baseType: !71, size: 128, offset: 2496)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !215, file: !216, line: 363, baseType: !71, size: 128, offset: 2624)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !215, file: !216, line: 368, baseType: !259, size: 64, offset: 2752)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !216, line: 48, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !215, file: !216, line: 372, baseType: !262, size: 32, offset: 2816)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !216, line: 274, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !216, line: 271, size: 32, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !263, file: !216, line: 273, baseType: !5, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !215, file: !216, line: 373, baseType: !36, size: 32, offset: 2848)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !215, file: !216, line: 382, baseType: !268, size: 64, offset: 2880)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !216, line: 46, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !215, file: !216, line: 385, baseType: !271, size: 64, offset: 2944)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !69, !198}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !215, file: !216, line: 386, baseType: !275, size: 64, offset: 3008)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !69, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !215, file: !216, line: 387, baseType: !280, size: 64, offset: 3072)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!36, !69}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !215, file: !216, line: 388, baseType: !284, size: 64, offset: 3136)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !69}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !215, file: !216, line: 389, baseType: !69, size: 64, offset: 3200)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !215, file: !216, line: 389, baseType: !69, size: 64, offset: 3264)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !215, file: !216, line: 389, baseType: !69, size: 64, offset: 3328)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !215, file: !216, line: 389, baseType: !69, size: 64, offset: 3392)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !166, file: !167, line: 1244, baseType: !292, size: 64, offset: 2048)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !294, line: 200, size: 17024, elements: !295)
!294 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!295 = !{!296, !298, !299, !300, !719, !720, !721, !722, !723, !724, !725}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !293, file: !294, line: 201, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !293, file: !294, line: 202, baseType: !71, size: 128, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !293, file: !294, line: 203, baseType: !71, size: 128, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !293, file: !294, line: 206, baseType: !301, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !294, line: 190, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !294, line: 126, size: 2816, elements: !304)
!304 = !{!305, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !404, !407, !408, !409, !691, !694, !695, !696, !697, !698, !699, !700, !701, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !718}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !294, line: 127, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !303, file: !294, line: 127, baseType: !306, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !303, file: !294, line: 128, baseType: !69, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !303, file: !294, line: 129, baseType: !69, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !303, file: !294, line: 130, baseType: !46, size: 512, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !294, line: 132, baseType: !36, size: 32, offset: 768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !294, line: 132, baseType: !36, size: 32, offset: 800)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !303, file: !294, line: 133, baseType: !36, size: 32, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !303, file: !294, line: 134, baseType: !36, size: 32, offset: 864)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !303, file: !294, line: 134, baseType: !36, size: 32, offset: 896)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !303, file: !294, line: 134, baseType: !36, size: 32, offset: 928)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !303, file: !294, line: 135, baseType: !36, size: 32, offset: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !303, file: !294, line: 135, baseType: !36, size: 32, offset: 992)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !303, file: !294, line: 136, baseType: !36, size: 32, offset: 1024)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !303, file: !294, line: 136, baseType: !36, size: 32, offset: 1056)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !303, file: !294, line: 137, baseType: !36, size: 32, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !303, file: !294, line: 137, baseType: !36, size: 32, offset: 1120)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !303, file: !294, line: 138, baseType: !198, size: 32, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !303, file: !294, line: 139, baseType: !198, size: 32, offset: 1184)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !303, file: !294, line: 139, baseType: !198, size: 32, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !303, file: !294, line: 141, baseType: !61, size: 16, offset: 1248)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !303, file: !294, line: 142, baseType: !61, size: 16, offset: 1264)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !303, file: !294, line: 143, baseType: !36, size: 32, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !303, file: !294, line: 144, baseType: !36, size: 32, offset: 1312)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !303, file: !294, line: 146, baseType: !331, size: 64, offset: 1344)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !294, line: 114, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !294, line: 99, size: 7232, elements: !334)
!334 = !{!335, !337, !338, !339, !340, !341, !342, !353, !357, !372, !381, !388, !398}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !294, line: 100, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !333, file: !294, line: 100, baseType: !336, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !333, file: !294, line: 101, baseType: !36, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !333, file: !294, line: 101, baseType: !36, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !333, file: !294, line: 102, baseType: !36, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !333, file: !294, line: 102, baseType: !36, size: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !333, file: !294, line: 103, baseType: !343, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !294, line: 59, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !294, line: 56, size: 2112, elements: !346)
!346 = !{!347, !351, !352}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !345, file: !294, line: 57, baseType: !348, size: 2048)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !345, file: !294, line: 58, baseType: !36, size: 32, offset: 2048)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !345, file: !294, line: 58, baseType: !36, size: 32, offset: 2080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !333, file: !294, line: 106, baseType: !354, size: 6144, offset: 320)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6144, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 768)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !333, file: !294, line: 107, baseType: !358, size: 64, offset: 6464)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !294, line: 97, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !294, line: 83, size: 8320, elements: !361)
!361 = !{!362, !363, !364, !368, !369, !370, !371}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !360, file: !294, line: 84, baseType: !354, size: 6144)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !360, file: !294, line: 87, baseType: !348, size: 2048, offset: 6144)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !360, file: !294, line: 88, baseType: !365, size: 64, offset: 8192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !367, line: 41, flags: DIFlagFwdDecl)
!367 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !360, file: !294, line: 90, baseType: !61, size: 16, offset: 8256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !360, file: !294, line: 92, baseType: !61, size: 16, offset: 8272)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !360, file: !294, line: 93, baseType: !61, size: 16, offset: 8288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !360, file: !294, line: 95, baseType: !61, size: 16, offset: 8304)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !333, file: !294, line: 108, baseType: !373, size: 64, offset: 6528)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !294, line: 66, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !294, line: 61, size: 128, elements: !376)
!376 = !{!377, !378, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !375, file: !294, line: 62, baseType: !36, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !375, file: !294, line: 63, baseType: !36, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !375, file: !294, line: 64, baseType: !36, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !375, file: !294, line: 65, baseType: !36, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !333, file: !294, line: 109, baseType: !382, size: 64, offset: 6592)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !294, line: 71, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !294, line: 68, size: 64, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !384, file: !294, line: 69, baseType: !36, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !384, file: !294, line: 70, baseType: !36, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !333, file: !294, line: 110, baseType: !389, size: 64, offset: 6656)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !294, line: 81, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !294, line: 73, size: 352, elements: !392)
!392 = !{!393, !394, !395, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !391, file: !294, line: 74, baseType: !197, size: 96)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !391, file: !294, line: 75, baseType: !197, size: 96, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !391, file: !294, line: 76, baseType: !197, size: 96, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !294, line: 77, baseType: !36, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !391, file: !294, line: 78, baseType: !36, size: 32, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !333, file: !294, line: 113, baseType: !399, size: 512, offset: 6720)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !400, line: 182, baseType: !401)
!400 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !400, line: 180, size: 512, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !401, file: !400, line: 181, baseType: !46, size: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !303, file: !294, line: 148, baseType: !405, size: 64, offset: 1408)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !294, line: 49, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !303, file: !294, line: 151, baseType: !165, size: 64, offset: 1472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !303, file: !294, line: 152, baseType: !175, size: 64, offset: 1536)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !303, file: !294, line: 153, baseType: !410, size: 64, offset: 1600)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !173, line: 64, size: 19136, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !420, !421, !422, !423, !426, !427, !677, !678, !686, !687, !688, !689, !690}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !411, file: !173, line: 65, baseType: !125, size: 960)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !411, file: !173, line: 66, baseType: !171, size: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !173, line: 68, baseType: !143, size: 8192, offset: 1024)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !411, file: !173, line: 70, baseType: !36, size: 32, offset: 9216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !411, file: !173, line: 71, baseType: !36, size: 32, offset: 9248)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !411, file: !173, line: 72, baseType: !419, size: 64, offset: 9280)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !231)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !411, file: !173, line: 74, baseType: !198, size: 32, offset: 9344)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !411, file: !173, line: 74, baseType: !198, size: 32, offset: 9376)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !411, file: !173, line: 76, baseType: !365, size: 64, offset: 9408)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !411, file: !173, line: 77, baseType: !424, size: 64, offset: 9472)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !173, line: 77, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !411, file: !173, line: 78, baseType: !226, size: 64, offset: 9536)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !411, file: !173, line: 80, baseType: !428, size: 2624, offset: 9600)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !228, line: 340, size: 2624, elements: !429)
!429 = !{!430, !458, !476, !477, !478, !496, !554, !555, !657, !658, !659, !660, !666}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !428, file: !228, line: 341, baseType: !431, size: 576)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !228, line: 251, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !228, line: 207, size: 576, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !432, file: !228, line: 208, baseType: !36, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !432, file: !228, line: 211, baseType: !61, size: 16, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !432, file: !228, line: 212, baseType: !61, size: 16, offset: 48)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !432, file: !228, line: 213, baseType: !198, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !432, file: !228, line: 214, baseType: !61, size: 16, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !432, file: !228, line: 215, baseType: !61, size: 16, offset: 112)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !432, file: !228, line: 216, baseType: !61, size: 16, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !432, file: !228, line: 217, baseType: !61, size: 16, offset: 144)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !432, file: !228, line: 218, baseType: !61, size: 16, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !432, file: !228, line: 219, baseType: !61, size: 16, offset: 176)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !432, file: !228, line: 220, baseType: !198, size: 32, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !432, file: !228, line: 222, baseType: !61, size: 16, offset: 224)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !432, file: !228, line: 225, baseType: !61, size: 16, offset: 240)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !432, file: !228, line: 228, baseType: !36, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !432, file: !228, line: 229, baseType: !36, size: 32, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !432, file: !228, line: 233, baseType: !36, size: 32, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !432, file: !228, line: 236, baseType: !61, size: 16, offset: 352)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !432, file: !228, line: 236, baseType: !61, size: 16, offset: 368)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !432, file: !228, line: 241, baseType: !198, size: 32, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !432, file: !228, line: 244, baseType: !36, size: 32, offset: 416)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !432, file: !228, line: 244, baseType: !36, size: 32, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !432, file: !228, line: 245, baseType: !198, size: 32, offset: 480)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !432, file: !228, line: 248, baseType: !198, size: 32, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !432, file: !228, line: 250, baseType: !36, size: 32, offset: 544)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !428, file: !228, line: 342, baseType: !459, size: 448, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !228, line: 79, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !228, line: 61, size: 448, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !460, file: !228, line: 62, baseType: !69, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !460, file: !228, line: 64, baseType: !61, size: 16, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !460, file: !228, line: 65, baseType: !61, size: 16, offset: 80)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !460, file: !228, line: 67, baseType: !198, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !460, file: !228, line: 68, baseType: !198, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !460, file: !228, line: 69, baseType: !198, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !460, file: !228, line: 70, baseType: !61, size: 16, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !460, file: !228, line: 71, baseType: !61, size: 16, offset: 208)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !460, file: !228, line: 72, baseType: !230, size: 64, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !460, file: !228, line: 75, baseType: !198, size: 32, offset: 288)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !460, file: !228, line: 75, baseType: !198, size: 32, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !460, file: !228, line: 75, baseType: !198, size: 32, offset: 352)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !460, file: !228, line: 78, baseType: !198, size: 32, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !460, file: !228, line: 78, baseType: !198, size: 32, offset: 416)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !428, file: !228, line: 343, baseType: !71, size: 128, offset: 1024)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !428, file: !228, line: 344, baseType: !71, size: 128, offset: 1152)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !428, file: !228, line: 345, baseType: !479, size: 192, offset: 1280)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !228, line: 278, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !228, line: 270, size: 192, elements: !481)
!481 = !{!482, !483, !484, !485, !486}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !480, file: !228, line: 271, baseType: !36, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !480, file: !228, line: 273, baseType: !198, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !480, file: !228, line: 275, baseType: !36, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !480, file: !228, line: 276, baseType: !36, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !480, file: !228, line: 277, baseType: !487, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !228, line: 55, size: 576, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !488, file: !228, line: 56, baseType: !36, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !488, file: !228, line: 57, baseType: !198, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !488, file: !228, line: 58, baseType: !493, size: 512, offset: 64)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 512, elements: !494)
!494 = !{!495, !495}
!495 = !DISubrange(count: 4)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !428, file: !228, line: 346, baseType: !497, size: 384, offset: 1472)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !228, line: 268, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !228, line: 253, size: 384, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !548, !549, !550, !551, !552, !553}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !498, file: !228, line: 254, baseType: !36, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !498, file: !228, line: 255, baseType: !36, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !498, file: !228, line: 255, baseType: !36, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !498, file: !228, line: 258, baseType: !198, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !498, file: !228, line: 259, baseType: !505, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !228, line: 164, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !228, line: 108, size: 1664, elements: !508)
!508 = !{!509, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !507, file: !228, line: 109, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !507, file: !228, line: 109, baseType: !510, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !507, file: !228, line: 111, baseType: !46, size: 512, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !507, file: !228, line: 119, baseType: !230, size: 64, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !507, file: !228, line: 119, baseType: !230, size: 64, offset: 704)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !507, file: !228, line: 125, baseType: !230, size: 64, offset: 768)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !507, file: !228, line: 125, baseType: !230, size: 64, offset: 832)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !507, file: !228, line: 127, baseType: !230, size: 64, offset: 896)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !507, file: !228, line: 130, baseType: !36, size: 32, offset: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !507, file: !228, line: 131, baseType: !36, size: 32, offset: 992)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !507, file: !228, line: 132, baseType: !521, size: 64, offset: 1024)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !228, line: 106, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !228, line: 81, size: 512, elements: !524)
!524 = !{!525, !526, !529, !530, !531, !532}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !523, file: !228, line: 82, baseType: !230, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !523, file: !228, line: 97, baseType: !527, size: 256, offset: 64)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 256, elements: !528)
!528 = !{!495, !232}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !523, file: !228, line: 102, baseType: !230, size: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !523, file: !228, line: 102, baseType: !230, size: 64, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !523, file: !228, line: 104, baseType: !36, size: 32, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !523, file: !228, line: 105, baseType: !36, size: 32, offset: 480)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !507, file: !228, line: 135, baseType: !197, size: 96, offset: 1088)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !507, file: !228, line: 136, baseType: !198, size: 32, offset: 1184)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !507, file: !228, line: 139, baseType: !36, size: 32, offset: 1216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !507, file: !228, line: 139, baseType: !36, size: 32, offset: 1248)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !507, file: !228, line: 139, baseType: !36, size: 32, offset: 1280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !507, file: !228, line: 140, baseType: !197, size: 96, offset: 1312)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !507, file: !228, line: 143, baseType: !61, size: 16, offset: 1408)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !507, file: !228, line: 144, baseType: !61, size: 16, offset: 1424)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !507, file: !228, line: 145, baseType: !61, size: 16, offset: 1440)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !507, file: !228, line: 148, baseType: !61, size: 16, offset: 1456)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !507, file: !228, line: 149, baseType: !36, size: 32, offset: 1472)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !507, file: !228, line: 150, baseType: !198, size: 32, offset: 1504)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !507, file: !228, line: 152, baseType: !226, size: 64, offset: 1536)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !507, file: !228, line: 163, baseType: !198, size: 32, offset: 1600)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !507, file: !228, line: 163, baseType: !198, size: 32, offset: 1632)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !498, file: !228, line: 261, baseType: !198, size: 32, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !498, file: !228, line: 261, baseType: !198, size: 32, offset: 224)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !498, file: !228, line: 261, baseType: !198, size: 32, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !498, file: !228, line: 263, baseType: !36, size: 32, offset: 288)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !498, file: !228, line: 266, baseType: !36, size: 32, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !498, file: !228, line: 267, baseType: !198, size: 32, offset: 352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !428, file: !228, line: 347, baseType: !505, size: 64, offset: 1856)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !428, file: !228, line: 348, baseType: !556, size: 64, offset: 1920)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !228, line: 205, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !228, line: 186, size: 1024, elements: !559)
!559 = !{!560, !562, !563, !564, !566, !567, !568, !576, !577, !578, !655, !656}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !228, line: 187, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !558, file: !228, line: 187, baseType: !561, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !558, file: !228, line: 189, baseType: !46, size: 512, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !558, file: !228, line: 191, baseType: !565, size: 64, offset: 640)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !558, file: !228, line: 193, baseType: !36, size: 32, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !558, file: !228, line: 193, baseType: !36, size: 32, offset: 736)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !558, file: !228, line: 195, baseType: !569, size: 64, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !228, line: 184, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !228, line: 166, size: 320, elements: !572)
!572 = !{!573, !574, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !571, file: !228, line: 180, baseType: !527, size: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !571, file: !228, line: 182, baseType: !36, size: 32, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !228, line: 183, baseType: !36, size: 32, offset: 288)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !558, file: !228, line: 196, baseType: !36, size: 32, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !558, file: !228, line: 198, baseType: !36, size: 32, offset: 864)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !558, file: !228, line: 200, baseType: !579, size: 64, offset: 896)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !367, line: 77, size: 15424, elements: !581)
!581 = !{!582, !583, !584, !587, !590, !591, !594, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !614, !615, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !641, !642, !643, !644, !645, !649}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !580, file: !367, line: 78, baseType: !125, size: 960)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !580, file: !367, line: 80, baseType: !143, size: 8192, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !580, file: !367, line: 82, baseType: !585, size: 64, offset: 9152)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !367, line: 43, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !580, file: !367, line: 83, baseType: !588, size: 64, offset: 9216)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !52, line: 46, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !580, file: !367, line: 86, baseType: !365, size: 64, offset: 9280)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !580, file: !367, line: 87, baseType: !592, size: 64, offset: 9344)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !367, line: 44, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !580, file: !367, line: 89, baseType: !595, size: 512, offset: 9408)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 512, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !580, file: !367, line: 90, baseType: !61, size: 16, offset: 9920)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !580, file: !367, line: 90, baseType: !61, size: 16, offset: 9936)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !580, file: !367, line: 92, baseType: !61, size: 16, offset: 9952)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !580, file: !367, line: 92, baseType: !61, size: 16, offset: 9968)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !580, file: !367, line: 93, baseType: !61, size: 16, offset: 9984)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !580, file: !367, line: 93, baseType: !61, size: 16, offset: 10000)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !580, file: !367, line: 94, baseType: !36, size: 32, offset: 10016)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !580, file: !367, line: 97, baseType: !61, size: 16, offset: 10048)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !580, file: !367, line: 97, baseType: !61, size: 16, offset: 10064)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !580, file: !367, line: 98, baseType: !61, size: 16, offset: 10080)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !580, file: !367, line: 98, baseType: !61, size: 16, offset: 10096)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !580, file: !367, line: 99, baseType: !61, size: 16, offset: 10112)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !580, file: !367, line: 99, baseType: !61, size: 16, offset: 10128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !580, file: !367, line: 100, baseType: !5, size: 32, offset: 10144)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !580, file: !367, line: 101, baseType: !613, size: 64, offset: 10176)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !580, file: !367, line: 103, baseType: !149, size: 64, offset: 10240)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !580, file: !367, line: 104, baseType: !616, size: 64, offset: 10304)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !52, line: 159, size: 448, elements: !618)
!618 = !{!619, !621, !622, !624, !625, !627}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !617, file: !52, line: 161, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !231)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !617, file: !52, line: 162, baseType: !620, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !617, file: !52, line: 163, baseType: !623, size: 32, offset: 128)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !231)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !617, file: !52, line: 164, baseType: !623, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !617, file: !52, line: 165, baseType: !626, size: 128, offset: 192)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 128, elements: !231)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !617, file: !52, line: 166, baseType: !628, size: 128, offset: 320)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 128, elements: !231)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !580, file: !367, line: 107, baseType: !198, size: 32, offset: 10368)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !580, file: !367, line: 108, baseType: !36, size: 32, offset: 10400)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !580, file: !367, line: 109, baseType: !61, size: 16, offset: 10432)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !580, file: !367, line: 110, baseType: !61, size: 16, offset: 10448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !580, file: !367, line: 113, baseType: !36, size: 32, offset: 10464)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !580, file: !367, line: 113, baseType: !36, size: 32, offset: 10496)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !580, file: !367, line: 114, baseType: !28, size: 8, offset: 10528)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !580, file: !367, line: 114, baseType: !28, size: 8, offset: 10536)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !580, file: !367, line: 115, baseType: !61, size: 16, offset: 10544)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !580, file: !367, line: 116, baseType: !639, size: 128, offset: 10560)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 128, elements: !640)
!640 = !{!495}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !580, file: !367, line: 119, baseType: !198, size: 32, offset: 10688)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !580, file: !367, line: 119, baseType: !198, size: 32, offset: 10720)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !580, file: !367, line: 122, baseType: !399, size: 512, offset: 10752)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !580, file: !367, line: 123, baseType: !28, size: 8, offset: 11264)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !580, file: !367, line: 125, baseType: !646, size: 56, offset: 11272)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 56, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 7)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !580, file: !367, line: 126, baseType: !650, size: 4096, offset: 11328)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 4096, elements: !596)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !367, line: 69, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !367, line: 67, size: 512, elements: !653)
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !652, file: !367, line: 68, baseType: !46, size: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !558, file: !228, line: 201, baseType: !198, size: 32, offset: 960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !558, file: !228, line: 204, baseType: !36, size: 32, offset: 992)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !428, file: !228, line: 350, baseType: !71, size: 128, offset: 1984)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !428, file: !228, line: 351, baseType: !36, size: 32, offset: 2112)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !428, file: !228, line: 351, baseType: !36, size: 32, offset: 2144)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !428, file: !228, line: 353, baseType: !661, size: 64, offset: 2176)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !228, line: 297, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !228, line: 295, size: 2048, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !663, file: !228, line: 296, baseType: !348, size: 2048)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !428, file: !228, line: 355, baseType: !667, size: 384, offset: 2240)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !228, line: 338, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !228, line: 322, size: 384, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !668, file: !228, line: 323, baseType: !36, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !668, file: !228, line: 325, baseType: !61, size: 16, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !668, file: !228, line: 326, baseType: !61, size: 16, offset: 48)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !668, file: !228, line: 331, baseType: !71, size: 128, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !668, file: !228, line: 334, baseType: !71, size: 128, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !668, file: !228, line: 335, baseType: !36, size: 32, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !668, file: !228, line: 337, baseType: !36, size: 32, offset: 352)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !411, file: !173, line: 81, baseType: !69, size: 64, offset: 12224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !411, file: !173, line: 85, baseType: !679, size: 6208, offset: 12288)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !173, line: 55, size: 6208, elements: !680)
!680 = !{!681, !682, !683, !684, !685}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !679, file: !173, line: 56, baseType: !354, size: 6144)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !679, file: !173, line: 58, baseType: !61, size: 16, offset: 6144)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !679, file: !173, line: 59, baseType: !61, size: 16, offset: 6160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !679, file: !173, line: 60, baseType: !61, size: 16, offset: 6176)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !679, file: !173, line: 61, baseType: !61, size: 16, offset: 6192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !411, file: !173, line: 86, baseType: !36, size: 32, offset: 18496)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !411, file: !173, line: 88, baseType: !36, size: 32, offset: 18528)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !411, file: !173, line: 90, baseType: !36, size: 32, offset: 18560)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !411, file: !173, line: 94, baseType: !36, size: 32, offset: 18592)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !411, file: !173, line: 100, baseType: !399, size: 512, offset: 18624)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !303, file: !294, line: 154, baseType: !692, size: 64, offset: 1664)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !177, line: 264, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !303, file: !294, line: 156, baseType: !365, size: 64, offset: 1728)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !303, file: !294, line: 158, baseType: !198, size: 32, offset: 1792)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !303, file: !294, line: 159, baseType: !198, size: 32, offset: 1824)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !303, file: !294, line: 162, baseType: !306, size: 64, offset: 1856)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !303, file: !294, line: 162, baseType: !306, size: 64, offset: 1920)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !303, file: !294, line: 162, baseType: !306, size: 64, offset: 1984)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !303, file: !294, line: 164, baseType: !71, size: 128, offset: 2048)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !303, file: !294, line: 166, baseType: !702, size: 64, offset: 2176)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !294, line: 51, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !303, file: !294, line: 167, baseType: !69, size: 64, offset: 2240)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !303, file: !294, line: 168, baseType: !198, size: 32, offset: 2304)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !303, file: !294, line: 170, baseType: !198, size: 32, offset: 2336)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !303, file: !294, line: 170, baseType: !198, size: 32, offset: 2368)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !303, file: !294, line: 171, baseType: !198, size: 32, offset: 2400)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !303, file: !294, line: 173, baseType: !69, size: 64, offset: 2432)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !303, file: !294, line: 175, baseType: !36, size: 32, offset: 2496)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !303, file: !294, line: 176, baseType: !36, size: 32, offset: 2528)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !303, file: !294, line: 179, baseType: !36, size: 32, offset: 2560)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !303, file: !294, line: 180, baseType: !198, size: 32, offset: 2592)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !303, file: !294, line: 183, baseType: !36, size: 32, offset: 2624)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !303, file: !294, line: 185, baseType: !28, size: 8, offset: 2656)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !303, file: !294, line: 186, baseType: !717, size: 24, offset: 2664)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 24, elements: !199)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !303, file: !294, line: 189, baseType: !71, size: 128, offset: 2688)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !293, file: !294, line: 207, baseType: !143, size: 8192, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !293, file: !294, line: 208, baseType: !143, size: 8192, offset: 8576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !293, file: !294, line: 210, baseType: !36, size: 32, offset: 16768)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !293, file: !294, line: 210, baseType: !36, size: 32, offset: 16800)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !293, file: !294, line: 211, baseType: !36, size: 32, offset: 16832)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !294, line: 211, baseType: !36, size: 32, offset: 16864)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !293, file: !294, line: 212, baseType: !248, size: 128, offset: 16896)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !166, file: !167, line: 1246, baseType: !727, size: 64, offset: 2112)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !167, line: 1067, size: 5184, elements: !729)
!729 = !{!730, !760, !761, !776, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !798, !814, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !924}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !728, file: !167, line: 1068, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !167, line: 934, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !167, line: 925, size: 576, elements: !734)
!734 = !{!735, !752, !753, !754, !755, !756, !759}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !733, file: !167, line: 926, baseType: !736, size: 320)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !167, line: 830, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !167, line: 813, size: 320, elements: !738)
!738 = !{!739, !742, !745, !746, !749, !750, !751}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !737, file: !167, line: 814, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !167, line: 51, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !737, file: !167, line: 815, baseType: !743, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !167, line: 815, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !737, file: !167, line: 818, baseType: !69, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !737, file: !167, line: 819, baseType: !747, size: 32, offset: 192)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 32, elements: !640)
!748 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !737, file: !167, line: 822, baseType: !36, size: 32, offset: 224)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !737, file: !167, line: 826, baseType: !36, size: 32, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !737, file: !167, line: 829, baseType: !36, size: 32, offset: 288)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !733, file: !167, line: 928, baseType: !61, size: 16, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !733, file: !167, line: 928, baseType: !61, size: 16, offset: 336)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !733, file: !167, line: 929, baseType: !36, size: 32, offset: 352)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !733, file: !167, line: 930, baseType: !613, size: 64, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !733, file: !167, line: 931, baseType: !757, size: 64, offset: 448)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !167, line: 931, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !733, file: !167, line: 933, baseType: !69, size: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !728, file: !167, line: 1069, baseType: !731, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !728, file: !167, line: 1070, baseType: !762, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !167, line: 916, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !167, line: 891, size: 704, elements: !765)
!765 = !{!766, !767, !768, !770, !771, !772, !773, !774, !775}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !764, file: !167, line: 892, baseType: !736, size: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !167, line: 896, baseType: !36, size: 32, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !764, file: !167, line: 900, baseType: !769, size: 96, offset: 352)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 96, elements: !199)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !764, file: !167, line: 903, baseType: !198, size: 32, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !764, file: !167, line: 906, baseType: !36, size: 32, offset: 480)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !764, file: !167, line: 909, baseType: !198, size: 32, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !764, file: !167, line: 912, baseType: !198, size: 32, offset: 544)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !764, file: !167, line: 914, baseType: !175, size: 64, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !764, file: !167, line: 915, baseType: !69, size: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !728, file: !167, line: 1071, baseType: !777, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !167, line: 920, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !167, line: 918, size: 320, elements: !780)
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !779, file: !167, line: 919, baseType: !736, size: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !728, file: !167, line: 1075, baseType: !198, size: 32, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !728, file: !167, line: 1077, baseType: !198, size: 32, offset: 288)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !728, file: !167, line: 1078, baseType: !198, size: 32, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !728, file: !167, line: 1079, baseType: !61, size: 16, offset: 352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !728, file: !167, line: 1082, baseType: !61, size: 16, offset: 368)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !728, file: !167, line: 1085, baseType: !28, size: 8, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !728, file: !167, line: 1086, baseType: !28, size: 8, offset: 392)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !728, file: !167, line: 1087, baseType: !28, size: 8, offset: 400)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !728, file: !167, line: 1088, baseType: !28, size: 8, offset: 408)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !728, file: !167, line: 1090, baseType: !198, size: 32, offset: 416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !728, file: !167, line: 1093, baseType: !61, size: 16, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !728, file: !167, line: 1096, baseType: !28, size: 8, offset: 464)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !728, file: !167, line: 1098, baseType: !795, size: 40, offset: 472)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 40, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 5)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !728, file: !167, line: 1101, baseType: !799, size: 832, offset: 512)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !167, line: 836, size: 832, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !799, file: !167, line: 837, baseType: !736, size: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !799, file: !167, line: 839, baseType: !61, size: 16, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !799, file: !167, line: 839, baseType: !61, size: 16, offset: 336)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !799, file: !167, line: 842, baseType: !61, size: 16, offset: 352)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !799, file: !167, line: 842, baseType: !61, size: 16, offset: 368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !799, file: !167, line: 843, baseType: !623, size: 32, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !799, file: !167, line: 845, baseType: !36, size: 32, offset: 416)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !799, file: !167, line: 847, baseType: !69, size: 64, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !799, file: !167, line: 848, baseType: !579, size: 64, offset: 512)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !799, file: !167, line: 849, baseType: !579, size: 64, offset: 576)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !799, file: !167, line: 850, baseType: !579, size: 64, offset: 640)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !799, file: !167, line: 851, baseType: !197, size: 96, offset: 704)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !799, file: !167, line: 852, baseType: !198, size: 32, offset: 800)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !728, file: !167, line: 1104, baseType: !815, size: 1344, offset: 1344)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !167, line: 867, size: 1344, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !832, !833, !834, !835, !836, !837, !838, !839, !840}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !815, file: !167, line: 868, baseType: !61, size: 16)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !815, file: !167, line: 869, baseType: !61, size: 16, offset: 16)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !815, file: !167, line: 870, baseType: !61, size: 16, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !815, file: !167, line: 871, baseType: !61, size: 16, offset: 48)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !815, file: !167, line: 873, baseType: !822, size: 896, offset: 64)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 896, elements: !647)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !167, line: 864, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !167, line: 859, size: 128, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !824, file: !167, line: 860, baseType: !61, size: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !824, file: !167, line: 861, baseType: !61, size: 16, offset: 16)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !824, file: !167, line: 861, baseType: !61, size: 16, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !824, file: !167, line: 861, baseType: !61, size: 16, offset: 48)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !824, file: !167, line: 862, baseType: !36, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !824, file: !167, line: 863, baseType: !198, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !815, file: !167, line: 874, baseType: !69, size: 64, offset: 960)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !815, file: !167, line: 876, baseType: !198, size: 32, offset: 1024)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !815, file: !167, line: 876, baseType: !198, size: 32, offset: 1056)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !815, file: !167, line: 878, baseType: !36, size: 32, offset: 1088)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !815, file: !167, line: 879, baseType: !36, size: 32, offset: 1120)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !815, file: !167, line: 881, baseType: !36, size: 32, offset: 1152)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !815, file: !167, line: 881, baseType: !36, size: 32, offset: 1184)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !815, file: !167, line: 883, baseType: !165, size: 64, offset: 1216)
