; ModuleID = 'blender/source/blender/editors/armature/armature_select.c'
source_filename = "blender/source/blender/editors/armature/armature_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Bone = type { %struct.Bone*, %struct.Bone*, %struct.IDProperty*, %struct.Bone*, %struct.ListBase, [64 x i8], float, [3 x float], [3 x float], [3 x [3 x float]], i32, [3 x float], [3 x float], [4 x [4 x float]], float, float, float, float, float, float, float, float, float, float, [3 x float], i32, i16, [1 x i16] }
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prop_similar_types", scope: !2, file: !3, line: 797, type: !1965, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !234, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/editors/armature/armature_select.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !32, !41}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBone_Flag", file: !6, line: 187, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!9 = !DIEnumerator(name: "BONE_SELECTED", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "BONE_ROOTSEL", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "BONE_TIPSEL", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "BONE_TRANSFORM", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "BONE_CONNECTED", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!15 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!16 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!17 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!18 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!19 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!20 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!21 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!22 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!23 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!24 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!25 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!26 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!27 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!28 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!29 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!30 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!31 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 351, baseType: !7, size: 32, elements: !34)
!33 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!34 = !{!35, !36, !37, !38, !39, !40}
!35 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!38 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!39 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!40 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !33, line: 67, baseType: !7, size: 32, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51}
!43 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!46 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!47 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!49 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!50 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!51 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!52 = !{!53, !54, !229, !231, !94, !149}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !6, line: 114, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !6, line: 78, size: 2048, elements: !57)
!57 = !{!58, !129, !132, !133, !134, !136, !182, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !56, file: !6, line: 79, baseType: !59, size: 960)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !60, line: 130, baseType: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !60, line: 117, size: 960, elements: !62)
!62 = !{!63, !64, !65, !67, !87, !91, !93, !95, !96, !97}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !60, line: 118, baseType: !53, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !61, file: !60, line: 118, baseType: !53, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !61, file: !60, line: 119, baseType: !66, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !61, file: !60, line: 120, baseType: !68, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !60, line: 136, size: 17600, elements: !70)
!70 = !{!71, !72, !74, !77, !82, !83, !84}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !69, file: !60, line: 137, baseType: !59, size: 960)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !69, file: !60, line: 138, baseType: !73, size: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !69, file: !60, line: 139, baseType: !75, size: 64, offset: 1024)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !60, line: 43, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !60, line: 140, baseType: !78, size: 8192, offset: 1088)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8192, elements: !80)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !{!81}
!81 = !DISubrange(count: 1024)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !69, file: !60, line: 141, baseType: !78, size: 8192, offset: 9280)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !69, file: !60, line: 148, baseType: !68, size: 64, offset: 17472)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !69, file: !60, line: 150, baseType: !85, size: 64, offset: 17536)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !60, line: 45, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !60, line: 121, baseType: !88, size: 528, offset: 256)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 528, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 66)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !61, file: !60, line: 126, baseType: !92, size: 16, offset: 784)
!92 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !61, file: !60, line: 127, baseType: !94, size: 32, offset: 800)
!94 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !61, file: !60, line: 128, baseType: !94, size: 32, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !61, file: !60, line: 128, baseType: !94, size: 32, offset: 864)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !61, file: !60, line: 129, baseType: !98, size: 64, offset: 896)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !60, line: 75, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !60, line: 62, size: 1024, elements: !101)
!101 = !{!102, !104, !105, !106, !107, !108, !112, !113, !127, !128}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !60, line: 63, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !60, line: 63, baseType: !103, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !60, line: 64, baseType: !79, size: 8, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !100, file: !60, line: 64, baseType: !79, size: 8, offset: 136)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !100, file: !60, line: 65, baseType: !92, size: 16, offset: 144)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !60, line: 66, baseType: !109, size: 512, offset: 160)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 512, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !100, file: !60, line: 67, baseType: !94, size: 32, offset: 672)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !60, line: 69, baseType: !114, size: 256, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !60, line: 60, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !60, line: 48, size: 256, elements: !116)
!116 = !{!117, !118, !125, !126}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !115, file: !60, line: 49, baseType: !53, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !115, file: !60, line: 58, baseType: !119, size: 128, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !120, line: 71, baseType: !121)
!120 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !120, line: 69, size: 128, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !121, file: !120, line: 70, baseType: !53, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !121, file: !120, line: 70, baseType: !53, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !115, file: !60, line: 59, baseType: !94, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !115, file: !60, line: 59, baseType: !94, size: 32, offset: 224)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !100, file: !60, line: 70, baseType: !94, size: 32, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !100, file: !60, line: 74, baseType: !94, size: 32, offset: 992)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !56, file: !6, line: 80, baseType: !130, size: 64, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !6, line: 37, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !56, file: !6, line: 82, baseType: !119, size: 128, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !56, file: !6, line: 83, baseType: !119, size: 128, offset: 1152)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !56, file: !6, line: 84, baseType: !135, size: 64, offset: 1280)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !56, file: !6, line: 92, baseType: !137, size: 64, offset: 1344)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !6, line: 76, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !6, line: 48, size: 2624, elements: !140)
!140 = !{!141, !143, !144, !145, !146, !147, !148, !150, !154, !155, !158, !159, !160, !161, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !139, file: !6, line: 49, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !139, file: !6, line: 49, baseType: !142, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !139, file: !6, line: 50, baseType: !98, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !139, file: !6, line: 51, baseType: !142, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !139, file: !6, line: 52, baseType: !119, size: 128, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !6, line: 53, baseType: !109, size: 512, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !139, file: !6, line: 55, baseType: !149, size: 32, offset: 896)
!149 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !139, file: !6, line: 56, baseType: !151, size: 96, offset: 928)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !139, file: !6, line: 57, baseType: !151, size: 96, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !139, file: !6, line: 58, baseType: !156, size: 288, offset: 1120)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 288, elements: !157)
!157 = !{!153, !153}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !139, file: !6, line: 60, baseType: !94, size: 32, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !139, file: !6, line: 62, baseType: !151, size: 96, offset: 1440)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !139, file: !6, line: 63, baseType: !151, size: 96, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !139, file: !6, line: 64, baseType: !162, size: 512, offset: 1632)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 512, elements: !163)
!163 = !{!164, !164}
!164 = !DISubrange(count: 4)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !139, file: !6, line: 65, baseType: !149, size: 32, offset: 2144)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !139, file: !6, line: 67, baseType: !149, size: 32, offset: 2176)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !139, file: !6, line: 67, baseType: !149, size: 32, offset: 2208)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !139, file: !6, line: 68, baseType: !149, size: 32, offset: 2240)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !139, file: !6, line: 68, baseType: !149, size: 32, offset: 2272)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !139, file: !6, line: 68, baseType: !149, size: 32, offset: 2304)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !139, file: !6, line: 69, baseType: !149, size: 32, offset: 2336)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !139, file: !6, line: 69, baseType: !149, size: 32, offset: 2368)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !139, file: !6, line: 70, baseType: !149, size: 32, offset: 2400)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !139, file: !6, line: 70, baseType: !149, size: 32, offset: 2432)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !139, file: !6, line: 72, baseType: !151, size: 96, offset: 2464)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !139, file: !6, line: 73, baseType: !94, size: 32, offset: 2560)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !139, file: !6, line: 74, baseType: !92, size: 16, offset: 2592)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !139, file: !6, line: 75, baseType: !179, size: 16, offset: 2608)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 16, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 1)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !56, file: !6, line: 93, baseType: !183, size: 64, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !185, line: 56, size: 1472, elements: !186)
!185 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !185, line: 57, baseType: !183, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !185, line: 57, baseType: !183, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !184, file: !185, line: 58, baseType: !103, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !184, file: !185, line: 59, baseType: !183, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !184, file: !185, line: 62, baseType: !53, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !185, line: 64, baseType: !109, size: 512, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !184, file: !185, line: 65, baseType: !149, size: 32, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !184, file: !185, line: 70, baseType: !151, size: 96, offset: 864)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !184, file: !185, line: 71, baseType: !151, size: 96, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !184, file: !185, line: 75, baseType: !94, size: 32, offset: 1056)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !184, file: !185, line: 76, baseType: !94, size: 32, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !184, file: !185, line: 78, baseType: !149, size: 32, offset: 1120)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !184, file: !185, line: 78, baseType: !149, size: 32, offset: 1152)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !184, file: !185, line: 79, baseType: !149, size: 32, offset: 1184)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !184, file: !185, line: 79, baseType: !149, size: 32, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !184, file: !185, line: 79, baseType: !149, size: 32, offset: 1248)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !184, file: !185, line: 80, baseType: !149, size: 32, offset: 1280)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !184, file: !185, line: 80, baseType: !149, size: 32, offset: 1312)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !184, file: !185, line: 81, baseType: !149, size: 32, offset: 1344)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !184, file: !185, line: 81, baseType: !149, size: 32, offset: 1376)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "oldlength", scope: !184, file: !185, line: 83, baseType: !149, size: 32, offset: 1408)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !184, file: !185, line: 85, baseType: !92, size: 16, offset: 1440)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !56, file: !6, line: 95, baseType: !53, size: 64, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !56, file: !6, line: 97, baseType: !94, size: 32, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !56, file: !6, line: 98, baseType: !94, size: 32, offset: 1568)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !56, file: !6, line: 99, baseType: !94, size: 32, offset: 1600)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !56, file: !6, line: 100, baseType: !94, size: 32, offset: 1632)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !56, file: !6, line: 101, baseType: !92, size: 16, offset: 1664)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !56, file: !6, line: 102, baseType: !92, size: 16, offset: 1680)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !56, file: !6, line: 104, baseType: !7, size: 32, offset: 1696)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !56, file: !6, line: 105, baseType: !7, size: 32, offset: 1728)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !56, file: !6, line: 105, baseType: !7, size: 32, offset: 1760)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !56, file: !6, line: 108, baseType: !92, size: 16, offset: 1792)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !56, file: !6, line: 108, baseType: !92, size: 16, offset: 1808)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !56, file: !6, line: 109, baseType: !92, size: 16, offset: 1824)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !56, file: !6, line: 109, baseType: !92, size: 16, offset: 1840)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !56, file: !6, line: 110, baseType: !94, size: 32, offset: 1856)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !56, file: !6, line: 110, baseType: !94, size: 32, offset: 1888)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !56, file: !6, line: 111, baseType: !94, size: 32, offset: 1920)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !56, file: !6, line: 111, baseType: !94, size: 32, offset: 1952)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !56, file: !6, line: 112, baseType: !94, size: 32, offset: 1984)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !56, file: !6, line: 112, baseType: !94, size: 32, offset: 2016)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditBone", file: !185, line: 86, baseType: !184)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !232, line: 87, baseType: !233)
!232 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!233 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!234 = !{!235, !0}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "direction_items", scope: !237, file: !3, line: 1044, type: !1956, isLocal: true, isDefinition: true)
!237 = distinct !DISubprogram(name: "ARMATURE_OT_select_hierarchy", scope: !3, file: !3, line: 1042, type: !238, scopeLine: 1043, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1955)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !242, line: 568, baseType: !243)
!242 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !242, line: 508, size: 1536, elements: !244)
!244 = !{!245, !248, !249, !250, !251, !1881, !1885, !1891, !1895, !1896, !1900, !1901, !1902, !1903, !1907, !1908, !1923, !1924, !1928, !1954}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !242, line: 509, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !243, file: !242, line: 510, baseType: !246, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !243, file: !242, line: 511, baseType: !246, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !243, file: !242, line: 512, baseType: !246, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !243, file: !242, line: 518, baseType: !252, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!94, !255, !258}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !257, line: 44, flags: DIFlagFwdDecl)
!257 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !33, line: 328, size: 1344, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !267, !268, !269, !281, !1874, !1875, !1876, !1879, !1880}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !33, line: 329, baseType: !258, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !259, file: !33, line: 329, baseType: !258, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !259, file: !33, line: 332, baseType: !109, size: 512, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !259, file: !33, line: 333, baseType: !98, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !259, file: !33, line: 336, baseType: !266, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !259, file: !33, line: 337, baseType: !53, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !259, file: !33, line: 338, baseType: !53, size: 64, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !259, file: !33, line: 340, baseType: !270, size: 64, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !257, line: 55, size: 192, elements: !272)
!272 = !{!273, !277, !280}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !271, file: !257, line: 58, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !271, file: !257, line: 56, size: 64, elements: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !257, line: 57, baseType: !53, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !271, file: !257, line: 60, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !257, line: 41, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !271, file: !257, line: 61, baseType: !53, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !259, file: !33, line: 341, baseType: !282, size: 64, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !33, line: 106, size: 320, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !283, file: !33, line: 107, baseType: !119, size: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !283, file: !33, line: 108, baseType: !94, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !283, file: !33, line: 109, baseType: !94, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !33, line: 110, baseType: !94, size: 32, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !283, file: !33, line: 110, baseType: !94, size: 32, offset: 224)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !283, file: !33, line: 111, baseType: !291, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !242, line: 490, size: 768, elements: !293)
!293 = !{!294, !295, !296, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !292, file: !242, line: 491, baseType: !291, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !292, file: !242, line: 491, baseType: !291, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !292, file: !242, line: 493, baseType: !297, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !33, line: 169, size: 2048, elements: !299)
!299 = !{!300, !301, !302, !303, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1840, !1843, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !33, line: 170, baseType: !297, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !298, file: !33, line: 170, baseType: !297, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !298, file: !33, line: 172, baseType: !53, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !298, file: !33, line: 174, baseType: !304, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !306, line: 49, size: 1984, elements: !307)
!306 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!307 = !{!308, !309, !310, !311, !312, !313, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !305, file: !306, line: 50, baseType: !59, size: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !305, file: !306, line: 52, baseType: !119, size: 128, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !305, file: !306, line: 53, baseType: !119, size: 128, offset: 1088)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !305, file: !306, line: 54, baseType: !119, size: 128, offset: 1216)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !305, file: !306, line: 55, baseType: !119, size: 128, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !305, file: !306, line: 57, baseType: !314, size: 64, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !316, line: 1216, size: 39680, elements: !317)
!316 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!317 = !{!318, !319, !320, !605, !608, !609, !610, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !634, !705, !1133, !1348, !1351, !1640, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1662, !1663, !1664, !1665, !1666, !1674, !1741, !1748, !1749, !1756, !1757, !1758, !1759, !1760, !1761, !1762}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !315, file: !316, line: 1217, baseType: !59, size: 960)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !315, file: !316, line: 1218, baseType: !130, size: 64, offset: 960)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !315, file: !316, line: 1220, baseType: !321, size: 64, offset: 1024)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !323, line: 115, size: 11392, elements: !324)
!323 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = !{!325, !326, !327, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !345, !355, !369, !370, !411, !412, !415, !416, !432, !433, !434, !435, !436, !437, !438, !442, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !520, !521, !522, !523, !524, !525, !526, !527, !528, !531, !534, !537, !538, !539, !540, !541, !544, !547, !550, !551, !557, !558, !559, !560, !561, !562, !563, !566, !569, !573, !593, !594}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !322, file: !323, line: 116, baseType: !59, size: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !322, file: !323, line: 117, baseType: !130, size: 64, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !322, file: !323, line: 119, baseType: !328, size: 64, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !323, line: 57, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !323, line: 121, baseType: !92, size: 16, offset: 1088)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !322, file: !323, line: 121, baseType: !92, size: 16, offset: 1104)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !322, file: !323, line: 122, baseType: !94, size: 32, offset: 1120)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !322, file: !323, line: 122, baseType: !94, size: 32, offset: 1152)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !322, file: !323, line: 122, baseType: !94, size: 32, offset: 1184)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !322, file: !323, line: 123, baseType: !109, size: 512, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !322, file: !323, line: 124, baseType: !321, size: 64, offset: 1728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !322, file: !323, line: 124, baseType: !321, size: 64, offset: 1792)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !322, file: !323, line: 127, baseType: !321, size: 64, offset: 1856)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !322, file: !323, line: 127, baseType: !321, size: 64, offset: 1920)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !322, file: !323, line: 127, baseType: !321, size: 64, offset: 1984)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !322, file: !323, line: 128, baseType: !342, size: 64, offset: 2048)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !344, line: 46, flags: DIFlagFwdDecl)
!344 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !322, file: !323, line: 130, baseType: !346, size: 64, offset: 2112)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !323, line: 97, size: 832, elements: !348)
!348 = !{!349, !353, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !347, file: !323, line: 98, baseType: !350, size: 768)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 768, elements: !351)
!351 = !{!352, !153}
!352 = !DISubrange(count: 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !323, line: 99, baseType: !94, size: 32, offset: 768)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !347, file: !323, line: 99, baseType: !94, size: 32, offset: 800)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !322, file: !323, line: 131, baseType: !356, size: 64, offset: 2176)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !358, line: 486, size: 1600, elements: !359)
!358 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !357, file: !358, line: 487, baseType: !59, size: 960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !357, file: !358, line: 489, baseType: !119, size: 128, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !357, file: !358, line: 490, baseType: !119, size: 128, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !357, file: !358, line: 491, baseType: !119, size: 128, offset: 1216)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !357, file: !358, line: 492, baseType: !119, size: 128, offset: 1344)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !357, file: !358, line: 494, baseType: !94, size: 32, offset: 1472)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !357, file: !358, line: 495, baseType: !94, size: 32, offset: 1504)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !357, file: !358, line: 497, baseType: !94, size: 32, offset: 1536)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !357, file: !358, line: 498, baseType: !94, size: 32, offset: 1568)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !322, file: !323, line: 132, baseType: !356, size: 64, offset: 2240)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !322, file: !323, line: 133, baseType: !371, size: 64, offset: 2304)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !358, line: 334, size: 1728, elements: !373)
!373 = !{!374, !375, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !410}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !372, file: !358, line: 335, baseType: !119, size: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !372, file: !358, line: 336, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !358, line: 47, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !372, file: !358, line: 338, baseType: !92, size: 16, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !372, file: !358, line: 338, baseType: !92, size: 16, offset: 208)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !372, file: !358, line: 339, baseType: !7, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !372, file: !358, line: 340, baseType: !94, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !372, file: !358, line: 342, baseType: !149, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !372, file: !358, line: 343, baseType: !151, size: 96, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !372, file: !358, line: 344, baseType: !151, size: 96, offset: 416)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !372, file: !358, line: 347, baseType: !119, size: 128, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !372, file: !358, line: 349, baseType: !94, size: 32, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !372, file: !358, line: 350, baseType: !94, size: 32, offset: 672)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !372, file: !358, line: 351, baseType: !53, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !372, file: !358, line: 352, baseType: !53, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !372, file: !358, line: 354, baseType: !391, size: 384, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !358, line: 116, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !358, line: 94, size: 384, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !392, file: !358, line: 96, baseType: !94, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !392, file: !358, line: 96, baseType: !94, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !392, file: !358, line: 97, baseType: !94, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !392, file: !358, line: 97, baseType: !94, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !392, file: !358, line: 99, baseType: !92, size: 16, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !392, file: !358, line: 100, baseType: !92, size: 16, offset: 144)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !392, file: !358, line: 102, baseType: !92, size: 16, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !392, file: !358, line: 105, baseType: !92, size: 16, offset: 176)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !392, file: !358, line: 108, baseType: !92, size: 16, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !392, file: !358, line: 109, baseType: !92, size: 16, offset: 208)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !392, file: !358, line: 111, baseType: !92, size: 16, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !392, file: !358, line: 112, baseType: !92, size: 16, offset: 240)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !392, file: !358, line: 114, baseType: !94, size: 32, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !392, file: !358, line: 114, baseType: !94, size: 32, offset: 288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !392, file: !358, line: 115, baseType: !94, size: 32, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !392, file: !358, line: 115, baseType: !94, size: 32, offset: 352)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !372, file: !358, line: 355, baseType: !109, size: 512, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !322, file: !323, line: 134, baseType: !53, size: 64, offset: 2368)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !322, file: !323, line: 136, baseType: !413, size: 64, offset: 2432)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !323, line: 58, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !322, file: !323, line: 138, baseType: !391, size: 384, offset: 2496)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !322, file: !323, line: 139, baseType: !417, size: 64, offset: 2880)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !358, line: 80, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !358, line: 72, size: 192, elements: !420)
!420 = !{!421, !428, !429, !430, !431}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !419, file: !358, line: 73, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !358, line: 59, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !358, line: 56, size: 128, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !424, file: !358, line: 57, baseType: !151, size: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !424, file: !358, line: 58, baseType: !94, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !419, file: !358, line: 74, baseType: !94, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !419, file: !358, line: 76, baseType: !94, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !419, file: !358, line: 77, baseType: !94, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !358, line: 79, baseType: !94, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !322, file: !323, line: 141, baseType: !119, size: 128, offset: 2944)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !322, file: !323, line: 142, baseType: !119, size: 128, offset: 3072)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !322, file: !323, line: 143, baseType: !119, size: 128, offset: 3200)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !322, file: !323, line: 144, baseType: !119, size: 128, offset: 3328)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !322, file: !323, line: 146, baseType: !94, size: 32, offset: 3456)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !322, file: !323, line: 147, baseType: !94, size: 32, offset: 3488)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !322, file: !323, line: 150, baseType: !439, size: 64, offset: 3520)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !323, line: 50, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !322, file: !323, line: 151, baseType: !443, size: 64, offset: 3584)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !322, file: !323, line: 152, baseType: !94, size: 32, offset: 3648)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !322, file: !323, line: 153, baseType: !94, size: 32, offset: 3680)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !322, file: !323, line: 156, baseType: !151, size: 96, offset: 3712)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !322, file: !323, line: 156, baseType: !151, size: 96, offset: 3808)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !322, file: !323, line: 156, baseType: !151, size: 96, offset: 3904)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !322, file: !323, line: 157, baseType: !151, size: 96, offset: 4000)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !322, file: !323, line: 158, baseType: !151, size: 96, offset: 4096)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !322, file: !323, line: 159, baseType: !151, size: 96, offset: 4192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !322, file: !323, line: 160, baseType: !151, size: 96, offset: 4288)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !322, file: !323, line: 160, baseType: !151, size: 96, offset: 4384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !322, file: !323, line: 161, baseType: !455, size: 128, offset: 4480)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 128, elements: !456)
!456 = !{!164}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !322, file: !323, line: 161, baseType: !455, size: 128, offset: 4608)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !322, file: !323, line: 162, baseType: !151, size: 96, offset: 4736)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !322, file: !323, line: 162, baseType: !151, size: 96, offset: 4832)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !322, file: !323, line: 163, baseType: !149, size: 32, offset: 4928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !322, file: !323, line: 163, baseType: !149, size: 32, offset: 4960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !322, file: !323, line: 164, baseType: !162, size: 512, offset: 4992)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !322, file: !323, line: 165, baseType: !162, size: 512, offset: 5504)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !322, file: !323, line: 166, baseType: !162, size: 512, offset: 6016)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !322, file: !323, line: 167, baseType: !162, size: 512, offset: 6528)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !322, file: !323, line: 176, baseType: !162, size: 512, offset: 7040)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !322, file: !323, line: 178, baseType: !7, size: 32, offset: 7552)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !323, line: 180, baseType: !92, size: 16, offset: 7584)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !322, file: !323, line: 181, baseType: !92, size: 16, offset: 7600)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !322, file: !323, line: 183, baseType: !92, size: 16, offset: 7616)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !322, file: !323, line: 183, baseType: !92, size: 16, offset: 7632)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !322, file: !323, line: 184, baseType: !92, size: 16, offset: 7648)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !322, file: !323, line: 184, baseType: !92, size: 16, offset: 7664)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !322, file: !323, line: 185, baseType: !92, size: 16, offset: 7680)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !322, file: !323, line: 186, baseType: !92, size: 16, offset: 7696)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !322, file: !323, line: 187, baseType: !92, size: 16, offset: 7712)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !322, file: !323, line: 188, baseType: !79, size: 8, offset: 7728)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !322, file: !323, line: 189, baseType: !79, size: 8, offset: 7736)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !322, file: !323, line: 192, baseType: !94, size: 32, offset: 7744)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !322, file: !323, line: 192, baseType: !94, size: 32, offset: 7776)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !322, file: !323, line: 192, baseType: !94, size: 32, offset: 7808)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !322, file: !323, line: 192, baseType: !94, size: 32, offset: 7840)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !322, file: !323, line: 194, baseType: !94, size: 32, offset: 7872)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !322, file: !323, line: 202, baseType: !149, size: 32, offset: 7904)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !322, file: !323, line: 202, baseType: !149, size: 32, offset: 7936)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !322, file: !323, line: 202, baseType: !149, size: 32, offset: 7968)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !322, file: !323, line: 211, baseType: !149, size: 32, offset: 8000)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !322, file: !323, line: 212, baseType: !149, size: 32, offset: 8032)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !322, file: !323, line: 213, baseType: !149, size: 32, offset: 8064)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !322, file: !323, line: 214, baseType: !149, size: 32, offset: 8096)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !322, file: !323, line: 215, baseType: !149, size: 32, offset: 8128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !322, file: !323, line: 216, baseType: !149, size: 32, offset: 8160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !322, file: !323, line: 219, baseType: !149, size: 32, offset: 8192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !322, file: !323, line: 220, baseType: !149, size: 32, offset: 8224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !322, file: !323, line: 221, baseType: !149, size: 32, offset: 8256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !322, file: !323, line: 224, baseType: !497, size: 16, offset: 8288)
!497 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !322, file: !323, line: 224, baseType: !497, size: 16, offset: 8304)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !322, file: !323, line: 226, baseType: !92, size: 16, offset: 8320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !322, file: !323, line: 228, baseType: !79, size: 8, offset: 8336)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !322, file: !323, line: 229, baseType: !79, size: 8, offset: 8344)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !322, file: !323, line: 231, baseType: !92, size: 16, offset: 8352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !322, file: !323, line: 232, baseType: !79, size: 8, offset: 8368)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !322, file: !323, line: 233, baseType: !79, size: 8, offset: 8376)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !322, file: !323, line: 234, baseType: !149, size: 32, offset: 8384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !322, file: !323, line: 235, baseType: !149, size: 32, offset: 8416)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !322, file: !323, line: 237, baseType: !119, size: 128, offset: 8448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !322, file: !323, line: 238, baseType: !119, size: 128, offset: 8576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !322, file: !323, line: 239, baseType: !119, size: 128, offset: 8704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !322, file: !323, line: 240, baseType: !119, size: 128, offset: 8832)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !322, file: !323, line: 242, baseType: !149, size: 32, offset: 8960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !322, file: !323, line: 244, baseType: !92, size: 16, offset: 8992)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !322, file: !323, line: 245, baseType: !497, size: 16, offset: 9008)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !322, file: !323, line: 246, baseType: !455, size: 128, offset: 9024)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !322, file: !323, line: 248, baseType: !94, size: 32, offset: 9152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !322, file: !323, line: 249, baseType: !94, size: 32, offset: 9184)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !322, file: !323, line: 251, baseType: !518, size: 64, offset: 9216)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !323, line: 251, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !322, file: !323, line: 253, baseType: !79, size: 8, offset: 9280)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !322, file: !323, line: 254, baseType: !79, size: 8, offset: 9288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !322, file: !323, line: 255, baseType: !92, size: 16, offset: 9296)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !322, file: !323, line: 256, baseType: !151, size: 96, offset: 9312)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !322, file: !323, line: 258, baseType: !119, size: 128, offset: 9408)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !322, file: !323, line: 259, baseType: !119, size: 128, offset: 9536)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !322, file: !323, line: 260, baseType: !119, size: 128, offset: 9664)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !322, file: !323, line: 261, baseType: !119, size: 128, offset: 9792)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !322, file: !323, line: 263, baseType: !529, size: 64, offset: 9920)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !323, line: 52, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !322, file: !323, line: 264, baseType: !532, size: 64, offset: 9984)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !323, line: 53, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !322, file: !323, line: 265, baseType: !535, size: 64, offset: 10048)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !358, line: 46, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !322, file: !323, line: 267, baseType: !79, size: 8, offset: 10112)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !322, file: !323, line: 268, baseType: !79, size: 8, offset: 10120)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !322, file: !323, line: 269, baseType: !92, size: 16, offset: 10128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !322, file: !323, line: 270, baseType: !149, size: 32, offset: 10144)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !322, file: !323, line: 272, baseType: !542, size: 64, offset: 10176)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !323, line: 54, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !322, file: !323, line: 275, baseType: !545, size: 64, offset: 10240)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !323, line: 275, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !322, file: !323, line: 277, baseType: !548, size: 64, offset: 10304)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !323, line: 56, flags: DIFlagFwdDecl)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !322, file: !323, line: 277, baseType: !548, size: 64, offset: 10368)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !322, file: !323, line: 278, baseType: !552, size: 64, offset: 10432)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !553, line: 27, baseType: !554)
!553 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !555, line: 45, baseType: !556)
!555 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!556 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !322, file: !323, line: 279, baseType: !552, size: 64, offset: 10496)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !322, file: !323, line: 280, baseType: !7, size: 32, offset: 10560)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !322, file: !323, line: 281, baseType: !7, size: 32, offset: 10592)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !322, file: !323, line: 283, baseType: !119, size: 128, offset: 10624)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !322, file: !323, line: 284, baseType: !119, size: 128, offset: 10752)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !322, file: !323, line: 285, baseType: !135, size: 64, offset: 10880)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !322, file: !323, line: 287, baseType: !564, size: 64, offset: 10944)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !323, line: 59, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !322, file: !323, line: 288, baseType: !567, size: 64, offset: 11008)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !323, line: 288, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !322, file: !323, line: 290, baseType: !570, size: 64, offset: 11072)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 2)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !322, file: !323, line: 291, baseType: !574, size: 64, offset: 11136)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !576, line: 65, baseType: !577)
!576 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !576, line: 50, size: 320, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !577, file: !576, line: 51, baseType: !314, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !577, file: !576, line: 53, baseType: !94, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !577, file: !576, line: 54, baseType: !94, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !577, file: !576, line: 55, baseType: !94, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !577, file: !576, line: 55, baseType: !94, size: 32, offset: 160)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !577, file: !576, line: 56, baseType: !79, size: 8, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !577, file: !576, line: 56, baseType: !79, size: 8, offset: 200)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !577, file: !576, line: 57, baseType: !79, size: 8, offset: 208)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !577, file: !576, line: 57, baseType: !79, size: 8, offset: 216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !577, file: !576, line: 59, baseType: !92, size: 16, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !577, file: !576, line: 59, baseType: !92, size: 16, offset: 240)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !577, file: !576, line: 59, baseType: !92, size: 16, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !577, file: !576, line: 61, baseType: !92, size: 16, offset: 272)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !577, file: !576, line: 63, baseType: !94, size: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !322, file: !323, line: 293, baseType: !119, size: 128, offset: 11200)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !322, file: !323, line: 294, baseType: !595, size: 64, offset: 11328)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !323, line: 113, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !323, line: 108, size: 256, elements: !598)
!598 = !{!599, !601, !602, !603, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !597, file: !323, line: 109, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !597, file: !323, line: 109, baseType: !600, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !597, file: !323, line: 110, baseType: !321, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !597, file: !323, line: 111, baseType: !94, size: 32, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !597, file: !323, line: 112, baseType: !149, size: 32, offset: 224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !315, file: !316, line: 1221, baseType: !606, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !316, line: 52, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !315, file: !316, line: 1223, baseType: !314, size: 64, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !315, file: !316, line: 1225, baseType: !119, size: 128, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !315, file: !316, line: 1226, baseType: !611, size: 64, offset: 1344)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !316, line: 69, size: 320, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !612, file: !316, line: 70, baseType: !611, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !612, file: !316, line: 70, baseType: !611, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !612, file: !316, line: 71, baseType: !7, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !612, file: !316, line: 71, baseType: !7, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !612, file: !316, line: 72, baseType: !94, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !612, file: !316, line: 73, baseType: !92, size: 16, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !612, file: !316, line: 73, baseType: !92, size: 16, offset: 240)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !612, file: !316, line: 74, baseType: !321, size: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !315, file: !316, line: 1227, baseType: !321, size: 64, offset: 1408)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !315, file: !316, line: 1229, baseType: !151, size: 96, offset: 1472)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !315, file: !316, line: 1230, baseType: !151, size: 96, offset: 1568)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !315, file: !316, line: 1231, baseType: !151, size: 96, offset: 1664)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !315, file: !316, line: 1231, baseType: !151, size: 96, offset: 1760)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !315, file: !316, line: 1233, baseType: !7, size: 32, offset: 1856)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !315, file: !316, line: 1234, baseType: !94, size: 32, offset: 1888)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !315, file: !316, line: 1235, baseType: !7, size: 32, offset: 1920)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !315, file: !316, line: 1237, baseType: !92, size: 16, offset: 1952)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !315, file: !316, line: 1239, baseType: !79, size: 8, offset: 1968)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !315, file: !316, line: 1240, baseType: !633, size: 8, offset: 1976)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8, elements: !180)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !315, file: !316, line: 1242, baseType: !635, size: 64, offset: 1984)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !637, line: 328, size: 3456, elements: !638)
!637 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!638 = !{!639, !640, !641, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !671, !672, !673, !676, !681, !682, !685, !689, !693, !697, !701, !702, !703, !704}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !636, file: !637, line: 329, baseType: !59, size: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !636, file: !637, line: 330, baseType: !130, size: 64, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !636, file: !637, line: 332, baseType: !642, size: 64, offset: 1024)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !637, line: 332, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !636, file: !637, line: 333, baseType: !109, size: 512, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !636, file: !637, line: 335, baseType: !278, size: 64, offset: 1600)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !636, file: !637, line: 337, baseType: !413, size: 64, offset: 1664)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !636, file: !637, line: 338, baseType: !570, size: 64, offset: 1728)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !636, file: !637, line: 340, baseType: !119, size: 128, offset: 1792)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !636, file: !637, line: 340, baseType: !119, size: 128, offset: 1920)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !636, file: !637, line: 342, baseType: !94, size: 32, offset: 2048)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !636, file: !637, line: 342, baseType: !94, size: 32, offset: 2080)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !636, file: !637, line: 343, baseType: !94, size: 32, offset: 2112)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !636, file: !637, line: 345, baseType: !94, size: 32, offset: 2144)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !636, file: !637, line: 346, baseType: !94, size: 32, offset: 2176)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !636, file: !637, line: 347, baseType: !92, size: 16, offset: 2208)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !636, file: !637, line: 348, baseType: !92, size: 16, offset: 2224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !636, file: !637, line: 349, baseType: !94, size: 32, offset: 2240)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !636, file: !637, line: 351, baseType: !94, size: 32, offset: 2272)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !636, file: !637, line: 353, baseType: !92, size: 16, offset: 2304)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !636, file: !637, line: 354, baseType: !92, size: 16, offset: 2320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !636, file: !637, line: 355, baseType: !94, size: 32, offset: 2336)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !636, file: !637, line: 357, baseType: !663, size: 128, offset: 2368)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !664, line: 95, baseType: !665)
!664 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !664, line: 92, size: 128, elements: !666)
!666 = !{!667, !668, !669, !670}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !665, file: !664, line: 93, baseType: !149, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !665, file: !664, line: 93, baseType: !149, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !665, file: !664, line: 94, baseType: !149, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !665, file: !664, line: 94, baseType: !149, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !636, file: !637, line: 363, baseType: !119, size: 128, offset: 2496)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !636, file: !637, line: 363, baseType: !119, size: 128, offset: 2624)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !636, file: !637, line: 368, baseType: !674, size: 64, offset: 2752)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !637, line: 48, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !636, file: !637, line: 372, baseType: !677, size: 32, offset: 2816)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !637, line: 274, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !637, line: 271, size: 32, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !678, file: !637, line: 273, baseType: !7, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !636, file: !637, line: 373, baseType: !94, size: 32, offset: 2848)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !636, file: !637, line: 382, baseType: !683, size: 64, offset: 2880)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !637, line: 46, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !636, file: !637, line: 385, baseType: !686, size: 64, offset: 2944)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !53, !149}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !636, file: !637, line: 386, baseType: !690, size: 64, offset: 3008)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !53, !443}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !636, file: !637, line: 387, baseType: !694, size: 64, offset: 3072)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!94, !53}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !636, file: !637, line: 388, baseType: !698, size: 64, offset: 3136)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !53}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !636, file: !637, line: 389, baseType: !53, size: 64, offset: 3200)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !636, file: !637, line: 389, baseType: !53, size: 64, offset: 3264)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !636, file: !637, line: 389, baseType: !53, size: 64, offset: 3328)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !636, file: !637, line: 389, baseType: !53, size: 64, offset: 3392)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !315, file: !316, line: 1244, baseType: !706, size: 64, offset: 2048)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !708, line: 200, size: 17024, elements: !709)
!708 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!709 = !{!710, !711, !712, !713, !1126, !1127, !1128, !1129, !1130, !1131, !1132}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !707, file: !708, line: 201, baseType: !135, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !707, file: !708, line: 202, baseType: !119, size: 128, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !707, file: !708, line: 203, baseType: !119, size: 128, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !707, file: !708, line: 206, baseType: !714, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !708, line: 190, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !708, line: 126, size: 2816, elements: !717)
!717 = !{!718, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !816, !817, !818, !819, !1097, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1125}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !716, file: !708, line: 127, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !716, file: !708, line: 127, baseType: !719, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !716, file: !708, line: 128, baseType: !53, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !716, file: !708, line: 129, baseType: !53, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !716, file: !708, line: 130, baseType: !109, size: 512, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !716, file: !708, line: 132, baseType: !94, size: 32, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !716, file: !708, line: 132, baseType: !94, size: 32, offset: 800)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !716, file: !708, line: 133, baseType: !94, size: 32, offset: 832)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !716, file: !708, line: 134, baseType: !94, size: 32, offset: 864)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !716, file: !708, line: 134, baseType: !94, size: 32, offset: 896)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !716, file: !708, line: 134, baseType: !94, size: 32, offset: 928)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !716, file: !708, line: 135, baseType: !94, size: 32, offset: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !716, file: !708, line: 135, baseType: !94, size: 32, offset: 992)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !716, file: !708, line: 136, baseType: !94, size: 32, offset: 1024)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !716, file: !708, line: 136, baseType: !94, size: 32, offset: 1056)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !716, file: !708, line: 137, baseType: !94, size: 32, offset: 1088)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !716, file: !708, line: 137, baseType: !94, size: 32, offset: 1120)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !716, file: !708, line: 138, baseType: !149, size: 32, offset: 1152)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !716, file: !708, line: 139, baseType: !149, size: 32, offset: 1184)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !716, file: !708, line: 139, baseType: !149, size: 32, offset: 1216)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !716, file: !708, line: 141, baseType: !92, size: 16, offset: 1248)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !716, file: !708, line: 142, baseType: !92, size: 16, offset: 1264)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !716, file: !708, line: 143, baseType: !94, size: 32, offset: 1280)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !716, file: !708, line: 144, baseType: !94, size: 32, offset: 1312)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !716, file: !708, line: 146, baseType: !744, size: 64, offset: 1344)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !708, line: 114, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !708, line: 99, size: 7232, elements: !747)
!747 = !{!748, !750, !751, !752, !753, !754, !755, !766, !770, !784, !793, !800, !810}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !746, file: !708, line: 100, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !746, file: !708, line: 100, baseType: !749, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !746, file: !708, line: 101, baseType: !94, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !746, file: !708, line: 101, baseType: !94, size: 32, offset: 160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !746, file: !708, line: 102, baseType: !94, size: 32, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !746, file: !708, line: 102, baseType: !94, size: 32, offset: 224)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !746, file: !708, line: 103, baseType: !756, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !708, line: 59, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !708, line: 56, size: 2112, elements: !759)
!759 = !{!760, !764, !765}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !758, file: !708, line: 57, baseType: !761, size: 2048)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 2048, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !758, file: !708, line: 58, baseType: !94, size: 32, offset: 2048)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !758, file: !708, line: 58, baseType: !94, size: 32, offset: 2080)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !746, file: !708, line: 106, baseType: !767, size: 6144, offset: 320)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 6144, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 768)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !746, file: !708, line: 107, baseType: !771, size: 64, offset: 6464)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !708, line: 97, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !708, line: 83, size: 8320, elements: !774)
!774 = !{!775, !776, !777, !780, !781, !782, !783}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !773, file: !708, line: 84, baseType: !767, size: 6144)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !773, file: !708, line: 87, baseType: !761, size: 2048, offset: 6144)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !773, file: !708, line: 88, baseType: !778, size: 64, offset: 8192)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !576, line: 41, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !773, file: !708, line: 90, baseType: !92, size: 16, offset: 8256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !773, file: !708, line: 92, baseType: !92, size: 16, offset: 8272)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !773, file: !708, line: 93, baseType: !92, size: 16, offset: 8288)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !773, file: !708, line: 95, baseType: !92, size: 16, offset: 8304)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !746, file: !708, line: 108, baseType: !785, size: 64, offset: 6528)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !708, line: 66, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !708, line: 61, size: 128, elements: !788)
!788 = !{!789, !790, !791, !792}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !787, file: !708, line: 62, baseType: !94, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !787, file: !708, line: 63, baseType: !94, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !787, file: !708, line: 64, baseType: !94, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !787, file: !708, line: 65, baseType: !94, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !746, file: !708, line: 109, baseType: !794, size: 64, offset: 6592)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !708, line: 71, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !708, line: 68, size: 64, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !796, file: !708, line: 69, baseType: !94, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !796, file: !708, line: 70, baseType: !94, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !746, file: !708, line: 110, baseType: !801, size: 64, offset: 6656)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !708, line: 81, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !708, line: 73, size: 352, elements: !804)
!804 = !{!805, !806, !807, !808, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !803, file: !708, line: 74, baseType: !151, size: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !803, file: !708, line: 75, baseType: !151, size: 96, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !803, file: !708, line: 76, baseType: !151, size: 96, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !803, file: !708, line: 77, baseType: !94, size: 32, offset: 288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !803, file: !708, line: 78, baseType: !94, size: 32, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !746, file: !708, line: 113, baseType: !811, size: 512, offset: 6720)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !812, line: 182, baseType: !813)
!812 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !812, line: 180, size: 512, elements: !814)
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !813, file: !812, line: 181, baseType: !109, size: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !716, file: !708, line: 148, baseType: !342, size: 64, offset: 1408)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !716, file: !708, line: 151, baseType: !314, size: 64, offset: 1472)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !716, file: !708, line: 152, baseType: !321, size: 64, offset: 1536)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !716, file: !708, line: 153, baseType: !820, size: 64, offset: 1600)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !822, line: 64, size: 19136, elements: !823)
!822 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!823 = !{!824, !825, !826, !827, !828, !829, !831, !832, !833, !834, !837, !838, !1083, !1084, !1092, !1093, !1094, !1095, !1096}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !821, file: !822, line: 65, baseType: !59, size: 960)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !821, file: !822, line: 66, baseType: !130, size: 64, offset: 960)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !822, line: 68, baseType: !78, size: 8192, offset: 1024)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !821, file: !822, line: 70, baseType: !94, size: 32, offset: 9216)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !821, file: !822, line: 71, baseType: !94, size: 32, offset: 9248)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !821, file: !822, line: 72, baseType: !830, size: 64, offset: 9280)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 64, elements: !571)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !821, file: !822, line: 74, baseType: !149, size: 32, offset: 9344)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !821, file: !822, line: 74, baseType: !149, size: 32, offset: 9376)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !821, file: !822, line: 76, baseType: !778, size: 64, offset: 9408)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !821, file: !822, line: 77, baseType: !835, size: 64, offset: 9472)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !822, line: 77, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !821, file: !822, line: 78, baseType: !413, size: 64, offset: 9536)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !821, file: !822, line: 80, baseType: !839, size: 2624, offset: 9600)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !840, line: 340, size: 2624, elements: !841)
!840 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!841 = !{!842, !870, !888, !889, !890, !905, !963, !964, !1063, !1064, !1065, !1066, !1072}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !839, file: !840, line: 341, baseType: !843, size: 576)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !840, line: 251, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !840, line: 207, size: 576, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869}
